+++
title = "Medion akoya mini E1210"
date = "2008-10-19T01:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/966"
aliases = "blog/966"
+++

<p>Lange bin ich um dies sch&ouml;nen, kleinen Netbooks rumgeschlichen und habe mir eingeredet dass ich sowas nicht brauche, dass mein altes Notebook ausreicht, dass ich erstmal genug andere Projekte am laufen habe und vor allem dass ich zur Zeit eh gerade kein Geld habe.</p>
<p>Gestern jedoch stand ich gerade im Aldi und habe festgestellt dass es das <a href="http://blog.nonstop-shopping.com/92-medion-akoya-mini-e1210-160gb-speicher-bluetooth/" target="_blank">Medion akoya mini</a> in der Version mit 160GB-Festplatte offensichtlich doch nicht nur bei Aldi S&uuml;d gibt, sondern auch bei Nord. Diesmal bin ich weich geworden und habe zugegriffen...<!--more--></p>
<p>Die technischen Daten der Kiste sind etwa mit meinem altem Fujitsu-Siemens zu vergleichen, es hat nat&uuml;rlich etwas mehr RAM als das Siemens im Auslieferungszustand (naja, mit 1GB nur das doppelte...), die Festplatte ist auch nur doppelt so gro&szlig; und der Prozessor ist zwar nur ein kleines bisschen schneller getaktet, aber ich denke mal dank Atom-Basis wird er wohl auch etwas schneller sein als mein alter Pentium M. Das Display hat auch immerhin eine Breite von 1024 Punkten, was auch dem Siemens entspricht, allerdings ist es bei einer H&ouml;he von 600 Punkten etwas schmaler. Das schadet aber nicht wirklich.<br/>Oh.. ja, fast h&auml;tte ich es vergessen: Das Medion-Ger&auml;t ist nat&uuml;rlich mit 1,2Kg ein kleines St&uuml;ck leichter und kleiner als das Siemens, ich glaube bereits mein Akku vom gro&szlig;en wiegt mehr als das kleine inkl. Akku.</p>
<p>Die genauen Daten:<br/></p><ul><br/> <li>CPU: Intel Atom N270 bei 1,6GHz</li><br/> <li>160 Gigabyte SATA-Festplatte (Western Digital)</li><br/> <li>Intel Media Accelerator 950 Graka</li><br/> <li>10" TFT-Display bei 1024x600</li><br/> <li>1GB RAM</li><br/> <li>WLAN: 802.11/b/g/Draft-n</li><br/> <li>Kleinzeug: VGA-Webcam, Mikrofon, 3x USB2.0, SD/MMC/MS-Kartenleser, VGA-Out, LAN</li><br/> <li>Zubeh&ouml;r: Bluetooth-Adapter (mini, verschwindet fast im USB-Port), Tragetasche</li><br/> <li>Preis: 369&euro;</li><br/></ul><br/>Leider wird die Kiste mit Windows bespielt geliefert, also werde ich mich in den n&auml;chsten Tagen mal daran machen m&uuml;ssen ein Betriebssystem aufzuspielen (dazu sp&auml;ter mehr). Das Ganze hat aber auch sein gutes, da ich schon mal nen PC mit Windoof hier stehen hatte, konnte ich auch gleich mal Guhgls Browser Chrome antesten (auch dazu sp&auml;ter mehr).

<p>Etwas sarkastisch finde ich dass Computer jetzt scheinbar doch wieder so ausgeliefert werden dass sich die Software nicht nur auf der Festplatte sondern auch auf CD befindet. Bl&ouml;d daran ist nur dass der betreffende PC kein CD-Laufwerk besitzt, aber irgendwas ist halt immer. Auf der anderen Seite werde ich die Software eh nie verwenden, also was solls?</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_764" onclick="set_comment_reference(764)" title="auf diesen Kommentar antworten">#764</a>:
    20.Oct.2008 11:10
    von
    
      
        <a href="http://malison.org" target="_blank">
          Carsten M&uuml;ller
        </a>
</p>
<p>Hmm f&uuml;r 30 Euro mehr w&uuml;rdest im November ein Samsung NC 10 bekommen. Bluetooth OnBoard und viel besserer Akku nebst besserer Verarbeitung. Mit dem Ger&auml;t Lieb&auml;ugel ich derzeit da ich mein MacBook irgendwie nur noch Station&auml;r einsetze...</p>

<p class="infos">
<a href="#comment_765" onclick="set_comment_reference(765)" title="auf diesen Kommentar antworten">#765</a>:
    20.Oct.2008 12:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ja, sicher sehr praktisch...<br/>
Mein Problem mit einer solchen Einstellung: Wenn ich einen Monat warte, bekomm ich IMMER ein besseres Ger&auml;t f&uuml;r das selbe Geld.</p>
<p>Bluetooth ist auch nicht gerade das wichtigste an dem Ger&auml;t... schon garnicht da ich keine Ahnung habe wie das unter Linux unterst&uuml;tzt wird und dieser Dongle das erste und Bluetooth-Ger&auml;t in meinem Besitz darstellt.</p>
<p>Was eher verlockend gewesen w&auml;re, w&auml;re ein 4:3-Display oder bereits vorinstalliertes Linux (letzteres h&auml;tte sich evtl. sogar positiv auf den Preis ausgewirkt).<br/>
Auf der anderen Seite sind 30 oder 50&euro; Mehr bei einem 370&euro;-Ger&auml;t auch nicht gerade wenig, irgendwo muss man ja auch mal ne Grenze ziehen. <em>g</em></p>

<p class="infos">
<a href="#comment_766" onclick="set_comment_reference(766)" title="auf diesen Kommentar antworten">#766</a>:
    20.Oct.2008 12:10
    von
    
      
        <a href="http://malison.org" target="_blank">
          Carsten M&uuml;ller
        </a>
</p>
<p>Das stimmt schon, ich trage mich halt schon l&auml;nger mit dem Gedanken und deshalb hab ich mich &uuml;ber Wochen hinweg erstmal schlau gemacht.</p>
<p>Bluetooth ist f&uuml;r mich wichtig, genau wie WLan und eine lange Akkulaufzeit. Was Linux betrifft, die Bluetooth Unterst&uuml;tzung bei einem USB-Stick sollte eigentlich problemlos laufen. Ich hab hier mehrere Billigsticks die tun problemlos.</p>
<p>Was mir halt noch wichtig ist w&auml;re eine gute Tastatur da ich viel tippe w&auml;re zum Beispiel so ein kleiner EEE wie ihn meine bessere H&auml;lfte hat f&uuml;r meine Wurstfinger eher ungeeignet :-)</p>
<p>Btw: Hier nochn Link<br/>
<a href="http://www.akoya-mini.de/2008/07/05/test-linux-auf-dem-akoya-mini/%3C/p%3E" rel="nofollow">http://www.akoya-mini....</a>
</p>
<p class="infos">
<a href="#comment_767" onclick="set_comment_reference(767)" title="auf diesen Kommentar antworten">#767</a>:
    20.Oct.2008 12:10
    von
    
      
        <a href="http://malison.org" target="_blank">
          Carsten M&uuml;ller
        </a>
</p>
<p>Falscher Link, hier der richtige:<br/>
<a href="http://blog.sperr-objekt.de/content/86-Ubuntu-auf-dem-Medion-Akoya-Mini.html%3C/p%3E" rel="nofollow">http://blog.sperr-obje...</a>
</p>
<p class="infos">
<a href="#comment_768" onclick="set_comment_reference(768)" title="auf diesen Kommentar antworten">#768</a>:
    20.Oct.2008 12:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Kenn ich schon... zum Thema Ubuntu aufm Akoya:<br/>
Heise hat auch einfach nur die damals aktuelle Version eingeworfen und aufgegeben als eine Fehlermeldung kam.<br/>
Diese spezielle Fehlermeldung zu umgehen ist eigentlich kein Problem und es gibt genug Anleitungen dazu im Netz. Mit aktuelleren Versionen stellt sich die Frage dann garnicht erst.</p>
<p>Zu meinem eigenen Status: ich hab ne Ubuntu-Version erfolgreich vom USB-Stick zum Booten gebracht, partitionierung auch erfolgreich durchgef&uuml;hrt und derzeit meckert er noch rum weil eine Festplatte unter /cdrom gemountet ist (der Stick mit Ubuntu halt) und er zum Partitionieren gerne alle Festplatten umounten will.<br/>
Ist aus mehr Gr&uuml;nden falsch als ich aufz&auml;hlen kann (die wichtigsten: Installationsquelle unmounten ist nervig, ro gemountete Laufwerke die nicht ge&auml;ndert werden sollten nicht unmountet werden m&uuml;ssen und die Partitionierung ist zu diesem Zeitpunkt bereits erfolgt -.-)</p>
<p>Jedenfalls ist das kein Akoya-spezifisches Problem sondern liegt eher am booten einer CD-Distri vom Stick. Wird mich nicht ewig aufhalten.</p>

<p class="infos">
<a href="#comment_769" onclick="set_comment_reference(769)" title="auf diesen Kommentar antworten">#769</a>:
    20.Oct.2008 12:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ah.. der Link ist auch schon erheblich interessanter :-)</p>

<p class="infos">
<a href="#comment_770" onclick="set_comment_reference(770)" title="auf diesen Kommentar antworten">#770</a>:
    20.Oct.2008 12:10
    von
    
      
        <a href="http://malison.org" target="_blank">
          Carsten M&uuml;ller
        </a>
</p>
<p>Da darin seh ich auch keine Probleme, das einzige was mich nervt ist der Gedanke Ubuntu so auf die Hardware anzupassen das es 1. schnell bootet und 2. den Akku nicht belastet.</p>

<p class="infos">
<a href="#comment_771" onclick="set_comment_reference(771)" title="auf diesen Kommentar antworten">#771</a>:
    20.Oct.2008 12:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>"da haste wahr"!<br/>
Allerdings isses mir das wert, ich hab keine Lust mich mit Windoof rumzuplagen. Evtl. probier ich aber auch noch mit anderen Distris rum, Puppy w&auml;re ja sch&ouml;n schnell <em>g</em><br/>
Aber dort nerven mich wieder ein paar andere Details, au&szlig;erdem brauch ich keine Micro-Distri wenn ich 160GB zur Verf&uuml;gung habe... da kann ich schon etwas mehr draufpacken</p>

<p class="infos">
<a href="#comment_772" onclick="set_comment_reference(772)" title="auf diesen Kommentar antworten">#772</a>:
    20.Oct.2008 01:10
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Vorsicht, flamender Troll: Windows ist nicht von Natur aus b&ouml;se, wei&szlig;te? ;)</p>

<p class="infos">
<a href="#comment_773" onclick="set_comment_reference(773)" title="auf diesen Kommentar antworten">#773</a>:
    20.Oct.2008 01:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>hab ich nie behauptet... ich w&uuml;rde es halt nur sehr ungern verwenden. ;-)</p>
<p>Ich tu mich irgendwie auch schwer Windows als anst&auml;ndiges Betriebssystem zu sehen. Das liegt nicht unbedingt am Kern (naja, zum Teil schon) sondern eher an den Einstellungen mit denen die einzige Distribution geliefert wird. Man KANN windows zu allem anpassen was man braucht, das habe ich nie bestritten, aber jeder der eine vern&uuml;nftige Rechteverteilung f&uuml;r eine Multiuserumgebung schonmal auf Windows einstellen wollte, wird mir recht geben wenn ich sage: Sowas geht leichter unter Unix/Linux/BSD!</p>

<p class="infos">
<a href="#comment_774" onclick="set_comment_reference(774)" title="auf diesen Kommentar antworten">#774</a>:
    20.Oct.2008 04:10
    von
    
      
        <a href="http://malison.org" target="_blank">
          Carsten M&uuml;ller
        </a>
</p>
<p>@Dr. Azrael Tod<br/>
Ich hab hier im Homenet nur Ubuntu und auf meinem Homeserver einen Apt Cache da w&auml;rs bissel sinnfrei eine andere Distri auf dem zuk&uuml;nftigen Netbook zu installieren :-)</p>
<p>Und was das Windows betrifft, naja ich hab das letzte mal ernsthaft Windows genutzt als es noch 3.11 hies....</p>

<p class="infos">
<a href="#comment_775" onclick="set_comment_reference(775)" title="auf diesen Kommentar antworten">#775</a>:
    20.Oct.2008 04:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ubuntu ist sicher schon nahe an der aktuellen ideall&ouml;sung... immerhin tut unter Ibex alles bis auf Wlan auf Anhieb (und Wlan sollte &uuml;ber ndiswrapper kein Problem darstellen).</p>
<p>Die anderen gro&szlig;en Distris werden sicher auch nicht gerade schneller.<br/>
Kleine Distris haben im Gegensatz dann evtl. wieder hardwarprobleme, sind also auch keine tolle Alternative (es sei denn man findet was speziell passendes).</p>
<p>... und &uuml;ber sowas wie Windows brauchen wir eigentlich garnicht erst reden. Mir fehlen einfach auch unter Windows meine gewohnten Programme, ich kann und will nicht wechseln.</p>

<p class="infos">
<a href="#comment_776" onclick="set_comment_reference(776)" title="auf diesen Kommentar antworten">#776</a>:
    21.Oct.2008 01:10
    von
    
      
        <a href="/2008/10/21/schreibfaul-kein-statusupdate/" target="_blank">
          Schreibfaul (k)ein Statusupdate &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] hab ich zur Zeit etwas mit meinen ganzen Projekten zu tun, Akoya rennt jetzt ziemlich gut unter Xubuntu 7.10. Wlan-Treiber sind auch sehr schnell installiert [...]</p>

<p class="infos">
<a href="#comment_777" onclick="set_comment_reference(777)" title="auf diesen Kommentar antworten">#777</a>:
    04.Nov.2008 10:11
    von
    
      
        <a href="/2008/11/04/kurzpost-putty-mit-url-erkennung/" target="_blank">
          Kurzpost: PuTTY mit URL-Erkennung &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] bin ich ja in letzter Zeit ziemlich dazu gezwungen, Akoya rennt zwar ziemlich gut unter Ubuntu 8.10, aber der zus&auml;tzliche Bildschirmausgang l&auml;sst sich [...]</p>

<p class="infos">
<a href="#comment_778" onclick="set_comment_reference(778)" title="auf diesen Kommentar antworten">#778</a>:
    13.Jan.2009 01:01
    von
    
      
        <a href="/2009/01/13/windows-migration/" target="_blank">
          Windows-Migration &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] Der Grund f&uuml;r diese Aktion waren die Probleme die ich noch bis vor kurzem mit Linux auf meinem Akoya hatte. Dank Xrandr und einigen Spielereien mit Ndiswrapper statt dem nativ, passenden [...]</p>
</div>