+++
title = "Wandtattoo"
date = "2008-10-19T02:10:00"
author = "Cindy"
issoid = "blog/968"
aliases = "blog/968"
+++

<p>In unserer Wohnung sind die R&auml;ume etwa 3 Meter hoch und alles in wei&szlig; gehalten, der einzige Farbtupfer ist der dunkelblaue Teppich. Da es sehr schwer ist ein Loch in die Wand zu bekommen, haben wir auch sehr wenig aufgeh&auml;ngt. Allerdings sah es bisher dementsprechend kahl aus, bis Frank mir von einem Gespr&auml;chsthema auf Arbeit erz&auml;hlte, bei dem es um Wandversch&ouml;nerungen ging.<!--more--><br/></p><p class="MsoNormal"></p><br/><p class="MsoNormal">Auch bei ihm auf Arbeit scheint es etwas an Dekoration zu fehlen. So entstand die Idee Wandtattoos anzubringen, von der er mir dann erz&auml;hlte. Kurzerhand informierte ich mich erstmal im Internet was das &uuml;berhaupt ist, denn bis dahin war mir der Begriff noch nicht &uuml;ber den Weg gelaufen. Gibt man den Begriff bei Google ein wird man auch sehr schnell f&uuml;ndig.</p><br/><p class="MsoNormal"></p><br/><p class="MsoNormal">Wir durchst&ouml;berten zahlreiche Seiten auf der Suche nach dem passenden Motiv f&uuml;r unsere Schlafzimmerwand. F&uuml;ndig wurden wir dann auf <a href="http://www.bilder-welten.net" target="_blank">bilder-welten</a>. Es gibt auf dieser Seite eine sehr gro&szlig;e Vielzahl von Motiven und wenn einem der Schriftzug nicht gef&auml;llt, dann ist es auch m&ouml;glich seinen eigenen Text zu w&auml;hlen, die Gr&ouml;&szlig;e, Farbe und Schriftart nach eigenen W&uuml;nschen anzupassen.</p><br/><p class="MsoNormal"></p><br/><p class="MsoNormal">Nachdem wir uns f&uuml;r eins entschieden hatten bestellten wir es sofort und &uuml;berwiesen den entsprechenden Betrag. Nach 2 Tagen kam eine E-Mail, dass unser Motiv in Arbeit sei und weiter 2 Tage sp&auml;ter kam eine E-Mail mit der Versandbest&auml;tigung und einem Hinweis, wie wir unseren Paketstatus abfragen k&ouml;nnen. Nach nur 5 Tagen war es dann da.</p><br/><p class="MsoNormal"></p><br/><p class="MsoNormal">Enthalten in dem Paket war eine sehr gute Anleitung zum Anbringen <a href="http://www.bilder-welten.net/shop_content.php/coID/15/product/Verklebeanleitung" target="_blank">(auch hier nachzulesen)</a>, das Motiv, welches schon auf einer Tr&auml;gerfolie war und eine Anbringhilfe. Das Anbringen dauerte dann etwa 20 min. von Auspacken &uuml;ber Ausmessen bis hin zum Bewundern. Bei der Gr&ouml;&szlig;e von 104cm x 20cm ist es allerdings erforderlich zu zweit zu sein.</p>
<p>[caption id="attachment_969" align="aligncenter" width="300" caption="Engelchen und Teufelchen"]<img alt="Engelchen und Teufelchen" class="size-medium wp-image-969" height="225" src="http://localhost/wordpress/wp-content/uploads/2008/10/sl701730.jpg?w=300" title="Wandtattoo" width="300"/>[/caption]<br/></p><p class="MsoNormal"></p><br/><p class="MsoNormal">Wir sind sehr zufrieden mit dem Ergebnis und denken bereits &uuml;ber das n&auml;chste Motiv nach.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_779" onclick="set_comment_reference(779)" title="auf diesen Kommentar antworten">#779</a>:
    19.Oct.2008 03:10
    von
    
      
        <a href="http://www.bunix.de" target="_blank">
          reaper
        </a>
</p>
<p>Das nenn ich mal massive Transpis, hab noch nie geh&ouml;rt das in einem Auflagenbescheid Transparente aus Naturbeton erw&auml;hnt wurden :P</p>

<p class="infos">
<a href="#comment_780" onclick="set_comment_reference(780)" title="auf diesen Kommentar antworten">#780</a>:
    19.Oct.2008 06:10
    von
    
      <a href="/blog/author/cindy/">
        Cindy
      </a>
</p>
<p>Jetzt nochmal auf deutsch bitte</p>

<p class="infos">
<a href="#comment_781" onclick="set_comment_reference(781)" title="auf diesen Kommentar antworten">#781</a>:
    20.Oct.2008 11:10
    von
    
      
        <a href="http://malison.org" target="_blank">
          Carsten M&uuml;ller
        </a>
</p>
<p>Empfehlen kann ich auch noch <a href="http://www.annawand.de/" rel="nofollow">http://www.annawand.de/</a> , falls man bei Bilder Welten nicht f&uuml;ndig wird.</p>

<p class="infos">
<a href="#comment_782" onclick="set_comment_reference(782)" title="auf diesen Kommentar antworten">#782</a>:
    27.Oct.2008 08:10
    von
    
      
        Diana
      
    
    
  </p>
<p>Genauso gut ist auch <a href="http://www.your-design-shop.com%3C/p%3E" rel="nofollow">www.your-design-shop.c...</a>
</p><p>Mir gef&auml;llt das Design des Shops. Hebt sich wirklich ab und die Motive sind echt stylish.</p>

<p class="infos">
<a href="#comment_783" onclick="set_comment_reference(783)" title="auf diesen Kommentar antworten">#783</a>:
    21.Nov.2008 03:11
    von
    
      
        Styleist
      
    
    
  </p>
<p>Ich pers&ouml;nlich finde Wandschablonen sch&ouml;ner und wesentlich besser als Wandtattoos. Einer Wandschablone sieht man n&auml;mlich nicht an, dass sie draufgeklebt ist (ist sie ja auch nicht).</p>
<p>[Notiz: URL zensiert da Werbung f&uuml;r einen Laden der Wandschablonen verkauft - Dr. Azrael Tod]</p>

<p class="infos">
<a href="#comment_784" onclick="set_comment_reference(784)" title="auf diesen Kommentar antworten">#784</a>:
    21.Nov.2008 05:11
    von
    
      <a href="/blog/author/cindy/">
        Cindy
      </a>
</p>
<p>Ich kenne Wandschablonen nicht, allerdings muss ich sagen, man sieht nicht auf den ersten Blick das das Wandtattoo aufgeklebt ist, werde mir aber auf jeden Fall mal Wandschablonen ansehen.</p>
<p>Danke f&uuml;r den Tipp!</p>

<p class="infos">
<a href="#comment_785" onclick="set_comment_reference(785)" title="auf diesen Kommentar antworten">#785</a>:
    01.Dec.2008 03:12
    von
    
      
        <a href="http://www.wandtattoos-online.de" target="_blank">
          Martin
        </a>
</p>
<p>Also man sieht hochwertige Wandtattoos wirklich nicht an, dass sie aufgeklebt sind - aber die Wanschablonen sind sicher auch eine interessante Sache - kannte ich nicht so wirklich vorher. Aber hat man damit nicht mehr Arbeit als mit Wandtattoos? Sp&auml;testens wenn man mal drei oder vier aufgeklebt hat, dann f&auml;llt einem das doch super leicht..</p>

<p class="infos">
<a href="#comment_786" onclick="set_comment_reference(786)" title="auf diesen Kommentar antworten">#786</a>:
    01.Dec.2008 05:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>naja, man spart sicher geld weil man nicht jedes mal neue Folie kaufen muss.<br/>
Aber daf&uuml;r muss man wohl erheblich mehr drauf achten dass es am Ende auch ordentlich aussieht, ist sicher etwas anspruchsvoller.</p>

<p class="infos">
<a href="#comment_787" onclick="set_comment_reference(787)" title="auf diesen Kommentar antworten">#787</a>:
    02.Dec.2008 03:12
    von
    
      
        Wandsticker
      
    
    
  </p>
<p>Ich find die Sache echt geil!</p>

<p class="infos">
<a href="#comment_788" onclick="set_comment_reference(788)" title="auf diesen Kommentar antworten">#788</a>:
    10.Dec.2008 12:12
    von
    
      
        MGD
      
    
    
  </p>
<p>Coole wandtattoos habe ich schon bei [Admin-Edit]deco-garage[/Admin-Edit] gesehen und dazu sind die recht g&uuml;nstig.</p>

<p class="infos">
<a href="#comment_789" onclick="set_comment_reference(789)" title="auf diesen Kommentar antworten">#789</a>:
    10.Dec.2008 12:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Also Leute langsam reichts... Wenn ihr unbedingt eure ganz tolle und sich super von all den anderen unterscheidende, kommerzielle Seite bewerben wollt ist das ja eins.<br/>
Aber bitte lasst diese sinnlosen Aktionen al&aacute; "Ganz toll ist auch Seite XYZ" ohne irgendwas weiteres.</p>
<p>Wenn eure Seite wirklich toll und anders ist, k&ouml;nnt ihr mir oder Cindy das gerne schreiben und sie wird sich schon mal jemand ansehen. Wenn WIR der Meinung ist dass sie toll ist, wird es sicher auch nochmal was ausf&uuml;hrlicheres dazu geben. (Martin hat das so getan und erscheint mir allein aufgrund dieser Tatsache schonmal seri&ouml;ser als alle anderen zusammen)</p>
<p>Wenn ihr weiterhin hier rumspamt, habt ihr erstens nicht viel davon da ich solche Links entferne und zweitens &uuml;berlege ich eh schon ob ich f&uuml;r die Bearbeitung anfallenden Spamaufkommens Geb&uuml;hren verlangen sollte...</p>

<p class="infos">
<a href="#comment_790" onclick="set_comment_reference(790)" title="auf diesen Kommentar antworten">#790</a>:
    08.Jan.2009 01:01
    von
    
      
        <a href="/2009/01/08/verspatung-bald-nun-ist-weihnachtszeit/" target="_blank">
          Versp&auml;tung: Bald nun ist Weihnachtszeit &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] Beides habe ich bis jetzt vor mir hergeschoben, doch da der Baum jetzt gerade wieder Thema war (in Form von Entsorgungsproblemen die wir nicht al&aacute; Ikea l&ouml;sen wollen), gingen mir langsam die Termine aus wohin ich dieses Thema verschieben k&ouml;nnte.Hier also das (zugegeben etwas nerdige)&nbsp;Wandtattoo&nbsp;mit dem Motiv &ldquo;Space Invaders&rdquo;, das wir uns zu gro&szlig;en Teilen &uuml;ber einen Gutschein von Tim E. &nbsp;(Bestechung um &uuml;ber den Anbieter auch zu berichten wie &uuml;ber das erste, &ldquo;Engelchen und Teufelchen&ldquo;) [...]</p>

<p class="infos">
<a href="#comment_791" onclick="set_comment_reference(791)" title="auf diesen Kommentar antworten">#791</a>:
    30.Nov.2009 06:11
    von
    
      
        Maike
      
    
    
  </p>
<p>Da das habt Ihr doch toll hinbekommen. Viele Gr&uuml;&szlig;e</p>

<p class="infos">
<a href="#comment_792" onclick="set_comment_reference(792)" title="auf diesen Kommentar antworten">#792</a>:
    24.Dec.2009 10:12
    von
    
      
        Wandtattoo
      
    
    
  </p>
<p>Wandtattoos gibts ja viele. St&auml;ndig neue Designs und Spr&uuml;che. Ist eben auch ein hingucker statt nur langweilige Bilder.</p>
</div>