+++
title = "Homeservergehäuse#1"
date = "2008-09-19T11:09:00"
author = "Dr. Azrael Tod"
tags = ["Hardware", "Nerdig", "PC", "Technik", "Homeservergehäuse"]
issoid = "blog/763"
aliases = "blog/763"
+++

<p>Meine Entw&uuml;rfe bez&uuml;glich meines kleinen Homeservergeh&auml;uses (<a href="/2008/9/5/Homeservergeh&auml;use/">Projektstart</a>) nehmen langsam erste Formen an.<br/>Inzwischen habe ich die dreieckige Grundfl&auml;che etwas aufgegeben, da sich die Bauteile doch etwas schlecht anbringen lassen. Die abschlie&szlig;ende Platte zur Sichtseite hin, werde ich evtl. dennoch &uuml;ber das eigentliche Geh&auml;use hinaus entlangziehen und mit einer Abschlussplatte im passenden Winkel zum anlegen an das Fernsehschr&auml;nkchen verwenden.<!--more--></p>
<p>Alle Anschl&uuml;sse werden wahrscheinlich zur selben Seite gelegt, damit meine ich sowohl die Motherboardseitigen Anschl&uuml;sse als auch Netzstecker und DVD-Schublade (wobei mir letzteres noch nicht so ganz gef&auml;llt da es sich schlecht bedienen l&auml;sst andere Varianten haben jedoch Probleme mit den L&auml;ngen der vorhandenen IDE-/Stromkabel und der Befestigung am Geh&auml;use).</p>
<p>Ich habe mich sogar mal hingesetzt, alle Teile ohne Geh&auml;use zusammengehalten und ausgemessen und grob eine Skizze im Originalma&szlig;stab auf karriertes Papier gezeichnet.<br/>[caption id="attachment_764" align="aligncenter" width="254" caption="Erster Entwurf zur Platzaufteilung im Geh&auml;use"]<a href="http://localhost/wordpress/wp-content/uploads/2008/09/entwurf1blog.jpg"><img alt="Erster Entwurf zur Platzaufteilung im Geh&auml;use" class="size-medium wp-image-764" height="300" src="http://localhost/wordpress/wp-content/uploads/2008/09/entwurf1blog.jpg?w=254" title="entwurf1" width="254"/></a>[/caption]</p>
<p>Die Variante das Geh&auml;use aus Holz zu bauen ist inzwischen so gut wie verworfen, ebenso wie Bleche stanzen und biegen zu lassen (wie es von meiner besseren H&auml;lfte vorgeschlagen wurde). Beides w&uuml;rde zu genaue Anforderungen an meine Planung und Gr&ouml;&szlig;enangaben stellen. Holz w&uuml;rde weiterhin zu viele Dreck verursachen und unter meinem geringen K&ouml;nnen leiden.<br/>Weiterhin zur Diskussion steht die Variante die Bauteile mit Glasfaser oder &auml;hnlichen Faserstrukturen und Kunstharz zu laminieren. Als weitere Variante ist die Fertigung aus 3mm starker Pappe hinzu gekommen, wie es neulich von <a href="http://www.bitsnpieces.de/blog" target="_blank">mattis</a> in seinem <a href="http://www.bitsnpieces.de/blog/2008/09/nas-im-eigenbau/" target="_blank">eigenem Homeserverprojekt</a> demonstriert wurde. Letzteres hat besonders beim Zuschnitt viele Vorteile, evtl. k&ouml;nnte man sp&auml;ter sogar aufgrund der Pappstrukturen andere Materialien verwenden. Damit w&uuml;rde z.B. auch die Genauigkeit wie sie f&uuml;r Nirosta-Bleche ben&ouml;tigt wird in Reichweite r&uuml;cken. Das sieht dann nat&uuml;rlich edler aus und ist wohl die haltbarste Variante. Auch ein Aufr&uuml;sten ist bei geschraubten Verbindungen mit Blech wohl nie ein Problem.</p>
<p>BTW: @RobVinc ein Entwurf via eines kostenlosen CAD-Tools k&ouml;nnte tats&auml;chlich noch folgen, so wie es jetzt aussieht aber allerh&ouml;chstens mit <a href="http://www.ribbonsoft.de/qcad.html" target="_blank">QCAD</a> weil ich das als einziges auf meinem Notebook installiert habe und sich daran bis weiteres, aufgrund meiner Internetsituation, nicht viel &auml;ndern wird. (F&uuml;r die Zeit nach dem 26. sind aber dennoch Vorschl&auml;ge betreffs anderer Software willkommen.)</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_623" onclick="set_comment_reference(623)" title="auf diesen Kommentar antworten">#623</a>:
    19.Sep.2008 01:09
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Falls du es bereits getan hast tut es mir leid, aber kannst du vielleicht mal alle Teile auflisten, die du verbauen willst? So ein NAS (Hmm... vor NAS kann man eigentlich gar keinen Artikel setzen... naja, nevermind) w&auml;r f&uuml;r mich recht praktisch und mich beschleicht ganz langsam das dumpfe Gef&uuml;hl, dass du eventuell ein klitzekleines bisschen mehr Ahnung haben k&ouml;nntest als ich. ;)</p>

<p class="infos">
<a href="#comment_624" onclick="set_comment_reference(624)" title="auf diesen Kommentar antworten">#624</a>:
    19.Sep.2008 01:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Klar, mach ich heute Abend mal und stelle es morgen online... :-)<br/>
Aber hoffe nicht zu sehr auf detaillierte Angaben, bei Bauteilen wie meinem DVD-Laufwerk oder Netzteil kann ich auch nicht viel mehr sagen als "altes Notebook DVD-Laufwerk" oder "l&uuml;fterloses Shuttle-PC-Netzteil", wenn ich Gl&uuml;ck habe steht noch der Hersteller drauf, ansonsten sind es halt Teile die ich gerade rumliegen habe.</p>
<p>Zu Motherboard, Fernsehkarte und so gibt es nat&uuml;rlich mehr Angaben.</p>

<p class="infos">
<a href="#comment_625" onclick="set_comment_reference(625)" title="auf diesen Kommentar antworten">#625</a>:
    19.Sep.2008 06:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Von wegen morgen... ich hab doch bis zum 26. kein inet und morgen ist WE. -.-<br/>
Also rechne mal lieber mit Montag, bis dahin sollte ich es wenigstens schaffen.</p>

<p class="infos">
<a href="#comment_626" onclick="set_comment_reference(626)" title="auf diesen Kommentar antworten">#626</a>:
    16.Nov.2008 04:11
    von
    
      
        <a href="/2008/11/16/homeservergehause-6-v4-tinfoilhat/" target="_blank">
          Homeservergeh&auml;use
        </a>
</p>
<p>[...]  Die n&auml;chste Revision meines Homeservergeh&auml;uses V4 - &ldquo;Tinfoilhat&rdquo; (alle Teile, 0 1 2 3 4 5) ist [...]</p>
</div>
