+++
title = "Buchen bei Billigfliegern, heute Germanwings"
date = "2008-09-17T10:09:00"
author = "profmakx"
issoid = "blog/741"
aliases = "blog/741"
+++

<p>Eigentlich sollte hier ein Rant gegen Germanwings stehen. Doch es kam anders...<br/><!--more--></p>
<p>Ende August buchte ich einen Flug f&uuml;r zwei Personen von K&ouml;ln-Bonn nach Edinburgh bei Germanwings &uuml;ber deren Webseite. Nat&uuml;rlicherweise wundert man sich &uuml;ber die Geb&uuml;hrenkreativit&auml;t dieser Anbieter, und ich bin recht froh dar&uuml;ber, dass der Gesetzgeber diesem Treiben endlich einen Riegel vorschiebt.</p>
<p>Nun aber zu meinem Problem. Wir schreiben den letzten Freitag im August. Ich wollte also zwei Personen von CGN nach EDI fliegen lassen. Am 22. September 2008. Das klappte alles auch ganz gut, nur, dass der Buchungsvorgang dann abbrach und weder eine Best&auml;tigungsmail bei mir ankam, noch der Flug in meiner &Uuml;bersicht bei Germanwings auftauchte. Ich dachte nat&uuml;rlich erstmal, dass die eine weile brauchen und lies der dinge gut sein.</p>
<p>Nachdem am Montag abend auch kein Geld von meinem Konto abgebucht wurde habe ich kurzerhand den Flug noch einmal gebucht. Dies ging auch problemlos, der Flug wurde ohne Probleme best&auml;tigt und mir eine Best&auml;tigungsmail zugeschickt.<br/>Am Dienstag morgen war dann auf einmal Geld abgebucht. Nur unter einer ganz anderen Buchungsnummer. Also hab ich dann doch mal bei der s&uuml;ndhaft teuren Hotline angerufen. (1 Euro pro minute, ich weiss, man gettet was man paid for). Die Dame sagte mir, dass ich nat&uuml;rlich 2 Fl&uuml;ge auf dieselben zwei Namen zur selben Uhrzeit am selben Tag gebucht habe und diese nat&uuml;rlich nun auch bezahlen m&uuml;sse (und: Wenn ich schon 1 Euro pro Minute bezahle h&auml;tte ich gerne jemanden, der des Deutschen wenigstens einigermassen m&auml;chtig ist). Sie bot mir eine kostenlose Umbuchung an, aber keine R&uuml;ckerstattung. Sie k&ouml;nne das nicht als doppelbuchung anerkennen, weil der Zeitraum zwischen Buchung 1 und Buchung 2 zu gross sei.<br/>Einfach den Bankeinzug zur&uuml;ckgehen zu lassen wollte ich zun&auml;chst nicht machen, da auf diese Weise alles nur stressiger und teurer wird, ausserdem will ich ja am 22. September nach Schottland fliegen.</p>
<p>Ich habe das Angebot der Umbuchung nicht angenommen.  Bis zu diesem Zeitpunkt hatte ich mich schon damit abgefunden die 160 Euro f&uuml;r den Flug zwei mal zu bezahlen und einfach nie wieder mit Germanwings zu fliegen. Aber da ich sehr gute Erfahrungen mit dem schreiben von Briefen habe (also die Dinger auf weissem Papier mit Briefmarke) habe ich noch schnell meinen vim gestartet und ein kleines Schreiben verfasst. Freundlich aber bestimmt wies ich darauf hin, dass ich diesen Flug unm&ouml;glich so antreten k&ouml;nne und dass ich auch einsehe selber einen kleinen Fehler gemacht zu haben. Ich bot an, dass sie einen gewissen Betrag <em>x</em> als Bearbeitungsgeb&uuml;hr f&uuml;r sich behalten sollen und den Rest zur&uuml;ckerstatten um beiden Parteien weitere Scherereien zu ersparen. Mit keinem Wort bin ich ausfallend geworden oder habe irgendeinen Boykott angedroht, das habe ich mir f&uuml;r einen eventuellen weiteren Brief aufbewahrt. Man muss ja erstmal die Lage sondieren.</p>
<p>Zwei Tage sp&auml;ter erreichte mich eine Email von Germanwings, die mir zusicherte den ersten Flug komplett zu stornieren und zur&uuml;ck zu erstatten. Aus Kulanz nat&uuml;rlich. Das Geld ist auch auf meinem Konto angekommen. Alles paletti also. Wenn nun der Flug am Montag klappt ist also alles super gelaufen, modulo dem Stress wegen der Buchung.</p>
<p>&Uuml;ber die Ursachen einer solchen Einsicht kann ich (vor allem als juristischer Laie) nur Mutma&szlig;en. Jedenfalls zeigt dieser Fall auch, dass man mit einem entsprechend besonnenem Auftreten etwas erreichen kann. Die meisten im Internet geschilderten F&auml;lle sehen ja nicht so g&uuml;nstig f&uuml;r Germanwings aus, aber in meinem Fall ist es wirklich gut gelaufen, wie ich finde.</p>
