+++
title = "Damals hatten wir Grundrechte. Heute: Das Brief- und Postgeheimnis"
date = "2008-09-17T11:09:00"
author = "profmakx"
issoid = "blog/727"
aliases = "blog/727"
+++

<p>Manchmal h&ouml;rt man ja noch von den sogenannten <em>Grundrechten</em>. In Deutschland (und ich will mich jetzt mal auf Deutschland beschr&auml;nken) sind diese in den ersten Paragraphen des <em>Grundgesetzes</em> festgeschrieben. Heutzutage brauchen wir immer wieder das <em>Bundesverfassungsgericht</em> damit &uuml;berhaupt noch ein kleiner Rest dieser Rechte bestehen bleibt.</p>
<p><!--more--></p>
<p>Vorweg sei gesagt, dass ich kein Experte auf diesem Gebiet bin und auch bestimmt keine Lust habe mich tiefergehend mit Gesetzestexten zu befassen. Das ist an und f&uuml;r sich schon ein Armutszeugnis, aber nicht f&uuml;r mich sondern f&uuml;r die Gesetze.</p>
<p>Letzte Woche sah ich eine dieser uns&auml;glich schlechten Spiegel-TV Dokus &uuml;ber den Zoll der in Frankfurt Sendungen auf Drogenschmuggel, Bomben, Terroristen, Kinderpornos, Raubkopien und Damenunterw&auml;sche pr&uuml;ft. Im Prinzip gucken die sich da jedes Paket an, welches aus dem Ausland nach Deutschland rein will (und machen es auch auf).<br/>Das machte mich ein wenig stutzig: D&uuml;rfen die einfach so Briefe und Pakete aufmachen?<br/>Ja, d&uuml;rfen sie. Sogar die Mitarbeiter der Post d&uuml;rfen, weil das Brief- und Postgeheimnis im Prinzip eh nichtmehr existent ist.</p>
<p>Das Brief- und Postgeheimnis ist in Artikel 10 des Grundgesetzes niedergeschrieben. Es verbietet dem Staat den Zugriff auf Sendungen (und sogar Telefonate) zu nehmen (der eigenen B&uuml;rger. In heutiger Zeit erscheint das sowieso etwas l&auml;cherlich). Das h&ouml;rt sich zwar gut an. Ist es aber nicht. Da es n&auml;mlich ein Gesetz gibt, das diese absolute Formulierung bis zur Unkenntlichkeit einschr&auml;nkt. So d&uuml;rfen der BND, der MAD und auch amerikanische Geheimdienste auf Briefe und Post zugreifen, ausserdem darf aufgrund von Zollrechtlichen fragen sowieso fast alles ge&ouml;ffnet und durchsucht werden was die Grenze passiert. Und das passiert auch noch zentral. In Frankfurt.</p>
<p>Und dann ist mir noch etwas aufgefallen: Das Grundrecht sch&uuml;tzt in erster Linie vor dem Staat. Aber die Post ist ja kein Staatsbetrieb mehr, sondern ein Unternehmen. (Ja ich weiss, dass der Bund an der Post grosse Anteile h&auml;lt, aber das macht es eigentlich schlimmer und nicht besser). Die Post hat AGB f&uuml;r die Bef&ouml;rderung. Kleingedruckte zwei Seiten. Und darin r&auml;umt sie sich gleich schonmal ein Recht zur &Ouml;ffnung von Sendungen (auch nationale!) ein.</p>
<p>Wer jetzt sagt "Aber der Zoll ist  vertrauensw&uuml;rdig und die Post hat ja kein Interesse an meinen privaten Briefen und zu Verbergen habe ich sowieso nichts" den lache ich sowieso schonmal prophylaktisch aus. Alleine der Gedanke, irgendein Zollbeamter oder schlimmer Postmitarbeiter k&ouml;nnte in meinen verdammten Paketen rumr&uuml;sseln treibt mir das Mittagessen hoch. Das von vorgestern.</p>
<p>Dar&uuml;berhinaus will ich garnicht wissen was passiert wenn man jemandem aus B&ouml;sartigkeit ein Paket mit Kinderporno-CDs zuschickt.</p>
<p>Konsequenz: Artikel 10 Grundgesetz k&ouml;nnen wir im Sinne der Effizienzinitiative schon einmal streichen. Mal schauen was als n&auml;chstes kommt. Herr Lafontaine h&auml;tte ja gerne das Recht auf Eigentum zur Disposition gestellt. Das ist aber eine andere Geschichte.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_602" onclick="set_comment_reference(602)" title="auf diesen Kommentar antworten">#602</a>:
    05.Nov.2008 01:11
    von
    
      
        <a href="http://www.fixmbr.de" target="_blank">
          Oliver
        </a>
</p>
<p>Ich empfehle diesbez&uuml;glich einfach mal mehr vom GG, insbesondere Art 11: <a href="http://dejure.org/gesetze/GG/11.html" rel="nofollow">http://dejure.org/gese...</a> und Art 10,2, obig zitiert, <a href="http://dejure.org/gesetze/GG/10.html%3C/p%3E" rel="nofollow">http://dejure.org/gese...</a>
</p><p>Die Notstandsgesetze (anno 68) - in ihrer Eigenschaft die erste Attacke auf das GG damals und nat&uuml;rlich immer noch g&uuml;ltig - weichen diesen Passus schon l&auml;ngst auf, seit Jahrzehnten. Der gro&szlig;e Lauschangriff von anno 98 tat sein &uuml;brigens dazu, der Rest heutzutage baut darauf auf.</p>
<p>"Dient die Beschr&auml;nkung dem Schutze der freiheitlichen demokratischen Grundordnung[...]"</p>
<p>kann so ziemlich alles definieren, Der Vollst&auml;ndigkeit halber sei noch Art 35 erw&auml;hnt und die Interpretation beim G8-Gipfel. Zwar wurde es im Nachhinein (Einsatz Tornado etc. pp.) als unverh&auml;ltnism&auml;&szlig;ig eingestuft, verfassungskonform war es dennoch.</p>
<p>Tja der Schaden ist schon seit Jahrzehnten angerichtet.</p>

<p class="infos">
<a href="#comment_603" onclick="set_comment_reference(603)" title="auf diesen Kommentar antworten">#603</a>:
    05.Nov.2008 01:11
    von
    
      
        <a href="http://www.fixmbr.de" target="_blank">
          Oliver
        </a>
</p>
<p>http://dejure.org/gesetze/GG/35.html</p>
<p>sorry f&uuml;r den SPAM, Art 35 vergessen.</p>

<p class="infos">
<a href="#comment_604" onclick="set_comment_reference(604)" title="auf diesen Kommentar antworten">#604</a>:
    14.Nov.2008 12:11
    von
    
      
        <a href="/2008/11/14/damals-hatten-wir-rechte/" target="_blank">
          Damals hatten wir Rechte&amp;#8230; &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] Vorschl&auml;ge und Gesetze in der Bundesdeutschen Klolitik aufzuarbeiten bediene ich mich mal der &Uuml;berschrift eines Artikels von [...]</p>
</div>