+++
title = "Fahrradwege"
date = "2008-09-17T09:09:00"
author = "Dr. Azrael Tod"
issoid = "blog/739"
aliases = "blog/739"
+++

<p>Es gibt etwas das mir, jeden Tag den ich in Dresden unterwegs bin, negativ auff&auml;llt. &Uuml;berall gibt es diese kombinierten Fahrrad-/Fu&szlig;wege. Also die Wege bei denen das Fahrrad-Symbol unter dem Fu&szlig;g&auml;ngersymbol auf dem Schild steht.<br/>Diese Wege empfinde ich als Zumutung. Nicht nur muss man auf diesen Wegen als Fahrradfahrer permanent auf Fu&szlig;g&auml;nger achten, auch ist man dort als Fu&szlig;g&auml;nger permanent der Gefahr durch unf&auml;hige Fahrradfahrer ausgesetzt.<!--more--></p>
<p>Besser w&auml;re es, wenn richtig getrennte Wege vorliegen w&uuml;rden, idealerweise bei denen der Fahrradweg eher der Stra&szlig;e als zus&auml;tzliche Spur zugeordnet und beides durch eine Bordsteinkante getrennt w&auml;re. Fahrr&auml;der stehen meiner Meinung nach sowohl was Geschwindigkeit als auch was Gewicht und Fahrverhalten betrifft eher den motorisierten Zweir&auml;dern (wie Roller oder Motorrad) nahe als einem Fu&szlig;g&auml;nger.<br/>Von einem Mopedfahrer w&uuml;rde ja wohl auch kaum jemand erwarten dass er sich den Fahrweg mit Fu&szlig;g&auml;ngern teilt. Dabei komme ich mit meinem Fahrrad auch auf der Geraden mit Leichtigkeit &uuml;ber das normale Innenstadt-Geschwindigkeitslimit von 50km/h und selbst im Dresdner Flachland ist eine totale Ebene eher eine Seltenheit.<br/>In Zschopau (Erzgebirge) hingegen habe ich es fr&uuml;her problemlos geschafft auf Geschwindigkeiten oberhalb der 80km/h zu erreichen... ohne die Pedale zu verwenden (Hangabtriebskraft is was feines), begrenzt wurde die Geschwindigkeit eher durch einen Mangel an Einsicht in die Strecke und einen &Uuml;berschuss an Bremsweg. Ich h&auml;tte also durchaus auch schneller rollen k&ouml;nnen, ich war mir nur nicht sicher es auch immer zu &uuml;berleben.<br/>Nat&uuml;rlich rasen eher wenigsten Fahrradfahrer auf kombinierten Rad-/Fu&szlig;wegen mit 80 oder auch nur 50km/h aber sie bewegen sich noch immer erheblich schneller als jeder Fu&szlig;g&auml;nger. Wenn kein solcher Weg vorhanden w&auml;re k&ouml;nnte man sich viel besser in den "normalen" Stra&szlig;enverkehr einordnen, so ist man jedoch gezwungen auch auf idealen Strecken immer mit Fu&szlig;g&auml;ngern zu rechnen.</p>
<p>Wer jetzt meint hier w&uuml;rde zu sehr der genervte Radfahrer aus mir sprechen, dem muss ich sagen dass ich die letzten Monate nicht ein einziges Mal per Rad unterwegs war. Ich bin jedoch jeden Tag zu Fu&szlig; auf solchen Wegen unterwegs und kann schon gar nicht mehr z&auml;hlen wie oft ich erschrocken war als ein Radfahrer pl&ouml;tzlich an mir vorbei schoss.<br/>Den Radfahrern konnte man in diesen speziellen F&auml;llen wohl nicht einmal einen wirklichen Vorwurf machen, mir w&auml;re keiner Aufgefallen der sein Rad offensichtlich nicht unter Kontrolle hatte. Auch scheint die technische Ausstattung hier in unserer N&auml;he meist noch einen kleinen Tick besser zu sein als das allgemein &uuml;blich ist.</p>
<p>Ich hatte fr&uuml;her ein paar etwas schockierende Begegnungen mit mies gewarteten, angerosteten und von Grund auf unbrauchbaren Fahrr&auml;dern. Besonders genannt seien an dieser Stelle die Leihfahrr&auml;der aus einem Schulausflug (defekte Torpedoschaltung, ab einer gewissen Tretgeschwindigkeit war schlagartig der mechanische Widerstand der Pedale komplett verschwunden... sollte ich keine Kinder zeugen k&ouml;nnen wissen wir wenigstens woran es liegt.) und das Fahrrad der Mitbewohnerin einer Exfreundin.<br/>Besagte Mitbewohnerin wusste noch nicht mal was an ihrem Fahrrad kaputt sein sollte als ich sie darauf ansprach, es machte mir jedoch schon etwas Sorgen als ich mit dem geliehenen Fahrrad anhalten wollte und die effektivsten Bremsm&ouml;glichkeiten "F&uuml;&szlig;e schleifen lassen" und "ausrollen" lauteten.</p>
<p>Wenn ich mir nun vorstelle dass einer der Radfahrer der morgens an mir vorbei rauscht ein ebenso schlecht gewartetes Rad f&auml;hrt, evtl. noch (typisch Flachl&auml;nder) mit kleinsten Steigungen schon rein prinzipiell &uuml;berfordert ist und evtl. auch noch konstitutionell beeintr&auml;chtigt ist (Party letzten Abend, viel getrunken, am fr&uuml;hen Morgen zur Arbeit?) dann steigert das mein Wohlbefinden auf derartigen Strecken nur bedingt.</p>
<p>BTW: Meine eigenen Erfahrungswerte sagen &uuml;brigens dass Radfahrer in gr&ouml;&szlig;eren St&auml;dten und im Flachland eine Tendenz aufweisen generell schlechtere Fahrr&auml;der zu verwenden als im Gebirge und "auf dem Land". Mein mehrere Jahre altes "Focus"-Fahrrad mag im Erzgebirge immer eines der &auml;lteren und klapprigeren sein, doch hier in der Dresdner Innenstadt trau ich es mir kaum es irgendwo zu den anderen zu stellen, weil es als optisch bestes wohl noch am ehesten gestohlen wird. Gibt es irgendwo offizielle Statistiken zu diesem Verhalten?</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_594" onclick="set_comment_reference(594)" title="auf diesen Kommentar antworten">#594</a>:
    17.Sep.2008 12:09
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Mir als notorischem Autofahrer gehen vor allem die Radfahrer auf den Keks die es partout nicht einsehen wollen, dass sie doch auch bittesch&ouml;n den parallel zur Stra&szlig;e laufenden Radweg benutzen k&ouml;nnten anstatt mir au&szlig;erorts mit runden 80 km/h Geschwindigkeitsdifferenz (ja, es gibt auch langsame Radfahrer), am besten zu zweit nebeneinander, in der Mitte der Stra&szlig;e hinter einer Kurve zu begegnen.</p>
<p>Wobei mir einf&auml;llt: Muss Radfahrerrant bloggen.</p>

<p class="infos">
<a href="#comment_595" onclick="set_comment_reference(595)" title="auf diesen Kommentar antworten">#595</a>:
    17.Sep.2008 01:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Was aber imho auch nur eine Folge der miesen Radwege ist... wenn ich als Radfahrer die Wahl habe mit Schrittgeschwindigkeit &uuml;ber einen Trampelpfad (so sehen die Rad-/Fu&szlig;wege hier teilweise aus) und permanent Fu&szlig;g&auml;ngern auszuweichen, oder auf der Stra&szlig;e zu fahren, ist mir klar was die meisten tun.</p>

<p class="infos">
<a href="#comment_596" onclick="set_comment_reference(596)" title="auf diesen Kommentar antworten">#596</a>:
    17.Sep.2008 01:09
    von
    
      
        <a href="http://" target="_blank">
          sirsnookie
        </a>
</p>
<p>Nunja das mit den Radwegen ist so eine Sache, wobei unsere niederl&auml;ndischen Freunde (Ok da gibts auch pro Einwohner mind. 1 Rad) es in Enschede gut gel&ouml;st haben. Da gibt es kleine Extraspuren zwischen der Stra&szlig;e und dem Fu&szlig;weg - auch mit Bordsteinkante teilw. versehen. Leider hab ich kein Foto gefunden :(</p>

<p class="infos">
<a href="#comment_597" onclick="set_comment_reference(597)" title="auf diesen Kommentar antworten">#597</a>:
    17.Sep.2008 01:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Wie bereits oben geschrieben halte ich das auch f&uuml;r die Ideall&ouml;sung. In Dresden jedoch gibt es im Idealfall nur breite Fu&szlig;wege, die durchaus bereits zwei farblich abgesetzte Spuren haben (es ist nat&uuml;rlich nicht klar welche Spur f&uuml;r was gedacht ist) und an denen Schilder f&uuml;r kombinierter Rad-/Fu&szlig;weg stehen. Was grob gesagt idiotisch ist.</p>

<p class="infos">
<a href="#comment_598" onclick="set_comment_reference(598)" title="auf diesen Kommentar antworten">#598</a>:
    17.Sep.2008 05:09
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>bzgl der Qualit&auml;t der Fahr&auml;der in der Stadt:<br/>
Ich sehe eigentlich t&auml;glich zusammengetretenen Fahrr&auml;der was in mir immer wieder den Instinkt weckt mein altes Rad zu nehmen anstatt dem guten / neueren.<br/>
Ist schade wie was .... aber letzlich kann man ein gutes Rad in der Stadt (KA) kaum &uuml;ber einen l&auml;ngeren Zeitraum stehen lassen ohne einen Schaden zu riskieren.</p>
<p>bzgl Speed:<br/>
Die Leute mit defekten / schlecht gewarteten R&auml;dern sind doch im Normalfal leh die gem&uuml;tlichen Fahrer ... oder hast du schonmal jmd mit nem alten /halbdefekten Damenrad mit 50 km/h auf dem Flachland gesehen ? =) Ich nicht.</p>
<p>bzgl Farblicher Hervorhebung:<br/>
gibts hier auch, ebenso ohne klare Aussage welche Farbe jetzt f&uuml;r Fussg&auml;nger und welche f&uuml;r Radfahrer ist (zumindest teilweise) ... tolle Logik.</p>

<p class="infos">
<a href="#comment_599" onclick="set_comment_reference(599)" title="auf diesen Kommentar antworten">#599</a>:
    17.Sep.2008 07:09
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Was aber imho auch nur eine Folge der miesen Radwege ist&hellip; </p>
<p>Oh, ich kann dir garantieren, der Ort an den ich immer denken muss, wenn ich so etwas sage, hat durchaus einen sch&ouml;nen Radweg. Das ist nur Ignoranz, was anderes kann da einfach nicht dahinterstecken.</p>

<p class="infos">
<a href="#comment_600" onclick="set_comment_reference(600)" title="auf diesen Kommentar antworten">#600</a>:
    18.Sep.2008 09:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Idioten gibt es halt immer und &uuml;berall, das wird man nicht so leicht weg bekommen, egal mit welchen Mitteln.</p>

<p class="infos">
<a href="#comment_601" onclick="set_comment_reference(601)" title="auf diesen Kommentar antworten">#601</a>:
    18.Sep.2008 10:09
    von
    
      
        <a href="http://ag7.alltagsgrauen.info/" target="_blank">
          fwolf
        </a>
</p>
<p>@fidel: ich denke, in KA ist das so gel&ouml;st: au&szlig;en die Radfahrer, innen die Fu&szlig;g&auml;nger.</p>
<p>Mir pers&ouml;nlich geht das Verhalten der Karlsruher Radfahrer aber geh&ouml;rig auf den Sack - so radikal und ungehobelt wie hier rumgeholzt wird, ist mir selbst in "Metropolen" wie M&uuml;nchen noch nicht passiert. Schlimmer daran ist aber, dass die Leute dann auch noch genauso schlecht Auto fahren <em>gnarf</em></p>
<p>cu, w0lf.</p>
</div>