+++
title = "OpenOffice ist tot"
date = "2015-04-23T01:04:00"
author = "Dr. Azrael Tod"
tags = ["\"Freie\" Software"]
issoid = "blog/1613"
aliases = "blog/1613"
+++

<p>Fast tot zumindest, und zumindest behauptet das <a href="http://www.pro-linux.de/news/1/22261/openoffice-kurz-vor-dem-ende.html" target="_blank" title="OpenOffice kurz vor dem Ende">ein Artikel den ich gerade gelesen habe</a>.</p>
<p></p><blockquote>W&auml;hrend die Office-Suite LibreOffice floriert, ist die Programmierarbeit bei OpenOffice auf nahezu null gesunken. Neue Ver&ouml;ffentlichungen von OpenOffice werden immer unwahrscheinlicher, doch die Verantwortlichen wollen die Tatsachen noch nicht wahrhaben.</blockquote>
<p>Ich werde OpenOffice keine Tr&auml;ne nachweinen. Von mir aus k&ouml;nnte auch LibreOffice sofort aus diesem Internetz verschwinden. Beides sind nur Quellen unglaublichen Schmerzes und von Fragen wie:<br/></p><blockquote>In MS Office hab ich das immer so gemacht. Warum geht das hier so umst&auml;ndlich?</blockquote>
<p>Imho ist das Problem dass beide weiterhin unglaublich komplexe Haufen Java-Schrott sind.<br/>Kleine Tools die jeweils eine Aufgabe erledigen sind heute ja leider nicht mehr gefragt, also baut man das was Mickeysoft und co anbieten nach.</p>
<p>Die ganzen Grundideen sind alle schon jeweils f&uuml;r sich bescheuert:<br/></p><ul><li>gezippte XML-Labyrinthe</li><li>WYSIWYG-Editoren (kann man tun, den Code selber zu lesen und zu &uuml;berarbeiten sollte aber immer eine ertr&auml;glich machbare Option bleiben. Momentan ist das nichtmal ann&auml;hernd vorgesehen)</li><li>kompletten Office-Suiten die alles tun was irgendwie was mit B&uuml;ro zu tun hat (einfache Texte, formatierte Texte, DTP, Tabellenkalkulation, Pr&auml;sentationen, Datenbank, E-Mail-Client?, schreiben kleiner Nutzertools via VB, ...)</li></ul>
<p>Microsoft kann einfach Geld/Aufwand auf die Probleme werfen die sich aus &uuml;berm&auml;&szlig;iger Komplexit&auml;t ergeben. Sinnvoll wird es dadurch noch lange nicht. Auch bei deren Produkten sieht man jedenfalls genau die gleichen Probleme und nat&uuml;rlich haben die sich mit ihren "<a href="http://de.wikipedia.org/wiki/Ribbon" target="_blank" title="Wikipedia: Ribbons">Ribbons</a>" ihre gewohnte Benutzerbasis auch ordentlich verschreckt, nur um sie demn&auml;chst <a href="http://de.wikipedia.org/wiki/Microsoft_Windows_8#Benutzeroberfl.C3.A4che" target="_blank" title="Wikipedia: Metro-Benutzeroberfl&auml;che">mit einer Metro-Umstellung</a> wieder vor das gleiche Problem zu stellen.</p>
<p>Ich glaube auch nicht dass man durch Nachahmung ein besseres Produkt erreichen wird.</p>
<p>OpenOffice/LibreOffice ist seit vielen Jahren auf einem Stand den ich jetzt nicht viel besser/schlechter als MS Office ansehen w&uuml;rde. Aber wie auch beim Vorbild schafft man es nicht mal zwischen verschiedenen Versionen des eigenen Programmes Dokumente durchgehend gleichm&auml;&szlig;ig darzustellen. Dar&uuml;ber was passiert wenn man vom Konkurrenzprogramm eine Datei importiert will man lieber gar nicht reden.</p>
<p>Wenn man eine Datei nur lange genug ver&auml;ndert, n&auml;hert sich die Wahrscheinlichkeit dass die Datei unbenutzbar wird (weil irgendwas Syntaxfehler oder &auml;hnliches erzeugt) stetig 1 an.</p>
<p>Das ist auch wieder eines dieser vielen Themen bei denen man sieht dass Einsteigerfreundlichkeit nicht das gleiche wie Benutzerfreundlichkeit ist.</p>
