+++
title = "Browserupdates"
date = "2012-03-02T01:03:00"
author = "Dr. Azrael Tod"
tags = ["Crapple", "PC", "Rant", "Softwareschrott", "Technik"]
issoid = "blog/1563"
aliases = "blog/1563"
+++

<p>Das allw&ouml;chentliche Browserupdate steht an, verschiedene Nutzer reagieren unterschiedlich daraf:</p>
<p></p><ul><br/><li><b>Der Chrome-Nutzer</b>: Beschwert sich weil er seinen Browser f&uuml;r das Update neu starten muss</li><br/><li><b>Der Firefox-Nutzer</b>: Freut sich dass nach dem Update der Browser so viel schneller ist, weil der ganze geleakte Speicher beim Neustart freigegeben wurde.</li><br/><li><b>Der Safari-Nutzer</b>: Beschwert sich <i>nicht</i> dar&uuml;ber dass er sein Betriebssystem f&uuml;r das Browserupdate 2x neu starten soll. Es ist die Art wie der heilige Jobs gesagt hat dass man Browserupdates durchf&uuml;hren soll.</li><br/><li><b>Der IE-Nutzer</b>: Up-Was? 0o</li><br/></ul>
<p></p><h3>Harte Realit&auml;t mit OSX und Updates</h3><br/>Mein Arbeitsrechner, der Aufgabenbedingt <a href="/OSX_-_function_follows_form">DreckOS benutzt</a>, wollte schon seit einer Woche oder so unbedingt ein Update f&uuml;r Safari installieren. Da ich Safari wirklich nicht ertragen kann und somit auch nicht nutze, habe ich das wie immer bis zu einem g&uuml;nstigem Zeitpunt (erfahrungsgem&auml;&szlig;: 1 Tag bevor das n&auml;chste Update erscheint) vor mir hergeschoben und heute, da sich eh schon wieder Finder aufgeh&auml;ngt und sogar Chrome gerade abgest&uuml;rzt war, dachte ich w&auml;re ein solcher Zeitpunkt.

<p>Also sch&ouml;n auf "Installier halt deine sinnlosen Updates und starte dich neu!" geklickt (vorher das m&uuml;hevoll deinstallierte iThunfisch f&uuml;r Updates deaktiviert, ich will das nicht wieder drauf haben, sonst h&auml;tte ich es nicht deinstalliert -.-) und 40min gewartet bis beide ausgew&auml;hlte Updates heruntergeladen und, wie ich dachte, installiert waren.</p>
<p>Dann nur noch:<br/></p><ol><br/><li>3-4x auf "Ja, ich will diesen Rechner wirklich neustarten" geklickt und einem guten dutzend offene Programmen best&auml;tigt dass ich wirklich auch sie beenden will.</li><br/><li>Dann noch einmal komplett auf "Rechner neustarten" klicken weil ich eines dieser "Wollen sie Programm XYZ wirklich beenden?" nicht schnell genug beantwortet habe und OSX inzwischen davon ausging dass "Programm XYZ kann nicht beendet werden, Neustart abgebrochen".</li><br/><li>Dann noch h&auml;ndisch Finder get&ouml;tet, weil Programme die sich ernsthaft aufgeh&auml;ngt haben kann dieses System nat&uuml;rlich nicht einfach beenden.</li><br/><li>Dann fast 15min auf einen blauen Bildschirm mit Apple-Typischem "Aktivit&auml;ts"-Anzeige-GIF gestarrt, w&auml;hrend der Rechner scheinbar nichts mehr tat.</li><br/><li>Von hand den Ausschalter gedr&uuml;ckt gehalten, weil es einem wirklich zu dumm geworden ist.</li><br/><li>Rechner wieder eingeschalten.</li><br/><li>mich dar&uuml;ber aufgeregt dass das Startger&auml;usch auch dann laut &uuml;ber die fest eingebauten Lautsprecher ausgegeben wird, wenn Kopfh&ouml;rer angesteckt sind</li><br/><li>folgende "Frage" mit "ok" beantwortet: "Es m&uuml;ssen 2 Updates installiert und danach der Rechner neu gestartet werden"</li><br/><li>kurz gewartet w&auml;hrend Updates installiert wurdent</li><br/><li>mich erneut &uuml;ber das Startger&auml;usch aufgeregt</li><br/><li>anmelden</li><br/><li>5min warten bis der Rechner nach Anmeldung auch wirklich benutzbar wird (Festplatte r&ouml;delt wie irre, Fensterwechsel ruckelt, Programme starten zwecklos)</li><br/></ol>
<p>...und schon war es geschafft! \o/</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1583" onclick="set_comment_reference(1583)" title="auf diesen Kommentar antworten">#1583</a>:
    17.Apr.2012 10:04
    von
    
      
        eri!
      
    
    
  </p>
<p>herzlichen gl&uuml;cksstrumpf</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1584">
<p class="infos">
<a href="#comment_1584" onclick="set_comment_reference(1584)" title="auf diesen Kommentar antworten">#1584</a>:
    19.Apr.2012 03:04
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>danke... -.-</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1590" onclick="set_comment_reference(1590)" title="auf diesen Kommentar antworten">#1590</a>:
    06.Aug.2012 10:08
    von
    
      
        Oelsen
      
    
    
  </p>
<p>f&uuml;rs archiv:</p>
<p>Der Opera-Nutzer: Regt sich masslos dar&uuml;ber auf, dass schon wieder ein Detail an andere Browser angepasst wurde und beschwert sich sofort auf <a href="http://opera.com" rel="nofollow">opera.com</a> lauthals &uuml;ber "nsl". Erwartet in ein paar Wochen endlich version X.01, damit diese nervigen Aufbaufehler verschwinden. Vergisst es nach ein paar Minuten wieder, surft zufrieden weiter. </p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1591">
<p class="infos">
<a href="#comment_1591" onclick="set_comment_reference(1591)" title="auf diesen Kommentar antworten">#1591</a>:
    07.Aug.2012 08:08
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Opera? Das war doch das Ding was zeitgleich mit Mosaic ausgestorben ist? <em>duck</em></p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1593">
<p class="infos">
<a href="#comment_1593" onclick="set_comment_reference(1593)" title="auf diesen Kommentar antworten">#1593</a>:
    14.Aug.2012 01:08
    von
    
      
        J.
      
    
    
  </p>
<p>Opera hat (noch) den einzigen bedienbaren Browser (Tastenk&uuml;rzel, Mausgesten), w&auml;hrend alle anderen Vendors dem Chrome-Nachbau-Wahn verfallen sind.</p>
</div>
</li>
</ul>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1619" onclick="set_comment_reference(1619)" title="auf diesen Kommentar antworten">#1619</a>:
    09.May.2013 06:05
    von
    
      
        <a href="http://linux-workers.posterous.com/" target="_blank">
          Ikem
        </a>
</p>
<p>Soviel zum Thema "Macs machen keinen &Auml;rger".</p>
</div>