+++
title = "Der Hund hat meine Hausaufgaben gefressen!"
date = "2008-10-13T10:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/934"
aliases = "blog/934"
+++

<p>...zugegeben: Ich habe keinen Hund, jedoch suche ich schon den ganzen Morgen mein verkalktes Hirn nach den Themen ab &uuml;ber die ich schreiben wollte.<br/>Ich wei&szlig; noch ganz genau dass mir gestern Abend im Bett noch was geniales eingefallen ist (Heute Morgen wusste ich nat&uuml;rlich nur noch dass ich schreiben wollte, nichtmehr wor&uuml;ber.) Dann ist mir unter der Dusche erneut etwas wenigstens annehmbares eingefallen, doch auch das hat nicht &uuml;berlebt bis ich am PC war.</p>
<p>Jetzt k&ouml;nnte ich auf Standardthemen ausweichen, doch irgendwie ist schon alles wichtige gesagt:<!--more--></p>
<p>Zur deutschen Fernsehkultur, <a href="http://blog.fefe.de/?ts=b60f328b" target="_blank">Reich-Ranicki</a> und <a href="http://www.faz.net/s/Rub475F682E3FC24868A8A5276D4FB916D7/Doc~EE91B6E359E494E34BE66891A5D35B7AB~ATpl~Ecommon~Scontent.html" target="_blank">seiner Ablehnung</a> des <a href="http://uk.youtube.com/watch?v=U-kH2FPKk5c" target="_blank">deutschen Fernsehpreises</a> wurde auf <a href="http://filmjournalisten.de/?p=1569" target="_blank">Filmjournalisten.de schon ein Beitrag</a> gebracht dem ich nichts besseres mehr hinzuf&uuml;gen kann...</p>
<p>zum Thema Kopierschutz und Contentmafia hat <a href="http://xkcd.com/488/" target="_blank">XKCD</a> mal wieder alles in einem Bild sch&ouml;n zusammengefasst. (Wer es etwas umfangreicher mag: guckt mal bei <a href="http://axisdude.blogspot.com/2008/10/sind-filesharer-verbrecher.html" target="_blank">"A Sceptic's Universe"</a>)...</p>
<p>zur US-Wahl und McCaine wurde vom <a href="http://www.rollingstone.com/news/coverstory/make_believe_maverick_the_real_john_mccain" target="_blank">Rolling-Stone-Magazine</a> ein guter Artikel geschrieben. (auch schon wieder <a href="http://blog.fefe.de/?ts=b60c6ced" target="_blank">via Fefe</a>)...</p>
<p>und um mich &uuml;ber die Bankenkriese auszulassen ist mein Alkoholspiegel am heutigen Morgen noch nicht hoch genug. Ja da wurde viel Shice gebaut und ja es wird wieder passieren... aber ist irgendwer auch nur ann&auml;hernd &uuml;berrascht? Also ich ehrlich gesagt nicht.</p>
<p>Vlt. sollte ich mich dar&uuml;ber aufregen dass wir jetzt die <a href="http://www.tagesspiegel.de/politik/deutschland/Bundeswehr;art122,2629476" target="_blank">Bundeswehr doch im Inland einsetzen d&uuml;rfen</a>. Aber das ist sicher auch nur wieder eine Ausrede um die Finanzierung dieser &uuml;beralterten Struktur zu rechtfertigen. Meiner Meinung dazu hab ich ja <a href="http://drazraeltod.wordpress.com/2008/10/07/rant-bundeswarez/">bereits Ausdruck verliehen</a>. ABSCHAFFEN!</p>
<p>Bleiben eigentlich nur noch private Sachen und das Wetter, zum Wetter kommt evtl. sp&auml;ter noch was, wenn ich ein Photo vom Handy/PPC meiner besseren H&auml;lfte anh&auml;ngen kann.<br/>Privat bliebe anzumerken dass wir jetzt eines dieser modernen "Walltattoos" bestellt haben. Die Diskussion welches wir kaufen sollten dauerte am l&auml;ngsten, leider wollte Cindy mich weder "HAIL ERIS", "FNORD!", "Soylent Gr&uuml;n ist Menschenfleisch", "Wir sind die Borg. Widerstand = Spannung/Strom" noch "Es gibt zwei Arten von Fu&szlig;g&auml;ngern - die schnellen und die toten." oder "Phnglui mglwnafh Cthulhu Rlyeh wgahnagl fhtagn!" im Wohnzimmer auf reichlich einem Meter breite aufh&auml;ngen lassen. Daher gibts erstmal nur eins f&uuml;rs Schlafzimmer, dort sind wir uns wenigstens einig geworden.</p>
<p>Ich h&auml;tte eigentlich damit rechnen sollen: Sie will mich ja auch nicht eine eventuelle Tochter Eris oder Diskordia nennen lassen... Nichtmal die kleinen Freuden g&ouml;nnt mann mir. *g*</p>
<p>Wenn wir gerade bei Fu&szlig;g&auml;ngern sind: Ich hoffe ihr habt alle sch&ouml;n den 3. j&auml;hrlichen Tag des Baumes am Samstag gefeiert und ein paar von den Mistdingern f&uuml;r mich umgelegt! ;-)<br/>Wenn nicht: Nachholen!</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_745" onclick="set_comment_reference(745)" title="auf diesen Kommentar antworten">#745</a>:
    13.Oct.2008 01:10
    von
    
      
        <a href="http://" target="_blank">
          sirsnookie
        </a>
</p>
<p>Am Wochenende werden sich sicherlich einige junge Leute in blechernden Kisten zusammengerauft haben und hier und da nen Baum wegrasiert haben :)</p>

<p class="infos">
<a href="#comment_746" onclick="set_comment_reference(746)" title="auf diesen Kommentar antworten">#746</a>:
    13.Oct.2008 01:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ich w&uuml;rde das uneingeschr&auml;nkt toll finden... wenn nicht dieser Bug bez&uuml;glich Autos noch immer nicht behoben w&auml;re.<br/>
Bereits bei mittleren Kollisionen mit B&auml;umen geben die Kisten einfach den Geist auf. Bei einem PC k&ouml;nnte man wenigstens bei Bedienfehlern die Software neu aufspielen und das Problem beheben, bei KFZ hingegen geht immer gleich die teuere Hardware kaputt. -.-</p>
</div>