+++
title = "Kreditkartenraub 2.0"
date = "2008-10-13T11:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/936"
aliases = "blog/936"
+++

<p>Das ist doch mal ne nette Idee. Statt jeden Kreditkartenslot einzeln zu manipulieren und so sehr umst&auml;ndlich an die Daten zu kommen kann man auch gleich manipulierte Ger&auml;te an die Nutzer verkaufen.<!--more--></p>
<p>Ich w&uuml;rde ja PC-Welt normalerweise nicht weiter &uuml;ber den Weg trauen als ich ihr Firmengeb&auml;ude werfen kann, aber die Idee ist so genial, die muss ich mal posten<br/></p><blockquote>Die "Wanze" im Kartenleseger&auml;t sendet einmal pro Tag die gesammelten Daten &uuml;ber eine Mobiltelefonverbindung nach Pakistan. Damit das Muster schwieriger erkennbar ist, k&ouml;nnen die Kriminellen per Funk einstellen, welche Karten das Ger&auml;t ausspionieren soll. So speichert die "Wanze" beispielsweise nur jede zehnte Transaktion oder nur f&uuml;nf Visa-Platinum Karten pro Tag und kann sogar vor&uuml;bergehend abgeschaltet werden. Zudem benutzen die Kriminellen die gestohlenen Kreditkarten- und Identifikationsnummern erst fr&uuml;hestens zwei Monate nach der Spionage. &Auml;u&szlig;erlich l&auml;sst sich keine Abnormit&auml;t an einem derartig manipulierten Ger&auml;t feststellen. Die sicherste M&ouml;glichkeit, ein Ger&auml;t mit der Zusatzplatine zu identifizieren, ist die Gewichtsmessung. Ein manipuliertes Ger&auml;t wiegt aufgrund der zus&auml;tzlich eingebauten Teile rund hundert Gramm mehr als ein herk&ouml;mmliches Ger&auml;t.</blockquote><br/>Auf die Art spart man sich nicht nur die Gefahr auf irgendwelchen Kameraaufzeichnungen beim Manipulieren des Kartenschlitzes aufzutauchen, sondern allgemein wird es erheblich unwahrscheinlicher dass man erwischt wird. Es wundert mich dass das bisher noch nicht viel h&auml;ufiger vorgekommen ist.

<p>(via <a href="http://www.ra-haensch.de/php/wordpress/?p=822" target="_blank">Rechtsanwalt Haensch</a>)</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_747" onclick="set_comment_reference(747)" title="auf diesen Kommentar antworten">#747</a>:
    14.Oct.2008 02:10
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>hehe. heute schon bei heise dr&uuml;ber gestolpert.<br/>
Respektable Idee =)</p>
<p>Sollte doch jetzt aber im Ansatz nachvollziehbar sein, wer da am Werke war oder ?</p>

<p class="infos">
<a href="#comment_748" onclick="set_comment_reference(748)" title="auf diesen Kommentar antworten">#748</a>:
    14.Oct.2008 08:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Das ist in der Tat sehr einfach:</p>
<p>Auch die US-amerikanischen Geheimdienste befassen sich mit dem Fall, da das Geld nach Pakistan flie&szlig;t, wo die Al-Kaida aktiv ist. "Fr&uuml;her h&auml;tte nur der nationale Geheimdienst so eine Operation durchf&uuml;hren k&ouml;nnen. Das ist be&auml;ngstigend", meint Joel Brenner von der US-Spionageabwehr. Er r&auml;t, die Produktionskette von Kreditkartenleseger&auml;ten strenger zu &uuml;berwachen. Wann genau im Produktionsprozess die Verbrecherorganisation die Ger&auml;te manipuliert hat, ist bisher noch nicht gekl&auml;rt. Die "Wanzen" wurden entweder in der Produktionsst&auml;tte in China oder kurz nach dem Ende der Produktionskette eingebaut.</p>
<p>ES WAREN DIE P&Ouml;SEN TERRORISTEN! <em>g</em></p>
</div>