+++
title = "Flatratelesen"
date = "2013-10-15T12:10:00"
author = "Dr. Azrael Tod"
tags = ["Bücher/Literatur", "Kulturflatrate", "Rant", "Säue durchs Dorf treiben"]
issoid = "blog/1577"
aliases = "blog/1577"
+++

<p>Achja&hellip; fast immer wenn irgendwer bei den &Ouml;R-Sendern unbedingt auf Krampf etwas kritisches zu aktuellen Entwicklungen aus den Fingern saugen muss, fang ich an mich ob der unglaublichen Idiotie vor Schmerzen zu winden.<br/>Dieses Mal hat eine gewisse <a href="https://twitter.com/chwatty" target="_blank" title="Christine Watty auf Twitter">Christine Watty</a> sich nicht entbl&ouml;den k&ouml;nnen, <a href="http://www.wdr5.de/sendungen/politikum/medienkolumne/onlinebuch102.html" target="_blank" title="WDR Politikum Medienkolumne: Die Buchbranche und das digitale Zeitalter">sich in ihrer Medienkolumne &uuml;ber E-Books "Gedanken" zu machen</a>.</p>
<p>Ihr Problem<br/></p><ul><br/><li>Es gibt E-Books</li><br/><li>Es gibt unautorisierte Kopien diese E-Books im Internet.</li><br/><li>Ein paar Autoren f&uuml;rchten ihr Buch wird so schneller verbreitet ohne dass sie etwas daran verdienen</li><br/><li>Diese Autoren ver&ouml;ffentlichen darum selber keine E-Book-Version.</li><br/></ul><br/>Sie bemerkt dann sogar selber dass auch das nat&uuml;rlich nicht 100%ig gegen Filesharing hilft. Und nimmt an dass auch hier (wie schon bei Filmen und Musik) bald ein Trend zur Flatrate zu erkennen sein k&ouml;nnte.

<p>Und da wird dann die hippe, junge, "Moderatorin, Autorin, Sprecherin Radio&amp;TV" zum ausgewachsenen Spie&szlig;er der althergebrachtes verteidigt weil ihm der reine Gedanke an &Auml;nderungen schon zuwider ist.</p>
<p>Oder um sie selbst zu zitieren:<br/></p><blockquote title="aus ihrem Beitrag">Also: F&uuml;r die Idee gegen einen Pauschalbetrag online Zugriff auf m&ouml;glichste viele B&uuml;cher zu erhalten? Gruselig!</blockquote>
<p>Mehr E-Books will sie nat&uuml;rlich schon!<br/></p><blockquote>Das Medium "Ebook" sollte digital gedacht werden, dann kann sich selbst auf seine alten Tage das Prinzip "Buch" nochmals v&ouml;llig neu anf&uuml;hlen. B&uuml;cher im Internet k&ouml;nnen wie soziale Netzwerke verbinden &ndash; die ersten Schritte sind zwar hier bereits gemacht. Aber die Branche muss sich sputen.</blockquote><br/>Allein, die Flatrate ist das Problem:<br/><blockquote title="Ihr Schlussabsatz im Artikel">Der Flatrate-Kunde ist l&auml;ngst erschaffen, einer, der zugreift, sobald ihm jemand das Angebot unterbreitet, das er schon aus dem Pizzaladen und dem Musikstreaming-Dienst kennt: Zahl einen kleinen Preis und dann nimm&rsquo; soviel Du kannst. Aber bitte, bitte nicht auch noch mit B&uuml;chern.</blockquote>
<p>Nat&uuml;rlich! Denn Flatrates (oder Festpreise, um mal deutsch zu reden) sind ein Werk des Teufels!<br/>Nicht auszumahlen wie schnell uns hier zur Steinzeit zur&uuml;ck katapultieren w&uuml;rden, wenn Leute unbegrenzt und uneingeschr&auml;nkt B&uuml;cher lesen k&ouml;nnten, nachdem sie einen festen Betrag gezahlt haben.</p>
<p>Pl&ouml;tzlich w&uuml;rden alle B&uuml;cher danach lesen was sie an Geld kosten statt nur auf den Inhalt zu achten! &hellip;Warte hier war schon irgendein Fehler.</p>
<p>&Uuml;berhaupt: Was soll das Problem sein? Dass die Verlage oder Autoren dann weniger Geld einnehmen? Wann war jemals ein Festpreismodell im Durchschnitt billiger als der selektive Einzelkauf dessen was man eigentlich wirklich haben will? Der Vorteil einer Flatrate ist eben <b>nicht</b> dass man Geld spart. Der Vorteil f&uuml;r den Endkunden liegt ganz einfach in der &Uuml;bersichtlichkeit.</p>
<p>Man bezahlt X Euro, alle N Wochen, v&ouml;llig unabh&auml;ngig davon was man konsumiert oder wieviel. Was k&ouml;nnte einfacher oder &uuml;bersichtlicher sein?</p>
<p>Auch w&uuml;rde evtl. etwas mehr Quersubventionierung m&ouml;glich sein. Wenn alle Flatrates bezahlen, wird es zwar f&uuml;r diejenigen die sonst kaum gelesen h&auml;tten kaum billiger, aber denjenigen die aktuell den Gro&szlig;teil der B&uuml;cher kaufen sollte das wohl kaum st&ouml;ren. Besser noch: Wenn $Typ jetzt kaum liest (z.B. weil ihn die wenigsten B&uuml;cher interessieren), dann aber aus reiner Bequemlichkeit eine Flatrate bezahlt, wird er evtl. &ouml;fter zu B&uuml;chern greifen die ihm sonst uninteressant erschienen w&auml;ren. Es ist doch eh bezahlt, Reinsehen kann man ja mal!</p>
<p>Um es kurz zu machen: Wenn Frau Watty schon damit ein so gro&szlig;es Problem hat dass irgendwer f&uuml;r einen festen Betrag unbegrenzt lesen k&ouml;nnte, sollten wir um ihrer Willen hoffen dass keiner auch noch auf die Idee kommt unbezahlt Buchkonsum zu erm&ouml;glichen. Z.B. in einer Art "&ouml;ffentlicher Videothek f&uuml;r B&uuml;cher" oder so.</p>
<p></p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1665" onclick="set_comment_reference(1665)" title="auf diesen Kommentar antworten">#1665</a>:
    15.Oct.2013 01:10
    von
    
      
        Snookie
      
    
    
  </p>
<p>Frau Watty hat nicht ein Problem mit eBooks, frau Watty hat ein Problem mit B&uuml;chern. Denn so wie die gute Dame die S&auml;tze im Beitrag st&uuml;ckelt ... klingt das sehr nach schlecht abgelesen. Vielleicht sollte die Dame mehr B&uuml;cher lesen? Auch Betonungen gibt es, diese l&auml;sst sie ganz unter den Tisch fallen. </p>
<p>Nat&uuml;rlich f&uuml;rchten die Autoren um "ihr" Geld. Denn wenn du einen gro&szlig;en Verlag hinter dir hast, gibt es auch viel Geld f&uuml;r verkaufte B&uuml;cher. Bei einer Flatrate m&uuml;sste das ganze entweder nach dem Prinzip Flattr aufgeteilt werden oder alle bek&auml;men etwas. Die Frage hierbei: "Wer sind die alle". Jeder der eine ISBN auf sein Werk gedruckt hat? </p>
<p>N&auml;chste Frage w&auml;re, die Verteilung ... hei&szlig;t das du machst eine Weltbild Flatrate (Sorry, Weltbild ist mir als 1. eingefallen) und kannst dann in allen Weltbild L&auml;den alles kaufen? Oder nur jedes Buch 1x? Sonst kommt wer auf die Idee und kauft 10 St&uuml;ck um sie dann f&uuml;r geringe Betr&auml;ge weiterzuverkaufen. </p>
<p>Wenn es so liefe wie bei Flattr, g&auml;be es wiederum das Problem "Datenschutz". Mimimi nu wissen alle das ich "Scheiss auf Grau 1-X" gelesen habe mimim. </p>
<p>Und dann bliebe noch das Problem: Nur auf Ebooks anwendbar oder auch auf normale B&uuml;cher? Im H&ouml;rbuch Bereich gibt es ja schon "Flatrates".</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1666">
<p class="infos">
<a href="#comment_1666" onclick="set_comment_reference(1666)" title="auf diesen Kommentar antworten">#1666</a>:
    15.Oct.2013 01:10
    von
    
      
        <a href="http://www.g33ky.de/blog/author/Dr_Azrael_Tod/" target="_blank">
          Dr. Azrael Tod
        </a>
</p>
<blockquote>
<p>N&auml;chste Frage w&auml;re, die Verteilung ... hei&szlig;t das du machst eine Weltbild Flatrate (Sorry, Weltbild ist mir als 1. eingefallen) und kannst dann in allen Weltbild L&auml;den alles kaufen? Oder nur jedes Buch 1x? Sonst kommt wer auf die Idee und kauft 10 St&uuml;ck um sie dann f&uuml;r geringe Betr&auml;ge weiterzuverkaufen.</p>
</blockquote>
<p>Es ging nur um E-Books. "Ich hab die Datei 10x" bringt keinen Vorteil.<br/>
Ich ging durchaus von einer Flatrate pro Anbieter aus. Sei das jetzt Weltbild, Amazon oder Reclam.<br/>
Ich habe kein Problem mir eine "Amazon Kindle Flatrate" vorzustellen (Reclam noch viel weniger, da dort die B&uuml;cher eh meist gemeinfrei sind).</p>
<p>Amazon ist sowieso das Idealbeispiel daf&uuml;r warum das alles kein Problem ist. Die machen genau das bereits jetzt alles, es wird nur anders abgerechnet. Nat&uuml;rlich wei&szlig; Amazon wann du welches Buch zum Lesen heruntergeladen hast (die wissen ja sogar wie weit gerade du gelesen hast, dar&uuml;ber beschwert sich ja auch keiner).</p>
</div>
</li>
</ul>
</div>