+++
title = "Zitate aus nem Kabaret"
date = "2006-05-23T08:05:00"
author = "Dr. Azrael Tod"
issoid = "blog/289"
aliases = "blog/289"
+++

<p>Hoffe mal es st&ouml;rt den K&uuml;nstler nich, wenn ich sein halbes Programm abschreib... aber der will ja wohl eher ne Botschaft verbreiten, da kann ihm das wohl nur recht sein...<br/>(Au&szlig;erdem wird er es wohl eh nie bemerken weil kaum wer das hier liest^^)<br/></p><p class="MsoNormal"><br/></p><p class="MsoNormal">"Was missbraucht wird muss abgeschafft werden... Sozialleistungen wurden missbraucht -&gt; wurden abgeschafft. Gesundheitswesen wurde missbraucht -&gt; wird abgeschafft. In letzter Zeit h&ouml;rt man viel von Kindesmissbrauch... aber lassen Sie der Regierung einfach noch ein paar Jahre Zeit"<br/><br/>"Die schlechte Ern&auml;hrung auf Grund der geringeren H&ouml;he der Rente wirkt sich positiv auf die L&auml;nge der Rentenzahlung aus"<br/><br/>Die Bundesregierung hat die Tabaksteuer nun doch in 3 Schritten je 33ct Stadt einmal um 1&euro; erh&ouml;ht. Ulla Schmidt antwortete auf die Frage wieso dies so erfolgte, wenn die Tabaksteuer doch dazu dienen sollte den Zigarettenkonsum zu verringern und mehr Geld ein zu nehmen wortw&ouml;rtlich: "Wir wollen das Ausweichverhalten der Raucher vermeiden"<br/>Die CSU hat es dann auf einer Pressekonferenz wenig sp&auml;ter offen ausgesprochen: "Wenn wir die Tabaksteuer zu sehr erh&ouml;hen verlieren wir Arbeitspl&auml;tze in der Zigarettenindustrie."<br/><br/>"Muss es funktionieren oder darf es was von Siemens sein?"<br/><br/>"Sag mir die Wahrheit... Auf den Schei&szlig; ist jeder Mann in seinem Leben nur ein Mal reingefallen"<br/><br/>"3 Monate nach der Bundestagswahl 1990 entdeckte Theo Waigel ein kleines Steuerloch. Knapp 300 Milliarden DM fehlten. Um das auszugleichen hat der Kohl die Mineral&ouml;lsteuer um 20 Pfennig erh&ouml;ht und den Soli-Zuschlag erhoben. 4 Jahre Rot-Gr&uuml;ne &Ouml;kosteuer machte der Kohl mit einem Wisch. Und parallel dazu hat er die ganzen Schulden gemacht... Die H&auml;lfte der Schulden, die Deutschland heute Probleme machen entstanden in den 16 Jahren Amtszeit Kohl. Und davon wieder die H&auml;lfte nur in den Jahren von 1990 bis 94.<br/>Laut Finanzexperten wurde in diesen 4 Jahren alles Falsch gemacht, was man h&auml;tte falsch machen k&ouml;nnen. Man hat viel zu viele Schulden gemacht und parallel dazu die Sozialsysteme wissentlich ruiniert. Die Renten sind gepl&uuml;ndert worden. Wissen Sie wer das vorgeschlagen hat? Wer das Haushaltsloch &uuml;bersehen hat? Das war der verantwortliche Staatssekret&auml;r im Finanzministerium. Der Waigel hat ja im Endeffekt nur alles abgesegnet. Wissen Sie wie dieser Staatssekret&auml;r hie&szlig;? K&ouml;hler, Horst K&ouml;hler"<br/><br/>"Wahlen &auml;ndern nichts, sonst w&auml;ren sie verboten" - Kurt Tucholsky<br/><br/>Haben Sie wirklich Probleme mit der Vorstellung Wale oder Delphine ab morgen zu vermissen? Hier in Berlin? Ich bin ganz ehrlich, ich w&uuml;rde nicht mal Elefanten ernsthaft vermissen."<br/><br/>"Der Kanzler hatte es ja mehrmals gesagt... Wir sollen nicht in einen oberfl&auml;chlichen Antiamerikanismus abgleiten. Aber Meiner ist ja nicht oberfl&auml;chlich"<br/><br/>"Angela Merkel zitiere ich ja am liebsten Wortw&ouml;rtlich... Ich hab noch keine bessere M&ouml;glichkeit gefunden, diese Frau zu beleidigen. ... Ja, die Merkel sagt Inhaltlich nicht viel, aber wenn sie was sagt, dann ist es auch nichts"<br/><br/>"Moslems... Menschen, die ihre Religion ernst nehmen, f&uuml;r Katholiken unvorstellbar."<br/><br/>"Die Bundeswehr ist dazu da, an der Grenze den Feind so lange aufzuhalten, bis Milit&auml;r kommt"<br/><br/>"Die Amerikaner k&ouml;nnen ja heute mit chirurgischer Pr&auml;zision... Die k&ouml;nnen keine Maschinen bauen die Zettel z&auml;hlen... aber die k&ouml;nnen mit chirurgischer Pr&auml;zision die von der UNO verbotenen Splitterbomben um die Zivilbev&ouml;lkerung drum rum abwerfen. Wenn da einer bl&ouml;d zur Seite springt kann man jetzt nichts machen"<br/><br/>"Ja wie? total vermint? Habt Ihr schon mal Bodensch&auml;tze"<br/><br/>"Fr&uuml;her hie&szlig; es Helm ab zum Gebet, heute hei&szlig;t es Hirn ab zur Solidarit&auml;t"<br/><br/>"Muhamet Ata hat sogar seine GEZ-Geb&uuml;hren bezahlt... als Student"<br/><br/>"Die alten Menschen in Deutschland haben Angst vor Al'Kaida. An deren Stelle h&auml;tte ich Angst vor deutschen Busfahrern, deren Trefferquote liegt wesentlich h&ouml;her"<br/><br/>"Manche sagen in den Schulen, da rieselt der Putz von den W&auml;nden mit dem Kalk in den K&ouml;pfen der Lehrer um die Wette"<br/><br/>"Wenn Sie heute Radio h&ouml;ren bekommen Sie alle 3 Minuten gesagt welchen Sender Sie h&ouml;ren und vor allem warum"<br/><br/>"Werbung in der Schule: Und jeder kann w&auml;hlen. Schick ich meine Kinder auf die Aldi-Gesamtschule, auf das Beneton-Gymnasium oder auf das Kellogs-Kolleg? Ja, Sie lachen aber Real-Schulen gibt&rsquo;s schon."<br/><br/>"Man kann nicht einfach Deutscher werden, so bl&ouml;d muss man geboren sein." </p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_22" onclick="set_comment_reference(22)" title="auf diesen Kommentar antworten">#22</a>:
    23.Nov.2008 12:11
    von
    
      
        <a href="http://www.mazonia.de/?p=28" target="_blank">
          Mazonia.de - Entdecke das Neuland &amp;raquo; Blog Archive &amp;raquo; Bundespr&auml;sident will weltweiten Sozialismus (vermutlich nur aus Versehen)
        </a>
</p>
<p>[...] Journalist ist, was hier aber keinesfalls von Nachteil sein soll, hat es sch&ouml;n zusammengefasst (Text von hier kopiert): &ldquo;3 Monate nach der Bundestagswahl 1990 entdeckte Theo Waigel ein kleines Steuerloch. Knapp 300 [...]</p>

<p class="infos">
<a href="#comment_23" onclick="set_comment_reference(23)" title="auf diesen Kommentar antworten">#23</a>:
    08.Jan.2009 11:01
    von
    
      
        chriz
      
    
    
  </p>
<p>Ich vermute, dass das ganze total aus dem zusammenhang gerissen wurde mit ulla schmidt und dem ausweichverhalten. ich find leider keine original interviews, aber es sollte wohl in die richtung gehen, dass raucher nicht auf g&uuml;nstigere und sch&auml;dlichere selbstgedrehte zigaretten ausweichen sollen.</p>

<p class="infos">
<a href="#comment_24" onclick="set_comment_reference(24)" title="auf diesen Kommentar antworten">#24</a>:
    08.Jan.2009 11:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ich w&auml;re mir da nicht ganz so sicher wie du es scheinbar bist.. Meine Meinung von Ulla Schmidt ist aber eh nicht gerade die h&ouml;chste und ehrlich gesagt f&auml;llt mir auch beim besten Willen kein sinnvoller Grund ein die Tabaksteuer (deren Sinn es doch sein sollte die Konsumenten durch Preiserh&ouml;hung abzuschrecken) nur Schrittweise zu erh&ouml;hen, wodurch die Preiserh&ouml;hung nicht so sehr auff&auml;llt.</p>

<p class="infos">
<a href="#comment_25" onclick="set_comment_reference(25)" title="auf diesen Kommentar antworten">#25</a>:
    15.Jul.2009 01:07
    von
    
      
        jemand
      
    
    
  </p>
<p>Du h&auml;ttest wenigstens in der Titelzeile erw&auml;hnen k&ouml;nnen, dass deine Zitate von Volker Pispers stammen!</p>

<p class="infos">
<a href="#comment_26" onclick="set_comment_reference(26)" title="auf diesen Kommentar antworten">#26</a>:
    15.Jul.2009 01:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>die meisten stammen durchaus von Pispers.. aber eben nicht alle<br/>
folgende fallen mir z.B. gleich auf Anhieb auf die nicht von Pispers stammen:</p>
<p>&ldquo;Muss es funktionieren oder darf es was von Siemens sein?&rdquo;<br/>
&ldquo;Wahlen &auml;ndern nichts, sonst w&auml;ren sie verboten&rdquo;</p>
</div>