+++
title = "Pro-\"Three Strikes\""
date = "2011-10-23T02:10:00"
author = "Dr. Azrael Tod"
tags = ["Politik", "Rant"]
issoid = "blog/1559"
aliases = "blog/1559"
+++

<p>Wir sollten wir wirklich dringend eine <a href="http://de.wikipedia.org/wiki/Three_strikes" target="_blank">"Three-Strikes"-Regelung</a> einf&uuml;hren... f&uuml;r Hundebesitzer. (schon allein deshalb weil sich Baseball-analogien dem durchschnittlichen Mitteleurop&auml;er immer so gut erschlie&szlig;en)</p>
<p>Beim dritten Vergehen, sollten jegliche Hunde im Besitz des T&auml;ters sofort entfernt werden. Nat&uuml;rlich erstmal b&uuml;rokratiearm und von privatwirtschaftlichen Firmen kontrolliert (als Anreitz k&ouml;nnte man z.B. eine Belohnung von 100&euro; auf jedes gemeldete Fehlverhalten ausschreiben) werden und wenn es sich doch um eine Fehlmeldung handelt, kann der Hundebesitzer dann sp&auml;ter noch Einspruch erheben.</p>
<p>Vergehen k&ouml;nnten hier z.B. das Nicht-Aufsammeln von Hundehaufen im Stadtgebiet, das leinenlose f&uuml;hren des Hundes oder &auml;hnliche Dinge sein, die bereits jetzt anerkannte Ordnungswidrigkeiten sind.</p>
<p>Unter Enfernung der Hunde, k&ouml;nnte man je nach Wirtschaftslage verschiedenes verstehen: bei geringer Auslastung der &ouml;rtlichen Tierheime, w&auml;re das eine tempor&auml;re Einlagerung dort, f&uuml;r sp&auml;teren Weiterverkauf. Wenn dies nicht der Fall ist, k&ouml;nnte man nat&uuml;rlich die Tiere auch direkt einschl&auml;fern und/oder dem &ouml;rtlichen Metzger &uuml;berstellen und so die Belohnungen refinanzieren.</p>
<p>Nat&uuml;rlich w&auml;re es "fairer" nicht die Hunde, sondern die Besitzer einzuschl&auml;fern, aber da das erstens zu halterlosen Hunden f&uuml;hrt und wohl 2. auch nicht politisch durchf&uuml;hrbar sein wird (irgendwer kommt sicher wieder mit solchem Menschenrechts-Geschwurbel oder so), m&uuml;ssen wir uns wohl mit einer solchen L&ouml;sung zufrieden geben.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1549" onclick="set_comment_reference(1549)" title="auf diesen Kommentar antworten">#1549</a>:
    23.Oct.2011 02:10
    von
    
      
        <a href="http://www.g33ky.de/" target="_blank">
          profmakx
        </a>
</p>
<p>FNORD!</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1550">
<p class="infos">
<a href="#comment_1550" onclick="set_comment_reference(1550)" title="auf diesen Kommentar antworten">#1550</a>:
    23.Oct.2011 02:10
    von
    
      
        <a href="http://g33ky.de/" target="_blank">
          Dr. Azrael Tod
        </a>
</p>
<p>ich wei&szlig; nicht was du meinst... ich sehe keinen Fnord, aber ich h&ouml;re da immer von fern einen Einh&auml;ndigen klatschen.</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1551" onclick="set_comment_reference(1551)" title="auf diesen Kommentar antworten">#1551</a>:
    26.Oct.2011 02:10
    von
    
      
        <a href="http://bunix.de/" target="_blank">
          reaper
        </a>
</p>
<p>Tut mir leid aber dein Kompromiss ist mir zu soft, ich bin daf&uuml;r die Hundehalter in ihre Stuhlt&uuml;ten einzusperren die sie allerorten liegen lassen. Normale Hundeschei&szlig;e ist nach ner Woche sp&auml;testens von K&auml;fern und so gefressen, in den T&uuml;ten entfaltet sie ihr Aroma erst nach mehreren Wochen. Einfach ausprobieren und auf die schwarzen T&uuml;ren treten die immer mal rumliegen.</p>
<p>Und wehe eins von den Kutschenpferden in der Altstadt schei&szlig;t mir nochmal vor die Motorhaube, dann gibts Salami.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1552">
<p class="infos">
<a href="#comment_1552" onclick="set_comment_reference(1552)" title="auf diesen Kommentar antworten">#1552</a>:
    26.Oct.2011 03:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>...wobei ich bei den Kutschenpferden wenigstens noch einsehe warum die da rumrennen und dass das tourismusm&auml;&szlig;ig irgendwie was bringen kann.</p>
</div>
</li>
</ul>
</div>