+++
title = "Inhalts-Lizenzen"
date = "2015-08-14T11:08:00"
author = "Dr. Azrael Tod"
tags = ["Open Source", "Technik"]
issoid = "blog/1623"
aliases = "blog/1623"
+++

<p>Gerade flog ein m&auml;&szlig;ig hilfreiches Video zum Thema Lizenzen an mir vorbei...</p>
<p></p><div style="text-align: center;"><iframe allowfullscreen="" frameborder="0" height="315" src="https://www.youtube.com/embed/8A0CgS66iE0" width="560"></iframe></div>
<p>Bl&ouml;d: Das erkl&auml;rt halt nicht dass es mehrere Lizenzen gibt die teilweise v&ouml;llig anders aussehen k&ouml;nnen.</p>
<p>Wenn dann jemand Bilder unter &ldquo;freier Lizenz&rdquo; findet und eins unter &ldquo;<a href="https://creativecommons.org/licenses/by-nc-nd/3.0/de/" target="_blank">CC-BY-NC-ND</a>&rdquo;, ein anderes unter <a href="https://de.wikipedia.org/wiki/GNU-Lizenz_f%C3%BCr_freie_Dokumentation" target="_blank">GFDL</a> und wieder ein anderes unter <a href="http://www.wtfpl.net/" target="_blank">WTFPL</a> steht, dann w&uuml;rde er sich nach dieser Anleitung trotzdem v&ouml;llig verwirrt und falsch anstellen.</p>
<p>Darum hier mal mein Versuch f&uuml;r mehr (un)Klarheit zu sorgen</p>
<p></p><h3>Wirkliche Anleitung:</h3>
<p>Lizenzen sind Bedingungen (meist mehrere gleichzeitig) unter denen man einen Inhalt (z.B. Bilder) &uuml;berlassen bekommt<br/>Bedingungen k&ouml;nnen dabei von &ldquo;du musst mir Geld zahlen&rdquo;, &uuml;ber &ldquo;du darfst es nicht verbreiten/bearbeiten&rdquo; bis zu &ldquo;wenn du mein Bild verteilen willst, muss dein Erstgeborener den Namen Strunzfu&szlig; bekommen&rdquo; reichen, das ist dem Urheber v&ouml;llig frei (abgesehen illegales nat&uuml;rlich) &uuml;berlassen</p>
<p>Bedingungen k&ouml;nnen sich von Lizenznehmer zu Lizenznehmer unterscheiden und k&ouml;nnen auch frei verhandelt werden (z.B. kann ich einem gemeinn&uuml;tzigen Verein sagen &ldquo;macht was ihr wollt damit&rdquo; und einer Waffenfirma alles verbieten)<br/>Weil das st&auml;ndiges Verhandeln und damit viel Aufwand bedeuten w&uuml;rde, hat man standardisierte Lizenzen erfunden die man einfach f&uuml;r sein Bild angibt und die, in der Regel, f&uuml;r alle gleich gelten.<br/>Steht also z.B. unter einem Bild &ldquo;unter CC-BY-SA&rdquo;, dann muss ich nicht erst verhandeln oder lange nachschlagen, sondern kann (weil ich die <a href="http://creativecommons.org/" target="_blank">CC</a>-Lizenz bereits kenne) das Bild &uuml;bernehmen. (Ich k&ouml;nnte aber trotzdem verhandeln wenn mir die Bedingungen nicht gefallen)</p>
<p></p><h3>Warum</h3>
<p>Warum &uuml;berhaupt eine Lizenz? Weil man sonst immer nachfragen m&uuml;sste. Stellt euch vor ihr findet ein Bild das ihr gerne verwenden wollt und an dem keine Lizenz steht. Ihr m&uuml;sstet rein theoretisch den Urheber ausfindig machen und nachfragen zu welchen Bedingungen ihr das d&uuml;rft. Ohne diese Auskunft d&uuml;rft ihr... nichts. Weiterverbreiten oder bearbeiten darf man nur mit Erlaubnis, darum ist auch die restriktivste Lizenz immer besser f&uuml;r euch als gar keine.</p>
<p>Wenn ihr mehr Rechte braucht k&ouml;nnt ihr halt immer noch nachfragen und neu verhandeln.</p>
<p></p><h3>Creative-Commons</h3><br/>Eine sehr h&auml;ufige Lizenz ist <a href="http://creativecommons.org/" target="_blank">Creative-Commons</a> (kurz CC), dabei handelt es sich um ein Baukastenprinzip nach dem man Bedingungen zusammen bauen kann:<br/><ul><li>CC0 - keine Bedingungen</li><li>BY - Urheber muss genannt werden</li><li>NC - kommerzielle Nutzung nicht erlaubt</li><li>ND - keine Bearbeitung erlaubt</li><li>SA - Weitergabe (z.B. von ver&auml;nderten Versionen) an andere nur unter der gleichen Lizenz erlaubt</li></ul>
<p></p><h3>Beispiel</h3><br/>ein K&uuml;nstler gibt unter seinem Bild an &ldquo;verwendbar unter CC-BY-NC-ND&rdquo; und ich will das Bild verwenden. Dann muss ich mir &uuml;berlegen &ldquo;will ich es bearbeiten?&rdquo; (z.B. einen Ausschnitt verwenden, das Bild spiegeln oder einen Text dar&uuml;ber malen), &ldquo;will ich es kommerziell nutzen?&rdquo; (z.B. auf einem Werbeflyer f&uuml;r das Kuchenfest meines Vereins mit 1&euro; pro St&uuml;ck Torte) und &ldquo;kann ich den Urheber drunter schreiben?&rdquo;.<br/>Wenn ich also die Bedingungen nicht einhalten kann, dann darf ich das Bild nicht unter dieser Lizenz verwenden.

<p>Ich kann aber trotzdem einfach dem Urheber eine Mail schreiben und ihn fragen ob er mir erlaubt es auf den Werbeflyer zu pappen.</p>
<p></p><h3>G33KY</h3><br/>Achja: dem aufmerksamen Leser ist sicher auch nicht entgangen dass am unteren Rand meiner Seite folgender Satz steht:<br/><blockquote>Alle Beitr&auml;ge unterliegen der Creative-Commons Lizenz <a href="https://creativecommons.org/licenses/by-sa/3.0/de/" target="_blank">CC-BY-SA</a></blockquote><br/>Das bedeutet ihr habt die folgenden Rechte wenn ihr Dinge mit meinen Artikeln tun wollt:<br/><blockquote><ul><li>Teilen &mdash; das Material in jedwedem Format oder Medium vervielf&auml;ltigen und weiterverbreiten</li><li>Bearbeiten &mdash; das Material remixen, ver&auml;ndern und darauf aufbauen - und zwar f&uuml;r beliebige Zwecke, sogar kommerziell.</li><li>Der Lizenzgeber kann diese Freiheiten nicht widerrufen solange Sie sich an die Lizenzbedingungen halten.</li></ul></blockquote><br/>...so lange ihr mich als urspr&uuml;nglichen Urheber angebt (mit Link hierher f&auml;nd' ich sch&ouml;n) und die Inhalte unter gleichen Bedingungen weitergebt.
      
    
  