+++
title = "Das Kabel-Los ziehen"
date = "2014-07-30T09:07:00"
author = "Dr. Azrael Tod"
tags = ["Gadget", "Hardware", "PC", "Technik"]
issoid = "blog/1596"
aliases = "blog/1596"
+++

<p>Wenn wir <a href="/2014/7/20/Kabellose-Gamepads-f&uuml;r-PC" title="G33KY: Kabellose Gamepads f&uuml;r PC">schon beim Thema "Kabellos" sind</a>, f&auml;llt mir gleich auf wie drastisch sich meine Hardware in diese Richtung gewandelt hat.</p>
<p>Auch wenn ich schon ewig dagegen argumentiere, f&uuml;r alles unbedingt verbindenden Dr&auml;hte einsparen zu m&uuml;ssen, habe ich das selbst sehr erfolgreich betrieben.<br/>Klar, Funk&uuml;bertragung ist fehleranf&auml;lliger (oh&hellip; Mikrowelle beim Nachbarn), unsicherer (jeder kann mitlesen), teuerer, langsamer, braucht mehr Strom und sorgt ganz allgemein f&uuml;r mehr Komplexit&auml;t, was eigentlich eh schon nie eine gute Idee ist.<br/>Dazu kommen noch so Albtr&auml;ume wie der BT-Stack oder dass Frequenzbereiche pro Land unterschiedlich sein k&ouml;nnen oder man an bestimmten Orten Funk ganz verboten ist&hellip;</p>
<p>Und trotzdem h&auml;ngen inzwischen alle M&ouml;glichen Ger&auml;te bei mir nicht mehr am Kabel:<br/></p><ul><br/><li>die Maus am Asus T100 ist bereits <a href="http://www.razerzone.com/de-de/gaming-mice/razer-orochi/" target="_blank" title="Razer Orochi Bluetooth-Maus">in zweiter Generation</a> kabellos, <a href="http://www.microsoft.com/hardware/de-de/p/arc-touch-mouse" target="_blank" title="Microsoft Arc Touch">die alte ben&ouml;tigte noch ein Dongle</a></li><br/><li>statt USB-Festplatten am Rechner anzustecken, h&auml;ngen die inzwischen fast ausschlie&szlig;lich an meiner <a href="http://avm.de/produkte/fritzbox/fritzbox-7390/" target="_blank" title="Modell 7390">Fritzbox</a> oder am Mediaserver (<a href="/2012/1/23/Nachfolge-f&uuml;r-mein-MediaserverNAS" title="G33KY: Nachfolge f&uuml;r mein Mediaserver/NAS">leider noch immer das Shuttle X27D</a>), welche beide nebenbei NAS spielen und mir die Daten per WLAN zuspielen</li><br/><li>mein <a href="http://www1.euro.dell.com/de/de/heimburo/Peripherals/dell-c1660w/pd.aspx?refid=dell-c1660w&amp;cs=dedhs1&amp;s=dhs" target="_blank" title="Dell c1660w - druckt gut, Toner h&auml;lt nicht lange und ist nie vorr&auml;tig, ist bereits teilweise kaputt - keine Kaufempfehlung">Drucker</a> h&auml;ngt jetzt auch seit 1-2 Monaten am WLAN und auch wenn ich mir demn&auml;chst <a href="http://www.canon.de/For_Home/Product_Finder/Printers/Direct_Photo/SELPHY_CP900/index.aspx" target="_blank" title="Canon SELPHY, Thermo-Sublimationsdrucker knapp &uuml;ber Sofortbildkamera-Gr&ouml;&szlig;e (100 Bilder = 30&euro;)">einen Photodrucker f&uuml;r unterwegs</a> kaufe, wird dieser das &auml;hnlich handhaben (wenn ich da wohl auch eher die alte Kamera per Kabel anstecken werde)</li><br/><li><a href="/2014/7/20/Kabellose-Gamepads-f&uuml;r-PC" title="G33KY: Kabellose Gamepads f&uuml;r PC">Gamepad (hatten wir ja erst ausf&uuml;hrlich)</a></li><br/><li>Meine Kopfh&ouml;rer sind <a href="/2011/8/8/A2DP-Bluetooth-Stereo-Audio" title="G33KY: A2DP Bluetooth-Stereo-Audio">schon seit Jahren</a> zu gro&szlig;en Teilen kabellos, auch wenn ich inzwischen <a href="http://www.philips.de/c-p/SHB7000_00/ueber-ohr-schwarz" target="_blank" title="Philips SHB7000">neue</a> vom selben Hersteller habe weil <a href="http://www.philips.de/c-p/SHB9000_10/bequem-verstellbarer-buegel" target="_blank" title="Philips SHB9000">die alten</a> kaputt waren und mir das Format besser gef&auml;llt</li><br/><li>selbst <a href="http://shop.metawatch.com/collections/frame" target="_blank" title="Metawatch Frame - nicht kaufen! softwareseitig komplett Schrott">Armbanduhr</a> und <a href="http://www.sigmasport.de/de/produkte/bikecomputer/topline_2012_wired/bc1612/?flash=0" target="_blank" title="Sigma BC 16.12 - drahtlos ist hier nur die Sensor-Anbindung">Fahrradcomputer</a> machen irgendwas-mit-ohne-Draht</li><br/><li>Meine Rechner haben kaum noch ordentliche Netzwerkanschl&uuml;sse. Die Notebooks betrifft das sowieso, weil ich damit zwischen Bett/Esstisch/Sofa umher wander, doch selbst <a href="/2009/5/4/because-i-can!" title="G33KY: because i can!">mein alter Spielerechner "WOPR"</a> ist momentan nur noch per WLAN mit Netz versorgt, weil ich zu faul bin endlich ordentliche Kabel zu verlegen</li><br/></ul>
<p></p><h3>Warum?</h3><br/><ul><li>Die Hersteller schwenken von propriet&auml;rem Schei&szlig; langsam zu Bluetooth und co. um. Das bedeutet dass ich nicht f&uuml;r jeden Schei&szlig; ein eigenes Dongle ben&ouml;tige, was den Nutzen potentiert</li><br/><li><i>jeder</i> Rechner (auch: Telefon oder sonstiges Spielzeug) hat heute Bluetooth eingebaut (ok, <a href="/2011/9/12/ARM-Cortex-A9-Netbook-Toshiba-AC100-10V" title="G33KY: ARM Cortex-A9-Netbook Toshiba AC100-10V">au&szlig;er dem Toshiba AC100</a>&hellip; einer von 2 Punkten warum das nicht mehr tragbar war)</li><br/><li>Ger&auml;te werden kleiner und mobiler, da st&ouml;ren Kabel st&auml;rker (an mein altes 3,5kg 14" Not-book h&auml;tte ich eher Festplatten angesteckt, das musste ich eh relativ statisch auf einen Tisch stellen. Das Asus T100 habe ich im Zweifelsfall auf dem Scho&szlig; stehen oder halte den Tablet-Teil direkt in der Hand um meiner Frau ein Katzenbild zu zeigen)</li><br/><li>weniger Anschl&uuml;sse an Ger&auml;ten &mdash; Ja, ich k&ouml;nnte so etwas wie mein T100 mit mehr als einem USB-Anschluss (oder gar Anschl&uuml;ssen die nicht an der abnehmbaren Tastatur h&auml;ngen) kaufen, aber daf&uuml;r m&uuml;sste ich fast 1K&euro; mehr bezahlen</li><br/><li>die Tendenz zu mehreren Rechnern hat sich fortgesetzt, ein Netzwerkdrucker war vor 10 Jahren etwas das man als Firma wollte, privat hatte man eh nur einen Haupt-PC und schlimmstenfalls noch ein Notebook dazu. Heute habe ich 4 wirklich aktiv verwendete Rechner zuhause stehen. Meine Frau hat noch ab und zu vorhandenes Arbeitsnotebook, jeder hat ein Smartie-Phone und auch von denen will man evtl. mal drucken. Ein Netzwerkdrucker ist heute auch f&uuml;r privat eine sinnvolle Sache und nicht mal marginal teuerer als ein USB-only-Ger&auml;t.</li><br/><li>langsam erscheinen Ger&auml;te die man entweder/oder betreiben kann. Man verwendet meistens Funk, aber wenn der Akku leer ist oder man im Flugzeug sitzt, kann man ein Kabel anstecken. (z.B. Philips SHB8000-Kopfh&ouml;rer, PS4-Gamepads, Razer Orochi Maus, USB-Festplatten an meiner Fritzbox, Dell c1660w)</li><br/></ul><br/><h3>Na und?</h3><br/>Ich habe keine Ahnung ob das sinnvoll ist. Ich glaube dass gerade die privatsph&auml;ren-Problematik und die St&ouml;ranf&auml;lligkeit weiter ernste Probleme darstellen, aber wie alle Menschen neige ich dazu Probleme zu ignorieren die sich momentan nicht sichtbar gegen mich auswirken.<br/>Langfristig habe ich mir vorgenommen wenn m&ouml;glich nur Ger&auml;te zu kaufen die man optional auch per Kabel betreiben kann und vor allem bei meinen Kopfh&ouml;rern, dem Gamepad und USB-Festplatten die ich zur Ausnahme auch mal vom Router abziehen kann, hat sich das bereits &ouml;fter bezahlt gemacht als ich vorher dachte.
      
    
  