+++
title = "Murphys Law: Schlafsaal"
date = "2008-10-11T11:10:00"
author = "Toranor"
issoid = "blog/924"
aliases = "blog/924"
+++

<p>Schlafsaal - dieser Name soll suggerieren, dass es ein Raum ist, in dem mehrere Menschen gleichzeitig Schlaf finden. Das is anf&uuml;rsich auch ne gute Idee, wenn da nicht Murphy w&auml;r. Es finden alle Schlaf, alle ausser dir.<!--more--><br/>Es scheint ein paar ungeschriebene Gesetze zu geben, die man kennen sollte ehe man sich in einen Schlafsaal wagt mit der Hoffnung auch zu schlafen. Ich versuche mal anhand meiner Erfahrung die ich leidvoll machen durfte diese f&uuml;r die Nachwelt festzuhalten.<br/><strong>Erstens:</strong><br/>Sobald alle ausser dir schlafen beginnt ein Wettbewerb, wer akustisch am stylishsten einen Baum f&auml;llen kann. 90% s&auml;gen ihn einfach ab. Das ist ein recht monotones Schnarchger&auml;usch, und man kann es ignorieren. 2 Hacken auf den Baum ein. Das ist hart, weil unregelm&auml;ssig und laut. Einer hat akustisch einen M&auml;hdrescher simuliert, der immer wieder gegen den Baum f&auml;hrt. Schon sehr kreativ, aber auch sehr schlafbehindernd. Die Kr&ouml;nung und mein pers&ouml;nlicher Favorit ist jener, der aller 2 Atemz&uuml;ge explodiert ist, in einem Ger&auml;usch wie ein in einer 150-j&auml;hrigen Eichen einschlagender Blitz. Einer macht Ger&auml;usche als ob er stirbt (w&auml;r er mal gestorben, h&auml;tten wir eine nervende Ger&auml;uschquelle weniger). Und egal in welchen Schlafsaal man ist: mindestens einer furzt im Schlaf. Und das so laut das mindestens zwei davon wach werden.<br/><strong>Zweitens:</strong><br/>Der empfindlichste und genervteste Typ schl&auml;ft an der T&uuml;r. Immer wenn einer reinkommt St&ouml;hnt er, wenn einer das Brett nicht innerhalb von 3 sekunden zu macht, weil er nichts sieht wird er angeschnauzt, und zwar in einer LAutst&auml;rke, das zwei weitere wach werden. Diese zwei verb&uuml;nden sich mit den 2 vom Furz aufgeweckten und beschweren sich lauthals, warum keiner die Fresse h&auml;lt. Interessant zu beobachten war, dass mit zunehmender L&auml;nge der "Nacht" die Lust des Motzers nachl&auml;sst. War es am Anfang (so gegen 5 Uhr) noch ein energisches "Machts Brett zu ihr Helden !!!!!" , so war es um halb Acht nur noch ein gequ&auml;ltes, halbverschlafenes "u laut du doof" (ja, das z hatte er nicht ausgesprochen).<br/><strong>Drittens:</strong><br/>Es stinkt. Es stinkt gewaltig. Wie soll man das nur beschreiben ? Es war eine Mischung aus Harzer K&uuml;mmelk&auml;se, Appenzeller, &uuml;berlagerter Gouda, ranziger Emmentaler, gammliger Mozarella und Schimmel. Ungelogen, als den Raum das erste mal betrat roch es neutral, am n&auml;chsten "Morgen" roch es in der Ecke echt nach Schimmel. Keine Ahnung wer da gen&auml;chtigt hatte, aber derjenige sollte sich Gedanken &uuml;ber seinen Gesundheitszustand machen.<br/><strong>Viertens:</strong><br/>Schlafsaal is provided as it is. Es geh&ouml;ren keine Duschen dazu. Jetzt stinkt man selber. Pech.</p>
<p>Wer Rechtschreibfehler findet darf sie meistbietend versteigern.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_741" onclick="set_comment_reference(741)" title="auf diesen Kommentar antworten">#741</a>:
    11.Oct.2008 11:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Also das n&auml;chste mal doch im Auto vor der Halle schlafen?^^</p>

<p class="infos">
<a href="#comment_742" onclick="set_comment_reference(742)" title="auf diesen Kommentar antworten">#742</a>:
    11.Oct.2008 12:10
    von
    
      <a href="/blog/author/toranor/">
        toranor
      </a>
</p>
<p>Naja, das ist leider saukalt und extrem unbequem</p>

<p class="infos">
<a href="#comment_743" onclick="set_comment_reference(743)" title="auf diesen Kommentar antworten">#743</a>:
    14.Oct.2008 04:10
    von
    
      
        Tsukama
      
    
    
  </p>
<p>und ich WEISS, warum ich bei diversen Conventions, Veranstaltungen, etc. IMMER im Hotel schlafe. Auch wenn's mehr kostet....</p>

<p class="infos">
<a href="#comment_744" onclick="set_comment_reference(744)" title="auf diesen Kommentar antworten">#744</a>:
    14.Oct.2008 08:10
    von
    
      <a href="/blog/author/toranor/">
        toranor
      </a>
</p>
<p>Nun, die 2. nacht hab ich mitten in der lan-halle verbracht, herrliche atmosph&auml;re.</p>
</div>