+++
title = "Neue Delphi/C++Builder-Versionen"
date = "2008-08-26T01:08:00"
author = "Dr. Azrael Tod"
issoid = "blog/631"
aliases = "blog/631"
+++

<p>Laut <a href="http://www.heise.de/ix/Neue-Versionen-von-Delphi-und-C-Builder--/news/meldung/114886" target="_blank">Heise</a> wurde gerade von <a href="http://www.embarcadero.com/" target="_blank">Embarcadero</a> eine neue Version von Delphi und C++Builder herausgegeben. Nat&uuml;rlich verf&uuml;gt sie wieder &uuml;ber all die Funktionen die sich so sch&ouml;n lesen in der Feature-Liste.<!--more--></p>
<p>F&uuml;r mich pers&ouml;nlich war Delphi auch schon immer eine der besten Entwicklungsumgebungen und stellte zusammen mit der nahezu ideal gew&auml;hlten Sprache (erst Pascal genannt, sp&auml;ter Object Pascal und seit Delphi 6 dann ebenfalls mit Delphi tituliert) eine prima RAD-Umgebung dar. Delphi war schon seit ich mehr als Batch kann mein Lieblingstool um mal schnell 1-2 Windowsanwendungen zusammen zu klicken.</p>
<p>Borland C++ Builder setzte auf die gleichen Bibliotheken (Visual Component Library oder VCL) auf und bot damit eine M&ouml;glichkeit C++-Code zu schreiben ohne sich gro&szlig;artig umgew&ouml;hnen zu m&uuml;ssen, auch die GUI-Erstellung wurde zum gr&ouml;&szlig;ten Teil beibehalten. Leider verlor das Ganze durch die unn&ouml;tige Verkomplizierung von C++ im Gegensatz zu den Pascal-basierenden Versionen sehr viel von seinem Charm, bei einigen Projekten die ich unter C++ Realisieren musste (einige eine direkte &Uuml;bernahme der selben Programmfunktionen aus einem fr&uuml;herem Delphi-Projekt) brauchten wir 50% der Entwicklungszeit nur daf&uuml;r, dass ich Klassen umst&auml;ndlich definieren musste und mich um Dinge k&uuml;mmern musste, die mich evtl. interessiert h&auml;tten wenn ich Systemnahe Sachen wie Treiber oder andere Betriebssystemkomponenten programmiert h&auml;tte.. die aber bei Anwendersoftware v&ouml;llig ohne Belang sind.</p>
<p>Leider wurde Delphi ab der massiven Verwendung von .Net mit den neueren Versionen grauenvoll langsam zu verwenden und die Ladezeiten &auml;hnelten eher denen von gro&szlig;en Java-IDEs wie Eclipse statt denen der sch&ouml;nen, alten Delphi-Versionen.</p>
<p>Auch war Delphi leider nur auf Windows beschr&auml;nkt, auch wenn das mit Kylix versucht wurde auf Linux auszuweiten. Da Kylix aber einerseits nur gegen Wine gelinkt wurde (was imho ziemlich weit weg von nativ ist) und andernseits f&uuml;r Kylix extra eine neue Bibliothekenplatform entwickelt wurde (was die VLC als altgedientes System abl&ouml;sen sollte), artete das Ganze nat&uuml;rlich zum Flopp hoch Zehn aus und wurde nach wenigen Versionen bereits abgesetzt.</p>
<p>&Auml;hnlich ging es sp&auml;ter den Delphi-Versionen auf .Net Basis. Die komplett neu erstellte GUI, zusammen mit den langen Ladezeiten hatte wohl viele der alten Fans verschreckt, so dass Borland seine etwas unwirtschaftlichen IDEs erst in Codegear auslagerte, was dann vom <a href="http://www.heise.de/newsticker/Borland-verkauft-CodeGear--/meldung/107585" target="_blank">jetzigen Besitzer aufgekauft wurde</a>.</p>
<p>F&uuml;r mich pers&ouml;nlich setzt sich die traurige Entwicklung mit den neuen Versionen offensichtlich weiterhin fort. Es w&auml;re sch&ouml;n wenn endlich an Grundproblemen wie den Ladezeiten, der Platformunabh&auml;ngigkeit (mal abgesehen von der durch .net und Mono vorhandenen) und &auml;hnlichem gearbeitet w&uuml;rde statt immer weiter Funktionen zu integrieren die 90% der Nutzer eh nicht brauchen (z.B. Ajax- und Silverlightunterst&uuml;tzung oder Ribbon Controls im Stil von Microsoft Office).</p>
<p>Bis dahin bleibt die einzige wirkliche Alternative f&uuml;r Pascal-basierende Programmierung wohl weiterhin das freie <a href="http://www.lazarus.freepascal.org/" target="_blank">Lazarus</a> (eine IDE auf <a href="http://freepascal.org/" target="_blank">Freepascal</a>-Basis, angelehnt an fr&uuml;here Delphi-Versionen), auch wenn dies noch weit von einer brauchbaren Version entfernt ist, ist es bereits um Welten n&auml;her an "nutzbar" als Delphi.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_460" onclick="set_comment_reference(460)" title="auf diesen Kommentar antworten">#460</a>:
    18.Sep.2008 10:09
    von
    
      
        <a href="/2008/09/18/trollwut-eclipse/" target="_blank">
          Trollwut: Eclipse &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] wenn ich wei&szlig; was sie tun. Wirklich &uuml;berzeugt hat mich dies jedoch bisher selten, einzig Delphi/Lazarus haben bisher wirklich zeitweise eine Befehlsreferenz f&uuml;r mich unn&ouml;tig gemacht, Visual [...]</p>
</div>