+++
title = "Verlinkte Links verlinken ist strafbar!"
date = "2009-03-02T06:03:00"
author = "Dr. Azrael Tod"
issoid = "blog/1284"
aliases = "blog/1284"
+++

<p><a href="http://www.lawblog.de/index.php/archives/2009/03/02/danische-sperrliste-mobilisiert-polizei/" target="_blank">&Uuml;ber das Lawblog</a> bin ich heute mal wieder &uuml;ber eine Geschichte gestolpert, bei der es den Hund mitsamt der H&uuml;tte schaudert.</p>
<p>Einem Blogbetreiber wurde mal eben die Wohnung durchsucht und der PC konfisziert weil er auf <a href="http://schutzalter.twoday.net/stories/5544030/#5551894" target="_blank">ein anderes Blog</a> verlinkt hat, dieses auf Wikileaks verlinkt hat und Wikileaks eine Liste gesperrter "Kinderpornoseiten" ver&ouml;ffentlicht hat, aus der man sehr sch&ouml;n sieht dass nicht alles Kinderporno ist, was in einigen L&auml;ndern gefiltert wird.<!--more--><br/>WTF? Ich verlinke auf eine Seite, die auf eine Seite verlinkt, die m&ouml;glicherweise kritische Seiten verlinkt und aus DIESEM GRUND wird meine Wohnung durchsucht und mein PC (inkl. Monitor) beschlagnahmt?</p>
<p>Wie krank ist unser System eigentlich? Bei einer tats&auml;chlichen Linktiefe von 3 bis 5 Links im ganzen Internet h&auml;tten wir damit mal eben 9/10 aller privaten Webseitenbetreiber kriminalisiert.</p>
<p>Da bleibt nur noch die Warnung dass man <strong>AUF KEINEN FALL</strong> auf Seiten verlinken sollte, die viele andere Seiten verlinken... Google z.B. soll ja fast das ganze Internet indizieren, wenn man diese Seite verlinkt, verlinkt man damit bestimmt die Verlinkung verlinkter Kinderpornolinks.</p>
<p>Nat&uuml;rlich ist das ganze mal wieder Bl&ouml;dsinn der schlimmsten Sorte und es besteht zum Gl&uuml;ck nicht die geringste Chance dass gegen den Blogbetreiber jemals ein wirksames Urteil erlassen wird. Das hilft dem Kerl aber leider garnicht, unserem sch&ouml;nem System sei dank k&ouml;nnen wir ja jederzeit Hardware die teuerer ist, als eine maximal m&ouml;gliche Geldstrafe, ohne jegliches Urteil konfiszieren und dem Besitzer so lange wegnehmen bis ihr Wert irgendwo um Null tendiert.</p>
<p>Rechtsstaat ist doch was feines oder?</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1173" onclick="set_comment_reference(1173)" title="auf diesen Kommentar antworten">#1173</a>:
    02.Mar.2009 10:03
    von
    
      <a href="/blog/author/toranor/">
        toranor
      </a>
</p>
<p>Rechtsstaat ist wie Demokratie und Kommunismus - Die Idee ist gut, nur leider nur nen Traum.<br/>
Die Demokratie scheitert an den F&uuml;hrern.<br/>
Der Kommunismus scheitert an den Untergebenen.<br/>
Der Rechtsstaat scheitert an beiden.</p>

<p class="infos">
<a href="#comment_1174" onclick="set_comment_reference(1174)" title="auf diesen Kommentar antworten">#1174</a>:
    02.Mar.2009 11:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Bliebe nur noch das absolute Chaos (Anarchie?) als M&ouml;glichkeit... keine F&uuml;hrer, keine Untergebenen, nichtmal ein System das scheitern k&ouml;nnte.</p>
<p>Aber da wir eh fast schon an dem Punkt sind, wo es nicht mehr schlimmer werden kann, w&auml;re es schon fast einen Versuch wert.</p>

<p class="infos">
<a href="#comment_1175" onclick="set_comment_reference(1175)" title="auf diesen Kommentar antworten">#1175</a>:
    03.Mar.2009 08:03
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>Und ich dachte, wir h&auml;tten alle Staatsformen schon lange abgeschafft und leben in einer Anarchie? So kommt es mir zumindest seit langem vor, wie sich viele meinen benehmen zu m&uuml;ssen, oder ebend auch solche Storys da oben -.-</p>

<p class="infos">
<a href="#comment_1176" onclick="set_comment_reference(1176)" title="auf diesen Kommentar antworten">#1176</a>:
    03.Mar.2009 08:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>nein, offensichtlich nicht... oder zumindest k&ouml;nnen nur einige tun was immer sie wollen, andere bekommen sofort eins auf den Deckel.</p>
<p>Ich w&uuml;rde das eher mit Diktatur beschreiben, noch dazu wenn man keine wirkliche M&ouml;glichkeit hat etwas anderes zu w&auml;hlen.</p>

<p class="infos">
<a href="#comment_1177" onclick="set_comment_reference(1177)" title="auf diesen Kommentar antworten">#1177</a>:
    03.Mar.2009 09:03
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Ich glaube dass eine gewisse form des geordneten Chaos mit ganz einfachen Grundregeln wirklich am besten funktionieren w&uuml;rde.</p>
<p>Jedenfalls ist eine &Uuml;berregelmentierung ganz offensichtlich nicht die L&ouml;sung.</p>
<p>Aber ich gehe auch immer davon aus, dass es so etwas wie einen gesunden Menschenverstand gibt, daran scheitert meine Vorstellung...</p>

<p class="infos">
<a href="#comment_1178" onclick="set_comment_reference(1178)" title="auf diesen Kommentar antworten">#1178</a>:
    03.Mar.2009 10:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>&bdquo;Was ist die Mehrheit? Mehrheit ist der Unsinn! Verstand ist stets bei wenigen nur gewesen.&ldquo;</p>
<p>Friedrich Schiller</p>

<p class="infos">
<a href="#comment_1179" onclick="set_comment_reference(1179)" title="auf diesen Kommentar antworten">#1179</a>:
    05.Mar.2009 08:03
    von
    
      
        Dr. Pfeffer
      
    
    
  </p>
<p>Ich glaube das war eine ente, denn hier stehen ein paar wichtige Infos dazu:<br/>
<a href="http://www.carechild.de/news/aktuelle_news/erneute_kinderporno_ermittlungen_gegen_krumme13_anfuehrer_dieter_g_aus_pforzheim_567_1.html%3C/p%3E" rel="nofollow">http://www.carechild.d...</a>
</p>
<p class="infos">
<a href="#comment_1180" onclick="set_comment_reference(1180)" title="auf diesen Kommentar antworten">#1180</a>:
    05.Mar.2009 10:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Damit haben wir jetzt ein Problem: Der Artikel auf den du da verlinkst ist ja ganz nett.. aber ich kann die Sachen genauso wenig nachpr&uuml;fen wie die gegenteiligen Aussagen.</p>
<p>Was auf jeden Fall bleibt, ist die Frage ob hier jemandem die Wohnung durchsucht wurde weil er einige Links angebracht hat und vorher abgesessene Verurteilungen aufzuweisen hatte. Die Verurteilung scheint keine der beiden Seiten zu bestreiten, nehmen wir sie also mal als gegeben hin, weitere Hinweise aufgrund derer die Hausdurchsuchung genehmigt wurde kann ich jedoch auch dem Artikel auf Carechild.de nicht entnehmen.</p>
<p>Diese beiden Sachen m&ouml;gen jetzt moralisch sicher Verdacht erwecken, f&uuml;r einen Durchsuchungsbefehl braucht man jedoch eigentlich schon ernstere Hinweise.</p>
<p>Dann bliebe noch die Frage was genau konfisziert wurde. Auch hier sind sich beide Seiten einig: Es wurde der komplette PC mit Bildschirm beschlagnahmt.</p>
<p>Was soll man damit erreichen? Beweise sichern? Das ist doch wohl ein Witz! Welche Beweise sollen auf dem Bildschirm gespeichert sein? Die Festplatte an sich h&auml;tte durchaus gen&uuml;gt.</p>
<p>Dadurch dass jedoch der komplette PC entfernt wurde, wird hier bereits eine Art pr&auml;ventiver Bestrafung durchgef&uuml;hrt, die durch keinerlei Gerichtsurteil begr&uuml;ndet ist. Dem Beschuldigten fehlen erstmal ohne jegliche Verhandlung (und scheinbar noch bevor irgendwelche Beweise aufgezeigt wurden) Gegenst&auml;nde, f&uuml;r deren Entfernung es keinen Grund gab.</p>
<p>Ich will hier nicht f&uuml;r Kindersch&auml;nder Argumentieren oder behaupten dass der Beschuldigte unschuldig sei. Ersteres liegt mir so fern wie kaum etwas anderes und letzteres kann und will ich nicht entscheiden.</p>
<p>Ich sage nur dass wir in Deutschland noch immer ZUERST die Schuld BEWEISEN, danach ein Gericht ein Strafma&szlig; festlegen lassen und die Strafe als letzter Punkt folgt.</p>
<p>So wie ich die Situation jedoch sehe, scheint sich heutzutage kaum noch wer an diese Grundordnung zu halten. Das mag noch verst&auml;ndlich klingen wenn neben dir jemand steht der laut ruft "Denkt denn niemand an die Kinder?", aber was ist wenn jemand DEINE Wohnung ohne Beweise durchsucht? Es muss ja nicht wegen Kindesmisshandlung sein, nehmen wir f&uuml;r den Anfang Drogenhandel oder Diebstahl. Wenn die Beispiele noch f&uuml;r Beifall sorgen k&ouml;nnen wir das System auch bei semi-legalen Privatkopien einf&uuml;hren (ok, k&ouml;nnen wir nicht, haben wir schon) oder wie w&auml;re es wenn deine Wohnung durchsucht wird weil du bei Rot &uuml;ber die Ampel gegangen sein K&Ouml;NNTEST.</p>
<p>Wo willst du die Grenze ziehen?</p>
<p>Aus genau diesem Grund haben wir eine klare Grenze.</p>

<p class="infos">
<a href="#comment_1181" onclick="set_comment_reference(1181)" title="auf diesen Kommentar antworten">#1181</a>:
    06.Mar.2009 06:03
    von
    
      
        Commentor
      
    
    
  </p>
<p>Hi, von Bildschirm stand da nichts. In anderen Blogs steht was von "Datenerfassungsger&auml;ten" oder sowas. Vielleicht sind damit externe festplatten gemeint und nur umst&auml;ndlich beschrieben. Nachpr&uuml;fen kannst du das doch: Anfrage an die Staatsanwaltschaft Karlsruhe (werden aber die ganzen Pressefuzzis sowieso machen falls die jetzt nicht mit dem Tauss zu besch&auml;ftigt sind.</p>
<p>&uuml;brigens f&uuml;r eine Hausdurchsuchung braucht man keine Beweise, wo kommen immer nur solche M&auml;rchen her? Man braucht einen Anfangsverdacht und die Vermutung, dass die HD zum auffinden von Beweismitteln f&uuml;hren wird, mehr nicht. Wenn man die Beweise n&auml;mlich schon h&auml;tte, br&auml;uchte man keine HD mehr. Das ist rechtsstaatlich v&ouml;llig in Ordnung und grundrechtlich abgesichert. Wer einen Blog verlinkt, dessen Inhalt und Betreiber man kennt und teilt und sich "zu Eigen macht", der braucht sich doch nicht ernsthaft &uuml;ber eine HD wundern, wenn in diesem Blog zu Straftaten aufgerufen wird? Das w&auml;re ja eine sch&ouml;ne verdrehte Welt. Nur die Begr&uuml;ndung im Durchsuchungsbeschluss (sofern der ver&ouml;ffentlichte, geschw&auml;rzte, auf einer ansonsten weissen Seite ohne Briefkopf und Siegel  ver&ouml;ffentlichte text denn authentisch ist) scheint mir ungl&uuml;cklich formuliert.</p>

<p class="infos">
<a href="#comment_1182" onclick="set_comment_reference(1182)" title="auf diesen Kommentar antworten">#1182</a>:
    06.Mar.2009 08:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ich habe mich nach folgendem Absatz gerichtet:</p>
<p>unter anderem "Computeranlage mit Peripherieger&auml;t zur Sichtbarmachung digitaler Speicher" und "Datentr&auml;ger" geh&ouml;ren, wurde dann unter anderem tats&auml;chlich ein kompletter PC (inklusive Monitor!) beschlagnahmt.</p>
<p>In der Tat habe ich bereits mehrmals davon geh&ouml;rt dass komplette Computereinrichtungen konfisziert wurden statt nur die Festplatten zu entfernen... Den typischen Fall eines Tor-Node-Betreibers, dessen gesammte PC-zugeh&ouml;rige Hardware beschlagnahmt wurde weil &uuml;ber seine IP irgendwelche illegalen Inhalte abegrufen worden w&auml;ren, hat wohl jeder schonmal geh&ouml;rt.<br/>
Es gibt sicher vieles was zur Beweissicherung n&ouml;tig ist, aber so weit kann man seine Mitarbeiter doch wohl schulen oder? (mal davon abgesehen dass ein paar Festplatten ja auch besser zu transportieren w&auml;ren).</p>
<p>Wenn ein Polizist gesagt bekommt er solle "Peripherieger&auml;te" auch "sicherstellen", dann nimmt der Peripherieger&auml;te mit... ALLE.</p>
<p>Und weil ich mich kritisch &uuml;ber Internetfilter &auml;u&szlig;er ist ein Anfangsverdacht gegeben dass ich etwas tu, dass diese Filter filtern sollen? HALLO?</p>
<p>Aber wir sollten uns wohl wirklich thematisch etwas von diesen Blogs entfernen, ich habe mir mal ein paar zuf&auml;llig ausgew&auml;hlte Inhalte angesehen was die vor ein paar Monaten so geschrieben haben und das ist wirklich mehr als bedenklich.</p>
<p>Das hat nat&uuml;rlich auch den "Vorteil" dass man erheblich mehr finden kann was einen Anfangsverdacht unterst&uuml;tzen w&uuml;rde. Ich sehe zwar auf Anhieb nichts wonach ich es mit meinem Gewissen vereinbahren k&ouml;nnte zu entscheiden dass es sich hier um jemand handelt der Straftaten begeht aber vlt. lagen der Polizei da ja mehr Daten vor.</p>
</div>