+++
title = "Der Klassenfeind"
date = "2015-06-09T11:06:00"
author = "Dr. Azrael Tod"
tags = ["DDR", "Maueralt", "Pseudoargumente", "Rant", "SPON", "Werbung"]
issoid = "blog/1620"
aliases = "blog/1620"
+++

<p>Man sollte ja meinen mit dem Mauerfall w&auml;re die Hetze gegen den Klassenfeind (oder wie auch immer die westdeutsche Entsprechung des Begriffes lauten w&uuml;rde, Kommunistenschweine?) beendet.<br/>Ostdeutschland wurde eingegliedert, wir sitzen jetzt wieder alle im gleichen Boot und man kann die Vergangenheit offen und ehrlich betrachten ohne zu st&auml;ndiger Propaganda &uuml;ber "das unterlegene System" abzuschweifen.</p>
<p>..und dann mach ich wieder den alten Fehler und lese Artikel bei SPON oder &auml;hnlichen Drecksbl&auml;ttern. <br/>Heute <a href="http://www.spiegel.de/einestages/werbung-in-der-ddr-trabant-pohli-und-goldbroiler-a-1036757.html" target="_blank" title="VORSICHT SPON! - Einestages: Werbung in der DDR">ein Artikel zu der wenigen, aber doch vorhandenen Werbung in der DDR</a>, also einem der imho recht wenigen, deutlichen Vorteile einer Planwirtschaft.</p>
<p>Schon im ersten Absatz geht es los<br/></p><blockquote>Wie heikel der Umgang mit den Verbrauchergef&uuml;hlen eines DDR-B&uuml;rgers sein konnte, zeigt die Sache mit der fleckgesch&uuml;tzten Tischdecke. Ein Hersteller machte f&uuml;r seine ausgefeilte Tischw&auml;sche TV-Reklame, und prompt h&auml;tten "sich B&uuml;rgerinnen beschwert, weil die Decke in bestimmten Landwarenh&auml;usern nicht da war", konstatierte in den Siebzigerjahren ein Verantwortlicher beim Ministerium f&uuml;r Handel und Versorgung.</blockquote>
<p>OMG! Zum Gl&uuml;ck ist sowas in westlichen Marktwirtschaften undenkbar. Man stelle sich nur mal vor was passieren w&uuml;rde wenn Leute Werbung von Aldi oder Lidl sehen w&uuml;rden und die darin angepriesenen Artikel bereits wenige Stunden nach Er&ouml;ffnung komplett ausverkauft w&auml;ren!<br/>Warte, das <a href="http://de.wikipedia.org/wiki/Lidl#Lockvogelangebote" target="_blank" title="Wikipedia: Lidl/Lockvogelangebote">erinnert mich an irgendwas</a>...<br/></p><blockquote>2005 wurde der Discounter nach einer Klage der Zentrale zur Bek&auml;mpfung unlauteren Wettbewerbs vom Oberlandesgericht Stuttgart wegen Lockvogelangeboten im Non-Food-Bereich verurteilt (Urteil vom 30. Juni 2005, Az. 2 U 7/05), da beworbene Produkte bereits nach einer Stunde ausverkauft waren, wohingegen f&uuml;r massiv beworbene Produkte ein Vorrat f&uuml;r mindestens zwei Tage vorzuhalten sei. 2011 gab es in einer gleich gelagerten Sache ein weiteres Urteil des Bundesgerichtshofes aufgrund einer Klage der Verbraucherzentrale Nordrhein-Westfalen</blockquote>
<p>Aber weiter:<br/></p><blockquote>Weil Konkurrenz unter den Herstellern fehlte, war Reklame in der DDR eher eine Variante der Propaganda.</blockquote><br/>Ich wei&szlig; nicht ob ich den Versuch &uuml;berm&auml;&szlig;ig vorhandenen Artikel_A statt knappen Artikel_B schmackhaft zu machen, als "Propaganda" bezeichnen w&uuml;rde (wenn ja, dann haben wir hier auch ziemlich viel davon), aber ja: Propaganda und Werbung waren und sind damals wie heute verwandte Gebiete.

<p></p><blockquote>Als das Land mal auf einem Haufen Zucker sa&szlig;, bediente sich die staatliche &Ouml;ffentlichkeitsbearbeitung des Slogans: "Zucker sparen? Grundverkehrt! Der K&ouml;rper braucht ihn. Zucker n&auml;hrt!" Die Volksgesundheit musste der Planwirtschaft weichen.</blockquote><br/>Meine G&uuml;te! Wie abgrundtief b&ouml;se, Werbung f&uuml;r heute als ungesund angesehene Dinge zu machen! Die Zust&auml;ndigen m&uuml;ssen wirklich der Inbegriff der B&ouml;sartigkeit gewesen sein.<br/>Schlimmer noch: Sie taten dies nicht wie Haribo, Sch&ouml;ller oder gar die westliche Zuckerindustrie, aus rein monet&auml;ren, sondern aus verabscheuungsw&uuml;rdigen Gr&uuml;nden wie z.B. um Versorgungsengp&auml;sse f&uuml;r den Lebensmittelnachschub auszugleichen.<br/><iframe allowfullscreen="" frameborder="0" height="315" src="https://www.youtube.com/embed/Crriq5jDDJA" style="display: block;  margin: auto;" width="420"></iframe><br/>Oh, ich sehe gerade. Das war dann doch eine westdeutsche Werbung die im Umfeld von <a href="http://de.wikipedia.org/wiki/Wolf_Uecker" target="_blank" title="Wikipedia: Wolf Uecker">Wolf Uecker</a> gegen 1964 f&uuml;r Verb&auml;nde der Zuckerhersteller entstanden ist. Dann auch noch fast zur gleichen Zeit wie die verabscheuungsw&uuml;rdige Zucker-Werbung bei den Kommunisten. Da war die Agentur im Westen sicher unterwandert!

<p></p><blockquote>Es gab auch eine Kampagne f&uuml;r das VEB-Minol-"Schnelltanken". Ein ausgefeiltes System? Nein, beim "Schnelltanken" wurde schlicht nur f&uuml;r runde Summen betankt, die Wartezeit auf die R&uuml;ckgabe von Wechselgeld entfiel. Grund genug f&uuml;r die DDR-Werber, eine Kampagne daraus zu stricken.</blockquote><br/>Werben f&uuml;r v&ouml;llig unwichtige Details? Sie als Weltrevolution darstellen? Wenn das mal Apple h&ouml;rt... die haben da bestimmt ein Patent drauf.

<p></p><blockquote>W&auml;hrend die westdeutschen Kollegen sich einiges einfallen lassen mussten, um im anschwellenden Chor der Verkaufsges&auml;nge noch geh&ouml;rt zu werden, dominierte im Osten die sorgf&auml;ltig inszenierte Langeweile. Neben gedruckter Reklame liefen auch Bildschirmbotschaften. Zu Beginn gab es nur eine Sendung pro Woche, sp&auml;ter t&auml;glich au&szlig;er sonntags, dann eine Weile zweimal die Woche</blockquote><br/>Um Eris' Willen! Wenig Werbung?<br/>Ja, diese Horrorgeschichte kann man nat&uuml;rlich nur mit "inszenierter Langeweile" beschreiben. Man stelle sich nur mal vor: Filme und Serien NICHT durch Werbung unterbrochen, ganze Stra&szlig;enz&uuml;ge ohne Plakatwand, Radio &uuml;ber Stunden ohne Hinweis auf <a href="https://www.youtube.com/watch?v=JYVF9ZTaNnU" target="_blank">Seitenbacher-M&uuml;sli</a>!<br/>Folter! Horror! Terror!

<p></p><blockquote>Egal, ob Reklame im Sportstadion oder bei der Reichsbahn, ebenso Fahnenstickereien, ein eigener "Verlag f&uuml;r Agitations- und Anschauungsmittel" (auch vierfarbige Honecker-Portr&auml;ts geh&ouml;rten zum Sortiment) oder Plakatdruckereien &ndash; alles war in der Hand der Dewag.

<p>Ihr langj&auml;hriger Chef, Ulrich Osche, war nicht etwa Werber, sondern machte in jungen Jahren Reklame f&uuml;r die Weltrevolution.</p></blockquote><br/>Heute haben wir wenigstens gut sortierte Oligopole auf dem Werbemarkt, wie es sich f&uuml;r Marktwirtschaft geh&ouml;rt. Es w&auml;re auch pervers wenn sich das grundlegende Konzept eines Wirtschaftssystems bis auf den Werbemarkt erstreckt.

<p>Ich hab' nicht mal den Hauch einer Ahnung warum man dann noch auf Verflechtungen zwischen Werbe-Staatsunternehmen und Staat hinweisen muss, aber wir k&ouml;nnen bestimmt froh sein dass es im Westen nie Interessenskonflikte gibt.</p>
<p></p><blockquote>Die Kom&ouml;die mit Armin Mueller-Stahl nahm die DDR-Reklamemacher aufs Korn &ndash; ein Grenzgang in der sozialistischen Republik. Im Mittelpunkt stand ein v&ouml;llig untalentierter Werbezeichner, der jede Fortbildung besuchte, aber kaum mehr konnte, als herumzuschwafeln, etwa von "der Rolle der Bedeutung" &ndash; und er stieg auf zum obersten Werber der Republik. Ein westdeutscher Filmdienst nannte das Defa-Werk eine "satirische Kom&ouml;die &uuml;ber kaderpolitische Fehlentwicklungen in der DDR". Die Zensoren lie&szlig;en den Film auf die Leinw&auml;nde und beanstandeten noch nicht mal Spottverse wie diesen hier: "Werbung f&uuml;r den Wartburg ist der reinste Hohn. Willst du einen kaufen, kriegt ihn erst dein Sohn."</blockquote><br/>Ironie und Selbstkritik, bzw. Kritik am eigenen System? Mir gehen die Superlative f&uuml;r solche Perversionen aus.

<p></p><blockquote>Dass die untergegangene sozialistische Gesellschaft nach 1990 den wissenschaftlichen Beweis f&uuml;r die Wirksamkeit von Werbung liefern sollte, erscheint wie ein historischer Witz. Ein Forscherteam der University of California machte sich den Umstand zunutze, dass ein Teil der Ostb&uuml;rger westliches Fernsehen sehen konnte und ein anderer Teil nicht.

<p>&Uuml;ber die Menschen, die schon zu Ostzeiten mit Westwerbung lebten, fanden die Wissenschaftler heraus: Sie griffen nach der Wiedervereinigung h&auml;ufiger zu den angepriesenen Produkten.</p></blockquote><br/>Schon wieder diese Propaganda, von der oben die Rede war.. oh, westliche? Na, die ist ok.

<p></p><h3>Nachtrag #1</h3><br/>Ich zitiere mal einen Kommentar der unter dem Artikel hing:<br/><blockquote>der Satz "Anders als im Westen hatte Werbung in der DDR auch eine p&auml;dagogische Funktion" hat mich doch irritiert. Ich erinnere mich noch ganz genau an eine Anzeige der Bundesregierung unter Helmut Schmidt aus den siebziger Jahren. Zu sehen war erstmal eine ausgedr&uuml;ckte Tube, deren ehemaliger Inhalt die form der BRD angenommen hatte. &Uuml;berschrift: "Konjunktuir(sic!) ist, wenn ALLE auf die Tube dr&uuml;cken". Unten dann ein erl&auml;uternder Text, dass die Menschen nicht auf ihrem Geld sitzen sollen, sondern sch&ouml;n konsumieren, damit die Konjunktur nach dem &Ouml;lschock wieder in Gang kommt. F&uuml;r B&uuml;rger mit mangelnder Phantasie war dann noch eine "Ich kauf mir was zum..."-Liste mit g&auml;ngigen Konsumartikeln (Haushalt, Klamotten, Autos etc.) angeh&auml;ngt.</blockquote>
