+++
title = "Welcome to Popup-Hell"
date = "2008-12-02T10:12:00"
author = "profmakx"
issoid = "blog/1093"
aliases = "blog/1093"
+++

<p>Habt ihr in letzter Zeit mal einen Windows Rechner gebootet? Ja? Dann kennt ihr das sicher: t&auml;glich (!!) springen einen Virenscanner, Windows, Adobe, Quicktime, Firefox, Java, &lt;insert stupid program here&gt; mit "updatepopoups" an. Und dann auch noch reboot, wenn man pech hat geht es wieder los.</p>
<p>Das nervt so dermassen, bis man erstmal diese ganze Schei&szlig;e weggeklickt hat!</p>
<p>Und jetzt greift das auch noch auf Linux und Firefox &uuml;ber! Updatemanager, Firefox mit den schei&szlig; Plugins etc pp.</p>
<p>Muss das eigentlich sein? Wahrscheinlich ist das einfach nur wegen dem Feel-Good-Faktor f&uuml;r den Durchschnittsl0ser. Ich bin echt genervt! Macht doch wenigstens irgendein Framework draus, dass das ein f&uuml;r alle mal einmal in der Woche macht (nicht dass es dann nicht trotzdem ca 15 Hersteller geben wird, die es trotzdem anders machen wollen)</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_933" onclick="set_comment_reference(933)" title="auf diesen Kommentar antworten">#933</a>:
    03.Dec.2008 09:12
    von
    
      
        <a href="http://friedenspanzer.blog.de/" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Hmm, ein allgemeines Update-Tool unter Linux... Moment, gleich hab ich es... hmm... nein, f&auml;llt mir nicht ein... obwohl... doch... warte... Paketmanager ;)</p>
<p>Aber ist richtig, unter Windows kann das ab und an nerven. Vor allem die Schei&szlig;e, die sie bei Vista draus gemacht haben: "Hallo, ihr Computer wird in 5 Minuten neugestartet und falls sie gerade nicht am Rechner sind, weil sie vielleicht &uuml;ber Nacht etwas herunterladen, k&ouml;nnen sie nichts dagegen tun und werden morgen mit dem Anmeldebildschrim begr&uuml;&szlig;t!"</p>
<p>Unter FF kann man das &uuml;brigens ganz bequem abschalten: Extras/Bearbeiten, Einstellungen, Update.</p>
<p>(Wer wegen dem ersten Satz wieder n&ouml;rgen will sollte wissen dass ich mich besser damit auskenne, als ich hier die meiste Zeit schreibe)</p>

<p class="infos">
<a href="#comment_934" onclick="set_comment_reference(934)" title="auf diesen Kommentar antworten">#934</a>:
    03.Dec.2008 09:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>leider ist das ein generelles Problem unter Windows das aufgrund der mangelnden Struktur hinter dem System an sich zustande kommt.<br/>
Microsoft hatte ja sogar versucht mit msi sowas &auml;hnliches wie eine Paketverwaltung nachzubauen, doch wie immer nur so grob und scheinbar mit dem Hintergedanken "das Verbessern wir!".</p>
<p>Nein MS, ihr verbessert nichts, ihr baut es j&auml;mmerlich schlecht nach. Egal ob es sich um die Unix-Zugriffsrechte, die Nutzerverzeichnisse, die Paketverwaltung oder gar die Systemweit vereinheitlichte Sammlung von Config-Daten handelt.</p>
<p>Also irgendwie k&ouml;nnte man fast an ein System hinter diesen Fehlschl&auml;gen glauben... (W&uuml;rde ich nicht MS jegliche Systematik absprechen wollen)</p>
<p>BTW: bestimmte Anbieter versuchen ja wenigstens f&uuml;r ihre eigenen Produkte eine generelle Art der Paketverwaltung nachzubauen. Sei es jetzt Google mit ihrem Updater (sneaky but it works) oder die PortableAppsSuite mit dem dazugeh&ouml;rigen Verwaltungssystem f&uuml;r installierte Programme im Unterverzeichnis.</p>
<p>Vlt. bekommen wir ja aus so einer Richtung doch noch irgendwann was brauchbares nachgeliefert.</p>

<p class="infos">
<a href="#comment_935" onclick="set_comment_reference(935)" title="auf diesen Kommentar antworten">#935</a>:
    03.Dec.2008 05:12
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>solange jedes Programm at launch den Check startet ist und bleibt Updaterei unter windows ein reiner Hass. Warum dann noch jedes vierte Programm denkt ein Neustart sei relevant und diesen vorschl&auml;gt habe ich noch nie verstanden.</p>
<p>Im Kern hast du schon recht - ein mini-teil-erfolg w&auml;re ein zentrales Was-auch-immer welches den Check f&uuml;r alle Drittanbieter Programm startet...um immerhin einen im Ansatz zentraleren Ansatz zu haben.</p>
<p>Bezweifel ich aber stark :/</p>

<p class="infos">
<a href="#comment_936" onclick="set_comment_reference(936)" title="auf diesen Kommentar antworten">#936</a>:
    03.Dec.2008 06:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Die einfachere L&ouml;sung w&auml;re nat&uuml;rlich auf irgendeine Linux-Distri umzusteigen bei der ein vern&uuml;nftiges Paketsystem dabei ist (und schon f&auml;llt RedHat raus).<br/>
Leider wird das in letzter Zeit auch immer mehr verw&auml;ssert, ich will garnicht wissen wer auf die bescheuerte Idee gekommen ist dass jede Scriptsprache da was eigenes braucht (Pear, Gems, ..).<br/>
Selbst Firefox ist da schon ziemlich grenzwertig wenn er jedes Plugin selbst verwalten will.</p>

<p class="infos">
<a href="#comment_937" onclick="set_comment_reference(937)" title="auf diesen Kommentar antworten">#937</a>:
    04.Dec.2008 07:12
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>Nur dass der Gro&szlig;teil der User diesen Umsteig nicht mitmachen wird und ggf eher veraltete Software-St&auml;nde akzeptiert da die Popups als nervend empfunden werden. Klingt dumm aber ich wette das passiert regelm&auml;&szlig;ig.</p>

<p class="infos">
<a href="#comment_938" onclick="set_comment_reference(938)" title="auf diesen Kommentar antworten">#938</a>:
    05.Dec.2008 03:12
    von
    
      
        <a href="http://macfidelity.de/2008/12/05/apps-bundling-oder-java-und-die-yahoo-toolbar/" target="_blank">
          Apps | Bundling oder Java und die Yahoo Toolbar | macfidelity
        </a>
</p>
<p>[...] wer sich weiter zu diesem Thema auskotzen will findet bei Dr. Azrael einen guten Beitrag zu diesem Thema ich will eigentlich auf einen anderen Teilaspekt [...]</p>

<p class="infos">
<a href="#comment_939" onclick="set_comment_reference(939)" title="auf diesen Kommentar antworten">#939</a>:
    11.Dec.2008 11:12
    von
    
      
        <a href="http://friedenspanzer.blog.de/" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Naja, PEAR und Gems w&uuml;rde ich auf gar keinen Fall im Paketmanager haben wollen, weil das nichts mit dem Betriebssystem zu tun hat (Wenn jemand ein Betriebssystem kennt das ohne PHP etwas mit PEAR anfangen kann soll er mir bitte widersprechen!). Bei den Firefox-Plugins seh ich es &auml;hnlich.</p>
<p>Ich bin da mehr so der Fan von Kaskaden: Paketmanager aktualisiert Firefox, Firefox aktualisiert seine Plugins. Paketmanager aktualisiert HTTP-Server, Server aktualisert PHP-Modul, PHP-Modul aktualisiert PEAR. Nur dann muss auch jedes Programm selbst das Ganze ordentlich umsetzen.</p>

<p class="infos">
<a href="#comment_940" onclick="set_comment_reference(940)" title="auf diesen Kommentar antworten">#940</a>:
    17.Dec.2008 01:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Dann kommst du aber wieder bei einem Status raus, wo jeder Nutzer f&uuml;r sich pers&ouml;nlich entscheidet ob er jetzt gerne die aktuellen Versionen seiner Firefox-Plugins installiert h&auml;tte.</p>
<p>Das mag f&uuml;r dieses Beispiel noch nicht schlimm sein, aber wenn ich dann erstmal pear und gems via apt updaten muss, gems danach per hand, dann pear, ... sieht mir das umst&auml;ndlicher aus als einfach apt-get dist-upgrade.</p>
<p>Es gibt sicher eine M&ouml;glichkeit das zu umgehen.. z.B. wenn jedes Tool das sinnvoll macht und beim Update seiner Verwaltung auch gleich ein Update aller darunter h&auml;ngenden Systeme durchf&uuml;hrt, aber das f&uuml;hrt wieder zu frickelshice al&aacute; "theoretisch ist es ein klasse system, es macht nur keiner das was er sollte.".</p>
<p>Ich w&uuml;rde mich nie auf die breite Masse der Entwickler verlassen wenn es eine einfache und offensichtliche L&ouml;sung gibt bei der niemand mehr etwas falsch machen kann.</p>
</div>