+++
title = "Arbeitszeitreduktion"
date = "2013-11-18T12:11:00"
author = "Dr. Azrael Tod"
tags = ["Politik"]
issoid = "blog/1580"
aliases = "blog/1580"
+++

<p>Wir haben offensichtlich viele Probleme in unserer Gesellschaft. Die meisten laufen allerdings auf reine Verteilungsprobleme hinaus. Arbeitskr&auml;fte sind offensichtlich im &Uuml;berschuss vorhanden (sonst w&uuml;rden die L&ouml;hne wenigstens genug steigen um mit der Inflation Schritt zu halten) und der haupts&auml;chliche Sinn der Industrialisierung war immerhin auch mal mehr G&uuml;ter mit weniger Arbeitsaufwand herzustellen.</p>
<p>Die bisherige L&ouml;sung des daraus entstehenden Produktivit&auml;ts&uuml;berschusses war bisher immer "Mehr Konsum!" und damit zusammen h&auml;ngend mehr Investition in Marketing/Werbung und andere, &auml;hnlich unsinnige Arbeitszeitverbrennungsmittel.</p>
<p>Wir wissen schon lange dass diese Arbeitskr&auml;fte nie wieder (globale Kriege, Katastrophen oder &auml;hnlich unvorhersehbares nicht eingerechnet) wirklich sinnvoll besch&auml;fftigt werden k&ouml;nnen. Im Gegenteil! Wir werden dank fortschreitender Technoloie in Zukunft noch viel weniger Personal zur Herstellung der n&ouml;tigen G&uuml;ter brauchen.</p>
<p>Oder <a href="https://www.youtube.com/watch?v=m2oW4Y3QBnQ&amp;feature=youtu.be&amp;t=4m40s">um es mit Volker Pispers (aus seinem St&uuml;ck "Jagodas Idee") zu sagen</a>:<br/></p><blockquote>Nein, die Leute werden dann dauerhaft arbeitslos sein, das kann ich ihnen schriftlich geben. <br/>Ne, die wissen das noch nicht, aber wir. <br/>Die werden in der Produktion nie wieder ben&ouml;tigt, Herr Thoma. Die braucht Deutschland nur noch beim Konsum.<br/></blockquote><br/>Das St&uuml;ck von 1994 (also vor fast 20 Jahren) ist &uuml;brigens damals wie heute komplett zutreffend und ich kann nur jedem (mindestens dem der es noch immer nicht gesehen hat) w&auml;rmstens ans Herz legen sich die ca. 8min Zeit zu nehmen und das anzusehen.<br/><p style="text-align: center;"><iframe allowfullscreen="" frameborder="0" height="315" src="//www.youtube.com/embed/m2oW4Y3QBnQ" width="560"></iframe></p>
<p>In einer Marktwirtschaft ergibt sich damit ein enormes Verteilungsproblem. Wenn G&uuml;ter danach an das Volk verteilt werden wie diese Arbeitszeit aufwenden (was mit dem Umweg "Geld" ja urspr&uuml;nglich mal vor hatten.) aber der Bedarf f&uuml;r Arbeitszeit sinkt, m&uuml;ssen wir die Arbeitszeit pro Person senken um eine gleichm&auml;&szlig;igere Verteilung zu erreichen.<br/>Jetzt kann nicht jeder einfach ab sofort auf einer halben Stelle arbeiten. Wir wissen l&auml;ngst dass es viele Jobs gibt bei denen das nicht m&ouml;glich ist und die bei denen das m&ouml;glich ist tendieren aufgrund der hohen Austauschbarkeit des Personals dazu verdammt mies bezahlt zu werden.<br/>Wir k&ouml;nnten auch das <a href="http://de.wikipedia.org/wiki/Renteneintrittsalter">Renteneintrittsalter</a> senken. Da wir jedoch da einfach nur das Verteilungsproblem von Arbeitslosen auf Rentner verschieben ist da nat&uuml;rlich auch keinem geholfen. Bereis jetzt zeigt sich dass wir hier in Zukunft ein ernstes Finanzierungsproblem bekommen werden (was durch privatisierung durch Neocon-Ideologie und Koppelung der Renten an vorherige Einkommensunterschiede noch verschlimmert wird).</p>
<p>Ich h&auml;tte da ein paar alternative Vorschl&auml;ge&hellip;</p>
<p></p><h3>Idee 1: Pausenzeiten</h3><br/>Gesetzlich vorgeschriebene Pausenzeiten sollten als geleistete Arbeitszeit z&auml;hlen.<br/>Bei einer typischen 40h-Woche mit 5x8h Arbeit, w&auml;ren das momentan nur 2,5h eingesparte Arbeitszeit.

<p>Der gro&szlig;e Vorteil liegt aber darin dass wir hier t&auml;gliche Zeiten verplanen die die Arbeitnehmer eh Unterwegs verbringen. &Auml;hnlich der Halbtagsarbeit wird also der Arbeitstag an sich verk&uuml;rzt, jedoch &uuml;ber alle Berufsgruppen hinweg gleichm&auml;&szlig;ig.<br/>Weiterhin f&auml;llt auch beim Arbeitnehmer die Motivation, die vorgeschriebenen Pausenzeiten zu ignorieren, weg. Das h&auml;tte auch Arbeitsschutztechnisch Vorteile.<br/>Und es wird noch besser: Arbeitspl&auml;tze mit mehr als 9h Arbeitszeit am St&uuml;ck werden st&auml;rker entlastet. Im Gegensatz zu Halbtagsarbeit betrifft das also die st&auml;rker beanspruchten Stellen mehr statt weniger.</p>
<p></p><h3>Idee 2: mehr Feiertage</h3>
<p>Momentan haben wir <a href="http://de.wikipedia.org/wiki/Feiertage_in_Deutschland#.C3.9Cbersicht_aller_Feiertage">&uuml;berall in Deutschland unterschiedliche Anzahlen an Feiertagen</a>. Der Bereich erstreckt sich von 9 Feiertagen/Jahr (Berlin, Bremen, Hamburg, Niedersachsen, Schleswig-Hollstein) bis hin zu ganzen 13 Feiertagen/Jahr (Bayern, in einigen Unterregionen kann das dort auch mal ein Tag mehr sein).</p>
<p>Dabei gibt es so stilbl&uuml;ten wie den <a href="http://de.wikipedia.org/wiki/Bu%C3%9F-_und_Bettag">Bu&szlig;- und Bettag</a>:<br/></p><blockquote>Im Jahr 1994 wurde beschlossen, den Bu&szlig;- und Bettag als arbeitsfreien Tag mit Wirkung ab 1995 zu streichen, um die Mehrbelastung f&uuml;r die <a href="http://de.wikipedia.org/wiki/Arbeitgeber">Arbeitgeber</a> durch die Beitr&auml;ge zur neu eingef&uuml;hrten <a href="http://de.wikipedia.org/wiki/Pflegeversicherung_(Deutschland)">Pflegeversicherung</a> durch <a href="http://de.wikipedia.org/wiki/Mehrarbeit">Mehrarbeit</a> der <a href="http://de.wikipedia.org/wiki/Arbeitnehmer">Arbeitnehmer</a> auszugleichen.

<p>Lediglich im <a href="http://de.wikipedia.org/wiki/Sachsen">Freistaat Sachsen</a> besteht er bis heute als <a href="http://de.wikipedia.org/wiki/Feiertage_in_Deutschland">gesetzlicher Feiertag</a> weiter, daf&uuml;r bezahlen in Sachsen abh&auml;ngig Besch&auml;ftigte (nicht jedoch deren Arbeitgeber) einen h&ouml;heren Beitrag zur Pflegeversicherung als im restlichen Bundesgebiet. Dieser zus&auml;tzliche Beitrag in H&ouml;he von 0,5 % des Bruttoarbeitsentgelts &uuml;bersteigt jedoch die Kosten eines Arbeitstages. Daher ist diese Regelung ein Nachteil f&uuml;r die s&auml;chsischen Arbeitnehmer. Das Bundesverfassungsgericht hielt dies im Gesamtkontext der Einf&uuml;hrung der Pflegeversicherung f&uuml;r zumutbar.<a href="http://de.wikipedia.org/wiki/Bu%C3%9F-_und_Bettag#cite_note-1"><sup>[1]</sup></a> Durch die Feiertagsgesetze ist es in den meisten anderen Bundesl&auml;ndern jedem Arbeitnehmer m&ouml;glich, sich unter Hinweis auf religi&ouml;se Pflichten an diesem Tag freizunehmen. Es muss kein Urlaubstag genommen werden, allerdings auf Lohn verzichtet. In Bayern ist am Bu&szlig;- und Bettag an allen Schulen unterrichtsfrei.<sup><a href="http://de.wikipedia.org/wiki/Bu%C3%9F-_und_Bettag#cite_note-2">[2]</a><a href="http://de.wikipedia.org/wiki/Bu%C3%9F-_und_Bettag#cite_note-3">[3]</a></sup> Au&szlig;erdem haben in diesem Bundesland die meisten Kinderg&auml;rten geschlossen, wodurch viele Arbeitnehmer mit Kindern an diesem Tag Urlaub nehmen m&uuml;ssen, der &ouml;ffentliche Nahverkehr folgt dem Ferienfahrplan. In Berlin besteht f&uuml;r evangelische Sch&uuml;ler keine Verpflichtung zum Schulbesuch.<a href="http://de.wikipedia.org/wiki/Bu%C3%9F-_und_Bettag#cite_note-4"><sup>[4]</sup></a></p>
<p>Kritiker der Abschaffung f&uuml;hren insbesondere an, dass der damals gew&uuml;nschte Effekt &ndash; die sichere Finanzierung der Pflegeversicherung &ndash;, anders als die Abschaffung des Feiertags, nicht von dauerhafter Wirkung war und bereits Beitragserh&ouml;hungen vorgenommen werden mussten.<a href="http://de.wikipedia.org/wiki/Bu%C3%9F-_und_Bettag#cite_note-5"><sup>[5]</sup></a> Eine Wiedereinf&uuml;hrung wurde in den ersten Jahren nach der Abschaffung von verschiedenen Initiativen, beispielsweise einem erfolglosen Volksentscheid in <a href="http://de.wikipedia.org/wiki/Schleswig-Holstein">Schleswig-Holstein</a><a href="http://de.wikipedia.org/wiki/Bu%C3%9F-_und_Bettag#cite_note-6"><sup>[6]</sup></a> und einem Gesuch des damaligen Bayerischen Ministerpr&auml;sidenten <a href="http://de.wikipedia.org/wiki/Edmund_Stoiber">Edmund Stoiber</a><a href="http://de.wikipedia.org/wiki/Bu%C3%9F-_und_Bettag#cite_note-7"><sup>[7]</sup></a>, gefordert, sp&auml;ter wurde das Thema nicht mehr diskutiert.</p></blockquote>
<p>Wenn wir also neue Feiertage schaffen (oder idealenfalls das ganze System der Feiertage &uuml;berarbeiten) bekommen wir gleichm&auml;&szlig;ig &uuml;ber die meisten Berufe hinweg eine sehr fein einstufbare Entlastung.<br/>Leider gibt es etliche Branchen die das nicht oder nur teilweise betrifft (z.B. Gesundheitswesen, Notfalldienste, Fabriken bei denen stillstehende Maschinen teuerer als Feiertagszuschlag sind, &hellip;) und leider legen wir in dieser Zeit einen Gro&szlig;teil unserer Wirtschaft komplett lahm.<br/>Eine bessere Verteilung w&auml;re also eigentlich schon w&uuml;nschenswert.</p>
<p></p><h3>Idee 3: mehr Mindest-Urlaub</h3>
<p>Flexibler wird es nicht!<br/>Urlaub muss man vorher eh mit dem Arbeitgeber absprechen, es fehlt also nie schlagartig die halbe Firma im wichtigsten Zeitraum. (ja, ok&hellip; vlt. durch unf&auml;higkeit desjenigen der das verwaltet).</p>
<p>Wir setzen einfach die vorgeschriebenen Urlaubstage pro Jahr von 24/20 auf 48/40 hoch und schlagartig, &uuml;ber alle Bev&ouml;lkerungsschichten hinweg, wird jeder um ~8% weniger produktiv.<br/>Wir k&ouml;nnen das auch als langsame Steigerung &uuml;ber 10 Jahre jeweils 1-2 Tage hochschrauben oder wir bauen L&ouml;sungen al&aacute; "mit neu abgeschlossenem Arbeitsvertrag".<br/>Wie wir das tun ist im Endeffekt fast egal.</p>
<p></p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1667" onclick="set_comment_reference(1667)" title="auf diesen Kommentar antworten">#1667</a>:
    19.Nov.2013 03:11
    von
    
      
        Jemand
      
    
    
  </p>
<ol>
<li>
<p>Es gab mal Zeiten, in denen war der Samstag arbeitsm&auml;&szlig;ig das, was heute der Freitag ist.<br/>
Konsequent weitergedacht: Warum nicht auf eine 4-Tage-Arbeitswoche heruntergehen?</p>
</li>
<li>
<p>Die sieben Wochentage ganz anders strukturiert nutzen, als bisher.<br/>
"5 Tage arbeiten, 2 Tage frei" war und ist f&uuml;r viele Berufe nicht allgemeing&uuml;ltig.<br/>
Warum &uuml;berhaupt sieben Tage?<br/>
Hier k&ouml;nnte man sich die verschiedensten Modelle ausdenken und durchrechnen - 4+2 w&auml;re beispielsweise ganz h&uuml;bsch.</p>
</li>
<li>
<p>Einzelhandel 24/7 &ouml;ffnen, zumindest mal ein gewisses Kontingent an Superm&auml;rkten (und Elektronikl&auml;den) zur Grundversorgung...</p>
</li>
</ol>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1669">
<p class="infos">
<a href="#comment_1669" onclick="set_comment_reference(1669)" title="auf diesen Kommentar antworten">#1669</a>:
    19.Nov.2013 04:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<ol>
<li>
<p>ja</p>
</li>
<li>
<p>Nun&hellip; wenn schon, k&ouml;nnen wir gleich auf den einzig wahren Kalender ( <a href="http://de.wikipedia.org/wiki/Diskordianischer_Kalender" rel="nofollow">http://de.wikipedia.or...</a> ) umsteigen. Dann haben wir 5 Tage die Woche, die Feiertage sind auch gleich sinnvoll und gleichm&auml;&szlig;ig verteilt und &uuml;berhaupt gibt es viel weniger Chaos, Verwirrung und Zwietracht!</p>
</li>
<li>
<p>Dass &Ouml;ffnungszeiten albern sind hab ich ja auch schon argumentiert ( <a href="http://g33ky.de/2009/10/6/Arbeitszeiten" rel="nofollow">http://g33ky.de/2009/1...</a> ), wobei der Punkt ja weniger ist dass alles 24/7 auf haben sollte, als vielmehr dass nicht alles GLEICHZEITIG auf haben sollte. Ich habe 20 Uhrmacher in Reichweite, aber nach 17 Uhr haben alle geschlossen? WAT?</p>
</li>
</ol>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1670" onclick="set_comment_reference(1670)" title="auf diesen Kommentar antworten">#1670</a>:
    25.Nov.2013 03:11
    von
    
      
        <a href="http://www.felixnagel.com/" target="_blank">
          Felix
        </a>
</p>
<p>Hier fehlt noch das Stichwort Bedingungsloses Grundeinkommen, das wohl auch massiv die Arbeitszeiten beeinflussen w&uuml;rde.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1671">
<p class="infos">
<a href="#comment_1671" onclick="set_comment_reference(1671)" title="auf diesen Kommentar antworten">#1671</a>:
    25.Nov.2013 03:11
    von
    
      
        <a href="http://www.g33ky.de/blog/author/Dr_Azrael_Tod/" target="_blank">
          Dr. Azrael Tod
        </a>
</p>
<p>Ich bin davon nicht wirklich &uuml;berzeugt&hellip; BGE hat mir zuviele, m&ouml;gliche Seitenauswirkungen als dass ich mich in solchen Behauptungen versteigen w&uuml;rde.<br/>
Sicher, wenn ich mein Leben arbeitsfrei finanzieren k&ouml;nnte, dann w&uuml;rde ich schwerer bis kaum zum Arbeiten f&uuml;r 40h/Woche  zu bewegen sein. Es gibt aber schlicht keinen funktionen Test von BGE da drau&szlig;en.</p>
<p>Die Wahrscheinlichkeit dass ein BGE erstmal nur eine spontane Inflation ausl&ouml;st, daf&uuml;r $Steuer erh&ouml;ht wird oder ich sonst irgendwie genauso verzweifelt f&uuml;r Geld arbeiten muss wie jetzt ist mir einfach zu hoch.</p>
<p>Das bedeutet &uuml;brigens nicht dass ich BGE nicht wenigstens mal testen w&uuml;rde. Ich glaube die positiven Chancen sind trotzdem deutlich besser als die auf negative Auswirkungen.</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1675" onclick="set_comment_reference(1675)" title="auf diesen Kommentar antworten">#1675</a>:
    25.Mar.2014 04:03
    von
    
      
        Zuzi
      
    
    
  </p>
<p>Von dem Seitenhieb gegen die Marketingbranche mal ganz abgesehen:<br/>
Vollste Zustimmung! Bei weniger Arbeit und mehr Urlaubstagen bin ich ganz vorn dabei. </p>
<p>Zum Bu&szlig;- und Bettag muss man ja noch dazu sagen, dass wir Sachsen daf&uuml;r zwar mehr zahlen, Bayern z.B. aber dennoch allgemein mehr Feiertage haben und daf&uuml;r nichts extra bezahlen m&uuml;ssen. Warum halsen wir ihnen nicht einfach noch ein paar Kosten auf und nehmen daf&uuml;r alle ein paar Feiertage mehr ins Programm...?</p>
</div>