+++
title = "Computerhotline"
date = "2008-06-03T10:06:00"
author = "Dr. Azrael Tod"
issoid = "blog/388"
aliases = "blog/388"
+++

<p>Jeder von euch kennt es, so ziemlich jeder hasst es, die meisten machen es doch... kostenloser Techsupport f&uuml;r Freunde und Familie. Warum tut man sich das an? Ein Arzt steht doch auch nicht auf der Geburtstagsfeier rum und sagt seiner Tante "Das Problem mit deinem Arm klingt ernsthaft, ich werd die Woche mal vorbei kommen und operieren m&uuml;ssen.". Klar gibt es auch andere Berufsgruppen, die mal eben f&uuml;r Familienmitglieder auch ihr Handwerkszeug ergreifen, aber keine andere bringt ihr Handwerkszeug zu den entsprechenden Personen nach hause, sitzt dann stundenlang am genannten Problem, behebt es und muss sich wann immer mal wieder ein Problem mit dem bearbeiteten Objekt auftritt stundenlang beschwerden anh&ouml;ren bis man sich bereit erkl&auml;rt sich erneut etliche Stunden daran zu setzen.</p>
<p>Nehmen wir doch mal einen KFZ-Mechaniker als Beispiel:<br/></p><ol><br/> <li>Man bringt das Auto zu ihm, keiner w&uuml;rde auf andere Ideen kommen.</li><br/> <li>Nur weil er einmal die Reifen gewechselt hat oder den Motor ausgetauscht hat, ist er noch lange nicht automatisch dran Schuld wenn das gleiche Problem ein paar Monate sp&auml;ter wieder auftritt. Im schlimmsten Fall w&uuml;rden sich die betroffenen Personen jemanden bezahltes suchen weil "Das ist ja richtige Arbeit, das kann man einem gutem Freund nicht st&auml;ndig unbezahlt zumuten."</li><br/></ol><br/>Zweites Beispiel, ein Maler:<br/><ol><br/> <li>OK, der bringt wirklich seine Ausstattung in die Wohnung mit dem Problem.. aber eben weil es ja kaum anders geht.</li><br/> <li>Wenn ein paar Wochen bis Monate sp&auml;ter ein Problem auftaucht liegt es nicht unbedingt am Maler. Hier kommt man sogar auf die Idee es k&ouml;nnte die falsche Farbe gewesen sein oder es wurde nicht genug Farbe verwendet.</li><br/> <li>Auch hier kommt keiner auf die Idee die gleiche Person alle 3-4 Wochen irgendwo eine (auch nicht kleine) Wand malern zu lassen.. "Wenn ich ihm st&auml;ndig so viel arbeit mache, f&uuml;hlt der sich noch ausgenutzt."</li><br/></ol><br/>Ich habe lange &uuml;berlegt wie ich dieses Problem l&ouml;se ohne alle betroffenen Personen vor den Kopf zu sto&szlig;en. Eine M&ouml;glichkeit w&auml;re es darauf hinzuweisen dass man generell keine PCs mehr f&uuml;r lau neu aufspielt oder Handlungen daran ausf&uuml;hrt die mehr als 60min dauern, eine andere dass man eine Preistabelle aufstellt, immer mit sich f&uuml;hrt und betreffenden Personen gleich vor die Nase halten kann (bzw. T-Shirt als Werbefl&auml;che?). Letzteres kann auch gleich mit dazu verwenden um Systeme die man mag zu subventionieren oder &auml;hnliche Dinge zu steuern. ("Computer neu aufspielen: Windows 20&euro;/h, Linux bzw. andere Unix-kompatible 15&euro;/h, andere nach Vereinbarung") Auf diese Art kann man auch gleich die Arbeit f&uuml;r zuk&uuml;nftige Auftr&auml;ge stark einschr&auml;nken. Denn sehen wir es objektiv, 1 PC mit Windows macht fast die gleiche Arbeit wie 3 PCs mit einem vern&uuml;nftig eingestelltem Linux ("Ich hab mal wieder ein programm runtergeladen, wie bekomm ich das weg? Deinstallieren l&auml;sst es sich nicht!")

<p>Wie kommt ihr damit klar, welche L&ouml;sungen habt ihr gefunden um dauerndes rumbasteln an allen m&ouml;glichen PCs zu vermeiden? Werdet ihr auch st&auml;ndig gedr&auml;ngt Kaufberatung f&uuml;r alle m&ouml;glichen elektrischen Ger&auml;te (Bei mir geht das wenns dumm kommt vom Handy &uuml;ber nen DVD-Player bis hin zu ner High-End-Grafikkarte. Ich habe als Programmierer nat&uuml;rlich von allen 3 Bereichen meistens nichtmal so viel Ahnung wie die Person die mich fragt... -.-) zu spielen?</p>
<p>Trackbacks/Pingbacks und Kommentare sind wie immer gern gesehen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_146" onclick="set_comment_reference(146)" title="auf diesen Kommentar antworten">#146</a>:
    03.Jun.2008 10:06
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Ich habs an meinen Bruder deligiert.</p>

<p class="infos">
<a href="#comment_147" onclick="set_comment_reference(147)" title="auf diesen Kommentar antworten">#147</a>:
    03.Jun.2008 10:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Hmm.. meine Schwester h&auml;llt sich erfolgreicher von meiner Verwandtschaft fern als ich.. eigentlich interessant wenn man bedenkt dass sie in Chemnitz wohnt und ich in Zwickau, also dass ich mal eben den doppelten Weg nach Zschopau habe. (nat&uuml;rlich nur wenn ich nicht grade bei Cindys Eltern rumh&auml;ng, was nochmal ein ganzes St&uuml;ck weiter ist.. und dass ich demn&auml;chst nach Dresden umsiedel macht die Entfernung auch nicht grade k&uuml;rzer.)</p>
<p>Jedenfalls bin ich wohl eh der einzige zu dem man sagen kann "Du studierst das doch, du musst dich doch damit auskennen!" in meiner Familie. (Erkl&auml;r mal jemandem, dass man, auch wenn man Informatik studiert, keine Lust hat sich mit jedem bl&ouml;den Fehler von Windows auseinander zu setzen!)</p>

<p class="infos">
<a href="#comment_148" onclick="set_comment_reference(148)" title="auf diesen Kommentar antworten">#148</a>:
    03.Jun.2008 11:06
    von
    
      
        <a href="http://usualredant.de" target="_blank">
          UsualRedAnt
        </a>
</p>
<p>Im Grunde unseres Herzens werden wir doch alle gern gebraucht. Und die Losl&ouml;sung von Nerds aus ihrem WOhn/Arbeitsumfeld hat doch auch durchaus positive Elemente.</p>
<p>Mal davon abegesehen, dass es sich nicht geh&ouml;rt bei der eigenen Sippe eine Rechnung zu schreiben, bleiben doch auch PC-Hilfsarbeiten nicht unbelohnt. Wenn Mutti mit ihrem neuen Rezepteprogramm gl&uuml;cklich ist, macht das n&auml;chste Weihnachten vielleicht sogar Spa&szlig; ;)</p>
<p>Im Ernst. Ich hab kein Problem damit anderen ihre Windoof-Kisten zu installieren und wittlerweile einfach meine Standardinstallation... Nebenbei hol ich mir den neuesten Klatsch und Tratsch ab... Es ein leckeres St&uuml;ck Kuchen oder so... Ein Gesch&auml;ft bei dem es nur Gewinner gibt - Nur das Finanzamt kuck bl&ouml;d aus der W&auml;sche.</p>

<p class="infos">
<a href="#comment_149" onclick="set_comment_reference(149)" title="auf diesen Kommentar antworten">#149</a>:
    03.Jun.2008 11:06
    von
    
      
        <a href="http://blog.b-o-f-h.net" target="_blank">
          Thorsten
        </a>
</p>
<p>Im Grunde unseres Herzens... Nein das stimmt so nicht, es geht eben bis zu einem gewissen Punkt und danach wird es unlustig. Man kann sehr viel Erfahrungen sammeln bei der Geschichte, aber wenn du dich schon den halben Tag mit irgendwelchen Problemem rum ge&auml;rgert hast, hast du definitiv nicht auch noch lust dich Abends als first, second und third Level Supporter zu besch&auml;ftigen, da soll es auch einfach mal funktionieren, da will man auch mal lustige Sachen machen, oder sich mit anderen Hobbys besch&auml;ftigen.</p>
<p>Also ich hab das vor Jahren nach und nach runter gefahren und zum gro&szlig;teil eingestellt. Sehr dabei geholfen hat mir dabei das ich selber gar kein Windows nutze (die eine Kiste mit den vielen Spielen drauf z&auml;hlt nicht), ich mich bei Windows Problemen dezent zur&uuml;ck halte. PC Supportende Raubkopierer gibt es im Windows Umfeld eh wie Sand am Meer, von daher wird da auch schnell ein anderer neuer Freund gefunden der einem hilft.</p>
<p>Support gebe ich maximal noch im famili&auml;ren Umfeld, und in diesem habe ich zb. meine Mutter bereits vor geraumer Zeit erfolgreich auf Linux umgestellt. Bei Leuten ohne PC Erfahrung spielt es meiner Meinung nach keine Rolle ob sie nun von Windows oder Linux keine Ahnung haben. Der Vorteil liegt zudem klar auf der Hand: Der Nachbar/Nachbarin, Freund/Freundin kommt eben nicht einfach mal an und installiert ihr irgend eine scheisse die die Stabilit&auml;t des Systems gef&auml;hrden.</p>

<p class="infos">
<a href="#comment_150" onclick="set_comment_reference(150)" title="auf diesen Kommentar antworten">#150</a>:
    03.Jun.2008 08:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Hmm.. ich hab jetzt erstmal als ernsthaft durchf&uuml;hrbaren Plan ins Auge gefasst alle PCs die ich immer noch warte so umzustellen dass ich dort auch per SSH mal ein bisschen Fernwartung betreiben kann (umstellung auf Linux ist dort jetzt &uuml;berall erfolgt).<br/>
Dann kann ich auf telefonische Fragen wie "wie kann ich meine Emails abrufen und meine Konten in Thunderbird einbinden?" gleich mit "Moment, gib mir mal die Daten von deinem Anbieter, ich stell das mal schnell ein..." antworten.</p>

<p class="infos">
<a href="#comment_151" onclick="set_comment_reference(151)" title="auf diesen Kommentar antworten">#151</a>:
    11.Jun.2008 10:06
    von
    
      
        <a href="http://www.drni.de/blog/" target="_blank">
          DrNI
        </a>
</p>
<p>Ich habe f&uuml;r Windows-Geschichten einen f&uuml;r Studenten angemessenen Stundenlohn eingef&uuml;hrt. Linux mache ich weiterhin umsonst. Bei letzterem sind die Leute ja recht selbstst&auml;ndig. Bei ersterem bin ich sie erfolgreich losgeworden. Falls nicht lehne ich mich bei der Arbeit ab und zu eine halbe Minute zur&uuml;ck und versuche, ans Geld zu denken.<br/>
Ich benutze selbst seit einigen Jahren kein Windows mehr. Immer, wenn ich davor sitze, geht irgendwas schief.</p>
</div>