+++
title = "Der Keeper erwartet dich!"
date = "2009-08-11T01:08:00"
author = "Dr. Azrael Tod"
issoid = "blog/1418"
aliases = "blog/1418"
+++

<p>Also ich bin ja als Nerd sehr anf&auml;llig f&uuml;r alles was irgendwie mit Fantasy, RPG oder Comics zu tun hat. Daher erscheint es auch nicht sonderlich verwunderlich dass ich ein treuer Stammleser des <a href="http://yafgc.shipsinker.com/" target="_blank">YAFGC (Yet Another Fantasy Gamer Comic)</a> bin und seitdem ich vor vlt. anderthalb Jahren auf dieses Webcomic gesto&szlig;en bin und es nahezu am St&uuml;ck durchgelesen habe, ich keinerlei Folge mehr verpasst habe.</p>
<p>Weiterhin wenig verwunderlich ist es wohl dass noch nach all den Jahren eines der imho besten Spiele die jemals ver&ouml;ffentlicht wurden wohl <a href="http://de.wikipedia.org/wiki/Dungeon_Keeper" target="_blank">Dungeon Keeper (inkl. Teil 2)</a> war und ich noch diesem Spiel nachtrauere. In letzter Zeit war ich sogar verzweifelt genug meinen Jahrelangen Entzug mit der vergleichsweise miserablen Ersatzdroge "Overlord 2" zu stillen versuchen.<!--more--></p>
<p>Wie erfreut war ich nun, nach meinem Urlaub in D&auml;nemark vorletzte Woche festzustellen dass bei YAFGC ein neuer Handlungsstrang mit altbekannten Figuren angefangen hat. <a href="http://yafgc.shipsinker.com/index.php?strip_id=1162" target="_blank">Ein Imp bricht durch die Wand</a> und ich wunder mich noch ob der extrem starken &Auml;hnlichkeit. Nachdem dann kurz darauf <a href="http://yafgc.shipsinker.com/index.php?strip_id=1164" target="_blank">vom Keeper die Rede ist</a>, <a href="http://yafgc.shipsinker.com/index.php?strip_id=1165" target="_blank">Gnome Fallen aufstellen und andere, alten Bekannten auftreten</a> ist wohl jeder letzte Zweifel verflogen!</p>
<p>YAFGC BRINGT EINE GESCHICHTE AUF DUNGEON-KEEPER-BASIS!</p>
<p>[caption id="attachment_1419" align="aligncenter" width="497" caption="es gibt Huhn... lecker!"]<img alt="es gibt Huhn... lecker!" class="size-full wp-image-1419" height="308" src="http://localhost/wordpress/wp-content/uploads/2009/08/20090808.jpg" title="CHICKEN!" width="497"/>[/caption]</p>
<p>F&uuml;r all diejenigen, die an dieser Stelle Blut geleckt haben, w&uuml;rde ich &uuml;brigens auch die Lekt&uuml;re des <a href="http://goblins.keenspot.com/" target="_blank">Goblins-Comic</a> und nat&uuml;rlich des wohlbekannten <a href="http://www.lfgcomic.com/" target="_blank">Looking-For-Group</a> empfehlen. Wem das alles noch lange nicht reicht, den mag ich an dieser Stelle meinen <a href="https://www.google.de/reader/shared/user/00910410964970600802/label/webcomix" target="_blank">via Google-Reader zusammengestellten</a> <a href="http://feeds.feedburner.com/webcomix" target="_blank">Webcomic-Newsfeed</a> ans Herz legen. Ich versuche so ziemlich alles was ich als wirklich lesbare Comics empfinde hier handverlesen zusammenzutragen.<br/>(Und im Gegensatz zu meinen Blogeintr&auml;gen in den letzten Monaten schwankt das Angebot dort schon seit Jahren eigentlich nicht gro&szlig;artig)</p>
<p>BTW: Ich bin vor vlt. 1-2 Jahren mal &uuml;ber Bem&uuml;hungen von einigen Fans gestolpert, die eine OpenSource-Variante von Dungeon Keeper bauen wollten, dort war allerdings schon damals abzusehen dass es rechtliche Probleme geben w&uuml;rde.<br/>Leider gab es noch keine auch nur ann&auml;hernd spielbare Version und mir f&auml;llt auch weder der Name noch eine URL dazu ein.<br/>Wei&szlig; zuf&auml;llig jemand was neues dazu? Wurde dieses Projekt weitergef&uuml;hrt?</p>
