+++
title = "Staatliche Ablenkungsanstalten"
date = "2008-09-23T01:09:00"
author = "Dr. Azrael Tod"
issoid = "blog/784"
aliases = "blog/784"
+++

<p>Ich geh&ouml;re schon seit vielen Jahren nicht mehr zu den Menschen die sich jeden Tag vom Radio berieseln lassen. Genau genommen ist mein Musikkonsum sogar allgemein recht niedrig (mal die letzten paar Wochen ausgenommen). Doch selbst mir ist aufgefallen dass Rundfunkanstalten permanent immer die selben Lieder spielen. Dies k&ouml;nnte man ja noch mit irgendwelchen rechtlichen Einschr&auml;nkungen durch Gema oder &auml;hnliche Argenturen begr&uuml;nden, doch ein paar weitere Beobachtungen machen dies etwas fragw&uuml;rdig...<!--more--></p>
<p>Z.B. f&auml;llt mir immer mehr auf dass sich durch GEZ-Geb&uuml;hren finanzierte Sender teilweise noch st&auml;rker wiederholen als private. Das nat&uuml;rlich bei der gleichen Menge Werbung und sinnlosen Gewinnspielen. (Von denen gibt es &uuml;brigens eindeutig 2 Arten: die schwierigen zur Unterhaltung, bei denen man solche Preise wie eine Tasse gewinnen kann und die einfachen zum Geld verdienen durch teuere Anrufe. Am besten werden diese Spiele auch noch parallel beworben und fast zeitgleich durchgef&uuml;hrt.)<br/>Es gibt also MINDESTENS die gleichen Einnahmen f&uuml;r die &ouml;ffentlich-rechtlichen wie f&uuml;r die privaten Sender und dennoch k&ouml;nnen sich die &Ouml;Rs weniger CDs leisten?</p>
<p>Wie kann es &uuml;berhaupt sein dass sich ein einziges Lied 10x am Tag wiederholt? Habt ihr nicht genug Musik gespeichert? Sollen wir mal sammeln gehen und euch ein paar OGG/Vorbis-DVDs mit <a href="http://de.wikipedia.org/wiki/Creative_Commons" target="_blank">CC</a>-Musik schicken? Ich h&auml;tte alleine bestimmt schon 1-2 GB mit richtig guten Sachen hier rumliegen, damit sollte man ein paar Tage durchhalten.</p>
<p>Wenn wir also davon ausgehen dass es kein Geld kostet eine gr&ouml;&szlig;ere Bandbreite an Musik zu bringen und private Sender trotz ihrer st&auml;rkeren Gewinnorientierung dies auch tun, dann bleibt wohl nur noch eine Begr&uuml;ndung f&uuml;r dieses Verhalten: Man WILL nicht so viele verschiedene K&uuml;nstler spielen.</p>
<p>Wenn ich mal v&ouml;llig in Verschw&ouml;rungstheorien abgleiten darf, w&uuml;rde ich sicher schnell zu dem Schluss kommen dass man mit eint&ouml;nigerer Musik das Volk noch mehr verbl&ouml;den kann. Je weniger Auswahl besteht desto weniger muss ich dar&uuml;ber nachdenken welches Lied ich toll finde und welches nicht. Meine Lieblingslieder kommen ja schon beide im Radio. Die beiden die ich nicht mag zwar auch, aber das muss ich einfach &uuml;ber mich ergehen lassen.<br/>Einfach ideal f&uuml;r eine Generation die sich "ihre Meinung [von anderen] bilden l&auml;sst"!</p>
<p>Passendes Motto: "Am besten lassen sich die Menschen lenken,<br/>wenn sie &uuml;berhaupt nicht denken"</p>
<p>[Edit:]<br/>Welche Aufgabe erf&uuml;llen diese Sender eigentlich noch?<br/>Unterhaltung? Nicht wirlich, ich f&uuml;hle mich dank Flop10 auf Endlosschleife und R&auml;tsel/Humor auf dem Niveau eines 3J&auml;hrigen jedenfalls nicht unterhalten.<br/>Information oder gar Bildung/Kultur? Das ist ein Witz oder?</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_636" onclick="set_comment_reference(636)" title="auf diesen Kommentar antworten">#636</a>:
    23.Sep.2008 05:09
    von
    
      
        <a href="http://" target="_blank">
          kopfschrott
        </a>
</p>
<p>es gibt auch noch ausnahmen, deutschland radio kultur oder mein pers&ouml;nlicher favorit mdr figaro macht genau das gegenteil:<br/>
1. sich wiederholende musik: fehlanzeige<br/>
2. gewinnspiele: "das musikalische sonntags" raten ist eigentlich total schwer aber einige schaffen es doch, die nummer is kostenlos und einsendungen sind via mail m&ouml;glich<br/>
3. unterhaltung: was will ich mehr als buchlesungen, diskusion, gute nachrichten, und so weiter...</p>
<p>auch reginal sender sind meist viel besser. radio lotte aus weimar hat neulich sonntag morgen post rock den ganzen vormiitag gespielt. h&auml;tte nie gedacht sigur r&oacute;s oder explosions in the sky jemans im radio zu h&ouml;ren ;) (fr&uuml;her gabs da sogar einen metal abend)</p>
<p>also es geht auch anders. nur eben was f&uuml;r die breite masse gedacht ist arbeitet auch f&uuml;r die breite masse und bedient sich solcher verdummungsmassnahmen</p>

<p class="infos">
<a href="#comment_637" onclick="set_comment_reference(637)" title="auf diesen Kommentar antworten">#637</a>:
    23.Sep.2008 07:09
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>Das warum habe ich auch noch nicht verstanden, aber vielleicht liegt ja ein Teilgrund darin:</p>
<p>a) Es funktioniert - Ver&auml;nderung kommt meist erst zum tragen wenn was nicht mehr wirtschaftlich funktioniert</p>
<p>b) Tr&auml;gheit des Menschen - wer sucht sich schon alternative Sender, die dann meist regional begrenzt verf&uuml;gbar sind</p>
<p>Ich liebe Musik, aber weder Radio noch der normale Handel bietet viel von der Art Musik die ich mag -&gt; Problem von Randgruppen nehme ich an =)</p>

<p class="infos">
<a href="#comment_638" onclick="set_comment_reference(638)" title="auf diesen Kommentar antworten">#638</a>:
    23.Sep.2008 07:09
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Das mit dem Verdummen ist totaler quatsch, wir alle wissen, dass das von den Telefongesellschaften gemacht wird ;)</p>
<p>Ich kann im Moment leider nicht mit Quellen dienen (ihr solltet mir also nichts glauben, sorry), aber Radio-DJs bekommen von der Musikindustrie Geld zugesteckt, damit bestimmte Lieder &ouml;fter zu h&ouml;ren sind. Wenn sehr viel Geld flie&szlig;t kommt es eben soweit, dass man nur noch 20 verschiedene Lieder h&ouml;rt.</p>
<p>Fr&uuml;her war es bei Rockland Radio so, dass man, wenn man zweimal innerhalb von 24 Stunden das selbe Lied geh&ouml;rt hat, dort anrufen konnte und dann 500&euro; daf&uuml;r bekommen hat. Kann sein, dass es das immer noch gibt, bin nicht so der Radioh&ouml;rer und wohn auch nicht im Empfangsgebiet.</p>

<p class="infos">
<a href="#comment_639" onclick="set_comment_reference(639)" title="auf diesen Kommentar antworten">#639</a>:
    24.Sep.2008 09:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>@kopfschrott das stimmt durchaus, es gibt noch 2-3 "Kultur-Sender" die annehmbare Sendungen bringen. bei diesen muss ich dann aber leider auf die Art Musik verzichten die ich wirklich mag (oder eher die Arten, ich hab imho einen ziemlich breit gef&auml;cherten geschmack)</p>
<p>Regionale Sender sind sicher toll, per Antenne bekommt man aber leider meist nur die 5-6 Standard-Sachen, die man sich einfach nicht antun will. Wie gesagt w&uuml;rde ich per Kabel auch Sunshine-Live h&ouml;ren, was meist relativ Abwechslungsreich ist.<br/>
Ich bin schlicht alle Sender in meinem Empfangsbereich (Dresden, Neustadt, UKW) durchgegangen und es gibt nicht einen Sender den man sich wirklich anh&ouml;ren will.</p>
<p>@fidel<br/>
Herzlich Willkommen im Club, :Wumpscut:/Randy Katana/Bin&auml;rpilot/[irgendwa anderes aus meiner aktuellen Playlist] und &auml;hnliches finde ich auch recht selten in den Medien oder auch nur im Laden. Man k&ouml;nnte direkt meinen unser aktuelles Rechtesystem w&uuml;rde ebenfalls eine Verflachung der Musikkultur f&ouml;rdern.</p>
<p>@Friedenspanzer<br/>
Ich dachte bisher eigentlich immer von Printmedien und Fernsehsendern... <em>g</em><br/>
Das mit dem Geld kenne ich auch, aber gerade von den &Ouml;ffentlich-/Rechtlichen, die sich immer auf die Fahne schreiben soundso viele lokale K&uuml;nstler "entdeckt" und "gef&ouml;rdert" zu haben sollte man eigentlich etwas anderes erwarten oder?</p>
</div>