+++
title = "Ausweg Amoklauf"
date = "2009-04-09T02:04:00"
author = "Dr. Azrael Tod"
issoid = "blog/1361"
aliases = "blog/1361"
+++

<p>Ich bin heute &uuml;ber <a href="http://twitter.com/G33KatWork" target="_blank">Twitter</a> und <a href="http://www.geekatwork.de/" target="_blank">G33KatWork</a> mal wieder &uuml;ber <a href="http://www.maniac.de/content/leserpost-mein-verhinderter-amoklauf" target="_blank">einen der sehr wenigen Artikel</a> <a href="http://twitter.com/G33KatWork/status/1482809434" target="_blank">gestolpert</a>, der mich wahnsinnig beeindruckt hat und den ich in dieser Form nahezu uneingeschr&auml;nkt unterschreiben w&uuml;rde.<br/>Es handelt sich um einen Leserbrief von jemandem, der tats&auml;chlich schon einmal in der Situation war selbst Amok laufen zu wollen.<!--more--></p>
<p>Wahrscheinlich liegt ein Teil der Gr&uuml;nde, warum ich diesen Brief so zutreffend finde auch darin, dass es mir in meiner Jugend (wenn auch in abgeschw&auml;chter Form) &auml;hnlich ging.<br/>Zum Gl&uuml;ck war ich damals meist etwas gr&ouml;&szlig;er/st&auml;rker als die meisten Altersgenossen, so dass ich mich einigerma&szlig;en Wehren konnte. Die Aussicht auch selbst einen Teil des Schadens einzustecken schreckt nach einiger Zeit dann doch andere davon ab jemanden zu sehr zu triezen.</p>
<p>Ja, auch ich habe mehrmals dar&uuml;ber nachgedacht wie ich den Leuten in meiner Umgebung ernsthaft Schaden zuf&uuml;gen konnte. Auch ich hatte als Kind &ouml;fters die Idee eine Waffe (wenn auch eher ein Messer) zur Verteidigung einzustecken um mich besser wehren zu k&ouml;nnen.<br/>Zu meinem (und wohl auch dem der anderen) Gl&uuml;ck jedoch habe ich nie etwas derartiges dabei gehabt wenn es doch mal an ernste Pr&uuml;gelein ging.. das lag zum einen daran dass derartige Vorkommnisse zum Gl&uuml;ck bei weitem noch nicht an der Tagesordnung waren und dass zwischen der Idee sich zu bewaffnen und der Ausf&uuml;hrung dieser Idee noch Welten liegen.</p>
<p>Jedoch: wenn mein Fall schlimmer gewesen w&auml;re und ich Waffen zur Verf&uuml;gung gehabt h&auml;tte, bin ich mir fast sicher dass auch ich eine gro&szlig;e Chance darauf gehabt h&auml;tte das neueste, jugendliche Monster f&uuml;r die BILD-Zeitung zu werden.</p>
<p>Dieser Gedankengang zeigt mir mal wieder sehr deutlich dass wir in einer Welt der Oberfl&auml;chlichkeit leben. Keiner will sich ernsthaft mit Problemen besch&auml;ftigen, die ihn nicht direkt betreffen. Lehrer nicht mit den internen Streitigkeiten der Sch&uuml;ler und Politiker nicht mit den Problemen der Jugendlichen.<br/>Wer ein Verbot von gewalthaltigen Computerspielen als L&ouml;sung ansieht, beweist damit nur wie Kleingeistig er dieses Thema betrachtet. Es ist ein komplexes Problem und KEIN wirklich komplexes Problem l&auml;sst sich auf einfache Art l&ouml;sen.</p>
<p>Die Zugriffsm&ouml;glichkeit auf Waffen einzuschr&auml;nken hingegen ist eine M&ouml;glichkeit die Symptome zu behandeln. Wenn jemand keine Pistole hat, wird er niemanden erschie&szlig;en.<br/>Dass auch dies nicht das Problem l&ouml;st ist klar... aber ich bin nicht so naiv wirklich zu fordern dass mehr Geld in unsere Jugend gesteckt wird. Auch wenn wir die Ausgaben f&uuml;r alle Bildungsprogramme, Schulen, Sozialhelfer und sonstiges bereits auf einen Bruchteil dessen gedr&uuml;ck haben, was wir mal eben einer Bank in die Hand dr&uuml;cken ohne wirklich zu kontrollieren was sie damit tut.<br/>Aus Bildungsgeldern kann man sich wohl nicht so ganz freim&uuml;tig bedienen und die Lobby der Jugendlichen ist auch ziemlich unterrepr&auml;sentiert, daher wird sich wohl nie ein Politiker wirklich ernsthaft f&uuml;r wirksamme Verbesserungen einsetzen (die Profilierungssucht einiger Leute ist kein ernsthafter Einsatz!)</p>
<p>Auch wenn ich sonst kein Fan davon bin, werde ich an dieser Stelle mal <a href="http://www.maniac.de/content/leserpost-mein-verhinderter-amoklauf" target="_blank">den Brief</a> komplett zitieren, in der Hoffnung dass der Schreiber ihn mit der Hoffnung auf m&ouml;glichst hohe Verbreitung schrieb und so nichts dagegen h&auml;tte.</p>
<p></p><blockquote>Liebes M!-Team,<br/>gerade habe ich den Leserbrief des &rsquo;geschockten P&auml;dagogen&rsquo; gelesen und m&ouml;chte hiermit mal eine Sichtweise erm&ouml;glichen, die es in der Form vielleicht noch nicht gegeben hat. Auch ich war fest entschlossen einen Amoklauf zu starten, verhindert wurde dies nur durch einen  Zufall.<br/>Sollte Euch interessieren wie Menschen zu Amokl&auml;ufern werden k&ouml;nnen, m&ouml;chte ich hiermit meine Geschichte erz&auml;hlen. Vielleicht wirft diese ein etwas anderes Licht auf diese grausamen Taten, die immer wieder geschehen. Die Person, die es am meisten betrifft kann man leider nicht mehr fragen, da sich die T&auml;ter traditionell am Ende selbst richten.

<p>Ich komme urspr&uuml;nglich aus einem kleinen Dorf mit gesch&auml;tzten 400 Einwohnern und besuchte nat&uuml;rlich auch die dortige Schule. Ich war, als ich eingeschult wurde, sehr lern- und wissbegierig, in den ersten Jahren mit der Klassenbeste und las bereits B&uuml;cher als die meisten anderen gerade erst mit dem ABC fertig waren. Ich war ein sehr ruhiges Kind - relativ unauff&auml;llig, friedlich und freundlich. Mit anderen Worten: Ich war anders als die meisten anderen. Zudem auch nicht besonders sportlich und k&ouml;rperlich schw&auml;cher als der Rest.  Ein gefundenes Fressen f&uuml;r Menschen mit schwachem Geist und eingeschr&auml;nkter Pers&ouml;nlichkeit.</p>
<p>Im Laufe der Jahre wurde ich zum Pr&uuml;gelknaben und S&uuml;ndenbock f&uuml;r alles m&ouml;gliche abgestempelt.  Als ich in die f&uuml;nfte Klasse kam, begann ein Leben, dass ich im Nachhinein nur als Horrorszenario beschreiben kann.  Ich interessierte mich eher f&uuml;r Naturwissenschaften, B&uuml;cher und seit meinem 12. Lebensjahr (als ich ein NES geschenkt bekam) auch mit absoluter Begeisterung f&uuml;r Videospiele. Ger&uuml;chte wurden laut, teilweise verbreitet durch Eltern, ich w&uuml;rde, wenn ich &auml;lter w&auml;re, bestimmt mal &rsquo;anders&rsquo; werden. Schwul, f&uuml;r Dorfbewohner also die niederste Lebensform die f&uuml;r sie &uuml;berhaupt existiert. Dies griffen einige Sch&uuml;ler auf und verbreiteten das Ger&uuml;cht, welches wohlwollend von vielen aufgenommen wurde. Meine Situation verschlimmerte sich auch noch dadurch, dass ich mich nicht dem Gruppenzwang unterordnen wollte. Ich interessierte mich nicht f&uuml;r  Zigaretten oder Alkohol,  Discotheken waren nie mein Ding und das Thema Sex bzw. &uuml;berhaupt erstmal eine Orientierung in dieser Richtung zu finden war mir erstmal auch egal. Jemanden wie mich w&uuml;rde man wohl als Sp&auml;tz&uuml;nder bezeichnen.<br/>Dies f&uuml;hrte nat&uuml;rlich dazu, dass ich nicht &rsquo;cool&rsquo; genug war und noch mehr ausgeschlossen wurde - was wiederum dazu f&uuml;hrte, dass ich mich f&uuml;r die oben genannten Dinge noch weniger interessierte und deswegen wurde ich noch uncooler wurde usw. - ein Teufelskreis. Ich hatte nur zwei Freunde, die sich in einer &auml;hnlichen Situation befanden und mir nicht wirklich helfen konnten, ich hatte manchmal den Eindruck dass jeder von uns froh war, wenn mal ein anderer gemobbt wurde.<br/>Bereits auf dem Weg zur Schule wurde ich geh&auml;nselt, durch den Schuleingang an den dort herumstehenden Sch&uuml;lern zu gehen war jeden Tag ein Spie&szlig;rutenlauf. Man warf mir Beleidigungen an den Kopf, teilweise bespuckte man mich, qu&auml;lte mich, schubste mich herum und tat mir sowohl psychisch als auch physisch weh. Ich war verzweifelt.  K&ouml;rperlich unterlegen sah ich irgendwann keinen anderen Ausweg als selbst Gewalt gegen einen dieser Sadisten anzuwenden. Dieser Versuch wurde jedoch im Keim erstickt - indem man mir sofort den Arm verdrehte und mich anderen vorf&uuml;hrte. Wenn man allein ist und versucht sich zu wehren, wird alles nur noch schlimmer. Man hat als Einzelner keine Chance, wenn andere sich immer wieder gegen einen verb&uuml;nden.</p>
<p>Ich versuchte etwas anderes. Mich anzupassen. Ich trank Bier, fing an zu rauchen und versuchte, Anschluss zu finden. Indem ich so tat, als ob mich die Themen der anderen interessierten. Partnersuche, Disco, Drogen. Im Grunde genommen versuchte ich, jemand zu sein der ich nie sein und werden wollte. Dies wurde erst skeptisch be&auml;ugt bis man dann kollektiv beschloss, es l&auml;cherlich zu finden. Meine Eltern wussten von diesen Dingen so gut wie nichts. Ihnen war klar dass ich nicht sonderlich beliebt war, was aber wirklich in der Schule und vor allem in mir vorging, wussten sie nicht.<br/>Lehrer beobachteten diese Szenarien zwar, schauten aber wohlwollend weg. Sind ja nur Kinder. Die meinen das nicht ernst. Ist ja nur Spa&szlig;. Dass dabei aber jemand innerlich zugrunde geht, interessierte niemanden. Eine Lehrkraft meinte einmal zu einem der obersten R&auml;delsf&uuml;hrer, er solle doch seine &uuml;bersch&uuml;ssige Kraft an einem Baum abreagieren, andere zu &auml;rgern w&auml;re unfair. Und das war es dann auch schon.<br/>Ein Highlight war, als ein hinter mir sitzender &sbquo;Klassenkamerad&rsquo; versuchte, mich im Unterricht anzuz&uuml;nden - indem er mir ein brennendes Feuerzeug in den Nacken hielt.  Den Lehrer interessierte dies herzlich wenig. Ich hatte danach eine offene, n&auml;ssende Wunde im Nacken, die ich versuchte vor meinen Eltern zu verstecken. Sie fanden es trotzdem heraus und fragten geschockt was passiert w&auml;re. Ich versuchte die Sache herunterzuspielen um das folgende Szenario zu vermeiden. Mir war klar, dass eine Einmischung meiner Eltern alles nur noch schlimmer machen w&uuml;rde. Am n&auml;chsten Tag fingen sie den Verursacher meiner Brandwunde ab (mein Elternhaus lag auf dem allgemeinen und einzigen Schulweg) und stellten ihn zur Rede. Sie ermahnten ihn, mich zuk&uuml;nftig in Ruhe zu lassen.</p>
<p>Das war der Beginn eines noch schlimmeren Alptraumes. Sowieso schon t&auml;glich geh&auml;nselt und ausgeschlossen, in der Schule &auml;ngstlich immer nur auf den n&auml;chsten Angriff wartend, war ich nun als Petze abgestempelt die sich nicht wehren kann und Mama und Papa vorschickt.<br/>Ab da war mein Leben kein Leben mehr. Ich verkroch mich nur noch in meinem Zimmer,  die Schule war jeden Tag ein emotionaler Trip in die H&ouml;lle. In den Pausen war ich oft &rsquo;f&auml;llig&rsquo;, im Sportunterricht sowieso.  Schw&auml;chlinge mit schlechten sportlichen Leistungen waren bei der damaligen Sportlehrerin sowieso nicht beliebt - dies war auch die ideale Gelegenheit dem Idioten, also mir, immer wieder richtig eins reinzuw&uuml;rgen. Im wahrsten Sinne des Wortes, ich sage nur V&ouml;lkerball&hellip;.<br/>Videospiele waren von da an mein t&auml;glicher Begleiter. Ich brauchte diese um mich abzureagieren. Ego-Shooter waren nie mein Ding, aber Pr&uuml;gelspiele, Horrorspiele, Rollenspiele. Ich fl&uuml;chtete mich in Phantasiewelten, um nicht wahnsinnig zu werden.<br/>Als wir eines Tages wieder Sportunterricht hatten, begab sich die Klasse in Richtung Sporthalle am anderen Ende des Dorfes, um dort auf den Unterrichtsbeginn zu warten. Keine Lehrkraft in der N&auml;he (da mal wieder zu sp&auml;t) und aggressive Raufbolde die Langeweile hatten. Bis jemandem einfiel, die umherliegenden Steine und Schieferplatten als Wurfgeschosse gegen mich zu verwenden. Die Idee fand wachsenden Zuspruch und so fing man quasi an, mich zu steinigen.</p>
<p>Ich hatte keine Chance mich zu wehren. All die Jahre der Qualen und Erniedrigungen ohne Aussicht auf Besserung oder Akzeptanz meiner Person brachen in diesem Moment &uuml;ber mich herein. Ich wollte fl&uuml;chten und schaffte es irgendwie mit meinem Fahrrad zu entkommen&hellip; nat&uuml;rlich nicht ohne den Versuch mich daran zu hindern  und mir weitere Steine hinterherzuwerfen. Man k&ouml;nnte ja noch den einen oder anderen Treffer landen. Ich fuhr zum Haus meiner Eltern, fing an zu weinen und wollte nur noch eines. T&ouml;ten oder get&ouml;tet werden. Mein Leben war sinnlos. Ich hatte an diesem Tag begriffen, dass es nicht besser werden w&uuml;rde, egal was ich auch versuchen sollte. Ich sah den Tod - in welcher Form auch immer - als den einzigen Ausweg. Ich traf unterwegs meine Sportlehrerin und rief Ihr zu, dass ich nicht mehr kann. Es schien sie kaum zu interessieren. Als ich an der Werkstatt meines Vaters war lie&szlig; ich mein Fahrrad fallen und begab mich tr&auml;nen&uuml;berstr&ouml;mt zum Waffenschrank. Mein Vater hatte Waffen und ich wusste auch damit umzugehen, wir hatten immer wieder Ziel&uuml;bungen auf Bierdosen oder &Uuml;-Ei Figuren unternommen. Mir war alles egal. Ich wollte diese Menschen t&ouml;ten, einen Befreiungsschlag aus&uuml;ben, Rache nehmen f&uuml;r die Jahre der H&ouml;lle auf Erden, die man mir bereitet hatte. Ich wollte nur noch den Tod. Den der anderen und/oder meinen eigenen. Egal. Es sollte einfach nur enden. An diesem Tag. Mir war alles egal.</p>
<p>(Un)gl&uuml;cklicherweise war der Waffenschrank meines Vaters an diesem Tag verschlossen. Ich r&uuml;ttelte daran, erreichte aber nicht das was ich wollte. Waffen um zu t&ouml;ten. Als ich begriff, dass nicht einmal dies funktionierte, war alles f&uuml;r mich vorbei. Ich lebte in der H&ouml;lle und es gab keinen Ausweg. Eine Weile sp&auml;ter fanden mich meine Eltern heulend und zitternd in meinem Zimmer. Ich hatte einen totalen Nervenzusammenbruch. Nat&uuml;rlich waren diese sofort in Panik und fragten was passiert w&auml;re, meine Antwort drauf war immer wieder, dass ich am Ende w&auml;re und nur noch einen Wunsch habe: Meine Peiniger zu t&ouml;ten oder mich umzubringen. Es sollte einfach nur vorbei sein.</p>
<p>Ich ging von da an nicht mehr in die Schule.  Psychologische Hilfe lehnte ich ab. Was sollte dies bringen? Besser damit umzugehen, dass ich misshandelt werde? Verst&auml;ndnis f&uuml;r meine Peiniger aufbringen? L&auml;cherlich&hellip;.<br/>Als in der Schule der Ernst der Lage erkannt wurde, wurden Diskussionen im Unterricht dar&uuml;ber gef&uuml;hrt, wie ich sp&auml;ter erfuhr. Nach einigen Tagen kam einer der schlimmsten Folterknechte zu mir nach Hause, um sich zu entschuldigen. Klar, dass er dies nur tat weil er dazu gezwungen wurde. Man sah ihm an, dass es nicht wirklich ernst gemeint war. Ich ging daraufhin wieder zur Schule - an meinem ersten Tag bekam ich von einer Mitsch&uuml;lerin eine Blume &uuml;berreicht und eine Entschuldigung im Namen der ganzen Klasse. L&auml;cherlich, dachte ich nur. Diese Schweine h&auml;tten von mir aus auch elendig verrecken k&ouml;nnen, aber ich nahm dankend an und machte gute Mine zum b&ouml;sen Spiel, denn keine zwei Wochen sp&auml;ter ging es - wenn auch in wesentlich abgeschw&auml;chter Form - weiter wie vorher.</p>
<p>Ich beendete nach der Realschule freiwillig meine Schullaufbahn, der Gedanke auf ein Gymnasium zu gehen und 3 weitere Jahre den Horror zu erleben, war unertr&auml;glich. Ich machte eine Ausbildung und tat das einzig Richtige: Ich zog sofort weg.<br/>Ich konnte endlich, nach fast 20 Jahren in Hamburg einen Neuanfang starten, in einer Stadt, in der mich niemand kannte und ich Menschen kennenlernen durfte, die mir gegen&uuml;ber unvoreingenommen waren. Ich war am Anfang sehr sch&uuml;chtern und &auml;ngstlich, bl&uuml;hte aber von da an f&ouml;rmlich auf. Heute kann ich sagen : Mein Leben begann erst mit 20, alles andere davor war ein Alptraum, die H&ouml;lle auf Erden. Viele Jahre lang. Heute habe ich viele Freunde, alles Menschen die mich m&ouml;gen und auf die ich mich verlassen kann, ich habe mein Abitur an der Abendschule nachgemacht (diese Zeit z&auml;hlt zum sch&ouml;nsten &uuml;berhaupt - h&auml;tte nie gedacht, dass so etwas in einer Schule m&ouml;glich w&auml;re), studiere demn&auml;chst Psychologie, habe einen tollen Job und f&uuml;hre ein zufriedenes Leben. Ich wei&szlig; mich meiner Haut zu erwehren und habe mittlerweile ein derartig starkes Selbstbewusstsein entwickelt, dass mich heute niemand mehr auch nur ansatzweise angreifen kann. Ich habe vor einigen Jahren in einer Psychotherapie meine Vergangenheit aufgearbeitet und kann nun besser damit  leben.</p>
<p>Wenn ich heutzutage lese dass &rsquo;Killerspiele&rsquo; Menschen zu Monstern mutieren lassen, kann ich nur mit dem Kopf sch&uuml;tteln &uuml;ber soviel Ahnungslosigkeit und Dummheit.  Menschen machen aus Menschen Killer, nicht Spiele - egal ab gewaltverherrlichend oder nicht. Auch ich zocke heute &ldquo;Resident Evil&ldquo;, &ldquo;Silent Hill&ldquo; und freue mich tierisch auf &ldquo;Mad World&ldquo;. Allerdings haben mich solche Spiele nie aggressiv gemacht und werden es auch nie tun. Es sind Spiele. Nicht mehr, nicht weniger.  Man wird nicht zum Amokl&auml;ufer weil man Killerspiele spielt, man spielt diese, um sich abzureagieren. Ein Ventil, nichts weiter.<br/>Im Gegensatz zu vielen anderen kann ich nur sagen: Mir tut der Amokl&auml;ufer von Herzen leid. Ich denke, ein normaler Mensch kann sich nicht vorstellen wie es ist, ausgesto&szlig;en und nicht akzeptiert zu sein. Damit k&ouml;nnte man vielleicht noch leben, wenn man wenigstens in Frieden gelassen werden w&uuml;rde.</p>
<p>Ich w&uuml;rde nur zu gern mit den Menschen ein Gespr&auml;ch f&uuml;hren, die der Meinung sind, dass Games als S&uuml;ndenbock zur Verantwortung zu ziehen sind und Ihnen gern mal meine Sichtweise schildern. Vielleicht hilft es ja, wenn diese Leute anstatt einfach gro&szlig; das Maul aufzurei&szlig;en, jemandem zuh&ouml;ren der wirklich wei&szlig;, wie es in solch gequ&auml;lten Seelen aussieht. Aber das z&auml;hlt ja nicht, solange sogenannte &rsquo;Experten&rsquo; ihre &rsquo;wissenschaftliche&rsquo; Meinung publizieren.<br/>Mittlerweile bin ich froh, dass mein Amoklauf nicht stattfand. Einige meiner Peiniger sind heute tot, gestorben bei Autounf&auml;llen, andere sind drogenabh&auml;ngig oder seit Jahren arbeitslos und h&auml;ngen an der Flasche - andere wiederum haben innerhalb der Dorfgemeinschaft geheiratet und f&uuml;hren ein erb&auml;rmliches Leben, w&auml;hrend ich meines in vollen Z&uuml;gen genie&szlig;e. So hat am Ende jeder bekommen, was er verdient und zu sehen wie sich die anderen selbst zu Grunde richten, ist in meinen Augen besser als jeder Amoklauf und mehr als eine Genugtuung.</p>
<p>Vielleicht gibt es ja da drau&szlig;en Menschen denen es jetzt &auml;hnlich geht wie mir damals. Sollten diese St&uuml;tze oder einen Rat ben&ouml;tigen, bin ich gern bereit zu helfen. mein Leserbrief ver&ouml;ffentlichen Resonanz hervorrufen, k&ouml;nnt Ihr meine Mail-Adresse gern weiterleiten.<br/>Im &uuml;brigen:  Ich bin jetzt 30 Jahre alt, spiele seit fast 18 Jahren Videogames und kenne (unter anderem) die MAN!AC seit ihrer ersten Stunde.  Ich wei&szlig; also, wovon ich rede, wenn ich &uuml;ber Games und Gewalt hier meine Meinung &auml;u&szlig;ere.</p>
<p>Mit freundlichen Gr&uuml;&szlig;en</p>
<p>(Aus nachvollziehbaren Gr&uuml;nden verzichten wir darauf, Namen und Bild des Autors zu ver&ouml;ffentlichen. Wer mit ihm in Kontakt treten m&ouml;chte, kann dies - &uuml;ber uns &ndash; gerne tun: per E-Mail an <a href="mailto:leserpost@maniac.de)&lt;/blockquote&gt;">leserpost@maniac.de)</a></p>
</blockquote><div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1236" onclick="set_comment_reference(1236)" title="auf diesen Kommentar antworten">#1236</a>:
    09.Apr.2009 02:04
    von
    
      
        <a href="http://www.twitter.com/Chateau_Margaux" target="_blank">
          Tsukama
        </a>
</p>
<p>Ich bedqanke mich bei Dir f&uuml;r diesen Bl&ouml;ogeintrag und bei dem Schreiber des Leserbriefes. In der Hoffnung, dass auch Du nichts gegen weitere Verbreitung Deines Beitrages hast, habe ich ihn getwittert und den Originallink des Leserbriefs.</p>
<p>Nochmals DANKESCH&Ouml;N! Gute Arbeit! Damit vielleicht doch ein paar mehr Leute weiterdenken!</p>

<p class="infos">
<a href="#comment_1237" onclick="set_comment_reference(1237)" title="auf diesen Kommentar antworten">#1237</a>:
    09.Apr.2009 07:04
    von
    
      
        <a href="http://malison.org/archives/1166-Lesebefehl-zum-Thema-Amoklauf.html" target="_blank">
          Lesebefehl zum Thema Amoklauf - h t t p : / / m a l i s o n . o r g
        </a>
</p>
<p>[...]  [...]</p>

<p class="infos">
<a href="#comment_1238" onclick="set_comment_reference(1238)" title="auf diesen Kommentar antworten">#1238</a>:
    10.Apr.2009 01:04
    von
    
      
        <a href="http://macfidelity.de/2009/03/14/unsorted-amok-lesebefehl/" target="_blank">
          Unsorted | Amok-Lesebefehl | macfidelity
        </a>
</p>
<p>[...] lesenswert gleiches gilt f&uuml;r diesen Artikel und auch diesen   Share [...]</p>

<p class="infos">
<a href="#comment_1239" onclick="set_comment_reference(1239)" title="auf diesen Kommentar antworten">#1239</a>:
    10.Apr.2009 01:04
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>Danke - und Respekt an den Urheber des Beitrages</p>

<p class="infos">
<a href="#comment_1240" onclick="set_comment_reference(1240)" title="auf diesen Kommentar antworten">#1240</a>:
    06.May.2009 05:05
    von
    
      
        <a href="http://dieweltwieichsiesehe.wordpress.com/2009/05/06/links-des-tages/" target="_blank">
          Links des Tages &amp;laquo; Die Welt, wie ich sie sehe
        </a>
</p>
<p>[...] Amoklauf - hier gibts einen wirklich ersch&uuml;tternden Brief eines Mannes, der selbst beinahe Amok gelaufen w&auml;re. Besonders empfehlenswert f&uuml;r diejenigen, die bei [...]</p>

<p class="infos">
<a href="#comment_1241" onclick="set_comment_reference(1241)" title="auf diesen Kommentar antworten">#1241</a>:
    05.Jun.2009 07:06
    von
    
      
        <a href="http://dieweltwieichsiesehe.wordpress.com/2009/06/05/keine-killerspiele-keine-amoklaufe/" target="_blank">
          Keine Killerspiele = keine Amokl&auml;ufe &amp;laquo; Die Welt, wie ich sie sehe
        </a>
</p>
<p>[...] aber man schadet damit niemanden &ndash; und zum Thema Amokl&auml;ufe verweise ich noch einmal auf diesen mutigen Leserbrief eines Beinahe-Amokl&auml;ufers, den ich schon einmal verlinkt [...]</p>
</div>