+++
title = "Das, dessen Name nicht genannt werden darf.."
date = "2007-07-17T04:07:00"
author = "Dr. Azrael Tod"
issoid = "blog/309"
aliases = "blog/309"
+++

<p>Warum nicht? Weil das nur noch mehr dem Hype hilft. Aber ich hab mir gedacht ich k&ouml;nnte wirklich mal ein paar Gedanken dazu ausformulieren und hier wiedergeben.. andernseits.. das ist Arbeit, also lass ich es lieber und kopier einfach ein Chatlog hierher.<br/>Denn ein Chatlog kann mehr sagen als 1000 Worte.. zumindest wenn es l&auml;nger als 1000 Worte ist.<br/><br/></p><blockquote>[profmakx] this is the moment<br/>[profmakx] wo man wieder eine herrlich sinnlose diskussion angetreten hat<br/>[profmakx] und pfeiffend davonschleicht<br/>[profmakx] !addfact TURING MUTANT NINJA TURTLES!<br/> [Notiz] fact wurde ergaenzt<br/>[profmakx] Durch ein Versehen wurde nun wohl verraten, dass T-Mobile der Netzbetreiber in Deutschland sein wird, der fu:r Apple das iPhone anbietet. <br/>[Dr_Azrael_Tod] jup<br/>[Dr_Azrael_Tod] seite online stellen mit angeboten und so<br/>[profmakx] ich verstehs einfach nicht<br/>[Dr_Azrael_Tod] ich glaube kaum dass tcom damit ein gro&szlig;es problem hat<br/>[Dr_Azrael_Tod] h&ouml;chstens apple<br/>[Dr_Azrael_Tod] f&uuml;r tcom bedeutet das h&ouml;chstens ein paar vertragsabschl&uuml;sse im vorraus,von leuten die sp&auml;ter darauf hoffen beim 2-j&auml;hrigen wechsel ein neues iphone zu bekommen<br/>[profmakx] ne<br/>[profmakx] ich versteh den hype um das iphone nicht<br/>[Dr_Azrael_Tod] aso<br/>[Dr_Azrael_Tod] musst du auch nicht<br/> hm<br/>[Dr_Azrael_Tod] das ist halt marketing<br/>[Dr_Azrael_Tod] herde in die richtige ecke treiben und so<br/>[Dr_Azrael_Tod] nur dass diesmal die unangepassten geeks einen gro&szlig;teil der herde bilden<br/>[profmakx] hm<br/>[profmakx] aber wenn man sich mal die aritkel ueber den ipropfen anliest<br/>[profmakx] merkt man dass das ding eigentlich nur eins kann<br/>[profmakx] und das auch noch schlecht<br/>[profmakx] ausehen<br/>[Dr_Azrael_Tod] naja...<br/>[Dr_Azrael_Tod] es hat schon ein paar nette features<br/>[Dr_Azrael_Tod] und f&uuml;r &gt;50% der bev&ouml;lkerung ist aussehen enorm wichtig<br/>[Dr_Azrael_Tod] ich kenne genug frauen, die sportwagen m&ouml;gen weil sie so toll aussehen, aber sich nicht im geringsten daf&uuml;r interessieren was f&uuml;r ein motor drin steckt<br/>[Dr_Azrael_Tod] auf dem gebiet ist das kein einzelfall, eher die norm<br/>[Dr_Azrael_Tod] warum nicht auch bei handys? man will angeben mit etwas h&uuml;bschem das man hat<br/>[Dr_Azrael_Tod] die tasche muss ja auch zu den schuhen passen<br/>[Dr_Azrael_Tod] warum dann nicht das handy zur tasche?<br/>[Dr_Azrael_Tod] und das betrifft bei weitem nicht nur frauen (nicht dass jemand meine aussagen als sexistisch falsch versteht)<br/>[profmakx] hach wie individuell<br/>[profmakx] dodally in<br/>[profmakx] iPropfen<br/>[profmakx] mit iTunfisch musik drauf<br/>[Dr_Azrael_Tod] es geht nicht um individualit&auml;t<br/>[Dr_Azrael_Tod] es geht darum dass alle es toll finden<br/>[profmakx] na dann solln die ma schoen dem iPropfen hitnerherwackeln<br/>[Dr_Azrael_Tod] wie sollte man mit etwas individuellem angeben, was man nur selber gut findet?<br/>[profmakx] mit ueberhoehten preisen bei T-Doofline<br/>[profmakx] und ich mach mit meinem telefon was ich mit ienem telefon machen will<br/>[profmakx] TELEFONIEREN<br/>[profmakx] o.o<br/>[Dr_Azrael_Tod] (offensichtliche ausnahmen ala sauteuerem handy mit 10000Karat Diamanten besetzt mal au&szlig;en vor gelassen)<br/>[profmakx] ieks<br/>[Dr_Azrael_Tod] du tust das<br/>[Dr_Azrael_Tod] ich auch<br/>[Dr_Azrael_Tod] und sicher auch jede menge andere<br/>[Dr_Azrael_Tod] aber nicht die breite masse<br/>[Dr_Azrael_Tod] die will statussymbole<br/>[Dr_Azrael_Tod] und iphone ist nunmal eins, nachdem der hype im inet nunmal so stark ist<br/>[Dr_Azrael_Tod] ob es was taugt ist da erstmal egal<br/>[profmakx] jetzt geh mir weg mit deinem realismus<br/>[profmakx] und lass mich in ruhe ueber diesen schrott ranten!<br/>[profmakx] wie koennen menschen nur immer wieder ihre doofheit so offensichtlich zur schau stellen1<br/>[Dr_Azrael_Tod] ich mein nur.. man h&auml;tte apple-aktien kaufen sollen<br/>[Dr_Azrael_Tod] jetzt ists leider bissl zu sp&auml;t<br/>[Dr_Azrael_Tod] lustig find ich auch die frage ob apple ne verbesserte version vom iphone aufn markt schmei&szlig;en wird...<br/>[Dr_Azrael_Tod] nat&uuml;rlich werden die...<br/>[profmakx] aber erst spaeter<br/>[Dr_Azrael_Tod] nur werden sie den teufel tun als irgendwas zu verursachen, was das vor der markteif&uuml;hrung des ersten iphones in s&auml;mmtlichen hauptgebieten zu best&auml;tigen<br/>[profmakx] wenn alle die erste version haben<br/>[profmakx] und dann am besten mit nem anderen partner :)<br/>[profmakx] iPhone 2.0 nur bei vodapfon<br/>[Dr_Azrael_Tod] zumindest wird vodaphone gut daf&uuml;r zahlen<br/>[Dr_Azrael_Tod] aber ich glaub tcom noch besser<br/>[Dr_Azrael_Tod] au&szlig;erdem ist das dann nichts mehr gar so neues mehr<br/>[Dr_Azrael_Tod] es k&ouml;nnte also auch bei mehreren auftauchen</blockquote><br/><br/>Das Log stammt &uuml;brigens aus dem Chan #Zanzibar im EuIRC.
      
    
  