+++
title = "Verspieltes"
date = "2012-12-12T02:12:00"
author = "Dr. Azrael Tod"
tags = ["\"Freie\" Software", "G33KY.de", "Nerdig", "Open Source", "PC"]
issoid = "blog/1571"
aliases = "blog/1571"
+++

<p>Ich hab momentan wieder ein wenig Zeit zum Spielen und hab daher mal wieder rausgekramt was es an Opensource FPS und &auml;hnlichem gerade so gibt.<br/>Dabei sind nat&uuml;rlich jede Menge <a href="/2008/10/1/Shoot@Linux">alte Bekannte</a>, die ich hier nicht noch einmal vorstellen will, aber auch 1-2 Neuzug&auml;nge.</p>
<p></p><h3>RedEclipse</h3><br/><a href="http://redeclipse.net">RedEclipse</a> ist wohl momentan das Spiel f&uuml;r welches die meiste Zeit bei mir drauf geht. Grundlegend ist es nichts weiter als ein Mod (ein Fork des nicht weiter entwickelten <a href="http://sourceforge.net/projects/bloodfrontier/">BloodFrontier</a>) f&uuml;r <a href="http://sauerbraten.org">Cube2: Sauerbraten</a>, ist jedoch deutlich in seiner Spielmechanik ver&auml;ndert worden.

<p>Hauptelemente sind jetzt Mehrfachspr&uuml;nge bzw. das Laufen an W&auml;nden, die komplette Entfernung jeglicher Munition oder Lebensenergie zum aufsammeln und nat&uuml;rlich die st&auml;rkere Verwendung von Nahkampf (Schwerter und Tritte sind nicht l&auml;nger die unpraktischsten Waffen).</p>
<p>Jedenfalls war ich zwischenzeitlich so gelangweilt (und <a href="/2012/12/4/Infrastruktur">internetlos</a>) dass ich mir auch mal wieder den genialen, integrierten Karteneditor, den man von Cube2 vererbt dabei hat, geschnappt habe und <a href="http://g33ky.de/static/games/box.tgz">eine eigene Karte gebaut</a> hab. Mangels sinnvollem Namens mit "box" bezeichnet und auf dem Server auf dem G33KY.de betrieben wird auch spielbar.</p>
<p>Also mal alle "/connect g33ky.de" eingeben und los gehts.</p>
<p>Momentan ist die Karte f&uuml;r Deathmatch recht spielbar, f&uuml;r CTF mit bis zu 4 Teams ertr&auml;glich und f&uuml;r Bomberball und &auml;hnliches noch ungeeignet. Achja: und sie ist h&auml;sslich.</p>
<p></p><h3>UrbanTerror</h3><br/><a href="http://www.urbanterror.info/">UrT</a> ist wohl relativ bekannt so dass ich nicht viel dazu sagen muss. Ein weiterer Mod f&uuml;r Q3A, welcher dank Opensource-Ver&ouml;ffentlichung der Engine allein spielbar ist. Das Projekt orientiert sich wie so viele stark an CounterStrike, ist aber ansonsten ganz ok, wenn man sich erstmal dran gew&ouml;hnt hat dass st&auml;rkere Spieler auch gerne mal in Sekundenbruchteilen via Mehrfachsprung die ganze Karte durchqueren.

<p></p><h3>Xonotic</h3><br/><a href="http://www.xonotic.org/">Xonotic</a> ist eigentlich nur <a href="http://www.alientrap.org/games/nexuiz">Nexuiz</a>. Jener Name ging an eine Firma die Closed-Source-Spiele unter dem Titel entwickeln will, also wurde ein Fork n&ouml;tig. Ge&auml;ndert hat sich nicht sehr viel, aber doch genug um es hier erneut zu nennen.

<p></p><h3>Revenge Of The Cats: Ethernet</h3><br/><a href="http://ethernet.wasted.ch/">ROTC</a> ist ein weiterer FPS, aber die Beschreibung f&auml;llt mir schwer. Wahrscheinlich ist es besser wenn man sich das <a href="http://www.indiedb.com/games/revenge-of-the-cats-ethernet/videos/rotc-ethernet-prototype-5">Video</a> dazu ansieht, vlt. mal ausprobiert und selbst eine Meinung bildet. Es macht Spa&szlig;, leider gibt es selten viele Mitspieler.

<p></p><h3>Zod</h3><br/><a href="http://zod.sourceforge.net/">Zod</a> ist eine Neuimplementierung <a href="http://de.wikipedia.org/wiki/Z_(Computerspiel)">des alten DOS-RTS Z</a>. Ich hab keine Ahnung warum das der Hersteller noch nicht in Grund und Boden geklagt hat, aber es ist jedenfalls geil dass dem so ist.<br/>Endlich kann man die Z-typischen Roboter, Jeeps und Panzer auch unter Linux und via Netzwerk aufeinander hetzen.
      
    
  <div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1599" onclick="set_comment_reference(1599)" title="auf diesen Kommentar antworten">#1599</a>:
    23.Dec.2012 02:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Die <a href="http://g33ky.de/static/games/industrial_complex.tgz">alte Sauerbraten-Karte "Industrial Complex"</a> habe ich jetzt auch mehr schlecht als recht f&uuml;r RedEclipse convertiert und online gestellt. <br/>
Es ist irgendwie sch&ouml;n zu sehen wie man mehrmals komplett unterschiedlich an sowas ran gegangen ist und Karten komplett entgegengesetzt aufgebaut hat.</p>
<p><a href="http://g33ky.de/static/games/box.tgz">Box</a> ist inzwischen auch aktualisiert und sollte f&uuml;r die meisten Spielmodi recht ertr&auml;glich spielbar sein. F&uuml;r das 4. Team in 4-Seitigem CTF/Bomb muss ich mir allerdings noch etwas einfallen lassen, das liegt momentan etwas benachteiligt durch seine Position.</p>
</div>