+++
title = "10 PocketPC-Tools"
date = "2008-09-10T12:09:00"
author = "Dr. Azrael Tod"
issoid = "blog/707"
aliases = "blog/707"
+++

<p>Da ich gerade mal wieder am Rumspielen mit einem PocketPC bin (Meine bessere H&auml;lfte hat sich ein neues Handy zugelegt, ebenfalls auf CE-Basis, ich hab daher ihren alten IPaq H3800 &uuml;berlassen bekommen der nun meinen alten <a href="http://drazraeltod.wordpress.com/2008/06/26/hp-jornada/" target="_blank">Jornada</a> so langsam abl&ouml;st) und wieder feste Programme suche die ich installieren k&ouml;nnte, hier eine kurze &Uuml;bersicht was eigentlich immer drauf sein sollte um die Funktionalit&auml;t des Ger&auml;tes auf ein sinnvolles Niveau zu bringen:<!--more--><br/></p><ol><br/> <li>Mediaplayer - das im Originalzustand vorhandene MS-Teil ist eigentlich gnadenlos entfernt von sinnvoll, besser funktionieren <a href="http://winampaq.softonic.de/pocketpc" target="_blank">Winampaq</a> oder <a href="http://hp.vector.co.jp/authors/VA032810/" target="_blank">GSPlayer</a></li><br/> <li>GB-Emulator - da die nativ vorhandenen Spiele aufgrund der kleinen Zielgruppe meist etwas sparsam ausfallen ist ein Emulator f&uuml;r eine richtige Konsole unumg&auml;nglich. Auf meinem Jornada (SH3-CPU) musste ich meist auf <a href="http://www.revolution.cx/PalmGB.htm" target="_blank">PalmGB</a> (kostenpflichtig) zur&uuml;ckgreifen, auf dem ipaq versuche ich es jetzt mit <a href="http://www.geocities.com/gnuboyce/" target="_blank">Gnuboy</a>.</li><br/> <li>Taschenrechner - klingt trivial, es kann aber manchmal verdammt praktisch sein wenn der Taschenrechner eine Vorrangautomatik besitzt.. meine Empfehlung: <a href="http://www.calculator.org/download.html" target="_blank">Calc98</a></li><br/> <li><a href="http://www.adobe.com/products/acrobat/readerforppc.html" target="_blank">PDF-Reader</a> - Ich habe ein tragbares Ger&auml;t mit kleinem Bildschirm... warum sollte ich keine Ebooks darauf lesen? (<a href="http://drazraeltod.wordpress.com/2008/09/05/filesharing-und-bucher-beletristik/" target="_self">i swore the</a> <a href="http://drazraeltod.wordpress.com/2008/09/08/ebooks/" target="_self">hypocrites oath</a>!)</li><br/> <li>Dateimanager - Der mitgelieferte Explorer ist im Laufe der Zeit tats&auml;chlich erheblich besser geworden, das &auml;ndert aber nichts daran dass <a href="http://www.resco.net/pocketpc/explorer/" target="_blank">RescoExplorer</a> (kostenpflichtig) oder <a href="http://page.freett.com/todamitsu/GSFinderE.htm" target="_blank">GSFinder+</a> (noch besser und kostenlos) dem Ding noch immer um Jahrzehnte vorraus sind.</li><br/> <li>Task-Switcher - Das Wechseln zwischen einzelnen, laufenden Programmen ist nur mit MS-Tools noch immer nahezu unm&ouml;glich. Die meisten PPC-Hersteller liefern daher ihre eigenen Programme mit, aber das beste ist imho noch immer <a href="http://www.scottandmichelle.net/scott/cestuff.html" target="_blank">PocketNav</a>.</li><br/> <li>IP-Telefon - Lohnt sich leider nur auf Ger&auml;ten mit WLAN wirklich (mein Jornada vlt. noch, wenn ich <a href="http://www.skype.com/download/skype/windowsmobile/" target="_blank">Skype</a> auf die 16MB internem Speicher quetschen kann, f&uuml;r den Ipaq fehlt noch eine SD-Wlankarte und Cindys neues Handy kann das nat&uuml;rlich schon von Haus aus)</li><br/> <li>W&ouml;rterbuch - Meine Empfehlung bisher (Tests erfolgten nur unter SH3-Software) <a href="http://pocket-pc-software.penreader.com/de/" target="_blank">SlovoED</a> (leider kostenpflichtig), sofortige Resultate und gut zum durchbl&auml;ttern</li><br/> <li>Web-Browser - Leider kann ich auf diesem Gebiet nicht viele Erfahrungswerte liefern. Was ich aber mit Sicherheit sagen kann ist dass der PocketIE totaler M&uuml;ll ist. Der wurde auch seit meinem Jornada nicht wirklich verbessert. <a href="http://www.opera.com/products/mobile/products/winmobileppc/" target="_blank">Opera</a> soll ganz gut sein und <a href="http://www-archive.mozilla.org/projects/minimo/" target="_blank">Mozilla Minimo</a> soll ebenfalls&nbsp; vorhanden sein.</li><br/> <li>Netzwerktools - Ich hatte schon alle m&ouml;glichen Sachen in dieser Richtung auf meinem Jornada installiert, leider war das meiste grob gesagt M&uuml;ll. Programme die die grunds&auml;tzlichen Funktionen wie Ping, ARP Requests oder Timeserver-Abfragen erm&ouml;glichen gibt es durchaus, doch alles was dar&uuml;ber hinaus geht wird schwer. (Wlan-Entdeckungs-Software gibt es teilweise noch, doch dazu verwende ich lieber mein Notebook.)</li><br/></ol><br/>Diese Liste stellt wie immer keinen Anspruch der Vollst&auml;ndigkeit oder inhaltlicher Richtigkeit.

<p>BTW: das passt doch eigentlich auch ideal zu /home/zeros "<a href="http://www.zeroathome.de/wordpress/open-blog-parade-personal-toolbox/" target="_blank">Personal Toolbox</a>".. auch wenn das Projekt wohl als gescheitert angesehen werden muss weil leider <a href="http://www.zeroathome.de/wordpress/open-blog-parade-personal-toolbox-summary/" target="_blank">kaum jemand mitgemacht hat</a>.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_572" onclick="set_comment_reference(572)" title="auf diesen Kommentar antworten">#572</a>:
    10.Sep.2008 08:09
    von
    
      
        RobVinc
      
    
    
  </p>
<p>S&ouml; mal meinen Mist dazu geb:<br/>
(Hab nen XDA neo auf WM5.0 Basis)<br/>
1. gsplayer, mit der 4GB SD-Karte kommt man gut zurecht mit Mukke<br/>
2. WiFiFoFum, netter WLAN-Finder mit GPS-Unterst&uuml;tzung<br/>
3. GPSVP, kann viele Kartenformate lesen und anzeigen,<br/>
4. TotalCommander CE<br/>
5. PocketXpdf<br/>
6. Putty (ja gibts auch f&uuml;r WM)<br/>
7. Sykpe f&uuml;r WinMobile<br/>
8. SJPhone (Sip-Softphone, bisher allerdings nur zum testen gebraucht)<br/>
9. PocketIRC<br/>
10. PocketDigi, kleines Tool um digitale Modulationsarten im AFU zu nutzen (CW,RTTY,PSK31 etc..)</p>

<p class="infos">
<a href="#comment_573" onclick="set_comment_reference(573)" title="auf diesen Kommentar antworten">#573</a>:
    10.Sep.2008 10:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Wie bereits gesagt (im IRC), hab ich mit GPS-Software keinerlei Erfahrungen da mir bisher immer die n&ouml;tige Hardware gefehlt hat. Meine beiden PPCs haben kein Blauzahn und einen GPS-Empf&auml;nger hab ich hier nur f&uuml;r USB rumliegen.<br/>
An etwas abstrusen Sachen k&ouml;nnte ich noch Freqtune nennen, ein Tool dass T&ouml;ne &uuml;ber das Mikrofon des Ger&auml;tes analysiert. Auch h&auml;tte ich noch alle m&ouml;glichen Midi-Player im Angebot (gr&ouml;&szlig;tenteils auf Chinesisch/Japanisch) und f&uuml;r die ganz verr&uuml;ckten einen PC-Emulator (Mit PC ist hier der original-IBM-PC gemeint), mit letzterem habe ich sogar Maniac-Mansion schneller auf meinem Jornada zum laufen bekommen als via ScummVM.</p>
</div>