+++
title = "Bitte keine Pseudonyme!"
date = "2008-09-10T11:09:00"
author = "Dr. Azrael Tod"
issoid = "blog/687"
aliases = "blog/687"
+++

<p>Mal wieder bin ich auf eine Seite gesto&szlig;en die Kommentare ablehnt welche unter Pseudonym geschrieben sind. Ich habe mich bereits <a href="http://drazraeltod.wordpress.com/about/" target="_self">mehrmals dar&uuml;ber aufgeregt</a> dass ich nicht verstehe was man damit erreichen will und ich plane das heute zu wiederholen.<!--more--></p>
<p>Mein Standardargument ist nat&uuml;rlich immer noch dass mein RL-Name einfach un-fuckin-googlebar ist und alleine in der Kleinstadt aus der ich stamme schon mehrfach in dieser oder sehr &auml;hnlicher Art vorkommt, mein Nickname "Dr. Azrael Tod" aber in dieser speziellen Form nur von weltweit einer einzigen Person so verwendet wird.</p>
<p>Wenn man mich googelt erh&auml;lt man also gr&ouml;&szlig;tenteils sinnvolle Ergebnisse und ich habe mir in den Jahren (seit 1993) die ich diesen Namen verwende wohl doch einen gewissen Ruf (Troll, Spinner und sowas) aufgebaut. Mein Pseudonym ist f&uuml;r mich also das genaue Gegenteil zur Anonymit&auml;t meines echten Namens.</p>
<p>Weiterhin muss ich zu bedenken geben dass die Unterscheidung zwischen Nickname und RL-Namen nicht immer m&ouml;glich ist. Es stellt nat&uuml;rlich kein Problem dar, zu erkennen dass kein Mensch sein Kind Azrael Tod nennen w&uuml;rde, bei Namen wie "Hubert Schmidt" oder "Fritz M&uuml;ller" w&uuml;rde das aber schwieriger.</p>
<p>Alles was man mit derartigen Anforderungen an seine Kommentatoren erreicht, ist diese zu reduzieren. Man gibt sich damit einen Anstrich der Seri&ouml;sit&auml;t der eigentlich unhaltbar und durch keinerlei Tatsachen gest&uuml;tzt ist.</p>
<p>Wie immer ist es schade dass in unserer Gesellschaft so viel Wert auf den Schein gelegt wird und viel weniger auf das was wirklich z&auml;hlt. Gerade f&uuml;r solche F&auml;lle, in denen es den Blogbetreibern darum geht ein gewisses Niveau aufrecht zu erhalten, gibt es doch in allen g&auml;ngigen Systemen die M&ouml;glichkeit einen Backlink auf seine eigene Webseite zu setzen. Dies erm&ouml;glicht es viel effektiver eine Unterscheidung zwischen guten und schlechten Kommentatoren zu realisieren. Etwa genauso sinnvoll w&auml;re eine Unterscheidung anhand dessen, welchen Kommentar die Person abgegeben hat, warum soll man guten Content auf der eigenen Seite l&ouml;schen?.</p>
<p>Vlt. sollte ich gro&szlig;fl&auml;chig fnordige Aktionen zur Data-pollution starten und Seiten die unbedingt meinen RL-Namen erfahren wollen, ohne etwas damit anfangen zu k&ouml;nnen, mit irgendwelchen falschen Angaben zum&uuml;llen. Wahrscheinlich sollte ich es aber lassen.</p>
<p>M&ouml;glicherweise ist dies nur eine weiterer, generationentrennende Relativit&auml;t, vergleichbar vlt. damit dass ich Kiddies aus dem Quakenet schon anhand ihrer Rechtschreibschw&auml;che erkenne und nicht wirklich f&uuml;r ernst nehme, aber da ich diesmal auf der verachteten Seite stehe finde ich das mehr als l&auml;cherlich. (au&szlig;erdem hab ich auch die logischen Argumente, nicht die Gegenseite :P )</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_574" onclick="set_comment_reference(574)" title="auf diesen Kommentar antworten">#574</a>:
    11.Sep.2008 12:09
    von
    
      
        <a href="http://" target="_blank">
          sirsnookie
        </a>
</p>
<p>Ich finde das mit den RealNames auch schwachsinnig - man kann da doch dann alles m&ouml;gliche eintragen - von Betti Busenluder bis Barack Obama. Oder auch Steve Jobs - wer will denn nachweisen das ich nicht so hei&szlig;e?</p>
<p>Ich finde die Blogs nehmen sich wohl ein Tick zu ernst :)</p>
<p>MfG</p>
<p>Betti Jobs lol!</p>

<p class="infos">
<a href="#comment_575" onclick="set_comment_reference(575)" title="auf diesen Kommentar antworten">#575</a>:
    11.Sep.2008 06:09
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>Kenne das eigentlich nur von Mailinglisten. Im speziellen der deutschen Latex Liste. Habe da vor Jahren mal ne strange Diskussion gehabt da einige Teilnehmer exakt diese Forderung stellten.</p>
<p>Den Sinn habe ich bis dato nicht verstanden, wenn ich ihnen nicht sagen will dass ich XY hei&szlig;e, sie meinen Nick fidel aber nicht akzeptieren, kann ich mich jederzeit auch gerne Alfred M&uuml;ller nennen... den angeblichen Mehrwert f&uuml;r die Betreiber sehe ich immer noch nicht.</p>
<p>Sch&ouml;n dass ich nicht der einzige bin der sich &uuml;ber sowas wundert.</p>
<p>Gruss<br/>
FIDEL =)</p>

<p class="infos">
<a href="#comment_576" onclick="set_comment_reference(576)" title="auf diesen Kommentar antworten">#576</a>:
    15.Sep.2008 12:09
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Nicknames sind im Prinzip ja nur der logisch weitergedachte K&uuml;nstlername, sind also genauso personenidentifizierend (ich mag lange W&ouml;rter!) wie ein echter Name.</p>
<p>Ich &uuml;berlege sogar mir in meinen n&auml;chsten Personalausweis meinen Nickname als K&uuml;nstlernamen einzutragen, wenn der alte ja eh schon abl&auml;uft. Dann k&ouml;nnen die mir gar nix mehr wollen, ich zieh dann einfach den "Steht so im Perso!"-Joker.</p>

<p class="infos">
<a href="#comment_577" onclick="set_comment_reference(577)" title="auf diesen Kommentar antworten">#577</a>:
    15.Sep.2008 12:09
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Sorry f&uuml;rs Doppelpost, hab mich so f&uuml;r das Thema interessiert, dass ich mich oberfl&auml;chlich ein wenig informiert hab. Es gibt sogar rechtlichen Anspruch auf ein Pseudonym:</p>
<p>"Der Diensteanbieter hat dem Nutzer die Inanspruchnahme von Mediendiensten und ihre Bezahlung anonym oder unter Pseudonym zu erm&ouml;glichen, soweit dies technisch m&ouml;glich und zumutbar ist. Der Nutzer ist &uuml;ber diese M&ouml;glichkeit zu informieren."<br/>
(Mediendienste-Staatsvertrag &sect;18 (6)</p>
<p>Kann als Quelle momentan leider nur Wikipedia nennen, find jetzt auf die Schnelle den Mediendienste-Staatsvertrag nicht. Wenns bis dahin keiner tut reich ich es morgen nach. Gute Nacht.</p>

<p class="infos">
<a href="#comment_578" onclick="set_comment_reference(578)" title="auf diesen Kommentar antworten">#578</a>:
    15.Sep.2008 09:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>das problem mit "steht so im perso" ist dass es genauso wenig gegen den lokalen admin hilft wie wenn man einen etwas seltsamen rl-namen hat.<br/>
Wer sich nicht durch offensichtliche, logische argumente &uuml;berzeugen l&auml;sst wird auch mit anderen logischen argumenten probleme haben.</p>

<p class="infos">
<a href="#comment_579" onclick="set_comment_reference(579)" title="auf diesen Kommentar antworten">#579</a>:
    15.Oct.2008 06:10
    von
    
      
        <a href="http://nexuslex.wordpress.com/" target="_blank">
          nexuslex
        </a>
</p>
<p>"Der Familienname Tod, h&auml;ufig auch als Abwandlung "Todt" oder "Tot", entstammt dem oberdeutschen Sprachgebrauch und diente als Ortsname f&uuml;r einen Teil des Moores. Zur Namenbildung wurde h&auml;uftig die Art der Wohnst&auml;tte verwandt. Der urspr&uuml;ngliche Namentr&auml;ger wohnte vermutlich nahe eines Moor- oder eines Sumpfgebietes."//http://cms.hans-tod.de/site_old/pages/wir.html</p>

<p class="infos">
<a href="#comment_580" onclick="set_comment_reference(580)" title="auf diesen Kommentar antworten">#580</a>:
    15.Oct.2008 08:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>auch eine Sichtweise... <em>g</em></p>
</div>