+++
title = "Kreativer Suizid: Koffein"
date = "2008-12-04T09:12:00"
author = "Dr. Azrael Tod"
tags = ["Nerdig", "Technik"]
issoid = "blog/1098"
aliases = "blog/1098"
+++

<p>Vor einigen Jahren habe ich bereits einmal ausgerechnet welche Dosis an Koffein man mit einer Tasse eines beliebigen Getr&auml;nks aufnimmt und welche Menge der verschiedenen Getr&auml;nke man braucht um die LD50 (die Dosis die bei 50% der Probanden lethal wirkt) zu erreichen.</p>
<p>Heute will ich das nochmal klarer aufgeschl&uuml;sselt wiederholen.<!--more-->Fangen wir bei der LD50 an: eine kurze Recherche ergab dass die&nbsp;orale&nbsp;<a href="http://de.wikipedia.org/wiki/Letale_Dosis" title="Letale Dosis">LD<sub>50</sub></a>&nbsp;bei 381 Milligramm pro Kilogramm K&ouml;rpergewicht liegt. Es handelt sich allerdings um den Wert f&uuml;r Ratten, irgendwie sind die &Auml;rzte schwer dazu zu bewegen das mal richtig realistisch mit menschlichen Probanden zu verifizieren.</p>
<p>Nun zum Koffeingehalt:</p>
<p>&nbsp;<br/></p><ul><br/> <li>Eine Tasse mit 125 ml Filterkaffee enth&auml;lt ca. 80&ndash;100mg Koffein.</li><br/> <li>Eine kleine Tasse&nbsp;<a href="http://de.wikipedia.org/wiki/Espresso" title="Espresso">Espresso</a>&nbsp;(30 ml) etwa 40&nbsp;mg Coffein.</li><br/> <li>Eine Tasse Schwarztee kann je nach Zubereitungsart bis zu 50&nbsp;mg enthalten.</li><br/> <li><a href="http://de.wikipedia.org/wiki/Energy-Drink" title="Energy-Drink">Energy-Drinks</a>&nbsp;wie &bdquo;<a class="mw-redirect" href="http://de.wikipedia.org/wiki/Red_Bull_Energy_Drink" title="Red Bull Energy Drink">Red Bull</a>&ldquo; (etwa 32&nbsp;mg/100&nbsp;ml)</li><br/> <li><a href="http://de.wikipedia.org/wiki/Cola" title="Cola">Cola</a>-Getr&auml;nke (mit 6&ndash;25&nbsp;mg/100&nbsp;ml),&nbsp;&bdquo;<a class="mw-redirect" href="http://de.wikipedia.org/wiki/Coca_Cola" title="Coca Cola">Coca Cola</a>&ldquo; und &bdquo;<a href="http://de.wikipedia.org/wiki/Pepsi" title="Pepsi">Pepsi Cola</a>&ldquo;: 10&nbsp;mg/100 ml</li><br/> <li>Coffeintabletten enthalten meistens 100 bis 200&nbsp;mg Coffein</li><br/> <li>Selbst&nbsp;<a href="http://de.wikipedia.org/wiki/Kakao" title="Kakao">Kakao</a>&nbsp;enth&auml;lt mit ungef&auml;hr 6&nbsp;mg pro Tasse ein wenig Coffein</li><br/></ul><br/>Um einen Menschen mit 75Kg K&ouml;rpergewicht mit 50%iger Wahrscheinlichkeit zu t&ouml;ten br&auml;uchten wir also grob 36g Koffein.

<p>Das enstpr&auml;che grob:<br/></p><ul><br/> <li>360 - 450 Tassen Kaffee &aacute; 125ml = 45-56l Kaffee</li><br/> <li>900 Tassen Espresso = 27l Espresso</li><br/> <li>721 Tassen starken Schwarztee</li><br/> <li>113l Red Bull</li><br/> <li>360l Cola</li><br/> <li>18-36 Coffeintabletten (das ist erstmalig fast schaffbar)</li><br/> <li>6012 Tassen Kakao (sp&auml;testens hier wirds abstrus)</li><br/></ul><br/>&nbsp;

<p>Im Nachhinein musste ich dann noch feststellen dass auch f&uuml;r Menschen andere LD50-Werte angegeben werden. Im Normalfall geht man von&nbsp;ungef&auml;hr 10 Gramm Koffein aus, spricht also je nach Konstitution und Gew&ouml;hnung von 5-30g die ausreichen sollten um einen Menschen zu t&ouml;ten. Das bedeutet etwa 100 Tassen Kaffee (50-300 Tassen/Tag).</p>
<p>Diese Werte klingen zwar erstmal niedriger, jedoch ist auch kein K&ouml;rpergewicht daf&uuml;r angegeben. Wenn dem so w&auml;re, k&ouml;nnte man die Rattendaten in eine Relation setzen.</p>
<p>Abschlie&szlig;end kann man sagen dass es mit koffeinhaltigen Getr&auml;nken verdammt schwer wird jemanden umzubringen... Koffeintabletten sind effektiver, aber man braucht noch immer eine verdammt gro&szlig;e Menge von den Dingern.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_950" onclick="set_comment_reference(950)" title="auf diesen Kommentar antworten">#950</a>:
    04.Dec.2008 09:12
    von
    
      
        <a href="http://dc6xs.de" target="_blank">
          RobVinc
        </a>
</p>
<p>Sch&ouml;ne AUfstellung, allerdings sollte man mal &uuml;berlegen ob $Human_beeing nicht nach Genuss von 360l Cola nicht an einer Aufl&ouml;sung von innen oder an einer Wasservergiftung stirbt.</p>
<p>Auch darf man nicht vergessen, dass Coffeein ja ein Blutdruck anhebender Wirkstoff ist, also vielleicht ist auch vorher schon durch eine Vorerkrankung o.&auml;. ein kritischer Zustand erreicht.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_951">
<p class="infos">
<a href="#comment_951" onclick="set_comment_reference(951)" title="auf diesen Kommentar antworten">#951</a>:
    04.Dec.2008 09:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Sicher... ich w&uuml;rde 6012 Tassen Kakao sicher auch schon aus Milch-Gr&uuml;nden nicht verkraften.<br/>
Es ging ja auch nur erstmal um den LD50 bei Koffein, es steht ja auch schon da dass eine gewisse Prozentzahl an Leuten schon bei 5g stirbt.<br/>
Das Ganze bildet halt wie immer und &uuml;berall eine h&uuml;bsche Glockenkurve und wenn man am falschen Ende ist, k&ouml;nnte man als sehr unwahrscheinlicher Fall vlt. sogar an einer Tasse Kaffee sterben.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_952">
<p class="infos">
<a href="#comment_952" onclick="set_comment_reference(952)" title="auf diesen Kommentar antworten">#952</a>:
    04.Dec.2008 01:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ein weiterer interessanter Link zum Thema w&auml;re wohl das "caffeine data sheet" &uuml;ber das ich gerade auf der Suche nach der LDlo gestolpert bin. LDlo bezeichnet in diesem Falle die geringste, bekannte t&ouml;dliche Dosis.<br/>
Oral eingenommen w&auml;ren das: 192 mg pro kg K&ouml;rpergewicht bei Erwachsenen oder 320 mg/kg bei Kindern.</p>
</div>
</li>
</ul>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_953" onclick="set_comment_reference(953)" title="auf diesen Kommentar antworten">#953</a>:
    08.Dec.2008 04:12
    von
    
      
        <a href="http://mac-and-mobile.de" target="_blank">
          schubi
        </a>
</p>
<p>au mann, toller artikel ^^<br/>
pass nur auf, irgendwann stolpert hollywood dr&uuml;ber und dann sehen wirs bei csi und konsorten</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_954">
<p class="infos">
<a href="#comment_954" onclick="set_comment_reference(954)" title="auf diesen Kommentar antworten">#954</a>:
    08.Dec.2008 08:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Na super.. da freu ich mich ja auch schon drauf. So wie sich CSI bisher an irgendwelche realit&auml;tsnahen Dinge gehalten hat k&ouml;nnen wir dann sicher sehen wie jemand mit einer Tasse zu starkem Kaffee eine Koffeinvergiftung erleidet.</p>
<p>Bytebl&ouml;cke in IPv4-Adressen k&ouml;nnen ja auch Werte oberhalb von 300 ergeben, dann geht sowas sicher auch. -.-</p>
</div>
</li>
</ul>
</div>