+++
title = "Ernährung & Diät"
date = "2009-03-09T01:03:00"
author = "Dr. Azrael Tod"
issoid = "blog/1298"
aliases = "blog/1298"
+++

<p>Immer wieder kommen Leute mit ganz tollen, neuen, "wissenschaftlichen" Erkentnissen daher und versuchen mir ein Gespr&auml;ch &uuml;ber irgendwelche neuen Lebensmittel ans Knie zu nageln.</p>
<p>Dabei kann es sich um ganz tolle Di&auml;tprodukte handeln die auf "nat&uuml;rlichem Wege" den Hunger reduzieren, um Pflanzen die genauso toll wie das Originalprodukt schmecken und nur die H&auml;lfte des Brennwertes haben oder um irgendwelche Wunderwirkstoffe die wie Zauberrei dazu f&uuml;hren dass man sofort mehr Energie verbrennt und schlagartig abnimmt.<!--more--><br/>Leute, fangt doch bitte an zu denken! Es gibt keinen Wunderpilz der eure Pfunde purzeln l&auml;sst obwohl ihr euch den ganzen Tag mit Hamburgern und Schokolade vollstopft.</p>
<p>Jedes eurer Argumente hat man schonmal geh&ouml;rt, sei es dass das Naturvolk Foobar sich schon seit tausenden Jahren davon ern&auml;hrt. - Ich kenne V&ouml;lker die sich von Menschenfleisch, Vogelspinnen, <a href="http://de.wikipedia.org/wiki/Fugu" target="_blank">giftigen Fischen</a> oder Hamburgern (<a href="http://www.youtube.com/watch?v=4w9EksAo5hY" target="_blank">Amerika ist wunderbar!</a> \o/) ern&auml;hren, aber nur weil die es tun ist es noch lange nicht gesund.<br/>Nat&uuml;rlich kennen die Foobar auch keinerlei Krankheiten und werden mindestens 150 Jahre alt! - Und warum habe ich dann noch nie von ihnen geh&ouml;rt? Warum ist dieses Ph&auml;nomen der Welt&ouml;ffentlichkeit die ganzen "Jahrtausende" verborgen geblieben? Das war doch sicher wieder irgendeine Verschw&ouml;rung der Lebensmittel- und Medizinindustrie!</p>
<p>Nat&uuml;rliche S&uuml;&szlig;stoffe wie <a href="http://de.wikipedia.org/wiki/Stevia_rebaudiana" target="_blank">Stevia</a> sind auch immer toll... Nat&uuml;rlich, die schmecken s&uuml;&szlig; und machen nicht dick! Der einzige Grund dass wir die in Deutschland nicht &uuml;berall verkaufen ist doch ganz eindeutig dass irgendeine Chemiefirma das nicht will!!!!!!11111einseinself - Die einfache Idee dass wir das Zeug nicht zugelassen haben weil es keine Langzeitstudien gibt die die unbedenklichkeit wirklich belegen ist einfach zu abstrus um wahr zu sein. Die EU ist ja sonst auch immer so schnell! *g&auml;hn*</p>
<p>Aber selbst wenn das Zeugs funktioniert... ihr habt dann einen weiteren Stoff der S&uuml;&szlig; schmeckt aber nicht sonderlich viel Kohlehydrate enth&auml;llt. Ganz toll! Davon gibt es ja auch noch nicht genug zugelassene! Aber sehen wir einfach mal nach was Wikipedia zu solchem Zeugs sagt:<br/></p><blockquote> Studien

<p>Im Jahr 1986 berichtete ein britisches Forscherteam (Blundell/Hill) im Magazin The Lancet von einem Versuch, bei dem die Testpersonen nach dem Trinken von mit S&uuml;&szlig;stoff angereichertem Wasser &uuml;ber st&auml;rkere Hungergef&uuml;hle berichteten als nach dem Trinken derselben Menge reinen Wassers. Es wurde jedoch nicht ermittelt, wie viel die Testpersonen sp&auml;ter tats&auml;chlich a&szlig;en. Seitdem haben zahlreiche Studien die m&ouml;gliche Wirkung von k&uuml;nstlichen S&uuml;&szlig;stoffen auf Appetit und Hunger untersucht, wobei die gro&szlig;e Mehrzahl die 1986 aufgestellte Hypothese nicht best&auml;tigte bzw. widerlegte. Au&szlig;er Blundell/Hill fand nur eine Studie Hinweise auf eine appetitsteigernde Wirkung, und zwar bei einem Test mit Kaugummi. Eine Meta-Analyse aus dem Jahr 2007 listet 19 Studien auf, von denen drei eine appetitsteigernde und drei eine appetitmindernde Wirkung angeben, alle &uuml;brigen ergaben keinen Einfluss von S&uuml;&szlig;stoff auf Hunger und Kalorienaufnahme.</p>
<p>Mit Bezug auf Blundell/Hill wurde die Hypothese aufgestellt, dass S&uuml;&szlig;stoffe ebenso wie Zucker eine verst&auml;rkte Aussch&uuml;ttung von Insulin kurz nach ihrer Aufnahme bewirken (cephalische Insulinreaktion), obwohl diese im Gegensatz zu Zucker und Kohlenhydraten keine Kalorien enthalten und dem K&ouml;rper keine Glucose zuf&uuml;hren. Kurze Zeit sp&auml;ter komme es dann zu einem starken Abfall des Blutzuckerspiegels, was die Hungergef&uuml;hle erkl&auml;re. In mehreren Versuchen wurde jedoch dieser Effekt nicht best&auml;tigt.</p>
<p>Ebenfalls basierend auf Blundell/Hill wurde die Theorie aufgestellt, dass die Verwendung von S&uuml;&szlig;stoff zu einer verst&auml;rkten Kalorienaufnahme f&uuml;hre und dadurch &Uuml;bergewicht f&ouml;rdere. Begr&uuml;ndet wurde dies zum einen mit der Hypothese der Appetitsteigerung, zum anderen mit der Theorie des kompensatorischen Essverhaltens, wonach der K&ouml;rper eingesparte Kalorien bei einer Mahlzeit durch verst&auml;rkte Kalorienaufnahme bei sp&auml;teren Mahlzeiten ausgleiche bzw. &uuml;berkompensiere. Die meisten Studien ergaben jedoch nur eine geringe Energiekompensation im Zusammenhang mit S&uuml;&szlig;stoffen, im Durchschnitt betrug sie nur 32 Prozent.</p></blockquote><br/>Egal welche Studien jetzt recht haben.. mein gesunder Menschenverstand sagt mir bereits dass es nicht sinnvoll sein kann meinen K&ouml;rper derartig zu verarschen. Wenn mein K&ouml;rper etwas S&uuml;&szlig;es will um seine Energievorr&auml;te aufzuf&uuml;llen und ich ihn mit Wirkstoffen &uuml;bers Ohr hau, an die ich evolution&auml;r nie gewohnt war, dann muss das irgendwelche Auswirkungen haben.

<p>Vlt. sollte man sich einfach dran gew&ouml;hnen weniger Energie zu brauchen.. Vlt. sollte man wirklich mal weniger Essen und sich mehr bewegen. Vlt. sollte man all diese Ideen ignorieren und sich einfach damit abfinden dass man nicht die selben (&uuml;brigens absolut ungesunden) Ma&szlig;e hat wie die tagelang Photoshopbearbeiteten Frauen auf irgendwelchen Titelbildern. (Schon garnicht als Kerl)</p>
<p>Egal was man sollte... Geht mir gef&auml;lligst nicht permanent auf den Sack mit eueren neuen Erkenntnissen und Theorien! Sie sind nicht neu! Das war alles schon tausendmal da und wird auch weiterhin immer wieder durch die Presse geistern. Wenn man die Eigenwahrnehmung genug mit falschen Bildern manipuliert hat, verkauft sich sowas scheinbar ziemlich gut und wenn ihr bl&ouml;d genug seid darauf reinzufallen, bedeutet das noch lange nicht dass ich es bin.</p>
<p>Di&auml;ten und Ern&auml;hrungsberatung sind eine Industrie. Nur weil ihr statt teuere Fettabsaugungen zu bezahlen lieber die Ratenzahlung in Form von Kursen, Zeitschriften, B&uuml;chern, Mittelchen, Blument&ouml;pfen, Reisen, Beratungssitzungen und wasauchimmer in kauf nehmt... es ist genau der selbe Bl&ouml;dsinn!</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1191" onclick="set_comment_reference(1191)" title="auf diesen Kommentar antworten">#1191</a>:
    10.Mar.2009 09:03
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>hrhr ^^<br/>
jaja, die Liebe Ern&auml;hrung und Co.</p>
<p>Vom J&auml;ger zum Sammler zum Konsumenten. Eine Entwicklung, die einen missing Link beinhaltet, denn es kam abrupt und nicht flie&szlig;end.<br/>
Ich bin der Meinung, man soll sich so ern&auml;hren, wie man sich dabei wohl f&uuml;hlt. Die Bewegung dabei ist nat&uuml;rlich nicht ausser Acht zu lassen ... allerdings auch nicht immer ganz so einfach zu generieren -.-<br/>
Ich will z.B. mit dem Laufen anfangen, Radfahren in der Stadt ist nicht mein Ding. Aber wenn ich von 5 Uhr morgens bis 20 Uhr Abends unterwegs bin, hab ich abends echt kaum noch Mu&szlig;e f&uuml;r ein paar Schritte.</p>
<p>Naja, Mutters Schr&auml;nke stehen hoffenltich bald alle. Komme mir langsam vor, als wenn ich ein ganzes Hotel verschraubt habe ^^</p>

<p class="infos">
<a href="#comment_1192" onclick="set_comment_reference(1192)" title="auf diesen Kommentar antworten">#1192</a>:
    10.Mar.2009 04:03
    von
    
      
        <a href="http://letsmakethislinkb0rken.com" target="_blank">
          Nina
        </a>
</p>
<p>Hi, kann Dir nur voll und ganz zustimmen. Jeder ist f&uuml;r seinen K&ouml;rper selber verantwortlich. Und wenn man viel mehr fri&szlig;t als der K&ouml;rper braucht, dann ist es kein Wunder das man zunimmt. Da man den Energieverbrauch mit Bewegung steigern kann ist auch keine Neuigkeit. Und wenn man Abnehmen will, dann mu&szlig; man eben was &auml;ndern.</p>
<p>Wenn man nichts &auml;ndert und weiterhin mehr fri&szlig;t als der K&ouml;rper braucht und gleichzeitig wenig bis keine Bewegung macht - dann bleibt das &Uuml;bergewicht eben die Realit&auml;t und Abnehmen der Traum. Ich seh das in meinem Beruf tagt&auml;glich... aber die Menschen glauben einfach gern an Wunder - und solange sie das tun, werden sich Wunder-Di&auml;ten weiterhin gut verkaufen ;-)</p>

<p class="infos">
<a href="#comment_1193" onclick="set_comment_reference(1193)" title="auf diesen Kommentar antworten">#1193</a>:
    10.Mar.2009 04:03
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          SirSnookie
        </a>
</p>
<p>Kinder haften f&uuml;r ihre Links, liebe Nina - vielen Dank f&uuml;r deinen Spam (ja dein Link/deine Webseite). Mich w&uuml;rd es nicht wundern, wenn du auf der falschen Seite mal einen solchen "Spam" hinterl&auml;sst und im nach hinein eine sch&ouml;ne Rechnung nach hause bekommst :)</p>
</div>