+++
title = "Hilfe mit OpenSource-Produkten"
date = "2008-10-16T04:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/952"
aliases = "blog/952"
+++

<p>Was mir bereits mehrmals negativ aufgefallen ist, ist das Verhalten was OpenSource-Communitys an den Tag legen wenn jemand um Hilfe bittet. Weil ich gerade mal wieder &uuml;ber <a href="http://www.symfony-project.org/forum/index.php/m/60021/" target="_blank">ein sehr gutes Beispiel</a> gestolpert bin muss ich jetzt mal meine &Uuml;berlegungen dazu &auml;u&szlig;ern.<!--more--></p>
<p>Einerseits ist nat&uuml;rlich klar dass viele Personen dort freiwillig an einem Projekt mitarbeiten und sich niemand verpflichtet hat irgendeine Leistung zu erbringen. Auf der anderen Seite gibt es aber auch viele Firmen die einfach ihre Projekte als OpenSource deklarieren und bei allem was Support oder Nutzeranfragen (z.B. implementiert mal bitte XYZ) betrifft die Verantwortung von sich schieben.<br/>Es ist ja beinahe Gemeingut und jeder andere k&ouml;nnte auch helfen...</p>
<p>So funktionier das aber leider nicht! Wenn man will dass ein Produkt verwendet wird, reicht es nicht eine besonders lange Liste an Features zu haben, man muss das Produkt auch wirklich verwenden k&ouml;nnen.<br/>Alles andere f&uuml;hrt zwar evtl. dazu dass sich mal jemand das Projekt grunds&auml;tzlich ansieht, wenn man aber auf eine solche Haltung st&ouml;&szlig;t wird das den Spa&szlig; an der Arbeit damit nicht gerade erh&ouml;hen.</p>
<p>Nat&uuml;rlich sind normale Projekte nicht immer besser... eher das Gegenteil ist der Fall. Aber gerade OpenSource hat noch immer mit dem Vorurteil zu k&auml;mpfen dass sich niemand f&uuml;r das Projekt verantwortlich f&uuml;hlen w&uuml;rde. Dies ist z.B. einer der Hauptgr&uuml;nde warum viele gro&szlig;e Firmen noch immer Windows statt Linux einsetzen.<br/>Die Anschaffungskosten sind bei Gro&szlig;projekten erstmal zu &uuml;berschauen, daher ist dieses Argument meist nicht so wichtig, aber wer kann schon sagen welche Personalzeit (und damit Geld) es kosten wird wenn ein Problem auftritt?<br/>Microsoft ist ein direkter Ansprechpartner, wenn man genug Geld an diese Firma gezahlt hat werden die sicher bereit sein zu helfen damit man weiter bezahlt und an das Produkt gebunden bleibt.<br/>(Rein auf Betriebssysteme bezogen ist dieser Vorteil von Windows gegen&uuml;ber Linux nat&uuml;rlich rein ideeller Natur, es gibt durchaus auch Linux-Distributoren die sich um ihre Kunden k&uuml;mmern.)</p>
<p>Wenn also das Vorurteil vorherrscht dass sich bei OpenSource niemand verantwortlich f&uuml;hlt... dann MUSS ich als Anbieter darauf reagieren und besseren Support bieten als vergleichbare Closed-Source-Projekte.<br/>Nach 2 Tagen Wartezeit auf eine einfache Antwort und einer verst&auml;ndlichen Reaktion seitens des Fragestellers (ca. "Der Support ist hier ganzsch&ouml;n fix...") dann noch mit einer schnippischen Antwort zu kommen, dass er als Neuling doch erstmal lernen sollte wie er mit einer solchen Community umzugehen hat, ist da sicher nicht hilfreich.</p>
<p>Wenn mir nat&uuml;rlich egal ist ob das Projekt jemals von jemandem anders verwendet wird ist dies alles egal. Ich glaube allerdings nicht dass Firmen oft Geld in derartige Sachen stecken.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_761" onclick="set_comment_reference(761)" title="auf diesen Kommentar antworten">#761</a>:
    16.Oct.2008 11:10
    von
    
      
        <a href="http://www.markuswalther.org" target="_blank">
          Markus
        </a>
</p>
<p>ich finde es auch traurig, was manchmal in foren so abgeht... einerseits tuen alle so als h&auml;tten sie ahnung und k&ouml;nnten helfen und auf der anderen seite kommen dann nur unbrauchbare kommentare anstatt sinnvoller hilfen.</p>
<p>ich behebe seit jahren meine probleme damit, dass ich bei google so lange suche bis ich eine l&ouml;sung f&uuml;r mein problem gefunden habe oder ich bastle so lange bis es funktioniert. ich m&ouml;chte mich nicht herablassen und als "noob" beschimpfen lassen, nur weil ich vielleicht eine (in den augen anderer) "dumme" frage stelle, das habe ich nicht n&ouml;tig ;-)</p>

<p class="infos">
<a href="#comment_762" onclick="set_comment_reference(762)" title="auf diesen Kommentar antworten">#762</a>:
    16.Oct.2008 11:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Naja, ich sehe Foren auch seit einigen Jahren schon nichtmehr als Ideall&ouml;sung an. Das liegt nicht unbedingt nur an der Mentalit&auml;t die sich dort meist findet. Sondern auch daran dass Foren leider oft auch die erste Anlaufstelle f&uuml;r Personen sind, die ich selbst als "Noobs" einsch&auml;tzen w&uuml;rde.</p>
<p>Wenn man wirklich eine komplexere Frage hat, die sich mit Google nicht l&ouml;sen l&auml;sst w&uuml;rde ich zuerst im IRC nachsehen, ob es einen Projektspezifischen Channel gibt.</p>
<p>Foren sind dann eher die ultima ratio, da es dort bis zu einer brauchbaren Antwort auf kompliziertere Fragen eh meist l&auml;nger dauert als IRGENDJEMANDEM hilfreich ist.<br/>
Dies k&ouml;nnte auch daran liegen dass die Projektbetreiber meist selbst in ihren Foren nur SEHR sporadisch auftauchen.</p>
</div>