+++
title = "Kontaktfindungsportal"
date = "2008-10-16T12:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/950"
aliases = "blog/950"
+++

<p>Snookie stellt <a href="http://www.wangoo.de/2008/10/die-freundin-aus-dem-internet/" target="_blank">auf dem Wangoo-Blog</a> mal die Vor- und Nachteile von Flirtseiten gegen&uuml;ber.</p>
<p>Ich selbst habe bis vor anderthalb Jahren (Viele liebe Gr&uuml;&szlig;e gehen an dieser Stelle&nbsp; an meine bessere H&auml;lfte <a href="/author/cindydavid/" target="_self">Cindy</a> *g*) ausgiebig Erfahrungen mit derartigen Seiten (allerdings nur kostenlose) gemacht und bilde mir ein auch dazu meinen Senf abgeben zu m&uuml;ssen.<!--more--></p>
<p>Wie Snookie bereits im letzten Absatz bemerkt, sollte man stark zwischen "Kennenlernen im Internet" und dem Start einer echten Beziehung unterscheiden:<br/></p><blockquote>Ebenfalls find ich es wichtig, das man sich immer erst vor Augen f&uuml;hren sollt, das dass Gegen&uuml;ber per Internet immer schlecht einzusch&auml;tzen ist. Auch sollte man vor einem Treffen sich per Telefon vergewissern ob das Gegen&uuml;ber auch wirklich von dem Geschlecht ist, welches man auf dem Bild sieht. Fakes sind auch in zahlenden Communitys nicht unbedingt selten.</blockquote><br/>Ich finde sogar dass dies eindeutig unter Nachteile geh&ouml;rt, da es einigen Leuten wirklich schwer f&auml;llt derartige Kontaktfindungsseiten (Den Begriff finde ich passender) als das Mittel zu sehen das sie darstellen.

<p>Man kann prima Personen in der N&auml;he dar&uuml;ber vorfiltern und mit ihnen ein Treffen vereinbaren. Was dann daraus wird sollte man auf KEINEN FALL vorher planen, das geht eigentlich immer schief.</p>
<p>Ich schreibe das aus bitterer Erfahrung, weil ich etliche Personen aus meiner sozialen Umgebung kenne die das nach dutzendfacher, schlechter Erfahrung offensichtlich noch immer nicht verstanden haben.</p>
<p>Sehr beliebt ist also immer noch die Unsitte jemandem seine Liebe zu gestehen den man noch nie getroffen hat.</p>
<p>Aus diesen Gr&uuml;nden bin ich stark daf&uuml;r den irref&uuml;hrenden Begriff "Flirtseite" oder gar "Partnerb&ouml;rse" nicht zu verwenden. Es geht nicht um Flirt oder Partner. Es geht um neue Kontakte. Es geht darum mit irgendjemandem mal einen Kaffee trinken oder in die Disco zu gehen. Es kann sogar darum gehen in einer neuen Stadt einfach Freunde zu finden.</p>
<p>Wahrscheinlich ist dies auch mit der Grund warum ich mit "normalen" Sozialen Netzwerken und lokalen Seiten erheblich bessere Ergebnisse erziehlt habe als mit Seiten bei denen schon Flirt in der &Uuml;berschrift stand: Die anderen gehen automatisch auch mit einer anderen, ich w&uuml;rde sogar sagen erheblich ges&uuml;nderen, Einstellung an die Sache.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_759" onclick="set_comment_reference(759)" title="auf diesen Kommentar antworten">#759</a>:
    17.Oct.2008 12:10
    von
    
      
        <a href="http://ag7.alltagsgrauen.info" target="_blank">
          fwolf
        </a>
</p>
<p>ehrlich gesagt nutze ich - und offenbar viele andere Leute - verschiedenste Variationen von "Flirtsites" als ganz normale Community und eben zur Kontaktaufnahme, wie schon von dir beschrieben - so z.B. MetalFlirt o.&auml;.</p>
<p>cu, w0lf.</p>

<p class="infos">
<a href="#comment_760" onclick="set_comment_reference(760)" title="auf diesen Kommentar antworten">#760</a>:
    17.Oct.2008 01:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ich kann daran auch &uuml;berhaupt nichts falsches finden ;-)</p>
</div>