+++
title = "Was vertragen wir?"
date = "2008-10-16T12:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/948"
aliases = "blog/948"
+++

<p>In meinem Beitrag <a href="http://drazraeltod.wordpress.com/2008/10/15/schrecken-ohne-ende-oder-ende-mit-schrecken/">"Schrecken ohne Ende oder Ende mit Schrecken?"</a> habe ich die These aufgestellt dass unser System einem totalem Kollaps sehr nahe ist. Sp&auml;ter ist mir dann die Idee gekommen dass dies wahrscheinlich nicht ein Sonderfall sondern viel eher der Standard ist auf dem sich beliebige Staatssysteme aufgrund von Gesetzm&auml;&szlig;igkeiten einpendeln M&Uuml;SSEN!<!--more--></p>
<p>Dieser Gedanke ist nat&uuml;rlich nicht neu, bereits <a href="http://de.wikiquote.org/wiki/Kurt_Tucholsky" target="_blank">Kurt Tucholsky</a> bemerkte in einem Brief an Dr. Hedwig M&uuml;ller (29. M&auml;rz 1934, Ver&ouml;ffentlicht in: "Briefe aus dem Schweigen", S. 97):<br/></p><blockquote>Eine Regierung ist nicht der Ausdruck des Volkswillens, sondern der Ausdruck dessen, was ein Volk ertr&auml;gt.</blockquote><br/>Ich denke darin liegt sehr viel Wahrheit, allein schon die Faulheit des Menschen verursacht dass er nicht gegen etwas ertr&auml;gliches ernsthafte Schritte unternehmen wird. Die perfekte Welt ist also ein Traum von dem wir stundenlang schwelgen k&ouml;nnten, doch kaum jemand wird ernsthaft aufstehen und wirkungsvolle Ma&szlig;nahmen ergreifen um diesem Ziel n&auml;her zu kommen.

<p>Auf der anderen Seite wird ein Regierungsapparat immer die Grenzen abtasten wie weit er gehen kann. Bei einer Diktatur wird dies sicherlich schneller vorran schreiten als bei einer Demokratie, da hier zumindest der Schein gewahrt werden muss das Volk h&auml;tte ernsthaft etwas zu sagen, doch am Ergebnis &auml;ndert dies nichts.<br/>Irgendwann wird die Regierung zu weit gehen und das Volk wird den Zustand als unertr&auml;glich wahrnehmen. Ab diesem Punkt wird beim leisesten Ausl&ouml;ser das System zusammenfallen und durch ein neues ersetzt. H&auml;ufig ist dieser Ausl&ouml;ser eine Person die die Zeichen der Zeit erkannt hat und das Volk zu steuern wei&szlig;... das f&uuml;hrt dann auch gleich zur n&auml;chsten Diktatur.</p>
<p>M&ouml;glicherweise sollten wir die Qualit&auml;t eines Systemes danach messen, wie sehr es in der Lage ist sich zu fangen wenn es eine offensichtliche Grenze erreicht hat und diese Grenze wieder zu unterschreiten. In unserem System w&auml;re ein typisches Beispiel wohl wenn Politiker massive W&auml;hlerverluste bef&uuml;rchten und aufgrund dessen doch mal was f&uuml;r das Volk statt gegen es unternehmen.<br/>Diese Qualit&auml;t entscheidet wie lange ein System bestehen bleiben kann. Das &auml;ndert nat&uuml;rlich nichts daran dass kein System ewig besteht. Irgendwann wird immer jemand zu weit gehen...</p>
