+++
title = "Schlechte Kopien von Argumenten"
date = "2009-06-24T09:06:00"
author = "Dr. Azrael Tod"
issoid = "blog/1414"
aliases = "blog/1414"
+++

<p><a href="http://www.piratenpartei.de/node/782" target="_blank">Sicherlich </a><a href="http://blog.windfluechter.net/index.php?/archives/567-Dirk-Hillbrecht-bei-Unter-den-Linden,-Phoenix.html" target="_blank">hat </a><a href="http://blog.windfluechter.net/index.php?/archives/566-TV-Tip-Unter-den-Linden,-Phoenix,-heute-2215.html" target="_blank">inzwischen </a><a href="http://blog.koehntopp.de/archives/2518-Falscher-Planet,-falsches-Jahrtausend.html" target="_blank">jeder</a> <a href="http://www.presseschauer.de/?p=760" target="_blank">von </a>euch mitbekommen dass "Mo, 22.06.09, 22.15 - 23.00 Uhr auf Phoenix" eine <a href="http://www.phoenix.de/content/phoenix/die_sendungen/diskussionen/unter_den_linden/251772?datum=2009-06-22" target="_blank">Folge von Unter den Linden</a> lief, in der<a href="http://de.wikipedia.org/wiki/Rupert_Scholz" target="_blank"> Prof. Rupert Scholz (CDU)</a> und <a href="http://de.wikipedia.org/wiki/Dirk_Hillbrecht" target="_blank">Dirk Hillbrecht (Piratenpartei)</a> zum Thema "Unter Piraten - Wem geh&ouml;rt das geistige Eigentum?" diskutierten.</p>
<p>Ich will mich jetzt nicht damit auseinander setzen ob sich Dirk Hillbrecht dort gut geschlagen hat,<!--more--> ob der Moderator eindeutig Position bezogen hat oder ob das Fernsehen nur noch ein Haufen seniler Redeschw&auml;lle ist. Ich pers&ouml;nlich m&ouml;chte solch eine Sendung weder moderieren m&uuml;ssen, noch will ich mich derartig hirnrissigen Argumenten ausgesetzt sehen und darauf auf Anhieb eine fundierte Meinung haben m&uuml;ssen, mit der ich m&ouml;glichst &uuml;berzeugend belegen kann dass mein Gegen&uuml;ber unrecht hat.<br/>Letzteres w&auml;re &uuml;brigens kein Problem.. leider hat man ja wohl immer den kleinen Nachteil dass man in der &Ouml;ffentlichkeit keine Sachen erz&auml;hlen will, die sich hinterher als auch nur ansatzweise unwahr oder schlecht belegbar herausstellen k&ouml;nnten. Wenn ein CDU-Politiker soetwas tut, dann ist das nat&uuml;rlich kein Problem. Immerhin rechnen wir alle damit und wer nicht damit rechnet, der wird das eh nicht bemerken. Es muss ja nur gut genug klingen.</p>
<p>Wenn jedoch ein Vertreter einer kleinen Partei mit lustigem Namen sowas sagt, dann steht der nat&uuml;rlich gleich im Abseits. Der CDU-Mann kann ihn in der Luft zerreisen "alle Ihre Argumente sind sicherlich solcher Bl&ouml;dsinn", seine W&auml;hler/Anh&auml;nger sind wahrscheinlich auf dem Gebiet schlau genug zu erkennen was er gerade erz&auml;hlt hat und auch bei den W&auml;hlern der Gegenpartei wird er nicht punkten k&ouml;nnen.. deren Meinung steht eh fest und l&auml;sst sich nichtmal durch sowas unwichtiges wie Tatsachen &auml;ndern. (klingt komisch, ist aber so... und ist leider eigentlich &uuml;berhaupt nicht komisch)</p>
<p>Worum es mir hier also eher gehen soll, sind ein paar Dinge &uuml;ber die eben NICHT geredet wird:</p>
<p>Was sich bei erw&auml;hnten Interview f&uuml;r mich am st&auml;rksten aufgedr&auml;ngt hat, war die Frage was denn ohne das Internet w&auml;re... w&uuml;rden die Leute keine Musik kopieren wenn sie dazu analoge Ger&auml;te verwenden m&uuml;ssten? Das Zeitalter der Musikkasette hat wohl bewiesen dass das Bl&ouml;dsinn ist. Die kopierte Musik war vlt. von permanent sinkender Qualit&auml;t, aber Qualit&auml;t ist nunmal nicht Quantit&auml;t.</p>
<p>Oder nehmen wir mal die Situation ein paar Jahre sp&auml;ter... digitales Kopieren ging (noch) nur via Diskette oder Band, Datennetze existierten zwar, wurden aber kaum privat verwendet. Hat uns das damals abgehalten an "illegale" Kopien zu kommen? Nein, wir sind einfach zu $Kumpel gegangen und haben uns die neuesten Disketten einfach kopiert... Wenn es sein musste auch mal 50 Disketten f&uuml;r eine sp&auml;rlich bef&uuml;llte CD (zumindest als CDs dann langsam aufgekommen sind) oder eine 90er Kasette mit den Inhalten der neuesten MusikCD/LP.</p>
<p>Die Unterschiede in den Situationen? Damals lief das still zuhause ab, jeder Gro&szlig;vater hat verstanden was passiert wenn ich eine Schallplatte auf Kassette &uuml;berspiele und keiner kam auf die bl&ouml;dsinnige Idee dass dies die Verk&auml;ufe von Schallplatten ernsthaft gef&auml;hrden w&uuml;rde. Wer wirklich ein Fan einer Band war hat sich nat&uuml;rlich dennoch das Original gekauft (wenn er ran kam und das Geld hatte zumindest).</p>
<p>Imho liegt das Problem nicht so sehr darin was passiert.. wie in der Diskussion von beiden Seiten erw&auml;hnt ist das selbe nur mit anderen technischen Mitteln. Das Problem liegt darin dass einige Leute diese anderen technischen Mittel nicht verstehen, nicht verstehen WOLLEN.</p>
<p>Nat&uuml;rlich ist es das Recht des K&uuml;nstlers den Leuten zu verbieten seine Werke zu h&ouml;ren. Er kann es nur technisch nicht durchsetzen wenn sie einmal allgemein verbreitet sind. Dabei ist es egal ob die Kassetten per Turnschuh &uuml;bertragen werden oder die MP3s per DSL.</p>
<p>Aber gehen wir mal weg von den Problemen der Musikindustrie und wenden wir uns dem Patentrecht zu. Hier hat Prof. Scholz ja noch viel weniger Einsicht gezeigt und sieht &uuml;berhaupt kein Problem. Firmen die sich selbst mit fadenscheinigen Trivialpatenten ausstatten m&uuml;ssen, um sich gegen Patenttrolle mit ebensolchen und die gerichtlichen Klagen der selbigen sch&uuml;tzen zu k&ouml;nnen, binden nunmal Mittel die sie sonst f&uuml;r ernsthaft n&uuml;tzliche Forschung verwenden k&ouml;nnen f&uuml;r diesen patentrechtlichen, kalten Krieg.</p>
<p>Die Patent&auml;mter im Gegensatz sind endg&uuml;ltig &uuml;berlastet. Niemand pr&uuml;ft mehr ernsthaft was da als Patent angemeldet wird, was dann im Gegegnzug wieder dazu f&uuml;hrt dass noch abstrusere Patente angemeldet werden.<br/>Selbst die Leute die an all diesem Chaos verdienen bestreiten inzwischen kaum noch dass unser Patentsystem im Eimer ist, aber zum Gl&uuml;ck haben wir ja (CDU-)Politiker die &uuml;ber das Ganze den &Uuml;berblick behalten haben und einwandfrei feststellen k&ouml;nnen, dass es hier nur um das geistige Eigentum geht, das um jeden Fall gesch&uuml;tzt werden muss.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1319" onclick="set_comment_reference(1319)" title="auf diesen Kommentar antworten">#1319</a>:
    24.Jun.2009 09:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Verdammt! Titel vergessen -.-</p>

<p class="infos">
<a href="#comment_1320" onclick="set_comment_reference(1320)" title="auf diesen Kommentar antworten">#1320</a>:
    02.Jul.2009 09:07
    von
    
      
        Fritz
      
    
    
  </p>
<p>Sehr sch&ouml;ner Bericht.Gut zu wissen.Danke f&uuml;r all diese Infos.Tolle Seite,weiter so!</p>

<p class="infos">
<a href="#comment_1321" onclick="set_comment_reference(1321)" title="auf diesen Kommentar antworten">#1321</a>:
    09.Nov.2009 01:11
    von
    
      
        <a href="http://www.happybuddha1975.de/" target="_blank">
          happy-buddha
        </a>
</p>
<p>Das Internet ist f&uuml;r die meisten Politiker wie ein B&ouml;hmisches Dorf.. Sie wissen das es da ist, aber damit hat es sich auch.</p>
</div>