+++
title = "Dinge die ich auf die harte Tour lernen musste 4"
date = "2008-08-22T08:08:00"
author = "Dr. Azrael Tod"
tags = ["Maueralt"]
issoid = "blog/581"
aliases = "blog/581"
+++

<p>F&uuml;r diejenigen die den <a href="http://drazraeltod.wordpress.com/2008/08/22/dinge-die-ich-auf-die-harte-tour-lernen-musste-3/" target="_self">letzten Beitrag</a> gelesen haben (oder <a href="http://drazraeltod.wordpress.com/2006/05/04/dinge-die-ich-auf-die-harte-tour-lernen-musste-1/" target="_self">die</a> <a href="http://drazraeltod.wordpress.com/2006/05/04/dinge-die-ich-auf-die-harte-tour-lernen-musste-2/" target="_self">beiden</a> von 2006), ist das was jetzt kommt schon bekannt, eine weitere Sammlung von Dingen die ich auf die harte Tour lernen musste.</p>
<p>Schon wieder gebe ich also einen Teil meiner <a href="http://drazraeltod.wordpress.com/zufallige-fakten/" target="_self">Facts</a> zum besten (<a href="http://feeds.feedburner.com/scquotes" target="_self">RSS-Feed f&uuml;r die neuesten</a>), diesmal alles was zum Thema Freundin/Beziehung/Sex passt. An dieser Stelle muss ich nat&uuml;rlich um Verst&auml;ndnis seitens meiner bisherigen und aktuellen Freundinnen/Lebensabschnittsgefahren bitten, das ist bestimmt nicht so b&ouml;se gemeint wie es stellenweise klingt, richtet sich evtl. auch nicht gegen jede Person die sich angesprochen f&uuml;hlt und nicht alle Facts beziehen sich unbedingt auf reale Erlebnisse. ;-)<!--more--></p>
<p>Dann gehts mal los:<br/></p><ul><br/> <li>NIE WIEDER EINE FREUNDIN DIE RAUCHT!</li><br/> <li>Fang nie was mit einer an, bei der du wei&szlig;t dass sie dich dringender will als du sie!</li><br/> <li>Endlich keinen Spa&szlig; mehr am Sex! Dank <a href="http://www.dooyoo.de/verhuetung/durex-performa-kondome-10-st/Testberichte/" target="_blank">Durex performa</a>!</li><br/> <li>Ich hasse es wenn mir eine Exfreundin schreibt, dass sie denkt sie w&auml;re wahrscheinlich von mir schwanger.</li><br/> <li>Meine Mutter findet es urkomisch mir "<a href="http://www.manager-magazin.de/life/genuss/0,2828,392348,00.html" target="_blank">Haremskonfekt</a>" zu schenken.</li><br/> <li>Ein Kerl bleibt selten mit Frauen befreundet, mit denen er sich niemals Sex vorstellen k&ouml;nnte.</li><br/> <li>Du wei&szlig;t nicht, was druck ist, bevor deine Freundinnen nicht alle gleichzeitig Zyklusbedingt ausfallen.</li><br/> <li>&lt;Mail-Thief&gt; "Einer Frau Komplimente zu machen ist wie Topfschlagen im Minenfeld"</li><br/> <li>Unter hormonellem Einfluss tut Man(n) Dinge, die kein Mensch bei klarem Verstand jemals nachvollziehen kann.</li><br/> <li>50 Prozent der M&auml;nner w&uuml;rden ein halbes Jahr auf Sex verzichten, um einen 50-Zoll-Flachbildfernseher zu bekommen.</li><br/> <li>14.02. Happy obsessively-calling-the-girl-who's-not-interested day!</li><br/> <li>Cindy mag es nicht wenn ich mein "<a href="http://localhost/wordpress/wp-content/uploads/2008/08/bild007.jpg" target="_blank">Killerspielspieler - Lauf so schnell du kannst</a>"-T-Shirt mit Totenkopf in der &Ouml;ffentlichkeit anziehe.</li><br/> <li>Mein <a href="http://drazraeltod.wordpress.com/2008/06/10/medikamente-fuer-informatiker/" target="_self">Antibiotikum</a> gef&auml;hrdet die Sicherheit der Pille! Mein Arzt hat mich extra darauf hingewiesen.</li><br/> <li>Die Freuden einer festen Beziehung: "Du solltest doch wissen dass es kein 'Deine' und 'meine' mehr zwischen uns gibt... es gibt nur noch 'Unser' und 'Meine' :P"</li><br/></ul><br/>So, diesmal wars etwas k&uuml;rzer und auch mit nichtmal halb so vielen Links versetzt... soll nochmal einer Behaupten meine Posts w&uuml;rden immer l&auml;nger und langatmiger werden! *g*
      
    
  <div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_455" onclick="set_comment_reference(455)" title="auf diesen Kommentar antworten">#455</a>:
    22.Aug.2008 12:08
    von
    
      
        <a href="/2008/08/22/dinge-die-ich-auf-die-harte-tour-lernen-musste-5/" target="_blank">
          Dinge die ich auf die harte Tour lernen musste
        </a>
</p>
<p>[...] Frauen (vom 23.08.0 [...]</p>

<p class="infos">
<a href="#comment_456" onclick="set_comment_reference(456)" title="auf diesen Kommentar antworten">#456</a>:
    22.Aug.2008 04:08
    von
    
      
        <a href="http://ag7.alltagsgrauen.info" target="_blank">
          fwolf
        </a>
</p>
<p>Thema Plastikt&uuml;te kann ich erg&auml;nzen mit: "Dicker Schwanz? Pech gehabt!" oder auch "Kondome sch&uuml;tzen" - ja, indem man &uuml;berhaupt keinen Bock auf Sex mehr hat, wenn man sich entweder den Schwanz damit abklemmt (quasi Cockring auf die harte Tour) oder selbige Dinger so gef&uuml;hlfsecht wie ein Regenmantel mit F&uuml;tterung sind (alternativ: wie ein guter Gummihandschuh). Grak!</p>
<p>cu, w0lf.</p>
</div>