+++
title = "Dinge die ich auf die harte Tour lernen musste 5"
date = "2008-08-22T12:08:00"
author = "Dr. Azrael Tod"
tags = ["Maueralt"]
issoid = "blog/589"
aliases = "blog/589"
+++

<p>Heute folgt auf die beiden k&uuml;rzlich geposteten Sammlungen nat&uuml;rlich noch eine 5. Das gibt keinen Sinn? Du hast wohl die ersten beiden verpasst? Kein Problem, f&uuml;r all diejenigen denen es so oder &auml;hnlich geht, gibt es hier noch einmal ein &Uuml;bersicht &uuml;ber alle 5 Posts:<br/></p><ol><br/> <li><a href="http://drazraeltod.wordpress.com/2006/05/04/dinge-die-ich-auf-die-harte-tour-lernen-musste-1/" target="_self">K&uuml;che</a> (vom 04.05.06)</li><br/> <li><a href="http://drazraeltod.wordpress.com/2006/05/04/dinge-die-ich-auf-die-harte-tour-lernen-musste-2/" target="_self">Autos</a> (ebenfalls 04.05.06)</li><br/> <li><a href="http://drazraeltod.wordpress.com/2008/08/22/dinge-die-ich-auf-die-harte-tour-lernen-musste-3/" target="_self">Elektronik/EDV</a> (vom 22.08.08)</li><br/> <li><a href="http://drazraeltod.wordpress.com/2008/08/22/dinge-die-ich-auf-die-harte-tour-lernen-musste-4/" target="_self">Frauen</a> (vom 23.08.08)</li><br/> <li><a href="http://drazraeltod.wordpress.com/2008/08/22/dinge-die-ich-auf-die-harte-tour-lernen-musste-5/" target="_blank">der Ganze Rest wo &uuml;brig ist</a> (23.08.08)<!--more--></li><br/></ol><br/>Und los gehts:<br/><ul><br/> <li>Ich hasse Busfahrpl&auml;ne, aber das macht nix... sie hassen mich ja auch -.-</li><br/> <li>Optimismus ist was f&uuml;r Bausparer</li><br/> <li>30min Rettungsfahrt kosten zur Zeit 306,40&euro;</li><br/> <li>Rauchmelder sind kein gutes Mittel um festzustellen dass der Toast fertig ist.</li><br/> <li>Klar haben wir die Wahl... es interessiert nur keinen welches &Uuml;bel wir w&auml;hlen.</li><br/> <li>Trauben-Nuss-M&uuml;sli ist eine bl&ouml;de Idee wenn man gegen N&uuml;sse allergisch ist.</li><br/> <li>Rasierwasser hat ganz eindeutig etwas von archaischen M&auml;nnlichkeitsbeweisen.</li><br/> <li>Man kann Rauchmelder auch mit Unmengen Wasserdampf ausl&ouml;sen.</li><br/> <li>Politik und Magie haben deutliche &Auml;hnlichkeiten, bei beidem ist die Ablenkung&nbsp; von den wahren Vorg&auml;ngen das Wichtigste.</li><br/> <li>Man sollte die Gelder zur Abwehr von Gefahren f&uuml;r das deutsche Volk nach tats&auml;chlichen Opfern verteilen.</li><br/> <li>Besser man kann T&auml;tigkeit gegen Vogelgrippe vorweisen und es gibt keine Opfer als man kann die doppelte T&auml;tigkeit gegen Krebs vorweisen und die Opfer gehen nur um die H&auml;lfte zur&uuml;ck.</li><br/> <li>Als ich grade aus dem Haus getreten bin musste ich unglaublich stark an die Szene in "<a href="http://de.wikipedia.org/wiki/Riddick:_Chroniken_eines_Kriegers#Handlung" target="_blank">Riddic</a>" denken, bei der der Purifier Riddic einen Vortrag h&auml;llt und dann in die Sonne hinaus geht &lt;- wenn das keine <a href="http://innergeek.us/geek.html" target="_blank">Geek-Punkte</a> gibt was dann?</li><br/> <li>Normschiss &Uuml;berbieten ist einfach</li><br/> <li>Der Milchpreis steigt, darum geh ich pleite und schuld sind die Chinesen, die <a href="http://www.welt.de/wissenschaft/article1066325/Vertragen_Chinesen_nun_Milch_oder_nicht.html" target="_blank">gar keine Milch trinken k&ouml;nnen</a>.</li><br/> <li>Die Arbeitgeber sind immer die Guten, denn Geben ist seliger denn Nehmen!</li><br/> <li>Von wegen Religion ist Opium f&uuml;rs Volk, Opium ist eine BewustseinsERWEITERNDE Droge!</li><br/> <li>Endlich ist mir eingefallen wie ich jemandem <a href="http://de.wikipedia.org/wiki/Rauchemaad" target="_blank">Rachermaad</a> erkl&auml;ren kann... "sone Art <a href="http://de.wikipedia.org/wiki/Klitscher" target="_blank">Klitscher</a>"</li><br/> <li>Fr&uuml;her waren 1/3 aller Kinder &uuml;bergewichtig, heute sind es schon 1/6.. welch enormer Anstieg, BILD hat nat&uuml;rlich recht!</li><br/> <li>ICH HASSE PAPIER!</li><br/> <li><a href="http://de.wikipedia.org/wiki/Olbernhau" target="_blank">Olbernhau</a> ist ein Dreckskaff!</li><br/> <li><a href="http://de.wikipedia.org/wiki/Bad_Gottleuba" target="_blank">Bad Gottleuba</a> ist ein Dreckskaff!</li><br/> <li>11.10. ist Tag des Baumes - schnappt euch eine Kettens&auml;ge und feiert mit!</li><br/> <li><a href="http://de.wikipedia.org/wiki/Differentialgleichung" target="_blank">DGL</a> h&ouml;herer Ordnung nerven.</li><br/> <li><a href="http://de.wikipedia.org/wiki/Polynominterpolation" target="_blank">Interpolationspolynome</a> machen die welt keinen deut besser.</li><br/> <li>Weggelassene Etagen f&uuml;hren zu Treppen die im Nichts enden (siehe <a href="http://www.bsz-zschopau.de/" target="_blank">Berufsschulzentrum Zschopau</a>)</li><br/> <li>Ich w&uuml;rde Bayern nicht mit erzkonservativ beschreiben.. ich w&uuml;rde aber erzkonservativ mit Bayern beschreiben.</li><br/> <li>Autos sind viel zu anf&auml;llig, was B&auml;ume betrifft! Ich werde kein Auto mehr fahren, bis diese Bugs behoben sind.</li><br/> <li>Die Arbeitsgeschwindigkeit meiner Teammitglieder ist konstant... Ja, auch 0 ist eine Konstante!</li><br/> <li>F&uuml;r das Geld, was Prof. Erwin Hofmann bekommt, m&ouml;chte ich gerne mal die doppelte Leistung bringen m&uuml;ssen.</li><br/> <li>Ich hasse Professoren, die komplizierte fragen zur Pr&uuml;fungsvorbereitung bereitstellen und darunter schreiben "L&ouml;sungen finden sie in meinem Buch mit der ISBN..."</li><br/> <li>Mathematiker sind normale Menschen... nur halt ein bissl geistig verwirrt.</li><br/> <li>Eine Reise innerhalb der EU buchen dauert <a href="http://drazraeltod.wordpress.com/2008/03/05/tschechisch-fur-service/" target="_self">bei der Bahn</a> l&auml;nger als die selbe Reise mit dem Flugzeug zur&uuml;ckzulegen.</li><br/> <li><a href="http://de.wikipedia.org/wiki/Carl_Friedrich_Gau%C3%9F" target="_blank">Gauss</a> hatte viel zu viel Freizeit.</li><br/> <li>Es gibt um Welten zu viele "the greatest hits"-Alben.</li><br/> <li>Qualit&auml;t ist, wenn der Kunde zur&uuml;ckkommt und nicht das Produkt.</li><br/> <li>Man hat einen Fehler bei <a href="http://de.wikipedia.org/wiki/Knut_(Eisb%C3%A4r)" target="_blank">Knut</a> gemacht... h&auml;tte man ihn im Mai 2007 ausgestopft, w&auml;re er jetzt wenigstens noch so s&uuml;&szlig; wie damals.</li><br/> <li>Ich hasse es in &Uuml;bungsaufgaben die <a href="http://de.wikipedia.org/wiki/Methode_der_kleinsten_Quadrate" target="_blank">Methode der kleinsten Quadrate</a> auf mehr als 20 Wertepaare anwenden zu m&uuml;ssen.</li><br/> <li>Wenn man an der internationalen Information steht und dort <a href="http://drazraeltod.wordpress.com/2008/03/05/tschechisch-fur-service/" target="_self">weder deutsch, englisch noch franz&ouml;sisch verstanden</a> wird, dann ist man in der <a href="http://de.wikipedia.org/wiki/Tschechien" target="_blank">Tschechischen Republik</a>.</li><br/> <li>Ich hasse Schraubgl&auml;ser - Gewalt IST eine L&ouml;sung</li><br/> <li>8 Stunden Zettel verteilen ist anstrengend.</li><br/> <li>500g frischer Thunfisch scheinen billig... bis man mitbekommt, dass der ausgezeichnete Preis f&uuml;r 100g gemeint war und nicht f&uuml;r 1kg.</li><br/> <li>Gro&szlig;e Aufschrift auf einem Shirt meiner Freundin (Handw&auml;sche) "Have fun washing!"</li><br/> <li>"Der <a href="http://synonyme.woxikon.de/synonyme/immens.php" target="_blank">immense</a> <a href="http://synonyme.woxikon.de/synonyme/usus.php" target="_blank">Usus</a> <a href="http://de.wikipedia.org/wiki/Exterritorialit%C3%A4t" target="_blank">exterritorialer</a> <a href="http://de.wikipedia.org/wiki/Vokabeln" target="_blank">Vokabeln</a> in der <a href="http://de.wikipedia.org/wiki/Germanistik" target="_blank">germanistischen</a> <a href="http://de.wikipedia.org/wiki/Sprachwissenschaft" target="_blank">Linguistik</a> ist mit <a href="http://de.wiktionary.org/wiki/dediziert" target="_blank">dezidiertem</a> <a href="http://de.wikipedia.org/wiki/Fanatismus" target="_blank">Fanatismus</a> auf das maximale Minimum zu reduzieren!"</li><br/> <li>Es gibt nichts besseres als ein Beet mit Pfefferminze platt zu m&auml;hen... das macht die Atemwege frei!</li><br/> <li>Amt! Denn wir sind f&uuml;r sie da! MUHAHAHAHAHAHAHHAHAHAAHHA</li><br/> <li><a href="http://de.wikipedia.org/wiki/Burnout-Syndrom" target="_blank">Burnout-Syndrom</a> - Wenn <a href="http://de.wikipedia.org/wiki/Hypochondrie" target="_blank">Hypochondrie</a> zu anstrengend wird!</li><br/> <li>Sich einen Bart wachsen lassen juckt wie sonstwas.. daher w&auml;re es eine bescheuerte Idee das gerade dann zu machen, wenn man im Gesicht nicht kratzen darf (oder gar das Gesicht nicht mal ber&uuml;hren sollte). Wir merken also dass mir wahrscheinlich doch irgendwo ein St&uuml;ck Hirn fehlt.</li><br/> <li>"After the shooting grab a body bag and head to the public viewing" (<a href="http://nothingforungood.com/2008/06/21/after-the-shooting-grab-a-body-bag-and-head-to-the-public-viewing/" target="_blank">via Nothing For Ungood</a>)</li><br/> <li>"Zu viele Rechnungen? holen sie sich jetzt ihren Barkredit! ohne Schufaauskunft, auch wenn sie andere Belastungen haben und ihr Girokonto &Uuml;berzogen ist" o0</li><br/> <li>Sch&auml;uble: <a href="http://netzpolitik.org/2008/ard-kinderreporter-befragen-politiker-zum-thema-ueberwachung/" target="_blank">"Wir tun aber die Leute nicht &Uuml;berwachen... nur wenns so ganz schlimme B&ouml;sewichte sind!"</a></li><br/> <li>Es gibt Leute, die sehen mich verwirrt an wenn ich denen sag dass ich ein Buch mehrmals lese...</li><br/> <li>Es ist bei sch&ouml;nem Wetter unm&ouml;glich einmal durch die Dresdner Altstadt zu laufen ohne nicht mindestens 10x Fotografiert zu werden.</li><br/> <li><a href="http://de.wikipedia.org/wiki/Justitia" target="_blank">Justizia</a> mag in Deutschland blind sein, irgendein Frechdachs hat aber ihre Waage etwas manipuliert und die arme, blinde Frau hats nichtmal mitbekommen.</li><br/></ul>
