+++
title = "Vapiano"
date = "2009-05-10T12:05:00"
author = "Dr. Azrael Tod"
issoid = "blog/1393"
aliases = "blog/1393"
+++

<p>Cindy, meine bessere H&auml;lfte hat Geburtstag und da wir sowieso noch ein paar Kinokarten rumliegen hatten, dachten wir wir k&ouml;nnten mal wieder gepflegt ins Kino und etwas essen gehen.</p>
<p>Die Wahl des Restaurants fiel diesmal auf das <a href="http://www.vapiano.de/frame.php?section=locations&amp;lang=de&amp;sub=dedd1" target="_blank">Vapiano an der Prager Stra&szlig;e</a>, haupts&auml;chlich weil wir noch nicht dort waren, weil man mehrmals geh&ouml;rt hatte dass das Essen gut w&auml;re und weil es r&auml;umlich sehr nahe am UFA-Kino liegt.<br/>Um die Schlussfolgerung mal vornweg zu nehmen: Das Essen IST gut, der Rest ist aber ziemlich daneben.<!--more--></p>
<p>Als wir angekommen sind standen wir erstmal vor dem Problem wie wir &uuml;berhaupt ins Geb&auml;ude kommen sollten, zwar gibt es jede Menge Sitzpl&auml;tze vor dem Haus, doch die sind ziemlich dicht mit Hecken in Pflanzk&uuml;beln abgesperrt. Der Grund daf&uuml;r liegt darin dass man am Eingang erstmal eine Chipkarte in die Hand gedr&uuml;ckt bekommt, auf die bucht man dann das Essen und beim Verlassen des Restaurants bezahlt man dann.<br/>Sch&ouml;n war an dieser Stelle dass man am Eingang erstmal ein paar Erl&auml;uterungen erh&auml;llt wie dort alles abl&auml;uft, weniger sch&ouml;n hingegen dass man bereits an dieser Stelle als Neukunde ziemlich verwirrt dasteht und erstmal von dem Gedr&auml;ngel im Geb&auml;ude &uuml;berw&auml;ltigt ist.</p>
<p>Als n&auml;chsten Schritt stellt man sich dann an eine der ca. 4-5 Schlangen an (bereits nach Nudeln/Salat/Pizza oder &auml;hnlichem geordnet) und bestellt sich was auch immer man essen will. Alles wird frisch zubereitet und im Vergleich zu "normalen" Restaurants l&auml;uft das alles auch recht schnell ab. Wenn man Pizza oder andere Sachen (au&szlig;er Pizza ist mir nichts aufgefallen) bestellt die von Natur aus l&auml;nger dauern bekommt man ein kleines Ger&auml;t in die Hand gedr&uuml;ckt, kann sich erstmal setzen und wenn das Essen fertig ist wird man via Vibrationsallarm gerufen.</p>
<p>Die Karte ist mit einem beidseitig bedrucktem Zettel von weniger als A5-Fl&auml;che ziemlich kurz zusammengefasst. Es gibt nicht direkt wenig was man bestellen kann, aber bereits dadurch dass keine Getr&auml;nke darauf stehen spart man nat&uuml;rlich ungemein Platz.<br/>Weil nat&uuml;rlich auch keine Getr&auml;nke mit Preisen irgendwo in der N&auml;he der Speiseausgabe aufgelistet sind bestellt man halt was man sieht.. bei den meisten wird das also wohl Cola oder &auml;hnliches. (Die &uuml;brigens dann auch f&uuml;r eine Flasche von 0,2l gleich mal reichlich 2&euro; kostet, aber das merkt man nat&uuml;rlich auch erst wenn man geht und bezahlen will.)</p>
<p>Dumm ist das System nat&uuml;rlich wenn man gerne einen Salat UND eine Pizza m&ouml;chte... dann darf man sich halt erstmal an 2 Schlangen anstellen. Auch wenn mehrere Personen essen gehen wollen, bekommt nat&uuml;rlich jeder sein Essen zu einem anderem Zeitpunkt. Wenn man die Leute dort etwas beobachtet sieht man dann nat&uuml;rlich auch dauernd Gruppen bei denen die ersten schon fertig sind, w&auml;hrend andere ihr Essen noch nichtmal haben.</p>
<p>Entspannung und Esskultur wird man im Vapiano  nat&uuml;rlich auch nicht finden, weder kann man sich gem&uuml;tlich, bei einem Glas Wein, unterhalten w&auml;hrend man aufs essen wartet, noch kann man sich bei ged&auml;mpftem Licht und ruhiger Hintergrundmusik bedienen lassen.</p>
<p>Was man als Essen in die Hand gedr&uuml;ckt bekommt schmeckt wie bereits geschrieben hervorragend und ist f&uuml;r ein Restaurant auch ziemlich billig. Allerdings hat man fast mehr Aufwand und Stress als wenn man es selbst zubereitet oder einfach aus der Tiefk&uuml;hltruhe nimmt und kann es erheblich weniger genie&szlig;en als Zuhause. Eine gut belegte Pizza bekomme ich in der Form bereits f&uuml;r weit unter 2&euro;, kann mir sie noch nach belieben zus&auml;tzlich belegen und kann sie in weit mehr Ruhe genie&szlig;en.</p>
<p>Alles in Allem kann man sich das Vapiano wie eine Art McDonnalds mit gutem Essen vorstellen. Die Unterschiede sind haupts&auml;chlich dass es bei McDoof erheblich ruhiger zugeht, dort die Cola erheblich billiger ist und dass man dort auch Samstag gegen 19:00 keinerlei Probleme hat dort gute Sitzpl&auml;tze zu finden.<br/>Durch das Anstehen an diversen Schlangen kommt echtes Kantinen-"feeling" auf und dass man in den engen G&auml;ngen beinahe st&auml;ndig mit einem Tablett in der Hand umgerannt wird macht das Ganze auch nicht angenehmer. F&uuml;r den Fall dass man allerdings wenig Zeit hat und einfach nur etwas gutes Essen will (z.B. in der Mittagspause oder vor einem Termin) oder dass man allein unterwegs ist und keinen Wert auf Atmosph&auml;re legt mag das Vapiano durchaus eine &Uuml;berlegung wert sein.</p>
<p>Wenn wir aber das n&auml;chste Mal wieder ins Kino gehen, werden wir wohl zum Essen wieder das Amigo (1-2 Geb&auml;ude weiter, sieht nach nicht viel aus ist aber ein sehr gem&uuml;tlicher, kleiner Italiener mit ebenfalls ziemlich gutem Essen) aufsuchen. F&uuml;r einen gem&uuml;tlichen Abend zu zweit ist das einfach die um L&auml;ngen bessere Wahl.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1278" onclick="set_comment_reference(1278)" title="auf diesen Kommentar antworten">#1278</a>:
    10.May.2009 11:05
    von
    
      
        <a href="http://codeschmie.de" target="_blank">
          fa
        </a>
</p>
<p>Gl&uuml;ck gehabt kann ich da nur sagen :)<br/>
Beim Vapiano in M&uuml;nchen am Marienplatz konnte ich nur 2 Dinge anmerken:<br/>
- Nomen est omen - "mach ma langsam" war deren Motto, wir haben gute 45min zwischen Kartenausgabe und Bezahlen gebraucht. Sehr schlecht f&uuml;r die Mittagspause<br/>
- Besonders gut geschmeckt hats mir auch nicht</p>

<p class="infos">
<a href="#comment_1279" onclick="set_comment_reference(1279)" title="auf diesen Kommentar antworten">#1279</a>:
    11.May.2009 01:05
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          sirsnookie
        </a>
</p>
<p>Klingt vielmehr nach nem m&ouml;chtegern Restaurant &aacute; la High-Tech-Schnellbedienung. Das mit den Getr&auml;nken ist aber normal, wenn da die Preise nicht abgedruckt sind kann man sich mei&szlig;t auf was teures gefasst machen. Rein von der rechtlichen Seite her betrachtet meine ich, das man die Preise irgendwo aush&auml;ngen <em>MUSS</em> aber naja.</p>
<p>Schlangenabfertigung ist nat&uuml;rlich praktisch. F&uuml;r mich klingt das alles nach IKEA-Schnellrestaurant mit High-Tech ausgestattet.</p>
<p>Freakige Restaurants habt ihr da "dr&uuml;ben"!</p>
</div>