+++
title = "b0rken Software - Fallout 2"
date = "2008-07-06T11:07:00"
author = "Dr. Azrael Tod"
issoid = "blog/451"
aliases = "blog/451"
+++

<p>Heute m&ouml;chte ich mal anhand meines Lieblingsspieles (Fallout 2) demonstrieren was man an Komplexen Softwareprojekten alles falsch machen kann (bzw. was man dort alles falsch gemacht hat).</p>
<p>Jetzt werden sich einige wundern warum ausgerechnet anhand dessen und vor allem warum dies mein Lieblingsspiel ist, wenn doch so viel falsch gemacht wurde. Der Grund ist dass ich mich auf reine Entwicklungsprobleme dieses Spieles beschr&auml;nken will, ohne auf subjektive Probleme die ich mit der Software evtl. habe, die der Entwickler aber direkt so gewollt hat, einzugehen. Au&szlig;erdem eignet sich Fallout 2 hervorragend dazu, da ich kaum ein Spiel kenne dessen original Auslieferungszustand derartig schlecht war.</p>
<p>Fallout 2 ist Bananensoftware (reift beim Kunden)! Dies ist keine Theorie sondern eine Tatsache. Es ist nahezu unm&ouml;glich das Spiel ohne Bugfixes &uuml;berhaupt durch zuspielen, dies kann bei einer ernsthaften Qualit&auml;tskontrolle unm&ouml;glich entgangen sein. Der Patch auf Version 1.02 (final) erschien &uuml;brigens auch zeitnah genug dass man ihn auf den meisten CDs gleich mitlieferte.. allerdings nicht in die Installationsroutine integriert (nicht mal am Ende davon aufgerufen) sondern einfach nur in irgendeinem Unterverzeichnis der CD liegend und leicht &uuml;bersehbar.<br/>Selbst wenn man das Spiel erstmal installiert, spielt bis man auf Probleme trifft (hier ist nicht die Frage "ob" sondern "wann") und dann den Patch installiert hat man ein ernstes Problem: die alten Spielst&auml;nde werden ung&uuml;ltig und man kann noch einmal vom Anfang anfangen.</p>
<p>Sollte man heute seine alte CD hervor kramen, Fallout installieren wollen und dann feststellen dass man dummerweise eine Version ohne mitgelieferten Patch hat, hat man ein weiteres Problem: Fallout 2 wird bereits seit vielen Jahren von niemandem mehr offiziell unterst&uuml;tzt. Mittlerweile ist dies derartig zum Problem geworden, dass nicht nur der Hersteller die urspr&uuml;nglichen Patches nicht mehr auf seinem Server anbietet sondern auch die meisten Drittquellen dies aufgegeben haben (die meisten haben eh nur auf den Hersteller verwiesen wie es &uuml;blich ist.) Man besitzt also jetzt eine CD mit Software die man eigentlich nicht nutzen kann.</p>
<p>Ein weiteres nettes Detail ist der "Kopierschutz". Wir alle wissen dass derartige Dinge meist mehr Probleme verursachen als sie l&ouml;sen, so auch in diesem Fall. Die Probleme m&uuml;ssen scheinbar so gro&szlig; gewesen sein dass die &Uuml;berpr&uuml;fung ob eine CD eingelegt ist auch bereits in Version 1.02 wieder entfernt war. Jemanden aufgehalten h&auml;tte diese Funktion ohnehin nicht, es wurde nur unf&auml;hig &uuml;berpr&uuml;ft ob eine entsprechende CD vorhanden war, kopieren konnte man die CD recht problemlos auch so dass sie erkannt wurde. (Zumindest nachdem die CD-Brenner gro&szlig;fl&auml;chig aufgekommen waren, zur Ver&ouml;ffentlichung von Fallout 2 waren diese noch nicht wirklich allt&auml;glich.)</p>
<p>Inhaltliche Lokalisierung: In diesem Punkt bin ich mir nicht ganz 100%ig sicher ob es sich um ein Problem mit Teil 1 oder 2 handelte, woran ich mich aber noch erinnre sind die Auswirkungen. Da in Deutschland der Jugendschutz so stark war, dass an eine Ver&ouml;ffentlichung von Fallout im Originalzustand offenbar nicht zu denken gewesen w&auml;re, wurden in dem Spiel alle Kinder weggelassen. (Jugendschutz -&gt; die Jugend muss vor Computerspielern gesch&uuml;tzt werden.. auch wenn es virtuelle Jugend ist!) Dies f&uuml;hrte zu interessanten Stilbl&uuml;ten wie dass ein Quest bei dem man ein Kind aus einem Brunnen retten musste unm&ouml;glich mit einem positiven Ende bestehen konnte, in der deutschen Version fand man immer nur &Uuml;berreste, nie ein lebendes Kind. Auch wurden in einer anderen Stadt die Kinder weggelassen, nicht jedoch die Textzeilen die&nbsp; sie von sich gaben. Es sieht etwas verwirrend aus wenn mitten in der Luft steht "Willst du mit mir spielen?" ohne dass jemand in der N&auml;he ist. Spieler die verwirrt an Geister glaubten und ewig nach einer Aufgabenstellung suchten, musste man entt&auml;uschen, dies war einfach ein Bug, kein neues Quest.</p>
<p>Versteht mich nicht Falsch! Fallout war inhaltlich ein wirklich gro&szlig;artiges Spiel, Bewegungsfreiheit und Humor dieses Spieles sind noch heute imho un&uuml;bertroffen aber ich frage mich ob bewusst versucht wurde bei der Ver&ouml;ffentlichung m&ouml;glichst viel falsch zu machen oder ob diese Fehler wirklich alle zuf&auml;llig massiert auftraten.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_287" onclick="set_comment_reference(287)" title="auf diesen Kommentar antworten">#287</a>:
    06.Jul.2008 11:07
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Wenn man einmal ansatzweise mit der Spieleindustrie zu tun hatte &uuml;berrascht einen das nicht.</p>
<p>Oft werden die Projekte mit 30 Jahre alten Softwareengineeringtechniken durchgef&uuml;hrt, meist mit grottiger Zeitplanung und am Ende geht es in der "Crunchtime" nur noch darum, den Titel in der angemessenen Zeit fertig zu bekommen.</p>
<p>Produktpflege ist vielenorts eh ein Fremdwort, und es wundert auch niemanden. Das Spiel wurde zu dem Zeitpunkt wo man das Bugfix braucht ja schon gekauft. Ausserdem sind bei vielen kleineren Spieleklitschen die Kapazit&auml;ten dann auch schon auf das n&auml;chste Projekt ausgerichtet, weil sonst verhungert man n&auml;mlich.</p>
<p>Es gibt zwar Ans&auml;tze, die zeigen, dass es besser wird, und sicherlich gibt es auch Computerspieleklitschen die das besser hinbekommen. Aber der Spruch "All Software sucks" trifft gerade auf Spiele zu. Vor allem auf dem PC. (Bei Konsolen schauen ja die Konsolenhersteller noch darauf, dass man keinen allzugrossen Murx abliefert).</p>

<p class="infos">
<a href="#comment_288" onclick="set_comment_reference(288)" title="auf diesen Kommentar antworten">#288</a>:
    06.Jul.2008 12:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>wobei "allzugrosser Murx" relativ ist... Microsoft hatte ja auch mal behauptet es w&uuml;rde nie Patchs und Installationsvorg&auml;nge auf der X-Box geben als denen das jemand (im Scherz) vorgeworfen h&auml;tte, da das das normale Vorgehen auf Microsoft-Systemen sei.<br/>
Inzwischen sind automatisch eingespielte Updates und Installationen auf der Festplatte einer Konsole auch derartig normal geworden dass sich keiner mehr gro&szlig;artig aufregt solange es nicht &uuml;berhand nimmt.</p>
</div>