+++
title = "Gedanken(rollen)spielchen"
date = "2008-10-28T11:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/1004"
aliases = "blog/1004"
+++

<p>Ich spiele ja gerne in Gedanken mit irgendwelchen abgedrehten Sachen rum.. Derzeit &uuml;berlege ich wie man ein "besseres" RPG-System aufbauen k&ouml;nnte und wie ich ein eigenes konstruieren w&uuml;rde wenn ich in der Verlegenheit w&auml;re.<!--more--></p>
<p>Die Ursprungsidee war erstmal mich mehr an dem <a href="http://de.wikipedia.org/wiki/Fallout_(Computerspiel)#Rollenspielsystem" target="_blank">System in Fallout 1/2</a> zu orientieren als am vielzitierten <a href="http://de.wikipedia.org/wiki/Pen-&amp;-Paper-Rollenspiel" target="_blank">P&amp;P</a>-Klassiker <a href="http://de.wikipedia.org/wiki/D%26D" target="_blank">Dungeons and Dragons</a>, einfach weil ich das System f&uuml;r die meisten Anwendungen sch&ouml;ner und leichter zu verwenden finde. Damit w&uuml;rden nat&uuml;rlich die ganzen Pen&amp;Paper-Spieler erstmal rausfallen, was mir auch gleich erspart permanent mit allen m&ouml;glichen W&uuml;rfeln als Grundgr&ouml;&szlig;e zu rechnen.</p>
<p>Die Zweite Grundidee war dann dass es eigentlich Bl&ouml;dsinn w&auml;re den Nutzer gleich am Anfang einen Charakter definieren zu lassen. Imho w&auml;re es besser Standardwerte festzulegen, die jeder Spieler am Anfang erstmal teilt. Anpassbar sollten f&uuml;r den Spieler dann nur "Wunschwerte" sein, die bei jeder Handlung je nach ihrer Auspr&auml;gung die tats&auml;chlichen Werte leicht beeinflussen.</p>
<p>Um mal kurz ein Beispiel zu nenen: Man kann keine Punkte f&uuml;r St&auml;rke bewusst vergeben, man kann einen Wunschwert als St&auml;rke-Ausdauer-Relation vergeben und je l&auml;nger man diesen st&auml;rker zu Ausdauer verschoben l&auml;sst umso h&ouml;her steigt der Ausdauer-Wert, aber umso geringer steigt auch der St&auml;rke-Wert.</p>
<p>Das Ganze f&uuml;hrt nat&uuml;rlich zu etwas komplexerer Mathematik. Ein Regler f&uuml;r die aktuellen Werte sollte also f&uuml;r den Nutzer m&ouml;glichst analog, sprich wenig abgestuft, erscheinen. Wirklich Auswirkungen hat das nat&uuml;rlich nicht nicht, wie wir bereits bemerkten fallen die P&amp;P/LARP-Spieler eh schon f&uuml;r das System aus dem Raster und bei aktueller Hardwareleistung sind die Berechnungen f&uuml;r das Charaktersystem irgendwie der Teil eines Spieles der am wenigsten Performance-Sorgen bereitet.</p>
<p>Wie gesagt: Bisher handelt es sich nur um einen wirren Gedankengang von mir, aber evtl. sollte ich doch mal irgendwann wieder ein Spiel coden... vlt. sollte ich diese Entscheidung von einem 1W2-Wurf (M&uuml;nze) abh&auml;ngig machen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_855" onclick="set_comment_reference(855)" title="auf diesen Kommentar antworten">#855</a>:
    29.Oct.2008 01:10
    von
    
      <a href="/blog/author/toranor/">
        toranor
      </a>
</p>
<p>W2 ist das Werk des Teufels, egal wie die M&uuml;nze f&auml;llt, das Ergebnis gef&auml;llt dir nicht. Und bei informatikern bleibt das Ding eh aufm Rand stehen, weil wir mit Geschick nun mal nicht so gl&auml;zen k&ouml;nnen wir nen Klavierspieler.</p>
<p>Prizipiell finde ich die idee mit dem Regler unsinnig. Wenn man die St&auml;rkeGeschickwertSumme (SGS) konstant l&auml;sst, ist es Unsinn, weil es keine Charakterentwicklung gibt (er bleibt also immer schwach und tolpatschig). Wenn man die SGS nun mit jedem Levelup (falls es sowas geben solte) erh&ouml;ht, und dann den Regler ver&auml;ndern darf, is es auch unsinnig, dann kann man gleich explizit Punkte vergeben.</p>
<p>Ich w&uuml;rde schon bei dem Punktesystem bleiben, aber zum Beispiel die Levelups weg lassen, weil ein char wird nicht pl&ouml;tzlich, nach erfolgreichem Leben nehmen oder mit-Person-reden st&auml;rker, sondern kontinuierlich. Ich finden den Ansatz in DSA4 - Drakensang recht gut, dass man jederzeit seine gewonnenen EP einsetzen kann, um alles m&ouml;glich zu steigern, das ist dann Lvup unabh&auml;ngig.</p>
<p>Eine Idee ist auch - und jetzt geh ich mal bei den ungeliebten Redmondern spionieren - das System von Dungeon Siege. Je nach art der gew&auml;hlten Waffe steigen sich die entsprechenden Grundwerte in einem gewissen Verh&auml;ltnis (d.h. beim Kampf mit Nahkampfwaffen gibts halt 0.7STR, 0.2DEX und 0.1INT). Nur hat MSGameSTodios das etwas tolpatschig umgesetzt und bei Dungeon Siege f&auml;llt der Aspekt der CHarentwicklung unter den Tsich, zumal es da nur 3 Grundattribute gibt.</p>
<p>Ich w&uuml;rde pers&ouml;nlich ein System entwickeln, welches die Attribute und Fahigkeiten anhand der Aktionen im Spiel steigert. F&uuml;rs h&auml;uf Schl&ouml;sser knacken gibts dann halt nen bissl geschick, und nen bissl Schlossknackenfahigkeit und wenns nicht klappt, dann gibts nen Quantum Trost. So in etwa wie in WoW, nur dass ich die Abstufung und die Anzahl der sich &auml;ndernden Werte vergr&ouml;ssern w&uuml;rde. Auch w&uuml;rd ich die m&ouml;glichkeiten eines Computers nutzen, und nicht bei ganzzahligen Werten, wie sie aus PnP-RPG's bekannt sind bleiben, sondern schon mit gebrochen rationalen Zahlen (ja, eine Intelligenz von PI ist doof) arbeiten.</p>
<p>als Beispiel:<br/>
Schaden = Grundschaden der Waffe(int) * Str(float) * fahigkeit etc...</p>
<p>Was auch interessant ist: Wie "Wirkt" R&uuml;stung ? es gibt das ja aus dem Althergebrachten 2 Ans&auml;tze:</p>
<p>R&uuml;stung reduziert direkt den Schaden:<br/>
Wenn getroffen wird, dann Reduziert die R&uuml;stung den Schaden: Also Grundschaden(+-*Modifikatoren)-R&uuml;stung. Das geht absolut (DSA, vor alem PnP) und Relativ (&auml;h... WoW)<br/>
Nachteil: In DSA gibt es so Dicke R&uuml;stungen, dass damit quasi vollst&auml;ndige Schadensimmunit&auml;t erreicht werden kann. (von Fulminictus und Drachent&ouml;tern mal abgesehen)<br/>
R&uuml;stung modifiziert die Trefferchance:<br/>
Die R&uuml;stung reduziert hier nicht den ankommenden Schaden, sondern reduziert die ANzahl der Treffer auf dem Ziel.<br/>
Beispiel: AD&amp;D<br/>
Nachteil: Es kann vorkommen, das wie in AD&amp;D charklassen untreffbar werden, was einer fast v&ouml;lligen Schadensimmunit&auml;t entspricht (M&ouml;nche! RK wie nen Krieger, SR -/1, Magiresistenz &gt;100%, Rettungsw&uuml;rfe an der Decke)</p>
<p>Interessant und 'ner genaueren Betrachtung w&uuml;rdich ist das System Von Diablo oder besser Diablo2. Hier gibt es ein Cap, was diese komplettimmunen unm&ouml;glich macht.</p>
<p>So jetzt hab ich hier meinen geistigen M&uuml;ll endgelagert, und es ist sow viel geworden, das sich das bestimmt keine Sau durchliesst, und ich keine Lust hab alles Korrektur zu lesen.</p>
</div>