+++
title = "Pikachu treten!"
date = "2008-10-28T01:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/1002"
aliases = "blog/1002"
+++

<p>ICH HABS GESCHAFFT! Ich habe mir eine Version von <a href="http://www.gamespot.com/n64/action/supersmashbros/index.html" target="_blank">Smash Bros. 64</a> besorgt!<!--more--></p>
<p>Endlich habe ich bei IEEEHH!-Bay eine "g&uuml;nstige" Version des wahrscheinlich besten Multiplayer-Spieles f&uuml;r das Nintendo64 ergattern k&ouml;nnen. Mit 11&euro; inkl. Porto und Verpackung ist es f&uuml;r ein derartig altes Spiel sicher f&uuml;r einige unverst&auml;ndlich teuer, doch wenn man sich vor Augen h&auml;llt dass ich selbst f&uuml;r ein simples Mario64, welches wohl eines der 2-3 am h&auml;ufigsten erh&auml;ltlichen Spiele f&uuml;r diese Konsole ist, auf einem Flohmarkt bereits &gt;10&euro; abdr&uuml;cken m&uuml;sste, sieht die Sache schon etwas anders aus.</p>
<p>F&uuml;r diejenigen die Smash Bros. nicht mehr kennen: Es handelt sich um ein Pr&uuml;gelspielchen bei dem man mit typischen Videospielcharakteren aus der Nintendo-Welt gegeneinander antritt. Es ist also endlich m&ouml;glich <a href="http://de.wikipedia.org/wiki/Donkey_Kong" target="_blank">Donkey Kong</a> auf <a href="http://de.wikipedia.org/wiki/The_Legend_of_Zelda" target="_blank">Link</a> und <a href="http://de.wikipedia.org/wiki/Pikachu" target="_blank">Pikachu</a> zu hetzen oder mit <a href="http://de.wikipedia.org/wiki/Kirby" target="_blank">Kirby</a> <a href="http://de.wikipedia.org/wiki/Samus_Aran" target="_blank">Samus Aran</a> zu verschlucken. Selbst der ewig unterdr&uuml;ckte <a href="http://de.wikipedia.org/wiki/Yoshi_(Super_Mario)" target="_blank">Yoshi</a> darf endlich auch mal Mario und seinen fiesen, gr&uuml;nen Bruder erledigen.</p>
<p>Vor allem mit 2-4 Spielern macht dieses Rom massig Spa&szlig; f&uuml;r einige Stunden. Egal ob man im Coop-Modus mit beliebig verstellbaren Teams und Handicaps spielt oder ob man nur 2 Figuren gegeneinander hetzt.</p>
<p>Die Sonderf&auml;higkeiten der Figuren sind nahezu komplett &uuml;bernommen was es einfach lustig macht mit Samus aufgeladener Kanone Gegner wegzuputzen, Minen zu legen, Links Fanghaken zu verwenden, als Kirby F&auml;higkeiten eingesaugter Gegner zu absorbieren, unverwundbarkeits-Sterne zu fangen, Donkey-Kong-F&auml;sser zu werfen, ... oder sonst IRGENDWELCHE F&auml;higkeiten oder Gegenst&auml;nde aus unterschiedlichsten Spielen zu vergleichen. Die permanent erscheinenden Gegenst&auml;nde bringen auch noch einiges an Abwechslung ins Spiel und die Art wie Punkte verteilt werden (Mehr schaden -&gt; man fliegt bei Treffern weiter, wer aus dem Bild fliegt verliert ein Leben, es existiert nahezu kein praktisches Schadenlimit bei dem man stirbt) sorgen f&uuml;r &Uuml;berraschungseffekte und stundenlangen Gespr&auml;chsstoff.</p>
<p>Der einzige kleine Designfehler: Bei manchen Leveln kann es mit 4 Figuren oder mehr etwas wirr auf dem Feld werden und man hat ein wenig Probleme seine Eigene Figur zu finden. Da die anderen die gleichen Probleme haben ist das aber nicht wirklich schlimm.</p>
<p>Fragen an die Leser: Welche anderen tollen Partyspiele f&uuml;r N64 sollte ich mir dringend zulegen? Welche Spiele haben euch beeindruckt und welche spielt ihr heute noch gerne.</p>
<p>BTW: N&auml;chstes Projekt ist dann ein funktionierendes SNES mit Spielen auftreiben, ich MUSS <a href="http://de.wikipedia.org/wiki/Chrono_Trigger" target="_blank">Chrono Trigger</a> unbedingt mal im Original spielf&auml;hig besitzen. *g*</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_846" onclick="set_comment_reference(846)" title="auf diesen Kommentar antworten">#846</a>:
    28.Oct.2008 03:10
    von
    
      
        Tsukama
      
    
    
  </p>
<p>Hmmmmm. &Uuml;ber Mario Kart 64 wird zwar allerorts geschimpft, aber ich finde es immer noch super-super-ober cool.</p>
<p>Oooooh, und Diddy-Kong Racing. Auch noch unbedingt reinfahren!</p>
<p>Ansosnten gebe ich Dir jetzt mal den Tipp, das Eine oder Andere Mal bei GIGAs "Telespiel" reinzuzappen oder per Livestream zu gucken, da gibt es immer wieder mal richtig sch&ouml;ne Retro-Klassiker.</p>

<p class="infos">
<a href="#comment_847" onclick="set_comment_reference(847)" title="auf diesen Kommentar antworten">#847</a>:
    28.Oct.2008 03:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Mariocart und anderes Standardzeug hab ich nat&uuml;rlich schon rumliegen... h&auml;tte ich wohl erw&auml;hnen sollen.</p>
<p>Diddi Kong ist ja auch eigentlich nur ein erweitertes Mario-Cart, wobei ich bei Mario den Ballon-Modus einfach am genialsten finde und bei Diddy etwas vergleichbares fehlt. Daf&uuml;r gibts dort andere Fahrzeuge und mehr Strecken.</p>
<p>Snowboard-Kids ist &uuml;brigens auch ein nettes Partyspiel, es ist einfach wahnsinnig erheiternd wie schnell sich da 1m vor dem Ende noch die Plazierung komplett umkrempeln kann.</p>
<p>Gibts eigentlich Micro-Machines f&uuml;r N64? Das w&auml;re auch mal ne Idee.</p>

<p class="infos">
<a href="#comment_848" onclick="set_comment_reference(848)" title="auf diesen Kommentar antworten">#848</a>:
    29.Oct.2008 03:10
    von
    
      
        Tsukama
      
    
    
  </p>
<p>Hmmmmmm..... Wei&szlig; ich jetzt nicht. Kann mich auch nicht erinnern, das jemals gesehenzu haben. Aber es gibt noch ein Spiel, was ich damals super lustig fand: Titel f&auml;llt mir gerade nicht ein; es geht darum, dass man als Baustellenfahrzueg (Bagger, Kipplaster, etc.) eine Bahnstrecke von diversen Geb&auml;uden "reinigen" muss. Verdammich nocheinaml, aber ich komme nicht auf den Titel.</p>

<p class="infos">
<a href="#comment_849" onclick="set_comment_reference(849)" title="auf diesen Kommentar antworten">#849</a>:
    29.Oct.2008 03:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>ich erinner mich auch daran... wenn auch dunkel.<br/>
War es irgendwas mit Destruction?</p>

<p class="infos">
<a href="#comment_850" onclick="set_comment_reference(850)" title="auf diesen Kommentar antworten">#850</a>:
    30.Oct.2008 01:10
    von
    
      
        Tsukama
      
    
    
  </p>
<p>Hab's raus! Das Spiel hei&szlig;t "Blast Corps". Wenn ich meinen Bruder nicht h&auml;tte :-)</p>
<p>Und hier: "Wave Race" - auch was f&uuml;r Dich?????</p>

<p class="infos">
<a href="#comment_851" onclick="set_comment_reference(851)" title="auf diesen Kommentar antworten">#851</a>:
    30.Oct.2008 01:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>jetzt wo du es sagst.. stimmt!</p>
<p>Wave Race liegt schon @home.<br/>
Was mir noch eingefallen ist: evtl. finde ich ja irgendwo noch ne Version von Destruction Derby. :-D</p>

<p class="infos">
<a href="#comment_852" onclick="set_comment_reference(852)" title="auf diesen Kommentar antworten">#852</a>:
    31.Oct.2008 03:10
    von
    
      
        Tsukama
      
    
    
  </p>
<p>Das macht auf jeden Fall Spa&szlig;.<br/>
Und ich w&uuml;nsch jetzt zum Abschluss viele gl&uuml;ckliche und vergn&uuml;gliche Stunden mit dem neu-erworbenen St&uuml;ck Nostalgie :-)</p>
<p>In diesem Sinne einen sch&ouml;nen Feiertag (ich muss leider schaffen - in Hesse gibt's kaan Reformationdach <em>g</em>) und ein sch&ouml;nes WE!</p>

<p class="infos">
<a href="#comment_853" onclick="set_comment_reference(853)" title="auf diesen Kommentar antworten">#853</a>:
    31.Oct.2008 03:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Danke, bisher sind wir leider nur einmal dazu gekommen das auch wirklich zu spielen, aber das kommt noch. (leider nicht dieses Wochenende, da sind wir bei Cindys Eltern)</p>
<p>Reformationstag ist ja ganz nett.. aber irgendwie h&auml;tte ich lieber an Diskordianischen Feiertagen frei statt an diesen Christlichen. <em>g</em></p>

<p class="infos">
<a href="#comment_854" onclick="set_comment_reference(854)" title="auf diesen Kommentar antworten">#854</a>:
    25.Nov.2008 11:11
    von
    
      
        <a href="/2008/11/25/spielekonsole-pc/" target="_blank">
          Spielekonsole PC &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] Situation bei der jemand das N64 in der Wohnstube sieht und wir erstmal zu viert anfangen uns via Smash Bros. zu [...]</p>
</div>