+++
title = "Wahnsinn Studium"
date = "2008-02-19T11:02:00"
author = "Dr. Azrael Tod"
issoid = "blog/323"
aliases = "blog/323"
+++

<p><span style="font-weight:bold;"><span style="font-style:italic;">Hai-tesch</span></span><br/><br/><br/>Wohl nahezu jeder kennt den IT-m&auml;&szlig;igen Bl&ouml;dsinn, den viele &ouml;ffentliche Einrichtungen und auch manche kleine bis mittlere Firmen veranstalten. Wer mag es solchen Organisationen auch ver&uuml;beln, das l&auml;uft dort nunmal meistens nur nebenbei ab bzw. es gibt dort einfach kein Personal daf&uuml;r. Man kann einfach nicht von einem Physik- und Geographie-Lehrer erwarten, dass er eine Schul-HP wie ein Profi betreibt, der f&uuml;r genau das bezahlt wird.<br/><br/>Normalerweise sollte es aber an einer Hochschule etwas anders aussehen. Dort gibt es immerhin nicht nur eine komplette Einrichtung, die f&uuml;r nichts anderes zust&auml;ndig ist (z.B. Hochschul-Rechenzentrum oder Zentrum f&uuml;r Kommunikation und Informationstechnik, Namen k&ouml;nnen abweichen oder sich auch &ouml;fters mal &auml;ndern, wenn der Ruf v&ouml;llig im Eimer ist), nein in den meisten Hochschulen gibt es sogar Fachbereiche die diese Dinge unterrichten sollten und wo daher auch ein gewisses Know-How verf&uuml;gbar sein sollte.<br/><br/><br/>An der Hochschule, an der ich studiere (noch Gegenwart) merkt man davon relativ wenig. Das wirkt sich teilweise recht harmlos aus. (z.B. durch eine Homepage, &uuml;ber die ich alleine schon einen ganzen Beitrag schreiben k&ouml;nnte.)<br/><br/>Teilweise f&uuml;hrt das ganze aber auch zu recht seltsamen Ergebnissen.<br/><br/>So ist es z.B. bei den meisten Fachbereichen Gang und Gebe sich f&uuml;r Pr&uuml;fungen im Internet einzuschreiben, jedoch die Studenten des Fachbereiches "Physikalische Technik/Informatik" m&uuml;ssen sich noch per Stift im Geb&auml;ude des Physik-Fachbereiches einschreiben (3 Klingeln vorhanden, auf keinen Fall die falsche dr&uuml;cken, die richtige ist nicht bekannt).<br/><br/><br/>Ein weiterer, lustiger Fakt ist die Art wie die Professoren Dateien an die Studenten verteilen.<br/><br/>Viele Fachbereiche haben sich darauf geeinigt, Daten wie Scripte, Aufgaben oder &auml;hnliches, &uuml;ber das f&uuml;r alle Studenten lesbare SMB-Netzlaufwerk (dank VPN und &auml;hnlichem auch per Internet erreichbar) Y zu verteilen. Man findet wichtige Sachen also unter Y:\Fachbereich\Prof\. Dies neigt in F&auml;llen, in denen der Fachbereich nicht 100%ig klar ist oder mehrere Fachbereiche involviert sind zu Un&uuml;bersichtlichkeit, ist aber insgesamt annehmbar. (Dass das VPN an der Hochschule grausam konfiguriert ist, ist ein anderes Thema.)<br/><br/>Der Fachbereich Informatik jedoch (unabh&auml;ngig von Physik) hat noch ein paar zus&auml;tzliche M&ouml;glichkeiten:<br/></p><ul><br/><br/><li>Das "Intranet der Fachgruppe Informatik", eine einfache Webseite im Internet, die nur per HTTPS erreichbar ist, ein seit ewigen Zeiten abgelaufenes Zertifikat ben&ouml;tigt und dank dem Zwang sich anzumelden nur f&uuml;r Informatikstudenten erreichbar ist. Letzteres wirkt sich lustig aus, wenn andere Studenten mit in der Vorlesung sitzen. Sie kommen nicht an die Unterlagen. (und warum das ganze Intranet genannt wird entschlie&szlig;t sich mir vollkommen -.-)</li><br/><li>Das Informatik-spezifische Laufwerk "Inflehre", praktisch nochmal genau das selbe wie "Lehre" (Y:), nur halt eben Informatikerspezifisch. (Es k&ouml;nnten ja andere Studenten unsere &Uuml;bungsaufgaben sehen... *panic*)</li><br/><li>das Bildungsportal-Sachsen/OPAL - eine weitere Webseite, diesmal eine die &uuml;ber mehrere Hochschulen hinweg die e-learning-Zugriffe vereinheitlichen soll. Da auf diesem Portal aber der Professor die Studenten, die sich f&uuml;r eine Vorlesung eingetragen haben noch nachtr&auml;glich freischalten muss, bevor diese Zugriff auf die Daten erhalten, warten noch heute manche Studenten auf ihre Daten von Vorlesungen die bereits Jahre her sind.</li><br/><li>Der Projektserver Informatik - noch eine Webseite, diesmal mit SVN- und CVS-Server, was f&uuml;r diverse &Uuml;bungprojekte genutzt wird. Allerdings sollte man sich von dem offiziell klingendem Namen nicht ablenken lassen, genau genommen gibt es nur einen Professor, der das ganze sowohl betreibt als auch nutzt.</li><br/><li>Diverse private Homepages der Professoren - Mit dieser M&ouml;glichkeit wird das ganze endg&uuml;ltig verwirrend, wer wei&szlig; schon immer, welcher Professor &uuml;berhaupt eine eigene Homepage hat und dann noch wo diese genau zu erreichen ist? (im Idealfall noch unter fh-webseite/~prof-k&uuml;rzel) Die Webseiten haben nat&uuml;rlich im Durchschnitt noch ein um einiges schlechteres Design als alles Andere.</li><br/></ul><br/>Der Rekord, der gleichzeitig verwendeten M&ouml;glichkeiten liegt &uuml;brigens (zum Gl&uuml;ck) bei 3, dies wurde daf&uuml;r von mehreren Professoren, unabh&auml;ngig voneinander geschafft. Dadurch kann man nichtmal mit dem Suchen nach Unterlagen aufh&ouml;ren, wenn man welche gefunden hat.. es k&ouml;nnten ja noch irgendwo an anderer Stelle welche rumliegen.<br/><br/>Noch zu bemerken w&auml;re dass es auch durchaus 1-2 Professoren gibt, die es trotz diesen Wirrwars an M&ouml;glichkeiten geschafft haben, ihre eigenen Daten &uuml;bersichtlich anzubieten. Dies geschieht im Idealfall einfach durch eine einfache Textdatei in der nichts anderes steht als "Meine Daten finden sie generell ..." und die dann auf 2-3 dieser M&ouml;glichkeiten als einziger Inhalt unter dem Namen des Professors angeboten wird.<br/>Diese L&ouml;sung w&auml;re aber wohl als Vorschlag f&uuml;r die ganze Fachgruppe einfach zu Low-Tech um sie in Erw&auml;gung zu ziehen.
      
    
  