+++
title = "Rant: Bundeswarez"
date = "2008-10-07T02:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/857"
aliases = "blog/857"
+++

<p>Mal ganz kurz in die Runde gefragt:<br/>Gibt es eigentlich noch einen ernsten Grund f&uuml;r den die Bundeswehr ben&ouml;tigt wird?<br/>Angeschafft haben wir sie doch (wenn ich mich richtig erinnere) um die BRD im Notfall gegen die Armee des Ostblockes zu verteidigen, sollte dieser Angreifen. Auch daf&uuml;r sollten sie genannte Streitkr&auml;fte nur so lange aufhalten, bis die Streitkr&auml;fte der NATO-B&uuml;ndnispartner vor Ort w&auml;ren. (Daher ist auch der alte Spruch "Die Bundeswehr soll den Feind solange aufhalten bis richtiges Milit&auml;r kommt" nicht wirklich falsch.)<!--more--></p>
<p>Der Ostblock existiert schon eine Weile nicht mehr und die Landesverteidigung k&ouml;nnten wir doch jetzt eigentlich komplett &uuml;ber NATO abwickeln oder?  Will noch jemand ernsthaft behaupten es w&auml;re nicht sinnvoll die bestehenden Streitkr&auml;fte stark zu reduzieren und komplett unter NATO-Verwaltung zu stellen?</p>
<p>F&uuml;r diesen Zweck w&uuml;rde bestimmt auch nur ein Bruchteil der derzeitigen Gelder ausreichen, die Wehrpflicht w&uuml;rde nat&uuml;rlich ebenfalls wegfallen, womit wir auch gleich eine Umstellung zu einer erheblich effektiveren und schlagkr&auml;ftigeren Berufsarmee durchgezogen h&auml;tten.</p>
<p>Die anderen NATO-Parteien h&auml;tten damit sicher auch kein Problem, immerhin h&auml;tten sie damit eine st&auml;rkere Kontrolle &uuml;ber "unsere" Streitkr&auml;fte. Das einzige Problem an der Sache w&auml;ren wohl die Zivildienstleistenden... wir m&uuml;ssten tats&auml;chlich Leute f&uuml;rs Altenheim und Krankenhaus anstellen die dann nat&uuml;rlich auch f&uuml;r solche Shicejobs ordentlich bezahlt werden wollen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_723" onclick="set_comment_reference(723)" title="auf diesen Kommentar antworten">#723</a>:
    07.Oct.2008 04:10
    von
    
      <a href="/blog/author/toranor/">
        toranor
      </a>
</p>
<p>Mit der kohle, die wir mit der abschaffund der wehrpflicht einsparen w&uuml;rden, k&ouml;nnten wir genug leute bezahlen, die alten leuten den arsch nachtragen.</p>

<p class="infos">
<a href="#comment_724" onclick="set_comment_reference(724)" title="auf diesen Kommentar antworten">#724</a>:
    07.Oct.2008 04:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Sicherlich.. die Zivis bezahlen wir ja im Moment auch, die Ersparnisse durch die Bundeswehr sollten wohl die Mehrkosten um den Faktor 100 oder so &uuml;bersteigen.</p>

<p class="infos">
<a href="#comment_725" onclick="set_comment_reference(725)" title="auf diesen Kommentar antworten">#725</a>:
    07.Oct.2008 05:10
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>Es ist doch jetzt schon so, dass nur ein Bruchteil derer die nicht verweigern zum Bund eingezogen werden. Damit ist zumindest die Wehrpflicht absolut hinterfragbar.</p>
<p>Wozu wir &uuml;berhaupt eine Armee ben&ouml;tigen die uns mehr oder weniger verteidigen kann frage ich mich auch seit langem.</p>
<p>Da Teile der Politik aber genau unsere liebe Bundeswehr f&uuml;r Inlandsaufgaben einspannen will &amp; man in Erg&auml;nzung mit einer Abschaffung vielen "im Beruf erfolgreichen Leuten" die Arbeitsgrundlage entziehen w&uuml;rde, wird sich da sicher nix ver&auml;ndern sagt mir zumindest mein Gef&uuml;hl.</p>
<p>Und ich bezweifel auch dass man ggf. dieses erspaarte Geld in die Sozialbranche stecken w&uuml;rde in der bis dato viele Zivis reale Arbeitspl&auml;tze blockieren. War zumindest in meiner Zivi-Zeit so.</p>

<p class="infos">
<a href="#comment_726" onclick="set_comment_reference(726)" title="auf diesen Kommentar antworten">#726</a>:
    07.Oct.2008 05:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ich bezweifel ja selber auch dass etwas passiert... aber das &auml;ndert ja nichts daran dass es sollte.</p>
<p>Ich finde es durchaus bedenklich wie Dinge deren Nutzen kaum jemand bestreitet dennoch nichtmal &ouml;ffentlich diskutiert werden.</p>

<p class="infos">
<a href="#comment_727" onclick="set_comment_reference(727)" title="auf diesen Kommentar antworten">#727</a>:
    07.Oct.2008 09:10
    von
    
      
        <a href="http://www.bunix.de" target="_blank">
          reaper
        </a>
</p>
<p>Da gibt es viele Gr&uuml;nde:</p>
<p>1) Die Grenze in Afghanistan verteidigen und weil sich auf dem Weg dahin so viele Soldaten in muslimische Jungefrauen verlieben und verschwinden brauchen wir so viele Soldaten, quasi auf Vorrat.</p>
<p>2) Zum Steuernsparen, weil die Pr&uuml;gelbullen kosten die L&auml;nder bei jeder Demo ein Verm&ouml;gen, Soldaten sind da viel billiger, so eine Kugel kostet einfach weniger als ein Schlagstock und ist auch viel effektiver.</p>
<p>3) Russland k&ouml;nnte Deutschland ja mit Georgien verwechseln und ehe dann die USA da sind und eingreifen m&uuml;ssen unsere Kinder in der Schule wieder die Arme verschr&auml;nken und fremde Alphabete lernen.</p>
<p>Nunja, man k&ouml;nnte diese Liste noch endlos weiterf&uuml;hren, aber in Wirklichkeit wissen wir doch alle wozu die Bundeswehr gebraucht wird... Wie alle moralisch Verschlissenen Institutionen ist doch der Besitz eines stehenden Heeres der Stolz eines jeden Landesvaters / -mutter</p>

<p class="infos">
<a href="#comment_728" onclick="set_comment_reference(728)" title="auf diesen Kommentar antworten">#728</a>:
    08.Oct.2008 09:10
    von
    
      
        <a href="http://malison.org" target="_blank">
          Carsten M&uuml;ller
        </a>
</p>
<p>Die Abschaffung der Wehrpflicht und die Reduzierung der Truppe auf eine kleine daf&uuml;r professionelle Berufsarmee wurde schon zu meiner Bundeswehrzeit diskutiert. Der Vorteil liegt auf der Hand, das Geld was wir f&uuml;r die Wehrpflichtigen und deren Ausbildung und Einsatz ausgeben k&ouml;nnten wir Sinnvollerweise in die Ausr&uuml;stung einer Spezialisierten Truppe stecken. Dann kommt es auch nicht mehr vor das man auf dem Wechsellauf des MG-3 noch das Hakenkreuz eingestanzt sieht weils ja nur ne Neuauflage des MG-42 aus dem 2. WK ist...</p>

<p class="infos">
<a href="#comment_729" onclick="set_comment_reference(729)" title="auf diesen Kommentar antworten">#729</a>:
    08.Oct.2008 07:10
    von
    
      
        Numanoid
      
    
    
  </p>
<p>@Carsten M&uuml;ller: Jaja, die alten M&auml;rchen von den eingestanzten Hakenkreuzen an diversen Waffen.<br/>
Kleiner Tip:  Mg3 hat Kaliber 7,62x51 das MG42 8x57, das passt nicht.</p>

<p class="infos">
<a href="#comment_730" onclick="set_comment_reference(730)" title="auf diesen Kommentar antworten">#730</a>:
    13.Oct.2008 10:10
    von
    
      
        <a href="/2008/10/13/der-hund-hat-meine-hausaufgaben-gefressen/" target="_blank">
          Der Hund hat meine Hausaufgaben gefressen! &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] um die Finanzierung dieser &uuml;beralterten Struktur zu rechtfertigen. Meiner Meinung dazu hab ich ja bereits Ausdruck verliehen. [...]</p>
</div>