+++
title = "because i can!"
date = "2009-05-04T11:05:00"
author = "Dr. Azrael Tod"
issoid = "blog/1389"
aliases = "blog/1389"
+++

<p>Da ich jetzt seit geraumer Zeit mit meinem Studium aufgeh&ouml;rt habe, verf&uuml;ge ich endlich wieder &uuml;ber genug Zeit und Geld um selbiges mit dem Spielen am Computer zu verschwenden. Bisher reichte mir zwar f&uuml;r alle praktischen Anwendungen durchaus mein <a href="/2008/10/19/medion-akoya-mini-e1210/">Medion Akoya Netbook</a> (eigentlich auch zum Spielen, Morrowind, Dosspielen und SNES-Emulatoren sei dank) aber der interne Bildschirm ist schon arg ungeeignet und mit der Zeit sammelt sich dann doch so einiges an was man zwar nicht direkt vermisst, aber doch irgendwo ganz gerne h&auml;tte.</p>
<p>Es wurde also Zeit sich etwas neuere Hardware zuzulegen.<!--more--></p>
<p>Angefangen hat wohl alles mit dem Kauf eines neuen Keyboards und einer Maus (A4 Tech - X7) mit passendem Mauspad (Sharkoon 1337 Black)... immerhin auch sehr gut nutzbar mit dem Netbook, man will ja auch nicht st&auml;ndig mit dem Touchpad in Magic Carpet festh&auml;ngen. Nachdem ich dann viele Wochen um alle m&ouml;glichen PC L&auml;den herumgeschlichen bin und mich auch ausgiebig von Toranor beraten lassen hab (bei Spielehardware ist er wohl erheblich besser auf dem Laufenden als ich), habe ich mir einen PC zusammengestellt den ich mir so f&uuml;r grob 700&euro; gerne irgendwo kaufen wollte.<br/>Mein Preisliches Ziel habe ich zwar knapp verfehlt, aber ich habe es nicht bereut.</p>
<p>Hier die Hardware:<br/></p><ul><br/><li>Prozessor: Intel Core 2 Duo Prozessor E8500 2x 3.16Ghz</li><br/><li>Grafikkarte 512 MB ATI Radeon HD4870 PCI-E</li><br/><li>Arbeitsspeicher 4096MB DDR2 Dual Channel 800Mhz (PC2-6400)</li><br/><li>Mainboard: ASUS P5N-D (Chipsatz: nVIDIA nForce 750i SLI)</li><br/><li>CPU K&uuml;hler: Akasa AK-956CP K&uuml;hler</li><br/><li>Geh&auml;use: Thermaltake Armor JR Midi Tower ohne Seitenfenster (Schwarz)</li><br/><li>Netzteil: 450 Watt BeQuiet</li><br/><li>Festplatte 500 GB SATA, 7200rpm, 8MB</li><br/><li>optisches Laufwerk 20x DVD+-RW Double Layer Brenner Laufwerk (irgendwas halt)</li><br/><li>Card Reader: 3.5 Zoll 16/1 Card Reader zum Einbau in den Floppy-Schacht</li><br/></ul>
<p>Dieser Rechner war dann nicht nur seit 5-6 Jahren der erste gro&szlig;e Kasten an Computer den ich mir &uuml;berhaupt wieder gekauft habe, er war auch seit meinem allererstem PC (Pentium 60, gebraucht) erst der Zweite in diesem Format, den ich nicht selbst zusammengebaut habe. Im nachhinein bereue ich diese Entscheidung auch keineswegs, die Kabel sind sehr sch&ouml;n verlegt (es ist halt alles darauf ausgelegt durch ein nicht vorhandenes Seitenfenster hindurch betrachtet zu werden) und alles sieht erheblich ordentlicher und aufger&auml;umter aus als ich es von meinen Eigenkonstruktionen gewohnt bin.</p>
<p>Nun hatte ich einen sehr kraftstrotzenden PC, doch die Bildwiedergabe stellte noch so ein "kleines" Problem dar. Der einzige externe Monitor war ein beinahe antiker 19 Z&ouml;ller CRT, der an einer Umschaltbox und 4 VGA-Kabeln hing und hier f&uuml;r DVD-Wiedergabe und &auml;hnliches genutzt wird.<br/>Der urspr&uuml;ngliche Plan, diesen Bildschirm gegen ein zeitgem&auml;&szlig;es und gr&ouml;&szlig;eres TFT-Modell zu ersetzen und diesen Bildschirm 3m weiter auf meinem Schreibtisch zum Spielen zu verwenden hatte leider einen kleinen Nachteil: ich h&auml;tte weiterhin einen &gt;20kg schweren Klotz von R&ouml;hre hier rumstehen gehabt.</p>
<p>In einem weiterem Blitzentschluss bin ich also letzten Samstag nochmal mit meiner besseren H&auml;lfte losgezogen und habe mir 2 Bildschirme gekauft, einen 23,6-Z&ouml;lligen als Media-Display und einen 19" TFT als Dekoration f&uuml;r meinen Schreibtisch.</p>
<p>Nachdem mich dann Samstag hingesetzt habe, meinen Homeserver/Mediaplayer (seit 3 Jahren das erste mal) neu aufgespielt habe und am gestrigen Sonntag gegen halb 1 Abends dann doch noch mal der Ehrgeiz packte und ich schnell einige Kabelkan&auml;le abgeschraubt und meine Netzwerkinstallation von reinem WLAN auf fast komplett verkabelt umgestellt habe (eine Aktion die ich seit dem Einzug vor fast einem 3/4-Jahr vor mir hergeschoben habe), bin ich nun mit meiner Ausstattung so ziemlich zufrieden.... erstmal.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1276" onclick="set_comment_reference(1276)" title="auf diesen Kommentar antworten">#1276</a>:
    07.May.2009 08:05
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>uh, gz ^^<br/>
ab und an muss dat mal se&icirc;n ^^</p>

<p class="infos">
<a href="#comment_1277" onclick="set_comment_reference(1277)" title="auf diesen Kommentar antworten">#1277</a>:
    13.May.2009 09:05
    von
    
      
        <a href="/2009/05/13/kein-opensource-unter-windows/" target="_blank">
          Kein OpenSource unter Windows &amp;laquo; G33KY^2 &amp;#8211; The Nerd Strikes Back
        </a>
</p>
<p>[...] ist mir dies als ich neulich meinen neuen Spiele-PC (Codename: &ldquo;WOPR&ldquo;) als ersten seit einem halben Jahrzehnt freiwillig mit Windows [...]</p>
</div>