+++
title = "Homeservergehäuse#2"
date = "2008-09-22T10:09:00"
author = "Dr. Azrael Tod"
tags = ["Hardware", "Nerdig", "PC", "Technik", "Homeservergehäuse"]
issoid = "blog/772"
aliases = "blog/772"
+++

<p>Freitag fing ich endlich an die Realisation meines Geh&auml;use-Projektes (<a href="/2008/9/5/Homeservergeh&auml;use/">0</a> <a href="/2008/9/19/Homeservergeh&auml;use1/">1</a>) ernsthafter in Angriff zu nehmen. Als erstes habe ich mal versucht die Skizze meines Geh&auml;useaufbaus via <a href="http://www.ribbonsoft.de/qcad.html" target="_blank">QCAD</a> in ein digitales Format zu bringen, leider ist QCAD eigentlich nur f&uuml;r 2D gedacht und meine pers&ouml;nliche CAD-Kompatibilit&auml;t hat sich seit der Berufsschule nicht verbessert. Ich kann noch immer nichts ernsthaftes mit diesen Programmen anfangen, die Bauteile per Hand zusammenf&uuml;gen und mal "sehen wie es passt" bringt mir mehr. Um mich daran zu erinnern wie ich alles positionieren wollte reicht dann auch eine handgezeichnete Skizze.<br/>Die DXF-Datei gibt es auf Anfrage, sagt aber wirklich nahezu garnichts aus.</p>
<p>Die Zweite Phase begann dann am Samstag, ich machte mich auf um Baumaterial zu beschaffen. Ich h&auml;tte allerdings gleich in den Bus steigen sollen und zu einem Baumarkt oder so fahren sollen. In der Dresdner Neustadt schienen sich die Ladenbesitzer gegen mich verschworen zu haben. Schreibwarenl&auml;den (f&uuml;r Graupappe) haben offensichtlich am Wochenende generell nicht auf, Spiddll&auml;den (M&auml;cGeiz, 1&euro;-Shop u.&auml;.) haben nichts brauchbares im Angebot und L&auml;den f&uuml;r Hobby- und Bastelzubeh&ouml;r scheinen alle Samstags gegen 13:00 zu schlie&szlig;en, was einem Informatikertagesablauf nicht gerade entgegen kommt.<!--more--></p>
<p>Wieder zuhause angekommen begab ich mich auf die Suche nach alternativem Baumaterial. Meine Aufmerksamkeit richtete sich schnell auf einen Pappkarton (eher 2, der erste war etwas flach also musste ich auf einen etwas gr&ouml;&szlig;eren mit den Ma&szlig;en: 21x35x13cm ausweichen) der mir f&uuml;r die gestellte Aufgabe ausreichend schien.<br/>Nach einigem Probieren zwecks einer neuen Raumaufteilung f&uuml;r die Baugruppen, fand sich auch eine M&ouml;glichkeit das etwas ung&uuml;nstig konstruierte Netzteil so zu integrieren dass<br/></p><ol><br/> <li>die internen Anschlusskabel zu den ben&ouml;tigten Stellen reichten</li><br/> <li>das Netzteil NEBEN das Motherboard passte statt frei dar&uuml;ber zu h&auml;ngen</li><br/> <li>Anschlusskabel nicht unbedingt auf der Unterseite des "Geh&auml;uses" befestigt werden mussten</li><br/></ol><br/>Die Bauteilliste f&uuml;r Homeserver V3 enth&auml;llt nun also folgendes:<br/><ul><br/> <li>Motherboard - VIA 7F4K (Mini-ITX, 1x PCI, 1xPATA, 2xSATA, 2xGB-LAN, 1+1xCOM, 4+4xUSB2, 0+1xParallel)</li><br/> <li>CPU - VIA C7 CN700 NANO BGA (fest verbaut)</li><br/> <li>RAM - 1GB, Qimonda (meiner besseren H&auml;lfte zuliebe)</li><br/> <li>Grafik - UniChrome Pro (onboard)</li><br/> <li>HDD - 80GB, Toshiba, 2,5"</li><br/> <li>DVD - Notebooklaufwerk, Hersteller unbekannt, aus einem Nachr&uuml;stbauteil f&uuml;r Siemens/Nixdorf Scenic 510AGP, mit Frontblende</li><br/> <li>L&uuml;fter - 12cm</li><br/> <li>Netzteil - 1x 145W l&uuml;fterlos aus Shuttle-PC unbekannter Hersteller</li><br/> <li>Fernsehkarte - WinTV, PAL-BG, PCI</li><br/> <li>Adapter - 1x 2,5"-HDD-Adapter (noname, von <a href="http://reichelt.de">reichelt.de</a>), 1x "PA-CD1" SlimCD2IDE-Adapter (ebenfals <a href="http://reichelt.de" target="_blank">reichelt.de</a>)</li><br/> <li>Pappkarton - 21x35x13cm</li><br/></ul><br/>Damit habe ich nicht nur meinen ersten PC in Aussicht, der noch im Pappkarton eingepackt bereits l&auml;uft, sondern sollte auch gleich den Preis f&uuml;r das schlechteste Geh&auml;use aller Zeiten gewinnen.
      
    
  
