+++
title = "Homeservergehäuse#3"
date = "2008-09-22T05:09:00"
author = "Dr. Azrael Tod"
tags = ["Hardware", "Nerdig", "PC", "Technik", "Homeservergehäuse"]
issoid = "blog/776"
aliases = "blog/776"
+++

<p>Heute gibt es die Dokumentation von Eigenbau-Homeservergeh&auml;use V3 "Schuhkartonserver" (andere Teile der Reihe: <a href="/2008/9/5/Homeservergeh&auml;use/">0</a> <a href="/2008/9/19/Homeservergeh&auml;use1/">1</a> <a href="/2008/9/22/Homeservergeh&auml;use2/">2</a>), also Beschreibung der Realisierung an sich, Testl&auml;ufe, erste Ausf&auml;lle, die Ursachen daf&uuml;r und <a href="http://picasaweb.google.de/drazraeltod/HomeserverV3#" target="_blank">Bilder zum System</a>.</p>
<p><!--more--></p>
<p>Passende L&ouml;cher f&uuml;r diverse Anschl&uuml;sse waren schnell geschnitten. Gelagert wurde das Motherboard auf 4 Speicherkarten-H&uuml;llen, die durch kleine "selbstklebende Antirutschquadrate" ringsrum in Position zwischen Motherboard und Wand gehalten wurden. An der Wand befestigt habe ich das Motherboard selbst mit 4 Kabelbindern, die jeder in einer Schlaufe durch jeweils 2 L&ouml;cher in der Wand befestigt wurden.<br/></p><table style="width:auto;"><tr><td><a href="http://picasaweb.google.de/lh/photo/3gqxNoyPfTuzxRYQvdDOJQ"><img src="http://lh3.ggpht.com/drazraeltod/SNd_Bjd1pEI/AAAAAAAAAM8/jkAdlgkINSM/s288/rueckansicht.jpg"/></a></td></tr><tr><td style="font-family:arial,sans-serif;font-size:11px;text-align:right;">Von <a href="http://picasaweb.google.de/drazraeltod/HomeserverV3">Homeserver V3</a></td></tr></table>
<p>&Auml;hnlich befestigt wurde der 12cm-L&uuml;fter, allerdings konnte ich bei diesem den Kabelbinder in der hintersten Ecke nicht ohne gro&szlig;en Aufwand festziehen, weshalb er nur an 3 L&ouml;chern h&auml;ngt.<br/></p><table style="width:auto;"><tr><td><a href="http://picasaweb.google.de/lh/photo/fOy8AkDqFu8yCU8de5JQUg"><img src="http://lh3.ggpht.com/drazraeltod/SNd_CJbjH3I/AAAAAAAAANE/3FYJjwS7Xf4/s288/vorderseite.jpg"/></a></td></tr><tr><td style="font-family:arial,sans-serif;font-size:11px;text-align:right;">Von <a href="http://picasaweb.google.de/drazraeltod/HomeserverV3">Homeserver V3</a></td></tr></table>
<p>Die einzige PCI-Karte (TV-Tuner, einzig f&uuml;r den Anschluss einer N64-Konsole) war &uuml;ber das Motherboard schon recht stabil befestigt, ein kleiner Schlitz im Karton an der Oberseite der Karte, durch den das oberste Teil des Slotbleches geschoben wurde, sorgte f&uuml;r die restliche Fixierung.</p>
<p>Eine Befestigung f&uuml;r das Netzteil fehlte leider noch, M&ouml;glichkeiten umfassten eine Fixierung mit Klebeband ("mit Tesa kann man alles reparieren", ich h&auml;tte dennoch etwas festeres Band genommen), Schrauben durch L&ouml;cher in der Pappe (passende Schrauben w&auml;ren kein Problem, ich bezweifelte aber die Festigkeit an der Pappwand) und weitere Kabelbinder durch die L&uuml;ftungsschlitze des Netzteiles.<br/>Ebenfalls noch nicht fest eingebaut waren Festplatte und DVD-Laufwerk.</p>
<p>Da aber die wichtigsten Bauteile erstmal recht gut plaziert waren (das Netzteil konnte erstmal im Karton risikofrei gelegt werden und die Festplatte lag au&szlig;erhalb, auf dem Karton) beschloss ich dass es erstmal Zeit f&uuml;r einen ersten Funktionstest w&auml;re.<br/>Nach kleineren Nachbesserungen an einigen L&ouml;chern im Karton war es dann auch sehr schnell m&ouml;glich alle Kabel anzubringen und meinen Eigenbau-Homeserver V3 in Betrieb zu nehmen.<br/></p><table style="width:auto;"><tr><td><a href="http://picasaweb.google.de/lh/photo/0OLOKuusItSDjKjHUZIzig"><img src="http://lh4.ggpht.com/drazraeltod/SNd_BKicGSI/AAAAAAAAAM0/OQtB1xbp-Nk/s288/innenleben.jpg"/></a></td></tr><tr><td style="font-family:arial,sans-serif;font-size:11px;text-align:right;">Von <a href="http://picasaweb.google.de/drazraeltod/HomeserverV3">Homeserver V3</a></td></tr></table>
<p>Die ersten Stunden des Testes verliefen wie erwartet recht ereignislos. Das System bootete anstandslos, zwar musste ich die Kontakte f&uuml;r den Netzschalter von Hand kurzschlie&szlig;en, da ich den extra gekauften Ein-Taster (1&euro; im Elektronikladen um die Ecke) noch nicht verbaut hatte.<br/>Das Motherboard wurde auch sehr gut bel&uuml;ftet, die Temperatur an der CPU stieg nicht merklich &uuml;ber normal an (sie war eher k&auml;lter als bei vorherigen Aufbauten), auch nach mehreren Stunden erreichten die K&uuml;hlrippen des Passivk&uuml;hlers nichtmal Handtemperatur.<br/>Ich begab mich dann mit der gewissheit dass alles in Ordnung w&auml;re und einem guten Buch ins Bett, nur um etwa eine halbe Stunde sp&auml;ter 2 Knallger&auml;usche aus dem Wohnzimmer zu h&ouml;ren.<br/>Bei meiner ganzen Optimierung des Luftstromes habe ich das Netzteil etwas ignoriert, w&auml;hrend alle anderen Bauteile ohne geringste Anstrengung ihren Dienst versahen, hat sich dieses immer St&auml;rker erhitzt, bis es sich mit genannten Spezialeffekten selbst au&szlig;er Betrieb nahm.</p>
<p>Dies hat mehrere Auswirkungen:<br/></p><ol><br/> <li>muss ich statt dem L&uuml;fterlosen Netzteil f&uuml;r Shuttle-PCs nun ein geringf&uuml;gig gr&ouml;&szlig;eres und aktiv gek&uuml;hltes ATX-Netzteil verbauen, welches aber erheblich sinnvoller positionierte Kabelausg&auml;nge, mehr Anschl&uuml;sse und eine gr&ouml;&szlig;ere Leistung mitbringt. Au&szlig;erdem ist es (was mich schon immer etwas verwunderte) LEISER als das l&uuml;fterlose, da der L&uuml;fter nahezu unh&ouml;rbar ist, das l&uuml;fterlose Netzteil jedoch meistens einen leisen Summton von sich gibt.</li><br/> <li>muss ich die Positionierung des Netzteiles im PC nun neu auslegen, was zu einem &uuml;berfl&uuml;ssigen Loch auf der Unterseite des Ger&auml;tes f&uuml;hrt, daf&uuml;r kann ich den PC nun auf seine kleinste Seite stellen (daher Unterseite).</li><br/> <li>wird ein weiteres, relativ gro&szlig;es Loch f&uuml;r L&uuml;fter und Stecker auf der Vorderseite des Kartons n&ouml;tig, dies schr&auml;nkt die Festigkeit weiter ein.</li><br/> <li>kann ich nun Festplatte und DVD-Laufwerk einfach an der Seite des Netzteiles verbauen (oder im Liegen &uuml;ber dem Netzteil). Dies erleichtert die Befestigung und l&auml;sst Platz f&uuml;r eine weitere Festplatte, sollte ich doch beschlie&szlig;en irgendwann den Speicherplatz zu erweitern (2 SATA-Steckpl&auml;tze sind ja noch frei).</li><br/></ol><br/>Alles in Allem ist das Desing durchaus brauchbar, wird jedoch in dieser Form nicht weiter verwendet werden.<br/>Es wird noch einmal n&ouml;tig den L&uuml;fter zu drehen. Er sitzt ja nun an der Oberseite und sollte die Luft eher aus dem Geh&auml;use ziehen, au&szlig;erdem bildet dies mit dem aktiven L&uuml;fter im Netzteil einen durchg&auml;ngigen Luftstrom. Weiterhin muss ich noch Netzteil, Laufwerke und Taster anbringen.<br/>Ich bin mir aber im Moment ziemlich sicher dass ich das gesamte Projekt noch einmal auf einer anderen Basis starte, ich werde mich aber wahrscheinlich an der aktuellen Anordnung orientieren und die Befestigungen/L&ouml;cher gleich so in andere Materialien einplanen.<br/>Auch die Befestigung durch Kabelbinder und die Lagerung auf den Plastikh&uuml;llen hat sich bew&auml;hrt und wird wohl auch f&uuml;r andere Materialien als einfache M&ouml;glichkeit in Erw&auml;gung gezogen.<br/>Die Karton-Pappe als Baumaterial ist halt eine Notl&ouml;sung und das merkt man auch. Die Aufh&auml;ngungen werden sich auf Dauer sicher weiter ins Material schneiden, der L&uuml;fter vibriert manchmal etwas lauter als es sein m&uuml;sste, schwerere Baugruppen w&uuml;rde ich generell am Boden verbauen und allgemein sieht das Ding einfach nur shice aus.

<p>Eigenbau-Homeserver V4 ist also bereits in Planung.</p>
<p>Die Bauteilliste f&uuml;r Homeserver V3 enthielt am Ende also folgendes:<br/></p><ul><br/> <li> Motherboard - VIA 7F4K (Mini-ITX, 1x PCI, 1xPATA, 2xSATA, 2xGB-LAN, 1+1xCOM, 4+4xUSB2, 0+1xParallel)</li><br/> <li>CPU - VIA C7 CN700 NANO BGA (fest verbaut)</li><br/> <li>RAM - 1GB, Qimonda (meiner besseren H&auml;lfte zuliebe)</li><br/> <li>Grafik - UniChrome Pro (onboard)</li><br/> <li>HDD - 80GB, Toshiba, 2,5"</li><br/> <li>DVD - Notebooklaufwerk, Hersteller unbekannt, aus einem Nachr&uuml;stbauteil f&uuml;r Siemens/Nixdorf Scenic 510AGP, mit Frontblende</li><br/> <li>L&uuml;fter - 12cm</li><br/> <li>Netzteil - 1x 200W ATX Astec</li><br/> <li>Fernsehkarte - WinTV, PAL-BG, PCI</li><br/> <li>Adapter - 1x 2,5"-HDD-Adapter (noname, von reichelt.de), 1x "PA-CD1" SlimCD2IDE-Adapter (ebenfals reichelt.de)</li><br/> <li>Pappkarton - 21x35x13cm</li><br/> <li>7 kurze Kabelbinder</li><br/></ul>
