+++
title = "Kommunikation Teil 3"
date = "2008-10-05T11:10:00"
author = "Cindy"
issoid = "blog/879"
aliases = "blog/879"
+++

<p>Die dritte Folge von Cindys Gedanken zu Medien im allgemeinen, Berichterstattung und allem was sonst noch falsch an unseren Medien ist.</p>
<p>Fernsehen - das ist die zeitnahe &Uuml;bertragung von Ton und bewegten Bildern, was vor allem zur Nachrichten&uuml;bertragung genutzt wird.<!--more--></p>
<p>Doch bei all den Serien die den ganzen Tag laufen, werden nur recht wenig Informationen &uuml;bertragen. Es sind nur Fantasiewelten, die viele von uns viel zu ernst nehmen.<br/>Diese nachgestellten Welten zeigen uns ein Idealbild wie wir es gern h&auml;tten bzw. nehmen uns die Fantasie eigene Gedanken zu entwickeln und kreativ zu sein (vor allem schlecht verfilmte B&uuml;cher).</p>
<p>Daneben gibt es aber auch noch die Talkshows, wo man immer wieder die Zur&uuml;ckentwicklung in Tiere beobachten kann, es &auml;hnelt h&auml;ufig einer Art Zoo und sollte zur Belustigung gesendet werden, h&ouml;chstens noch um uns die Umgangsformen untereinander und miteinander zu verdeutlichen.<br/>Private Problem sollten auch privat bleiben, denn es interessiert keinen warum jemand eine Brustoperation durchf&uuml;hren lies oder sich ein Paar getrennt hat.</p>
<p>Dann haben wir da noch die Gerichtsshows, die uns zeigen, was f&uuml;r eine Rechtsgrundlage wir in Deutschland zu haben scheinen. Da ich so was noch nie angeschaut habe kann ich mir dazu kein Urteil erlauben, aber es spricht vielleicht auch f&uuml;r sich, wenn ich so was noch nicht einmal angesehen habe.</p>
<p>Das einzig wirklich gute sind doch die Nachrichten, die uns wieder zeigen, wof&uuml;r unser Staat Geld hat und wof&uuml;r nicht. (Bildung und Kultur stehen immer weit unten in der Liste, es ist ja auch viel wichtiger sich stundenlange herumzustreiten, warum die CSU in Bayern versagt hat oder wie viel Geld unser Bankensystem bekommt)</p>
<p>Au&szlig;erdem kann man sich auch noch anschauen wie 21 Menschen einem Ball hinterher rennen (inkl. Schiedsrichter) oder ein Haufen Autos im Kreis fahren. Was der Wetterfrosch meint zum morgigen Wetter, das dann meist anders kommt als es gesagt wurde (und das bei der heutigen Satellitentechnik, wof&uuml;r wird der Meteorologe eigentlich bezahlt?).</p>
<p>Ach die Weltnachrichten h&auml;tte ich fast vergessen, die zeigen uns wie wir Menschen uns gegenseitig einsch&auml;tzen, denn es ist meist so, dass bei Katastrophen viele Menschen umkommen, aber nur von den Frauen und Kindern berichtet wird.<br/>Die armen M&auml;nner sind halt nur Nebensache. Genauso wird eine Katastrophe nach Nation eingestuft, denn es ist viel schlimmer, wenn in den USA ein B&ouml;rsencrash ist, als ein Erdbeben in China, es gibt schlie&szlig;lich st&auml;ndig Erdbeben.</p>
