+++
title = "Kommunikation Teil 1"
date = "2008-10-05T07:10:00"
author = "Cindy"
issoid = "blog/875"
aliases = "blog/875"
+++

<p>Im Folgenden paar kurze Gedanken zu den Themen B&uuml;cher, Sprache und Kommunikation.</p>
<p>B&uuml;cher - das sind Ansammlungen von beschriebenen Bl&auml;ttern, die meist aus Papier bestehen und die in der richtigen Reihenfolge aneinandergereiht einen Zusammenhang ergeben. Meist werden sie zum Schutz noch mit einem Umschlag versehen. Bereits die &Auml;gypter brachten ihre Gedanken zu Papier<!--more--></p>
<p>Die Verbreitung und das zug&auml;nglich machen f&uuml;r die &Ouml;ffentlichkeit machte allerdings Johannes Gutenberg m&ouml;glich mit der Erfindung des Buchdrucks im 15.Jh.</p>
<p>Im Laufe der Jahrhunderte entwickelte sich das Buch zu einer ersten Form des Massenspeichers, es wurden nicht mehr nur biblische Texte vervielf&auml;ltigt, sondern auch belletristische, wissenschaftliche u.a. Genre der Literatur entwickelten sich.</p>
<p>Heute gibt es eine Vielzahl an B&uuml;chern und trotz eines Zeitalters der multimedialen Entwicklungen ist es immer wieder ein &nbsp;angenehmes Gef&uuml;hl, wenn ich auf unser B&uuml;cherregal schaue und diese recht kleine aber durchaus gut gew&auml;hlte Anzahl von Literatur finde. Wenn ich mich in meinem Familien- und Bekanntenkreis umschaue sieht das ganz anders aus und dass merkt man auch in der Kommunikationsf&auml;higkeit.</p>
<p>Die deutsche Sprache entwickelt sich immer mehr in eine Aneinanderreihung von Abk&uuml;rzungen, Neukreationen, englischen Begriffen und einfach nur einzelnen Buchstaben, die man dann meist im Zusammenhang erraten soll.<br/>Ein kleines Beispiel: "I geh no ni pennen." Was soviel hei&szlig;t wie: "Ich gehe noch nicht schlafen.".<br/>Auf Arbeit wird sich wie folgt unterhalten: "Das ist ultra schnell und danach musst das an folgendem Tool noch mergen." Das soll hei&szlig;en, dass es sehr schnell geht und an einer bestimmten Anlage noch zusammengef&uuml;gt werden muss. Aber am schlimmsten sind die, die versuchen mit ihren Unmengen an Abk&uuml;rzungen (und da gibt es ja f&uuml;r jeden Bereich des Lebens mehr als genug) sich als intelligent und wichtig in den Vordergrund zu stellen.</p>
<p>Als Laie ist es dann immer wieder schwer, sich die richtige Bedeutung herauszusuchen, denn meist gibt es mehr als eine Variante, die gemeint sein k&ouml;nnte. Ein Beispiel: "<a href="http://de.wikipedia.org/wiki/pm" target="_blank">PM</a>" Schaut euch selbst an wie viele Variationen es gibt und ich versichere euch, dass das nicht alle sind. Ich kenne schon alleine in Dresden einen Club der diese Abk&uuml;rzung tr&auml;gt (PM "Haus Altmarkt") und bei mir auf Arbeit ist damit weder etwas politisches noch etwas religi&ouml;ses gemeint, sondern vielmehr eine Partikelmessung.</p>
