+++
title = "Kino"
date = "2008-07-05T12:07:00"
author = "Dr. Azrael Tod"
issoid = "blog/449"
aliases = "blog/449"
+++

<p>Wie bereits geschrieben war ich gestern seit Monaten mal wieder im Kino. Der Film war eigentlich recht gut, nur &uuml;ber das ganze Drumherum k&ouml;nnte ich mich stundenlang aufregen. Um das mal zu verdeutlichen werde ich mal die M&ouml;glichkeiten einen Film anzusehen gegen&uuml;ber stellen.</p>
<p>im Kino:<br/></p><ul><br/> <li>hoher Eintritt (7&euro; pro Erwachsenem bei uns, wenn man da zu 4. reingeht, kann man sich fast schon die DVD kaufen.)</li><br/> <li>mit Popcorn raschelnde Leute &uuml;berall</li><br/> <li>Popcorn und &auml;hnliches auf den Kinositzen vom letzten Film</li><br/> <li>w&auml;hrend des Filmes m&uuml;ssen sich noch Leute unbedingt rausschleichen und 5min. sp&auml;ter zur&uuml;ckkommen (Kann man nicht mal vorher aufs Klo gehen? Es ist doch vorher klar dass der Film eine Weile dauert. Evtl. sollte man nicht permanent mit dem Strohhalm in der Kola rumnuckeln, das macht nicht nur L&auml;rm sondern auch Druck in der Blase.)</li><br/> <li>15 Minuten Werbung vom Kino selbst, danach 5min. Helligkeit ("M&ouml;chte noch jemand ein EEEEEEEIIIIS!?"), dann weitere 15min. (Warum zahl ich nochmal Eintritt? Wird der Film etwa doch durch die Werbeeinnahmen finanziert?)</li><br/> <li>Die Kinositze werden verdammt unbequem auf Dauer (Nichtmal die Armlehnen kann man in Zwickau runterklappen, ganz zu schweigen davon dass zwischen mir und einem wildfremden Typ immer nur eine Armlehne ist, die meist der andere Beansprucht. F&uuml;r "Kuschelecken" in denen die Armlehne zwischen 2 Sitzen komplett fehlt zahlt man nat&uuml;rlich extra, au&szlig;erdem sind die praktisch immer ausverkauft.)</li><br/> <li>Handys klingeln w&auml;hrend des Filmes. Kann man die nicht einmal f&uuml;r 2 Stunden ausschalten? (Vibrationsallarm ist auch keine bessere Idee. -.-) Imho sollte das Kino seine R&auml;ume gegen Funkempfang abschirmen, dann w&uuml;sste eh jeder "mein Handy verbraucht hier nur sinnlos Akku, ich kann es auch ausschalten."</li><br/> <li>Jugendliche die w&auml;hrend des Filmes reden, die F&uuml;&szlig;e auf die Kopfst&uuml;tzen anderer legen oder &auml;hnliches geh&ouml;ren meiner Meinung nach aus dem Kino geworfen.</li><br/> <li>Die Toneinstellungen sind teilweise Grottig, manche Filme sind dank viel zu &uuml;bertrieben lautem Bass kaum zu ertragen. (setzt euch mal an den Rand...)</li><br/> <li>Karten im Vorverkauf kosten <a href="http://www.sebbi.de/archives/2008/04/30/vorverkaufsgebuhren-fur-kinokarten/" target="_blank">sogar</a> noch <a href="http://www.sebbi.de/archives/2008/05/07/kinokarten-online-kaufen-ii/" target="_blank">mehr</a>!</li><br/></ul><br/>DVD kaufen:<br/><ul><br/> <li>ein paar Monate Wartezeit nach Ver&ouml;ffentlichung</li><br/> <li>relativ teuer</li><br/> <li>man muss sich jedes Mal anh&ouml;ren dass "Raubkopierer Verbrecher sind" (HALLO? Ich habe mir die DVD GEKAUFT! Sonst w&uuml;rde ich mir das doch nicht ansehen m&uuml;ssen sondern h&auml;tte es rausgeschnitten...)</li><br/></ul><br/>legaler Download:<br/><ul><br/> <li>fast der gleiche Preis wie bei einer DVD</li><br/> <li><a href="http://en.wikipedia.org/wiki/Digital_restrictions_management" target="_blank"><strong>Digital Restrictions Management (DRM)</strong></a> macht es schwer bis unm&ouml;glich (f&uuml;r Otto-Normal-Nutzer) eine Sicherheitskopie der Daten zu erstellen, sie beliebig oft abzuspielen oder auf beliebigen Ger&auml;ten wiederzugeben. Die Einschr&auml;nkungen sind das einzige dem keine Grenzen gesetzt sind.</li><br/> <li>nahezu alle Einschr&auml;nkungen die ich auch sonst bei einer DVD habe (sp&auml;te Ver&ouml;ffentlichung, "Raubkopierer sind Verbrecher", ...)</li><br/> <li>Qualit&auml;t stellenweise auf TV-Niveau</li><br/></ul><br/>Freetv-Ver&ouml;ffentlichung:<br/><ul><br/> <li>kostenlos</li><br/> <li>immer 20min Film, dann 10min Werbung, das ergibt auf einen 90min Film 40min Werbung (mag auf den ersten Blick viel erscheinen aber wenn man bedenkt dass es im Kino schon 25-35min sind...)</li><br/> <li>Wartezeit &gt;&gt;1 Jahr bis zur Ausstrahlung</li><br/> <li>Qualit&auml;t oft gering, wird aber gesteigert</li><br/> <li>Einblendungen (*pling*) unter, &uuml;ber, neben und quer &uuml;ber den Film w&auml;hrend der eigentlichen Handlung</li><br/> <li>Werbung kann per recorder zu gro&szlig;en Teilen umgangen werden, dadurch ist auch ein ansehen zu beliebigen Zeiten m&ouml;glich</li><br/> <li>100% legal</li><br/></ul><br/>Pay-TV:<br/><ul><br/> <li>relativ billig wenn man sich alle Filme ansieht (macht aber eher keiner), f&uuml;r Gelegenheits-Zuschauer ziemlich teuer</li><br/> <li>keine Werbeunterbrechungen im Film</li><br/> <li>Verwertung durch Aufnahme wie beim Free-TV m&ouml;glich, ebenfalls legal</li><br/> <li>Wartezeit entspricht ca. der Wartezeit bei legalen Downloads</li><br/></ul><br/>illegale Downloads:<br/><ul><br/> <li>ver&ouml;ffentlichung oft schon direkt bei Kinostart (zeitweise sogar fr&uuml;her, Qualit&auml;t dann aber oft noch mies)</li><br/> <li>Qualit&auml;t bei DVD-Ver&ouml;ffentlichung meinst der DVD fast ebenb&uuml;rtig</li><br/> <li>jederzeit verf&uuml;gbar, kein DRM, keine Kosten, keine "Raubkopierer sind Verbrecher"-Spots, keine Werbung, in allen Sprachen verf&uuml;gbar, extras bei DVD-Ver&ouml;ffentlichung auch oft verf&uuml;gbar</li><br/> <li>illegal (ja klar.. kriminalisieren und verhaften wir das ganze Volk... die Gef&auml;ngnisse waren eh grade leer.), meist aber nicht Nachweisbar (ein Bildschirmphoto mit einer IP-Adresse ist KEIN Beweis.<a href="http://www.wangoo.de/2008/07/02/die-eu-abgehort/" target="_blank"> Dateinamen sagen auch nichts &uuml;ber den Inhalt aus, Hash-Werte ebenfalls nicht.</a>)</li><br/></ul><br/>Wenn ich mir die ellenlange Liste von negativen Eintr&auml;gen unter Kino so ansehe, f&auml;llt es mir nicht schwer zu glauben dass die Einnahmen aus dieser Quelle immer geringer werden. Es ist unbequem, man wird dauernd beim ansehen gest&ouml;rt, man wird zum Werbung ansehen gezwungen und wenn man den Film erneut ansehen muss bekommt man nichtmal Erm&auml;&szlig;igung auf den Eintritt. (Filmjournalisten.de hat<a href="http://filmjournalisten.de/?p=889" target="_blank"> einige nette Ideen dazu</a>)

<p>Warum k&ouml;nnen Leute im Kino ihre Telefone ungestraft aktiv lassen?<br/>Warum muss ich mir 30min. Werbung antun, wenn ich schon daf&uuml;r Eintritt bezahlt habe?<br/>Warum darf ich mir die ganze Zeit das Popcorn-geknusper der Leute um mich ringsrum anh&ouml;ren?<br/>Warum darf man wieder ins Kino wenn man schon w&auml;hrend des Filmes rausrennen muss?<br/>Warum kann man keine gem&uuml;tlichen Sitze aufstellen?Warum muss ich f&uuml;r ALLES extra zahlen? (Vorbestellung, &Uuml;berl&auml;nge,&nbsp; Kuschelecke, Sitzpl&auml;tze in der Mitte, ... Ich habe seit Jahren nicht ein einziges mal den Preis bezahlt der im Internet f&uuml;r einen Film in diesem Kino angezeigt wurde.)</p>
<p>Solange das Kino weiter so ausverkauft wird und nichts f&uuml;r das "Erlebnis Kino" getan wird, sehe ich f&uuml;r die gesamte Branche schwarz.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_270" onclick="set_comment_reference(270)" title="auf diesen Kommentar antworten">#270</a>:
    05.Jul.2008 04:07
    von
    
      
        <a href="http://www.drni.de/blog/" target="_blank">
          DrNI
        </a>
</p>
<p>Du hast vergessen, dass im TV oft einige Szenen des Kinofilms fehlen. Von "The Rock" zum Beispiel fehlte fast die ganze Schlu&szlig;szene in der Fernsehfassung, Au&szlig;erdem gibt es Kinofilme, die gar nie ins Fernsehen kommen. Wenn man sich f&uuml;r diese Filme interessiert, hat man auch kein Problem mit dem Kino: Meistens befindet man sich in einem etwas sch&auml;bigen, nicht voll gestopften Programmkino, in dem Handy-Pimmelprothesen schwenkende Jugendliche gar nicht sein m&ouml;gen.</p>

<p class="infos">
<a href="#comment_271" onclick="set_comment_reference(271)" title="auf diesen Kommentar antworten">#271</a>:
    05.Jul.2008 04:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>TV ist aber auch nicht unbedingt die gro&szlig;e Konkurrenz mit der das Kino als solches zu k&auml;mpfen hat.. (mal davon abgesehen dass kleinere und unbekanntere Filme am Gesammtumsatz der Filmbranche auch nicht den gr&ouml;&szlig;ten Anteil stellen)<br/>
Die Problematische Frage f&uuml;r mich stellt sich halt eher in Form von: Wenn ich $tollen_neuen_Kassenschlager ansehen will, warum sollte ich ins Kino gehen, Geld ausgeben und die ganzen St&ouml;reffekte hinnehmen, wenn ich auch einfach zuhause eine illegale Version runterladen oder (mit kleiner Versp&auml;tung) zum &auml;hnlichen Preis eine DVD kaufen kann und den Film gem&uuml;tlich mit Freunden in Ruhe ansehen kann?</p>

<p class="infos">
<a href="#comment_272" onclick="set_comment_reference(272)" title="auf diesen Kommentar antworten">#272</a>:
    05.Jul.2008 04:07
    von
    
      
        <a href="http://www.sebbi.de" target="_blank">
          Sebbi
        </a>
</p>
<p><em>Zustimm</em> ... f&uuml;r das Kino z&auml;hlt eigentlich nur noch die gro&szlig;e Leinwand und der relativ fr&uuml;he Starttermin.</p>
<p>Wobei ich mir die Werbung eigentlich gerne anschaue. Bei uns kommt im zweiten Teil dann auch eigentlich fast nichts mehr, sondern nur noch Trailer und ich LIEBE Trailer :D</p>

<p class="infos">
<a href="#comment_273" onclick="set_comment_reference(273)" title="auf diesen Kommentar antworten">#273</a>:
    05.Jul.2008 05:07
    von
    
      
        RobVinc
      
    
    
  </p>
<p>Du hast bei DVD und Download vergessen, dass man dort sich die Sprachen meistens aussuchen kann und bei den Mainstream-Filmen im Kino oder TV gibts seltenst die Orginaltonspur..</p>

<p class="infos">
<a href="#comment_274" onclick="set_comment_reference(274)" title="auf diesen Kommentar antworten">#274</a>:
    05.Jul.2008 05:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Trailer sind an sich nicht schlecht.. ich muss aber sagen dass die hier stark nachgelassen haben im Vergleich zur Gesammtmenge der Werbung. Gestern warens noch 3-4 Trailer, daf&uuml;r aber jede Menge Werbung f&uuml;r Kino an sich (o0 und ich dachte ich bin bereits im Kino...), lokale Tageszeitungen/Radiosender und Nahrungsmittel/Getr&auml;nke ("Magnum Blahfasel, auch hier in ihrem Kino!")</p>
<p>@RobVinc<br/>
Stimmt nat&uuml;rlich, kann sich aber auch jeder selber denken.. die offensichtlichen Vorteile hab ich bei den meisten ziemlich vernachl&auml;ssigt.</p>

<p class="infos">
<a href="#comment_275" onclick="set_comment_reference(275)" title="auf diesen Kommentar antworten">#275</a>:
    07.Jul.2008 02:07
    von
    
      
        Tsukama
      
    
    
  </p>
<p>Und wie w&auml;re es mit DVD leihen????<br/>
Zum Einen, um &uuml;berhaupt festzustellen, ob der Film was taugt (ich meine 1,50 &euro; im Vergleich zu bald 8&euro; f&uuml;rs Kino ist ein WITZ!). zum Anderen, wenn man sich den Film dann immer noch f&uuml;r Daheim zulegen will, kann man auch getrost so lange warten, bis Jemand den Film f&uuml;r Ein Appel-Fuffzich bei Amazon reinstellt.</p>
<p>Ichmache es zumindest immer so.... Hat sich &uuml;ber die Jahre bew&auml;hrt  :-)</p>

<p class="infos">
<a href="#comment_276" onclick="set_comment_reference(276)" title="auf diesen Kommentar antworten">#276</a>:
    07.Jul.2008 02:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Sicher.. eine gute Idee an sich.<br/>
Mir ging es halt darum, festzustellen dass das Kino schlechte Karten hat und sich das durch den Popcornverkauf und die ewiglange Werbung sicher auch nicht verbessert.</p>

<p class="infos">
<a href="#comment_277" onclick="set_comment_reference(277)" title="auf diesen Kommentar antworten">#277</a>:
    08.Jul.2008 01:07
    von
    
      
        Tsukama
      
    
    
  </p>
<p>Ist schon recht :-)</p>
<p>Ich mein ja nur... <em>schmoll</em></p>
<p>Nee, Quatsch, ich schmolle nicht. Ich fand, dass dieser Punkt auch seine "Berechtigung" hat :-)</p>
<p>Kino ist bei mir halt auch schon seit L&auml;ngerem unten durch - Das letzte Mal im Kino war ich bei Batman Begins...</p>

<p class="infos">
<a href="#comment_278" onclick="set_comment_reference(278)" title="auf diesen Kommentar antworten">#278</a>:
    08.Jul.2008 01:07
    von
    
      
        Tsukama
      
    
    
  </p>
<p>Mir f&auml;llt grad noch ein: Es gibt ja auch Streaming-Websites!</p>
<p>In diesem Sinne - einen sch&ouml;nen Tag Euch allen!</p>

<p class="infos">
<a href="#comment_279" onclick="set_comment_reference(279)" title="auf diesen Kommentar antworten">#279</a>:
    08.Jul.2008 01:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>wobei Batman Begins auch ein schweinegeiler Film ist... <em>g</em></p>
<p>Streaming-Websites sind aber imho sehr schlecht zum ansehen eines kompletten Filmes geeignet.<br/>
Au&szlig;erdem hab ich schon immer die Nase voll wenn ich Adobe Trash &auml;h Flash seh...</p>

<p class="infos">
<a href="#comment_280" onclick="set_comment_reference(280)" title="auf diesen Kommentar antworten">#280</a>:
    09.Jul.2008 01:07
    von
    
      
        Tsukama
      
    
    
  </p>
<p>DIVX Webplayer? Oder wie der sich richtig schreibt <em>bin zu faul zum Nachgucken</em></p>
<p>Ja, hmmm, Unrecht hast Du, was Webstreams betrifft, nicht. Wie auch immer - ich hab es am liebsten kuschelig und gem&uuml;tlich auf der Couch, da kann man auch sch&ouml;ner einschlafen, wenn der Film zu lang, langweilig oder doof ist, bzw. man hat es nicht weit ins Bettchen!</p>

<p class="infos">
<a href="#comment_281" onclick="set_comment_reference(281)" title="auf diesen Kommentar antworten">#281</a>:
    09.Jul.2008 01:07
    von
    
      
        Tsukama
      
    
    
  </p>
<p>Der Film war auch schweinegeil! Hab mir dann die Special-DVD-Edition gekauft!</p>

<p class="infos">
<a href="#comment_282" onclick="set_comment_reference(282)" title="auf diesen Kommentar antworten">#282</a>:
    09.Jul.2008 03:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ich freue mich ja schon auf den n&auml;chsten Teil.. vor allem da laut dem Trailer Bale wieder die Hauptrolle hat.<br/>
Was der anfasst wird irgendwie immer Gold, egal ob American Psycho, The Machinist oder Batman.</p>

<p class="infos">
<a href="#comment_283" onclick="set_comment_reference(283)" title="auf diesen Kommentar antworten">#283</a>:
    10.Jul.2008 01:07
    von
    
      
        <a href="http://legionoffalconers.com/serendipity/" target="_blank">
          Fahrertuer
        </a>
</p>
<p>Vielleicht solltest du dir mal ein anderes Kino suchen. War seit Anfang des Jahres 10 oder 11 mal im Kino - nie mehr als 6&euro; Eintritt bezahlt, ein einziges Mal in einem voll besetzten Kino gesesses und superbequeme Sessel mit einer riesigen Beinfreiheit...<br/>
F&uuml;r die Vorbestellung meiner Karten habe ich auch nie zahlen m&uuml;ssen. Genausowenig f&uuml;r die mittigen Pl&auml;tze - und von miesem Sound habe ich auch noch nichts mitbekommen genauswenig wie verschmutze Sitze (die hatte ich nur mal vor x Jahren in einem kleinen Kino, welches es aber auch schon lange nimmer gibt)</p>
<p>Und wegen der Werbung vorweg: einfach 20 Minuten sp&auml;ter ins Kino gehen - keine Nervige "P&ouml;ser P&ouml;ser Raubkopierer Werbung", keine Werbung &uuml;berhaupt mit dem richtigen Timing. Und wegen Handys die klingeln: habs bis jetzt einmal erlebt das ein Handy klingelte und die Person wurde direkt danach von einem netten Herren nach drau&szlig;en geleitet und ist auch nicht wieder reingekommen...</p>
<p>Und bist du selbst bei den 90 bis 120 Minuten die ein FIlm dauert durchweg still? Knabberst du selber kein Popcorn und schl&uuml;rfst auch kein Getr&auml;nk jedweder Art? Wenn ja: Ball flachhalten und nich meckern. Au&szlig;erdem: zu Hause hat man auch st&ouml;rger&auml;usche!</p>

<p class="infos">
<a href="#comment_284" onclick="set_comment_reference(284)" title="auf diesen Kommentar antworten">#284</a>:
    10.Jul.2008 02:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Nat&uuml;rlich kann ich weniger zahlen.. wenn ich z.B. Dienstags ins Kino gehe. Ansonsten sind die M&ouml;glichkeiten f&uuml;r Kinounterhaltung in Zwickau etwas lau, wenn nur ein Kino in der Stadt vorhanden ist leidet die Auswahl etwas.<br/>
Wenn man dazu noch einen Film wie Hancock am Freitag Abend nach der Ver&ouml;ffentlichung sehen will ist es irgendwie vorherzusehen dass das Kino relativ voll ist.<br/>
Alleine beim letzten mal hat 2x ein Handy geklingelt (zwar mit Vibrationsallarm aber das st&ouml;rt mich irgendwie dennoch)<br/>
Zugegeben: F&uuml;r die Vorbestellung habe ich auch nie Geld bezahlt, dies k&ouml;nnte jedoch auch daran liegen dass ich nie Karten vorbestellt habe. Was die Sitze betrifft kann ich ja gerne mal ein Photo von einem durchschnittlichen Kinosessel und ein Photo meines Sofas/Bettes in der Wohnung vergleichen.<br/>
Und um das gleich mal klar zu stellen: NEIN ich esse kein Popcorn im Kino und ich trinke auch keine dort gekaufte Cola (einerseits aus Geldgr&uuml;nden, andernseits weil ich wei&szlig; wie das nerven kann)<br/>
Tatsache ist einfach dass ich zu Hause vlt. St&ouml;rger&auml;usche habe, diese sich jedoch von mir steuern lassen. Wenn mich der Geschirrsp&uuml;ler st&ouml;rt muss ich den ja nicht w&auml;hrend dem Film laufen lassen. Aus irgend einem Grund st&ouml;ren die meisten Menschen ihre eigenen Unterhaltungen w&auml;hrend eines Filmes auch nicht so sehr wie die Unterhaltungen von wildfremden, m&uuml;sste man mal nen psychologen fragen warum das ist.. evtl. kann man das aber auch mit nachdenken rausbekommen. ;-)</p>
<p>BTW: es gibt nichts schlimmeres als Leute die 20min sp&auml;ter kommen wollen und am besten schon im Vorspann reinplatzen... "kann ich mal durch?"</p>

<p class="infos">
<a href="#comment_285" onclick="set_comment_reference(285)" title="auf diesen Kommentar antworten">#285</a>:
    03.Sep.2008 01:09
    von
    
      
        <a href="/2008/09/03/kino-2/" target="_blank">
          Kino 2 &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...]  Heute war ich mal wieder mit meiner besseren H&auml;lfte im Kino. The Dark Knight musste ich mir einfach selbst ansehen. Der [...]</p>

<p class="infos">
<a href="#comment_286" onclick="set_comment_reference(286)" title="auf diesen Kommentar antworten">#286</a>:
    12.Nov.2008 12:11
    von
    
      
        <a href="/2008/11/12/007-ein-quant-hoffnung/" target="_blank">
          007 - Ein Quant Hoffnung &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...]  Eigentlich hatte ich ja nicht vor mir den neuen &ldquo;Bond-Film&rdquo;&nbsp;a quantum of solace im Kino anzusehen. Allerdings ist der Mensch ja Herdentier (und davon unabh&auml;ngig auch ich manchmal) und [...]</p>
</div>