+++
title = "Online-Dokumentation"
date = "2008-08-13T05:08:00"
author = "Dr. Azrael Tod"
issoid = "blog/533"
aliases = "blog/533"
+++

<p>Es hat mich ja schon lange genervt dass viele Programme/Sprachen/Framesets oder &auml;hnliches nur Online-Dokumentationen anbieten aber in letzter Zeit wird das immer schlimmer (Das liegt sicher auch zum gro&szlig;en Teil daran, dass ich noch immer kein permanentes Internet in Dresden habe.)</p>
<p>Es ist einfach grauenvoll wenn man gerade mal wieder 3 Stunden in einer Bahn sitzt, das Notebook in der Tasche und eigentlich viel Zeit zum Arbeiten h&auml;tte. Leider h&auml;ngt man nach 5min an einem kleinen Detail das man in Sekunden in der Doku finden w&uuml;rde, doch die Doku hat man nat&uuml;rlich mal wieder nicht mit.</p>
<p><!--more-->Ich sehe es ja noch ein dass f&uuml;r viele Frameworks und Bibliotheken B&uuml;cher als Medium einfach zu langsam sind. Wenn sich alle 3-4 Monate ein neues Framework als Hype breitmacht oder komplett umgeschrieben wird, wie soll sich dann jemand hinsetzen und nebenbei auch noch ein Buch dazu schreiben? Von den armen Entwicklern die sich all die B&uuml;cher kaufen sollen dann mal ganz abgesehen. In dieser Beziehung musste ich neulich auch erst wieder feststellen wie verw&ouml;hnt ich bin. Pl&ouml;tzlich musste ich meine Bibliotheksgewohnheiten von einer vollen Etage voller IT-Bezogener B&uuml;cher (<a href="http://drazraeltod.wordpress.com/2008/05/15/bitte-lacheln/" target="_self">Bibliothek </a>der <a href="http://drazraeltod.wordpress.com/2008/03/28/hochschulbibliothek/" target="_blank">WHZ</a>) auf ein bis zwei Regale pro Zweigstelle (<a href="http://drazraeltod.wordpress.com/2008/08/02/lest-mal-wieder/" target="_self">Stadtbibliotheken Dresden</a>, die sind an sich schon ziemlich gut ausgestattet aber halt keine Fachbibliotheken) umstellen. Nat&uuml;rlich findet man dann eher seltener etwas zu neueren oder ausgefallenen Themenbereichen wie <a href="http://de.wikipedia.org/wiki/Python_(Programmiersprache)" target="_blank">Python </a>mit <a href="http://code.google.com/appengine/" target="_blank">AppEngine</a>.</p>
<p>Es sollte jedenfalls m&ouml;glich sein die &uuml;berall vorhandenen Online-Dokumentationen nicht nur Online lesen k&ouml;nnte sondern auch in irgendeiner statisch zusammengestellten Form runterladen k&ouml;nnte. Nicht in jeder Situation muss man permanent die aktuellste Version von vor einer halben Stunde im Wiki nachlesen, manchmal w&uuml;rde es auch die 6 Monate alte Version im PDF-Format oder noch besser als Tarball mit HTML-Seiten tun.</p>
<p>Manche Projekte verhalten sich bei diesen Dingen auch durchaus wie gew&uuml;nscht, die <a href="http://framework.zend.com/download/documentation/" target="_blank">Dokumentation zum Zend Framework</a> gibt es z.B. jederzeit gut sichtbar zum Download, das gleiche gilt ebenfalls f&uuml;r <a href="http://cakeforge.org/projects/cakedocs/" target="_blank">CakePHP</a> oder (als wohl bekanntestes Beispiel) f&uuml;r <a href="http://aktuell.de.selfhtml.org/extras/download.shtml" target="_blank">SelfHTML</a>.</p>
<p>Andere Projekte scheinen das noch immer nicht verstanden zu haben. Ich w&uuml;rde mich z.B. f&uuml;r einen m&ouml;glichen Job der demn&auml;chst anstehen k&ouml;nnte gerne schonmal ins Symfony Framework einlesen, die <a href="http://www.symfony-project.org/doc/1_1/" target="_blank">Online-Doku</a> scheint auch recht umfangreich und hilfreich, leider gibt es keine wirklich praktikable M&ouml;glichkeit (vom Download jeder einzelnen Seite mal abgesehen) um das Ganze auf einen USB-Stick zu ziehen und mitzunehmen. Ach&nbsp; halt... ich k&ouml;nnte nat&uuml;rlich <a href="http://www.amazon.com/dp/1590597869?tag=symfonyprojec-20&amp;camp=14573&amp;creative=327641&amp;linkCode=as1&amp;creativeASIN=1590597869&amp;adid=0E8EEASTSYS05JS23TXC&amp;" target="_blank">das offizelle Buch</a> ($29,10) dazu bestellen oder zu einem <a href="http://www.sensiolabs.com/en/offer/formation-symfony" target="_blank">Workshop</a> (1200&euro;, in Frankreich) gehen, beides sehr deutlich auf der Seite angeboten. Trotz Doku unter <a href="http://www.gnu.org/licenses/fdl.txt" target="_blank">GFDL </a>ist man also ziemlich eingeschr&auml;nkt, ein Schelm wer b&ouml;ses dabei denkt.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_431" onclick="set_comment_reference(431)" title="auf diesen Kommentar antworten">#431</a>:
    13.Aug.2008 10:08
    von
    
      
        sirsnookie
      
    
    
  </p>
<p>Das geht ganz einfach ;)</p>
<p>"wget --mirror --convert-links --backup-converted --html-extension -o log " Ich pers&ouml;nlich finde es auch immer wieder toll das es soetwas nicht fix zum download gibt. ich mein, heh das ist nun kein gro&szlig;er akt. bei django versteh ich das noch "halbwegs" da die, sobald &auml;nderungen an der svn version vorgenommen wurden, diese auch im handbuch dokumentiert werden.</p>

<p class="infos">
<a href="#comment_432" onclick="set_comment_reference(432)" title="auf diesen Kommentar antworten">#432</a>:
    14.Aug.2008 07:08
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>naja, man k&ouml;nnte aber dann auch einfach ein script basteln das relativ aktuell das Handbuch zum Download anbietet...<br/>
Man muss ja nicht permanent die komplette Wiki-Datenbank umrechnen, ein Cronjob der das einmal am Tag macht w&uuml;rde dicke reichen.</p>

<p class="infos">
<a href="#comment_433" onclick="set_comment_reference(433)" title="auf diesen Kommentar antworten">#433</a>:
    07.Jan.2009 04:01
    von
    
      
        <a href="http://sonnenschutz360.de" target="_blank">
          ttwhy
        </a>
</p>
<p>Online Dokumentationen haben auch ihre Vorteile. Die Comments bei z.B. <a href="http://php.net" rel="nofollow">php.net</a> sind unverzichtbar und bieten viele interessante Anwendungsm&ouml;glichkeiten, die man nicht einfach so untersch&auml;tzen sollte.<br/>
B&uuml;cher sind nur noch relevant f&uuml;r Themen, die extrem spezialisiert sind. Meistens veralten sie aber schon, nachdem sie gedruckt wurden (siehe Django von Python). Ein wenig nutzen hat web 2.0 ja schon :)</p>

<p class="infos">
<a href="#comment_434" onclick="set_comment_reference(434)" title="auf diesen Kommentar antworten">#434</a>:
    07.Jan.2009 04:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>&auml;hm.. dein Punkt im Bezug auf meinen Post war was?<br/>
Ich sehe durchaus ein dass das so ist, ich finde nur dass es (wenn sowieso schon eine Online-Doku vorhanden ist) kein Problem sein sollte die Doku auch komplett zum Download anzubieten. Ich f&uuml;rchte nur halt dass dies mit Absicht erschwert wird, um mehr B&uuml;cher zu verkaufen oder so.</p>

<p class="infos">
<a href="#comment_435" onclick="set_comment_reference(435)" title="auf diesen Kommentar antworten">#435</a>:
    08.Jan.2009 11:01
    von
    
      
        <a href="http://friedenspanzer.blog.de/" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>CakePHP muss ich allerdings als ganz schlechtes Beispiel entlarven, die bieten nur Uralt-Versionen zum Download an in denen wirklich nur absolut grundlegende Dinge noch aktuell sind. Hat mich schon viele Nerven gekostet weil ich nicht auf die Versionsnummern geachtet habe.</p>

<p class="infos">
<a href="#comment_436" onclick="set_comment_reference(436)" title="auf diesen Kommentar antworten">#436</a>:
    08.Jan.2009 11:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ging mir bei meinen wenigen Erfahrungen mit Cake bisher &auml;hnlich.. auch wenn Symfony da neuerdings nicht wirklich besser ist, die meiste Doku bezieht sich nunmal noch auf Versionen lange vor 1.1, w&auml;hrend bereits der Unterschied zwischen 1.1 und 1.2 mir einige Stunden anpassungsarbeit beschert hatte. -.-</p>
</div>