+++
title = "Sozialdarwinismus"
date = "2009-02-04T12:02:00"
author = "Dr. Azrael Tod"
issoid = "blog/1232"
aliases = "blog/1232"
+++

<p>Jaja.. es ist schon ein Grauen mit diesen Schmarotzern die sich auf Kosten der Leistungsschicht nur durchfressen. Menschen die keinerlei Innovationen bringen und einfach nur tun was man ihnen sagt oder schlimmer noch.. nichtmal etwas zu tun finden.</p>
<p>Bevor mich jetzt jemand schl&auml;gt, sollte ich wohl noch hinzuf&uuml;gen dass ich diese Ansicht durchaus nicht teile, sie sogar im Gegenteil f&uuml;r kurzsichtig und sehr optimistisch auf die eigene Person bezogen ansehe.<!--more--><br/>Ausgangspunkt f&uuml;r meine &Uuml;berlegungen war, dass mich "USA Erkl&auml;rt" (&uuml;brigens ein verdammt interessantes Blog) mal eben aufgekl&auml;rt hat <a href="http://usaerklaert.wordpress.com/2009/02/03/von-der-bedeutung-von-ayn-rand-und-john-galt-wer-auch-immer-das-sein-mag/" target="_blank">was es mit Ayn Randt und John Galt</a> auf sich hat.</p>
<p>Ich will garnicht gegen die dort besprochene Autorin oder gar ihr bekanntestes Buch wettern, dazu m&uuml;sste ich mindestens das Buch gelesen haben. Wenn ich mir jedoch ansehe, WER sich mit welchen Begr&uuml;ndungen f&uuml;r sozial &uuml;berlegen h&auml;llt und denkt dass er den Darwinismus etwas pervertieren und dann auch auf seine pers&ouml;nliche Situation anwenden kann, dann k&ouml;nnte ich gleich erstmal aufs Klo rennen...</p>
<p>Warum auch nicht? Es klappt ja gut oder? Immerhin sagt auch der Darwin dass sich gutes durchsetzt und schlechtes ausstirbt. Das ist doch genau das was wir im sozialen Leben sehen...<br/>Und da haben wir schon das erste Problem: hohe Einkommen oder zu den oberen 10k zu z&auml;hlen setzt sich nicht im Geringsten durch. Im Gegenteil, die sozialen Unterschiede werden immer gr&ouml;&szlig;er. Selbst wenn wir engstirnig nur ein einziges Land betrachten, bleibt eine rie&szlig;engro&szlig;e Unterschicht gegen&uuml;bergestellt zu einigen, wenigen wirklich reichen. Das ist nicht Darwins "survival of the fittest", das ist viel eher <a href="http://de.wikipedia.org/wiki/Russell_Mulcahy" target="_blank">Russell Mulcahys</a> <a href="http://de.wikipedia.org/wiki/Highlander_%E2%80%93_Es_kann_nur_einen_geben" target="_blank">Highlander - Es kann nur einen geben</a>.<br/>Interessanterweise trifft das sogar auf mehr Aspekte zu als man meinen sollte, die &Uuml;berlebenden werden auch in der Wirtschaft st&auml;rker (hier reicher) und k&ouml;nnen damit besser &uuml;berleben und auch hier unterscheiden sich die "&Uuml;berlegenen" vom Rest der Welt durch die kleine Tatsache dass sie kaum Kinder haben.</p>
<p>Doch selbst wenn wir mal weglassen dass die "&Uuml;berlegenen" in diesem System dabei sind auszusterben statt sich st&auml;rker zu vermehren als alles andere... selbst dann finden sich noch genug Gr&uuml;nde warum Sozialdarwinismus Bl&ouml;dsinn ist. So gehen die Verfechter dieser Ideologie oft davon aus dass sie, die "<a href="http://de.wikipedia.org/wiki/Elite#Leistungselite" target="_blank">Leistungstr&auml;ger</a>" der Gesellschaft w&auml;ren, die Personen also ohne die hier alles zusammenbricht und keinerlei Fortschritt mehr stattfindet.</p>
<p>Um es mal kurz zu sagen: BULLSHIT! Welchen Bev&ouml;lkerungsteil kann man weglassen ohne dass hier einiges ins Wanken ger&auml;t? Versuchen wir es mal bei Branchen mit weniger Prestige (M&uuml;llabfuhr, Bauern, ...) werden wir wahrscheinlich sogar schlimmere Auswirkungen sp&uuml;ren als wenn wir alle B&auml;nker oder Vorstandsmitglieder wegrationalisieren. Das Fu&szlig;volk ist also alles andere als entbehrlich.<br/>Douglas Adams hat das mit seinen <a href="http://de.wikipedia.org/wiki/Planeten_aus_dem_Roman_Per_Anhalter_durch_die_Galaxis#Golgafrincham" target="_blank">Telefondesinfizierern</a> &uuml;brigens mal ziemlich gut zusammengefasst.</p>
<p>Das ist jetzt durchaus nicht als Aufruf an das <a href="http://de.wikipedia.org/wiki/Proletariat" target="_blank">Proletariat</a> gedacht sich zu erheben (frei nach: "Alle R&auml;der stehen still, wenn mein starker Arm es will") aber es f&auml;llt auf dass es da drau&szlig;en doch einige Menschen gibt die, obwohl sie sich selbst zur "Elite" z&auml;hlen und Geh&auml;lter beziehen die weit &uuml;ber dem liegen was sie jemals verbraten k&ouml;nnen, doch irgendwie geschlafen haben als die Bildung verteilt wurde. Das ist eigentlich besonders schade, denn immerhin k&ouml;nnen diese Leute es nichtmal darauf schieben dass sie wegen ihrer sozialen Stellung weniger zugang zur Bildung h&auml;tten als andere.</p>
<p>Wahrscheinlich ist diese Meinung aber auch einfach so sch&ouml;n einfach und bequem... Wie sonst soll man (zumindest diejenigen die sowas absurdes wie Moral f&uuml;r sinnvoll halten) ruhig schlafen k&ouml;nnen, wenn man genau wei&szlig; dass man Monatlich das 20-1000fache dessen verdient, was der durchschnittliche Weltb&uuml;rger insgesamt besitzt... das am besten noch ohne gro&szlig;en Aufwand. Aus der Sichtweise sind wir dann wohl eh wieder alle die Elite.. und wer will sich schon einen deutschen Harz4-Empf&auml;nger mit abgebrochener Hauptschule als h&ouml;chsten Abschluss unter Elite vorstellen?</p>
<p>I R 1337!!!!111einseinself \o/</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1118" onclick="set_comment_reference(1118)" title="auf diesen Kommentar antworten">#1118</a>:
    04.Feb.2009 08:02
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>Ein gro&szlig;es Ack</p>
<p>Kleiner Einschub:<br/>
Einzelne Bev&ouml;lkerungsteile/Schichten/Branchen lassen sich sicher nicht "weglassen" - aber der einzelne dieser in dieser "Kategorie" ist aus Sicht der Pseudo-Elite einfach ersetzbar sein. Denke darin liegt ein Unterschied.</p>

<p class="infos">
<a href="#comment_1119" onclick="set_comment_reference(1119)" title="auf diesen Kommentar antworten">#1119</a>:
    05.Feb.2009 12:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Hmm.. Ich sehe den Unterschied irgendwie nicht so extrem, warum sollte ich diverse Manager nicht auch weglassen k&ouml;nnen? Mal von irgendwelchen Medienhypes (z.B. "Steve Jobs ist krank -&gt; Apple Aktie st&uuml;rzt ab") abgesehen w&uuml;sste ich jetzt niemanden auf den die Welt nicht verzichten k&ouml;nnte.</p>
<p>"You are no wonderful and unique snowflake"</p>

<p class="infos">
<a href="#comment_1120" onclick="set_comment_reference(1120)" title="auf diesen Kommentar antworten">#1120</a>:
    05.Feb.2009 08:02
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>nicht extrem, aber siehs mal an folgendem Beispiel:</p>
<p>Wie lange brauche ich um einen Ersatz f&uuml;r meine "Putzfrau" zu finden und wie lange im Vergleich um meinen "Chefentwickler" der vielleicht in einer speziellen Nische seit 20 Jahren firmenspezifisch arbeitet zu ersetzten ?</p>
<p>Spinnt man das ganze weiter ins extreme habe ich z.b. bei der Ersatz-Suche nach nem Atom-Waffen-Forscher-whatever eine noch deutlich geringere Auswahl ....</p>
<p>Sprich: es gibt sicherlich Unterschiede.</p>
<p>Den Apple Messias ignoriere ich jetzt mal ... der w&auml;re sehr einfach zu ersetzen die dumme Horde darf es nur nicht mitbekommen ;)</p>

<p class="infos">
<a href="#comment_1121" onclick="set_comment_reference(1121)" title="auf diesen Kommentar antworten">#1121</a>:
    05.Feb.2009 08:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Sicher.. solche Leute sind nat&uuml;rlich schwerer zu ersetzen.. aber sie sind ersetzbar. Wenn wirklich mal gar keine mehr zu finden sind, kann man im schlimmsten Fall neue ausbilden, m&ouml;glicherweise sogar die Putzfrau zum "Chefentwickler" machen wenn sie sich daf&uuml;r interessiert und man genug Zeit bzw. Geld investieren kann.</p>
<p>Auch dem Argument dass man Leute wie Albert Einstein nicht einfach ersetzen kann k&ouml;nnte man noch begnen... entweder derjenige hat seine Entdeckung schon gemacht (dann wird er ja eh nicht mehr ben&ouml;tigt, auch andere k&ouml;nnen damit weiterarbeiten) oder er ist noch unbekannt und niemand w&uuml;de ihn f&uuml;r unersetzbar halten.</p>
<p>Was ich damit sagen will: Ideen, bei denen die Elite (als Gruppe von Menschen) sagt dass ohne sie alles den Bach runter g&auml;nge, sind reiner Bl&ouml;dsinn. Entweder man kann diese weggefallenen Personen durch bereits ausgebildete ersetzen (bei Politikern und Managern klappt das immer besonders gut, teilweise kann man Politiker durch welche aus dem komplett entgegengesetzten Lager ersetzen ohne einen Inhaltlichen Unterschied zu bemerken) oder es "wachsen halt welche nach".<br/>
Man k&ouml;nnte also vlt. f&uuml;r ein paar Monate und Jahre einige B&ouml;rsenspekulanten durchdrehen lassen, aber mal von derartigem Bl&ouml;dsinn abgesehen w&uuml;rde die Menschheit nicht pl&ouml;tzlich in ihrer technischen Entwicklung oder so stagnieren.</p>

<p class="infos">
<a href="#comment_1122" onclick="set_comment_reference(1122)" title="auf diesen Kommentar antworten">#1122</a>:
    05.Feb.2009 08:02
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>absolut richtig - ich wollte oben auch nur anmerken dass es zumindest kleine Unterschiede bzgl der Ersetzbarkeit gibt.</p>
<p>In der Kernaussage "bin ich bei dir" ;)</p>
<p>in dem Zuge auch mal danke f&uuml;r die immer wieder erheiternden Dumme-Horde Beitr&auml;ge - bringen immer ein schmunzeln bei mir zu Tage.</p>
<p>Sch&ouml;ne Gr&uuml;&szlig;e<br/>
fidel</p>

<p class="infos">
<a href="#comment_1123" onclick="set_comment_reference(1123)" title="auf diesen Kommentar antworten">#1123</a>:
    05.Feb.2009 09:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Danke, ich freu mich immer wenn jemand mal seinen Senf zu meinem Geschwafel abgibt, ich bilde mir sogar ein mich relativ unabh&auml;ngig davon ob lob oder kritik ge&auml;u&szlig;ert wird zu freuen. <em>G</em></p>
<p>Die Sachen in der Rubrik sind auch in letzter Zeit irgendwie immer mehr geworden. Mal sehen wohin sich das Blog noch so entwickelt.</p>

<p class="infos">
<a href="#comment_1124" onclick="set_comment_reference(1124)" title="auf diesen Kommentar antworten">#1124</a>:
    05.Feb.2009 02:02
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>gef&uuml;hlt empfinde ich die Rant-Artikel dieser Dumme Herde-Kategorie mit sozialem Kontext mit abstand am besten .... aber ist nat&uuml;rlich ansichtssache. So oder so danke f&uuml;rs unterhalten ;)</p>
<p>Und ja ... der Anteil dieses Tags w&auml;chst irgendwie ... wieso blo&szlig; hehe</p>

<p class="infos">
<a href="#comment_1125" onclick="set_comment_reference(1125)" title="auf diesen Kommentar antworten">#1125</a>:
    06.Feb.2009 01:02
    von
    
      
        <a href="/2009/02/06/kleinkram/" target="_blank">
          Kleinkram &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] habe ich noch &uuml;ber &ldquo;Sozialdarwinismus&rdquo; geschrieben, da kommt schon wieder ein Beitrag &uuml;ber RSS herein, der ein &auml;hnliches Thema [...]</p>
</div>