+++
title = "Netbooks - Atom nein danke!"
date = "2009-04-24T02:04:00"
author = "Dr. Azrael Tod"
issoid = "blog/1375"
aliases = "blog/1375"
+++

<p>Was ich euch heute erz&auml;hlen will ist eigentlich wirklich nichts neues, es scheint nur noch immer nicht beim Endkunden angekommen zu sein. Wenn ihr euch einen neuen Computer kauft, habt ihr eigentlich nicht nur die Wahl zwischen Produkte der beiden Firmen AMD und Intel, ihr k&ouml;nntet auch jederzeit eine v&ouml;llig andere Platform als x86 w&auml;hlen.<!--more--></p>
<p>Jetzt gibt es nat&uuml;rlich auch Gr&uuml;nde daf&uuml;r, dass es im Laden eigentlich nur diese beiden Varianten einer einzigen Prozessorarchitektur zu kaufen gibt. Einer w&auml;re sicher dass diese CPUs noch immer die Leistungsst&auml;rksten sind, ein anderer dass sowohl Windows als auch aktuelle Mac-Systeme NUR auf x86 laufen und dass auch die meisten Linux-Distributionen in erster Linie diese Platform als Ziel haben.</p>
<p>Neuerdings wird es aber immer &uuml;blicher ein Netbook zu kaufen, kleine portable Ger&auml;te deren Zielstellung am besten mit den Adjektiven billig, mobil und klein beschrieben wird. Leistung ist hier wirklich als allerletztes ein Kriterium, viel wichtiger sind Dinge wie eine lange Akkulaufzeit (wobei sich ein st&auml;rkerer Akku stark auf den Preis auswirkt) und das Gewicht.</p>
<p>Auch die verwendete Software hat sich in den letzten Jahren stark ge&auml;ndert. Haben wir vor 10 Jahren noch sehr stark komerzielle Software verwendet, verlagern wir uns heute immer st&auml;rker auf OpenSource-Software (OSS) oder Anwendungen die wir komplett im Browser laufen lassen k&ouml;nnen. (OK, genau betrachtet ist auch OSS meistens mit kommerziellen Hintergedanken produziert)<br/>Dies bedeutet einerseits dass wir mit relativ wenig Aufwand bestehende Software auch auf andere Systeme portieren k&ouml;nnen, auch wenn der urspr&uuml;ngliche Anbieter der Software das nicht unterst&uuml;tzt, andernseits wird es auch immer weiter egal ob das System X eine Anwendung f&uuml;r Y hat, man l&auml;sst ja eh fast nur noch einen Browser laufen und in dem verwendet man dann die sch&ouml;nen, webzweinulligen Anwendungen.</p>
<p>Wir merken also dass es auch immer unwichtiger wird welches Betriebssystem ich installiert habe. Noch vor wenigen Jahren w&auml;re es z.B. f&uuml;r die meisten Nutzer sehr umst&auml;ndlich gewesen etwas anderes als Windows zu verwenden, w&auml;hrend es heute mehr eine Frage von Gewohnheit oder pers&ouml;nlichem Geschmack ist.<br/>Aus diesem Grund bietet es sich jetzt auch langsam ersnsthaft an eine andere CPU-Architektur zu  verwenden, ein ARM-Prozessor reicht z.B. f&uuml;r die meisten Anwendungen eines Netbooks v&ouml;llig aus, braucht aber oft nur einen Bruchteil des Energiebedarfes eines x86ers und ist erheblich g&uuml;nstiger. Die ge&auml;nderte Architektur kann man nahezu komplett vor dem unerfahrenen Nutzer verstecken, er hat ja weiterhin seinen Firefox, OpenOffice und Pidgin (oder beliebige andere Software) und die GUI ist sowieso auf das kleine Display angepasst. Wen  interessiert es da schon ob da drunter ein Windows XP mit alternativer Shell seinen Dienst tut oder ein Debian f&uuml;r Hitachi SH4?</p>
<p>Wer jetzt sagt dass er nichtmal irgendwo geh&ouml;rt h&auml;tte, dass sowas wie ARM erw&auml;hnt wurde und dass wohl in der Praxis nur x86er eine Rolle spiele, dem sei ein Blick auf den Markt mit Mobiltelefonen ans Herz gelegt, der schon seit vielen Jahren fast nur aus ARM-CPU-getriebenen Ger&auml;ten besteht.</p>
<p>Doch auch wenn es weiterhin ein bin&auml;rkompatibles System sein soll gibt es Alternativen. Der (eigentlich schon viel l&auml;nger als Intel f&uuml;r stromsparende CPUs bekannte) Hersteller VIA bietet z.B. seine neueste Prozessorgeneration (eine komplette Neuentwicklung) unter dem Namen VIA Nano an. Diese CPU bietet zwar nur einen Kern im Gegensatz zu Intels gro&szlig;en Varianten vom Atom und braucht auch fast 10 W mehr an Energie, liefert daf&uuml;r aber auch auf diesem einen Kern etwas mehr Rechenleistung als ein Atom.</p>
<p>Das mag jetzt f&uuml;r sich genommen noch nicht als die sooo tolle Alternative erscheinen, jedoch wird der Unterschied im Stromverbrauch durch die beim Atom zus&auml;tzlich au&szlig;erhalb der CPU n&ouml;tige Southbridge kompensiert. Weiterhin rechnet der Nano bereits auf 64Bit, was aktuell nichts bringt au&szlig;er man hat mehr als 4GB Ram im Netbook (MUHAHAHAHA), aber in Punkto Zukunftssicherheit ganz nett ist. Ebenfalls direkt im Nano enthalten sind Strukturen f&uuml;r Verschl&uuml;sselung. Diese werden zwar heute noch von keiner ernstzunehmenden Software unterst&uuml;tz, k&ouml;nnten aber Dinge wie komplette Festplattenverschl&uuml;sselung extrem beschleunigen.<br/>Auch die 2 Kerne der Atoms sind bei Netbooks nur sehr selten von Vorteil, so dass der Nano auf nahezu allen Anwendungsgebieten mehr Leistung als der Atom bringt.</p>
<p>Auch bleiben beim Nano viele Beschr&auml;nkungen au&szlig;er acht, die Intel aus politischen Gr&uuml;nden seinem Atom auferlegt (wohl um seinen eigenen "gro&szlig;en" Mobil-CPUs nicht zu viel Konkurrenz zu machen). Man kann z.B. den Nano auch mit einem Display kombinieren das gr&ouml;&szlig;er ist als 10.2", ohne dass die CPU teuerer wird.</p>
<p>&Auml;hnliche Einschr&auml;nkungen gelten &uuml;brigens auch noch immer f&uuml;r den Einsatz von Windows XP. Wenn ein Hersteller Heute noch Versionen von diesem Betriebssystem verkaufen will, darf z.B. die Festplatte nich gr&ouml;&szlig;er als 160GB sein.</p>
<p>Wenn wir also endlich die neu gewonnene Freiheit bez&uuml;glich Betriebssystem und Hardwareplatform voll ausnutzen, werden wir in den kommenden Jahren wirklich wahnsinnig viele neue Entwicklungen sehen, die sich auch mal etwas von dem Einheitsbrei der aktuellen Netbooks unterscheiden. Leider sieht es zwar in den letzten Monaten wieder so aus als h&auml;tten das die Hersteller noch immer nicht verstanden und wollen weiterhin ihre alte Schiene mit Windows und Hardwarerekorden (wenn auch auf den Netbookbereich geschrumpft) fahren, doch irgendwo tief in mir bin ich wohl noch immer nicht ganz von meinem unbegr&uuml;ndeten Restoptimismus geheilt. (Eigentlich sollte ich es besser wissen.)</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1259" onclick="set_comment_reference(1259)" title="auf diesen Kommentar antworten">#1259</a>:
    24.Apr.2009 02:04
    von
    
      
        <a href="http://martin-grandrath.de" target="_blank">
          Martin Grandrath
        </a>
</p>
<p>&gt; Ebenfalls direkt im Nano enthalten sind Strukturen f&uuml;r<br/>
&gt; Verschl&uuml;sselung. Diese werden zwar heute noch von keiner<br/>
&gt; ernstzunehmenden Software unterst&uuml;tzt</p>
<p>Was meinst du mit "ernstzunehmend"?  Der Linux-Kernel unterst&uuml;tzt Padlock seit geraumer Zeit und kann Dinge wie Festplattenverschl&uuml;sselung, VPN und SSH enorm beschleunigen.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1260">
<p class="infos">
<a href="#comment_1260" onclick="set_comment_reference(1260)" title="auf diesen Kommentar antworten">#1260</a>:
    24.Apr.2009 03:04
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Tatsache.. du hast recht...  Das war mir bisher entgangen.<br/>
Das w&auml;re dann wieder nur ein weiterer Grund sich ein C7-Ger&auml;t zuzulegen, jetzt m&uuml;sste es da nur noch ordentliche geben.. aber ich glaub das dauert noch ein paar Monate bis die hier etwas verbreiteter sind.</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1261" onclick="set_comment_reference(1261)" title="auf diesen Kommentar antworten">#1261</a>:
    25.Apr.2009 11:04
    von
    
      
        <a href="http://blog.windfluechter.net" target="_blank">
          Ingo Juergensmann
        </a>
</p>
<p>Eine Desktop/Laptop/Netbook-Loesung auf Basis von non-x86 Architekturen wird sich heute nicht mehr durchsetzen koennen. Linux mag zwar auf allen moeglichen Geraeten und Architekturen laufen, aber es wird an solchen banalen Sachen wie fehlendes Flash scheitern. Flash-Alternativen sind unbrauchbar, zumindest in all den Jahren, in denen ich Linux auf PowerPC benutzt habe.</p>
<p>Schoen waere es jedenfalls, wenn man mal vom x86 Monopol wegkaeme, aber ich sehe ich wenig Hoffnung dafuer...</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1262">
<p class="infos">
<a href="#comment_1262" onclick="set_comment_reference(1262)" title="auf diesen Kommentar antworten">#1262</a>:
    25.Apr.2009 11:04
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>wer sagt denn dass das so bleibt? Ich sehe durchaus die M&ouml;glichkeit dass es irgendwann eine brauchbare Gnash-Version f&uuml;r solche Systeme geben k&ouml;nnte oder noch besser: dass gro&szlig;e Projekte eher von Flash zu vern&uuml;nftigen Systemen umschwenken k&ouml;nnten.<br/>
JS-Canvas k&ouml;nnte z.B. irgendwann mal die meisten Flash-aufgaben erledigen, daf&uuml;r w&auml;re es nat&uuml;rlich n&ouml;tig dass diverse Browser sich mal ordentliche JS-Engines zulegen, aber die ersten Versionen gibt es ja bereits.<br/>
Und bevor es jemand sagt: ja Javascript ist h&auml;sslich, langsam und eigentlich will man das nicht... aber alles ist besser als Flash.</p>
</div>
</li>
</ul>
</div>