+++
title = "Ladenschlussschluss"
date = "2014-05-05T01:05:00"
author = "Dr. Azrael Tod"
tags = ["Politik", "Rant"]
issoid = "blog/1589"
aliases = "blog/1589"
+++

<p>K&ouml;nnten wir mal bitte endlich <a href="https://de.wikipedia.org/wiki/Laden%C3%B6ffnungszeit" target="_blank" title="Wikipedia: Laden&ouml;ffnungszeit">Ladenschluss</a> kippen?<br/>Ist ja nicht so als w&uuml;rde das noch irgendwas bewirken.</p>
<p>Das ganze gilt ja schon immer nicht f&uuml;r "die Wirtschaft" sondern nur erstmal f&uuml;r den Einzelhandel mit Ladengesch&auml;ften in der realen Welt.<br/>Und auch da nat&uuml;rlich mit Millionen Ausnahmen.</p>
<p></p><ul><br/><li>die Lidl-Filialen, Buchhandlungen,  in den Bahnh&ouml;fen oder Flugh&auml;fen</li><br/><li>die B&auml;ckerei mit Buch- und Blumenhandel an der Ecke</li><br/><li>Tankstellen</li><br/><li>L&auml;den die ihre &Ouml;ffnungszeiten komplett umgelegt haben (Sp&auml;ti)</li><br/><li>Apotheken (nat&uuml;rlich nicht wirklich in der Praxis, das w&auml;re zu einfach)</li><br/></ul>
<p>In der Tat f&auml;llt es mir verdammt schwer irgend ein Beispiel f&uuml;r Dinge zu finden die <em>nicht</em> Sonntags oder Nachts nicht ge&ouml;ffnet haben d&uuml;rfen. Vom Stahlwerk &uuml;ber Amazon, Krankenh&auml;user, Restaurants&hellip; keiner k&auml;me auf die Idee irgendwas wichtiges oder einfach nur neues so einzuschr&auml;nken. Aber die kleinen L&auml;den, da haben wir das immer schon so gemacht, da muss das so bleiben.</p>
<p>Aber nicht nur dass es Bl&ouml;dsinn ist, es ist auch &uuml;berall anders!<br/></p><blockquote>Gesetzliche Ladenschlusszeiten an den Werktagen gibt es in den L&auml;ndern Bayern und Saarland (20 bis 6 Uhr), Rheinland-Pfalz und Sachsen (22 bis 6 Uhr). Sachsen-Anhalt, Th&uuml;ringen und Mecklenburg-Vorpommern kennen Beschr&auml;nkungen an Samstagen.</blockquote><br/>Auf Landesebene haben wir also generell schonmal eigene Regeln, ob du Freitags 21:30 noch Brot kaufen kannst h&auml;ngt davon ab wo du dich gerade aufh&auml;ltst.<br/>Dazu macht das auch jedes Bundesland seine Sonderregelungen anders. Sachsen hat z.B. 5 Sonntage pro Jahr wo das ebenfalls aufgehoben wird.  Zus&auml;tzlich k&ouml;nnen diverse Gemeinden das noch selber regeln eliminieren damit dann auch jegliche verbleibende Klarheit.

<p>Selbst dass hier eine gesetzliche Regelung also f&uuml;r &Uuml;bersichtlichkeit sorgen solle, k&ouml;nnen wir als l&auml;cherlich abtun.</p>
<p></p><h3>Aber denkt denn keiner an die $foobar?</h3>
<p>Argumentiert wird da ja gerne mit:</p>
<p></p><blockquote>aber die kleinen H&auml;ndler k&ouml;nnen es sich doch nicht Leisten 24/7 offen zu haben und werden dann benachteiligt!!!!111elf</blockquote>
<p>&Auml;h&hellip; ja.</p>
<p>Genau! Denn die gro&szlig;en Einkaufszentren haben ja bisher auch verdammte Probleme damit das zu Umgehen. Stichworte <a _blank="" href="http://www.einkaufsbahnhof.de/ target=">Einkaufsbahnhof</a> und <a _blank="" href="http://www.verkaufsoffene-sonntage.com/staedte/sonntagsverkauf-in-dresden/ target=">verkaufsoffener Sonntag</a>.</p>
<p>Und was tun die kleinen L&auml;den? <a href="/2009/10/06/Arbeitszeiten" title="G33KY: Arbeitszeiten">Die haben schon jetzt &Ouml;ffnungszeiten die bei weitem nicht die gesetzlichen M&ouml;glichkeiten ausreizen</a>.</p>
<p>Oder wie es snookie und profmakx im IRC gerade sch&ouml;n ausdr&uuml;ckten:<br/></p><blockquote><pre>&lt;snookie&gt; die kleinen l&auml;den<br/>&lt;snookie&gt; die um 1 schlie&szlig;en<br/>&lt;snookie&gt; und um 15 uhr wieder &ouml;ffnen<br/>&lt;snookie&gt; um dann um 18 uhr wieder dicht zu machen<br/>&lt;profmakx&gt; was ich daran albern finde ist<br/>&lt;profmakx&gt; das es doch demonstriert wird in europa<br/>&lt;profmakx&gt; dass das eben keinerlei negativen auswirkungen hat<br/>&lt;profmakx&gt; aber evidence based is halt nich so populaer in deutschland<br/>&lt;profmakx&gt; da wird lieber esoteriert<br/></pre></blockquote>
<p>K&ouml;nnen wir also bitte den Schei&szlig; einfach lassen? Alles negative was wir damit abwehren wollten ist l&auml;ngst eingetreten. Alles was wir h&auml;tten positives h&auml;tten erreichen k&ouml;nnen wurde nie ansatzweise erreicht. Es wird zeit anzuerkennen dass dadurch die Welt nicht untergeht, so wenig alle anderen L&auml;nder untergehen.<br/>Zus&auml;tzlich bauen wir uns un&uuml;bersichtliche schei&szlig;e, die wieder Sonderaktionismus einf&uuml;hrt und &uuml;ber die keiner einen &Uuml;berblick beh&auml;lt.</p>
