+++
title = "Infrastruktur"
date = "2012-12-04T04:12:00"
author = "Dr. Azrael Tod"
tags = ["Dresden", "Rant", "Technik", "Telefon"]
issoid = "blog/1570"
aliases = "blog/1570"
+++

<p>Es <a href="/2008/9/26/Intarwebs-at-last!">ist</a> mal <a href="/2008/7/17/H%C3%A4nde-weg-von-TeleColumbus/">wieder</a> so weit.</p>
<p>Nachdem ich seit fast anderthalb Jahren durchgehend gut mit Internetzugang versorgt war, darf ich jetzt endlich mal wieder erleben wie unglaublich unertr&auml;glich diese Branche noch immer ist. Irgendwann im ersten Quartal diesen Jahres hat meine Hausverwaltung einfach mal angek&uuml;ndigt dass ab Dezember alle Haushalte neu mit "Multimedia-Anschl&uuml;ssen" von Kabel Deutschland versorgt werden sollen.</p>
<p></p><h2>Aktueller Ablauf</h2>
<p>Warum Antennendosen jetzt unbedingt neu benannt werden m&uuml;ssen frag ich lieber garnicht erst, jedenfalls ist mein Problem dass ich wie viele andere Internet &uuml;ber den bestehenden Betreiber des Kabelnetzes hier beziehe. Jener ist eine kleine, lokale Firma, die vlt. nicht immer die billigsten Preise bietet, aber so lange ich hier wohne sehr zuverl&auml;ssig geliefert hat was sie versprach und bei der man auch prima mal Anrufen oder vorbei gehen konnte, sollte es doch ein mal ein Problem geben. Das kam nur in der Anfangszeit &uuml;berhaupt vor, lag teilweise auch mit an mir und war sehr schnell behoben.<br/>Sprich: mal abgesehen von der verwendeten Technologie war <a href="http://www.antenneneinert.de/">diese Firma</a> schon sehr nahe an dem was man sich w&uuml;nschen w&uuml;rde.</p>
<p>Nun haben wir aber jene Umstellung auf den &uuml;berregionalen Discount-Anbieter, der dank seinem neuen Vertrag mit unserer &uuml;berregionalen Hausverwaltung mal eben ein paar hundert neue Kunden garantiert bekommt. Der alte Anbieter erfuhr das dann nat&uuml;rlich erst als sich seine Kunden &uuml;ber den Brief der Hausverwaltung wunderten und bei ihm anfragten was mit den bestehenden Vertr&auml;gen w&uuml;rde.</p>
<p>Jedenfalls war es jetzt so weit. Vor ca. einem Monat stand der nette Vertreter von Kabel Deutschland vor der T&uuml;r, versprach absurde Geschwindigkeiten, billige Preise und nat&uuml;rlich einen nahtlosen &Uuml;bergang.<br/>Maximal 1-2 Stunden solle die Umstellung die Internetverbindung unterbrechen, eine Dauer mit der man in der Tat zufrieden sein k&ouml;nnte.</p>
<p>Nachdem dann alle Formulare ausgef&uuml;llt waren, warteten wir wieder einen halben Monat, dann kamen die ersten Briefe in denen weitere Daten abgefragt wurden. Nat&uuml;rlich haben wir auch hier noch 3 mal auf die Frage geantwortet dass wir wirklich eine Telefonnummer &uuml;bernehmen wollen und diese angegeben und in der Tat wurde der IP-Telefonanschluss auch bereits p&uuml;nktlich vorletzte Woche abgestellt. Eine Woche bevor der neue Anschluss aktiviert werden sollte.</p>
<p>Gut, auf Telefon kann ich auch mal ein paar Tage verzichten.</p>
<p>Anfang letzter Woche bekam ich dann endlich einen Termin gesagt, zu welchem ein Techniker kurz vorbei kommen soll, der die Umstellung vornimmt. Termin ist wie &uuml;blich bei solchen Aktionen eine eher dehnbare Beschreibung, jedenfalls solle er irgendwann letzten Freitag zwischen 7 und 13 Uhr vorbei kommen.</p>
<p>In der tat klingelte es dann auch ziemlich p&uuml;nktlich am Freitag gegen 9:00.<br/>Also mein Mobiltelefon klingelte, dran war eine Frau im Callcenter die mir nur sagte dass "aus technischen Gr&uuml;nden" der Termin abgesagt werden m&uuml;sse und ich "bald" mehr erfahren w&uuml;rde.<br/>Genaue Details konnte sie mir nat&uuml;rlich nicht mitteilen, weder was f&uuml;r "technische Gr&uuml;nde" denn vorl&auml;gen, noch wann ich einen neuen Termin bek&auml;me.</p>
<p>Also hat meine Frau abends nochmal bei jenem &Uuml;berfreundlichen Vertreter angerufen und um Kl&auml;rung gebeten. Antwort: "Die Dose f&uuml;r das Haus fehlte, also wurde der Techniker der diese mitbringen sollte und gleich f&uuml;r die Wohnungen die einzelnen Umstellungen machen sollte irrt&uuml;mlich abgesagt" und nat&uuml;rlich: Er w&uuml;rde sich bei uns Melden wenn es Neues gibt, allersp&auml;testens jedoch am Montag.</p>
<p>Also ein Wochenende ohne Internet/Telefon/Fernsehen verbracht, auch der Montag kam und keinerlei Neuigkeiten wurden uns offenbart.<br/>Ein weiterer Anruf beim Vertreter ergab dann dass wohl fr&uuml;hestens Donnerstag die Leitung zum Haus stehen w&uuml;rde, danach erst ein Techniker beauftragt werden k&ouml;nne und wir "dann" unsere Anschlusstechnik f&uuml;r die Wohnung bekommen w&uuml;rden.</p>
<p>Ich darf also mindestens eine Woche ohne benutzbare Internetverbindung hier rum r&ouml;deln.</p>
<p></p><h2>Rant</h2><br/>Wie kann man sowas verbocken? Nat&uuml;rlich k&ouml;nnen immer unvorhergesehene Umst&auml;nde auftreten, aber es sollte doch mit einem sehr reichlichen halben Jahr Vorbereitungszeit m&ouml;glich sein ein paar Dutzend Wohnungen innerhalb von 1-2 Tagen ans Internet anzuklemmen.

<p>Wir reden hier von grundlegender Infrastruktur. Wann war das letzte Mal, dass irgendwo die Versorgung mit Strom, Wasser oder Gas f&uuml;r mehrere Geb&auml;ude l&auml;nger als einen Tag ausgefallen ist? (Meines Wissens nach w&auml;hrend des gro&szlig;en Hochwassers im letzten Jahrzehnt, da waren es teilweise sogar 2-3 Tage in einigen Gebieten)</p>
<p>Bei Internetanbietern ist das hingegen v&ouml;llig normal. Kein Anbieterwechsel scheint problemlos zu verlaufen. Tagelange Ausf&auml;lle sind v&ouml;llig &uuml;blich.<br/><a href="/2010/1/28/Miese-Zeiten2-Wirtschaft">Angeblich macht doch Privatisierung und Marktwirtschaft sowas besser</a>, wie kommt es dann dass ich hier genau Auswahl zwischen 1 Anbietern habe (F&uuml;r Telekom und co. existiert dieses Haus angeblich nicht, bei Kabelnetz muss ich nehmen was ich bekommen kann), mir keiner Mobilfunk verkaufen will den ich l&auml;nger als 1/4 Tag pro Monat mit "voller" Geschwindigkeit nutzen kann und wir bei Kabelnetzbetreibern inzwischen ganz klar nur noch 2-3 nennenswerte Anbieter mit Eigentumsanteilen an einander und generell sehr exakt lokal abgesteckten Zust&auml;ndigkeitsbereichen.<br/><a href="http://www.g33ky.de/2012/8/31/Telekom-und-Glasfasern">Was mit Glasfaser gemacht wird, ist der gr&ouml;&szlig;te Witz aller Zeiten</a>, neue Technologien oder gar einfach nur simple Strukturen wie ein Switch pro Haus und GBit/s-Anbindung  baut nat&uuml;rlich erst recht keiner.</p>
<p>Es gibt keine Konkurrenz, es gibt keine Vergleichbarkeit in den Angeboten, es gibt keine M&ouml;glichkeit eine nicht erhaltene Leistung einzuklagen, es gibt keinen &Uuml;berblick &uuml;ber die Angebote, es gibt schlicht nichts von dem was immer als Vorteile angepriesen wird.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1597" onclick="set_comment_reference(1597)" title="auf diesen Kommentar antworten">#1597</a>:
    04.Dec.2012 04:12
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Wilkommen im Kapitalismus. Er gibt dir die wahl das produkt zu nehmen mit dem man dich am besten ausnehmen kann. Die wahl ist bei dir auf ein Produkt beschaenkt, aber das kann ja mal passieren.</p>
<p>Wie immer wird hier natuerlich auch in faschistischer Weise entschieden, wie es sich fuer Konzerne gehoert. Die Hausverwaltung entscheidet: Ab in 6 Monaten bist du bei Kabel Deutschland. Was passiert wenn Kabeldeutschland anfaengt deinen Anschluss zu zensieren? bandbreitenbeschraenkungen einzufuehren? Du hast keine Moeglichkeit zu wechseln ausser umzuziehen.</p>
<p>Wann kommt die Revolution?</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1598">
<p class="infos">
<a href="#comment_1598" onclick="set_comment_reference(1598)" title="auf diesen Kommentar antworten">#1598</a>:
    05.Dec.2012 12:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr.  Azrael Tod
      </a>
</p>
<p>Die musste leider au technischen Gr&uuml;nden verschoben werden.<br/>
Wir werden sie aber nat&uuml;rlich benachrichtigen wenn ein neuer Termin feststeht. </p>
</div>
</li>
</ul>
</div>