+++
title = "First-World-Problems: Le roi est mort, vive le roi"
date = "2011-11-08T11:11:00"
author = "Dr. Azrael Tod"
tags = ["\"Freie\" Software", "G33KY.de", "Open Source", "Softwareschrott", "Technik"]
issoid = "blog/1560"
aliases = "blog/1560"
+++

<p>Ich hab ja die letzten Jahre mit best&auml;ndig wachsender Frequenz Newsfeeds in Google Reader konsumiert und dort auch via <a href="http://feeds.feedburner.com/SharedByDrAzraelTod" target="_blank">"Share"</a> und <a href="http://feeds.feedburner.com/StarredByDrAzraelTod" target="_blank">"Star"</a> weitergeleitet. Als dann Google diese Funktion ausgebaut und deutlich prominenter positioniert hat, habe ich mich gefreut und auch die Zahl der Leute die angefangen haben bei meinen Elementen mitzulesen hat sich von wenigen Leuten per Newsfeed um einige Dutzend direkt Reader-Intern erh&ouml;ht.</p>
<p></p><h3>Fuck it up!</h3>
<p>Wie wir jedoch alle wissen, hat Google diese Funktion abgeschalten und durch eine wirklich miese Funktion via Google+ "ersetzt". Das w&auml;re jetzt alles noch nichtmal ein Problem, wenn das nicht derartig schlecht umgesetzt worden w&auml;re, dass sich der Aufwand um ein Element zu teilen von:<br/></p><ul><li>"Shift+s dr&uuml;cken</li></ul><br/>auf:<br/><ul><br/><li>Maus-in-die-Hand-nehmen (ich liebe Keyboard-Navigation),</li><br/><li>Icon clicken (nein, es gibt keinen Keyboard-Shortcut daf&uuml;r)</li><br/><li>Text eingeben (nein, den Element-Text kann man nat&uuml;rlich nicht direkt &uuml;bernehmen),</li><br/><li>Senden-klicken,</li><br/><li>irgendwohin klicken (weil der Fokus sonst auf dem IFrame liegt und die Tastaturbedienung nicht mehr funktioniert)</li></ul><br/>potentiert h&auml;tte.

<p>Schlimmer noch: Auf der Empfangenden Seite ist das ganze noch viel unbrauchbarer, meine Daten liegen weiterhin bei Google (und was mir das bringt sollte man sp&auml;testens gemerkt haben, als s&auml;mtliche Abos von geteilten Reader-Sachen mit weggeflogen sind), es gibt keinen RSS-Export/API von dem man reden br&auml;uchte und zus&auml;tzlich muss ich nochmal ganz von Null anfangen.</p>
<p>Dabei w&auml;re es so einfach gewesen. Man h&auml;tte problemlos die +1-Funktion einfach an Stelle von "Like" setzen k&ouml;nnen (was imho wirklich exakt das selbe ist) und Reader-Shares Volltext in einen neuen Google+-Circle pipen k&ouml;nnen, den man mit den verfolgten Leuten bef&uuml;llt. Dann noch brauchbares HTML schreiben das ohne seltsame IFrames und co. auskommt und schon h&auml;tte man nicht halb so viel Drama produziert.</p>
<p></p><h3>Diaspora</h3>
<p>Doch sei es wie es ist. <b>Da ich nun also f&uuml;r meine bekannte Funktionalit&auml;t suchen muss und der Aufwand f&uuml;r Google+ ziemlich exakt der selbe ist, als w&uuml;rde ich komplett auf eine andere Plattform umsteigen, habe ich beschlossen meine Sachen erstmal nach <a href="https://pod.geraspora.de/u/drazraeltod" target="_blank">Diaspora</a> zu kippen.</b> Das sieht zwar genauso ekelhaft aus wie Google+ (oder umgekehrt?) ist fast noch mehr mit Bugs geschlagen und Funktionalit&auml;t fehlt noch an etlichen Stellen, aber daf&uuml;r kann ich wenigstens meine Daten per <a href="https://pod.geraspora.de/public/drazraeltod.atom" target="_blank">RSS</a> <b>und</b> API ausgeben lassen und man hat das wohlige Gef&uuml;hl wenigstens offene Software zu verwenden.</p>
<p>F&uuml;r alle anderen Zielsetzungen bleiben nat&uuml;rlich weiterhin die <a href="/fact/">Facts</a> (<a href="/feed/facts">Feed</a>), <a href="/blog">Blogposts</a> (<a href="/feed/blog">Feed</a>) und entsprechende <a href="http://twitter.com/DrAzraelTod" target="_blank">Twitter</a>-<a href="http://twitter.com/Sacred_Chao" target="_blank">Weiterleitungen</a> wie sie immer waren.</p>
<p>Bleibt nat&uuml;rlich noch die Probleme dass das Interface f&uuml;r meine Zwecke absolut unbrauchbar ist (gut, muss ich mir halt irgendwann mal was sinnvolles schreiben... ich hab ja nix zu tun) und dass ich eigentlich auch noch nen anderen Newsreader brauche. Dass Diaspora momentan von keinem wirklich genutzt wird, ist mir hingegen erstmal v&ouml;llig egal, alle wichtigen Personen sind ja mit meinem Account vertreten.</p>
<p>Nun ja... F&uuml;r die Eingabe der Posts dort kann man sich jedenfalls recht einfach ein paar fast sinnvolle Sachen zusammenstricken und Bilder posten geht mit <a href="http://cubbi.es/a9eb78101a70ed20" target="_blank">Cubbi.es</a> bereits jetzt besser als es irgendwelche Bookmarklets mit Reader jemals erm&ouml;glicht h&auml;tten. Der Rest.. wir werden sehen.</p>
