+++
title = "Damals hatten wir Rechte..."
date = "2008-11-14T12:11:00"
author = "Dr. Azrael Tod"
issoid = "blog/1049"
aliases = "blog/1049"
+++

<p>Um jetzt mal mit 1-2 Tagen Versp&auml;tung die tollen neuen Vorschl&auml;ge und Gesetze in der Bundesdeutschen Klolitik aufzuarbeiten bediene ich mich mal der <a href="http://drazraeltod.wordpress.com/2008/09/17/damals-hatten-wir-grundrechte-heute-das-brief-und-postgeheimnis/" target="_self">&Uuml;berschrift eines Artikels</a> von <a href="http://drazraeltod.wordpress.com/author/profmakx/">profmakx</a>.</p>
<p>Scheinbar beschleunigt sich die Geschwindigkeit mit der uns wichtige Grundrechte entzogen werden neuerdings Exponential. Diesmal betrifft es vor allem das Recht auf informationelle Selbstbestimmung (ist ja nix neues) und das Recht auf Versammlungsfreiheit.<!--more-->Dass mit dem neu verabschiedetem BKA-Erm&auml;chtigungsgesetz vieles von den neuen "Verbesserungen" eingef&uuml;hrt wurde an denen unser Stasi2.0-Chef und hauptberuflicher Spizenterrorist Sch&auml;uble schon lange geschraubt hat, brauch ich ja wohl kaum noch jemandem zu sagen. Kai fasste die <a href="http://blog.kairaven.de/archives/1758-Der-Beschluss-des-BKA-Ermaechtigungsgesetzes.html" target="_blank">H&ouml;hepunkte auf Ravenhorst</a> ziemlich gut und knapp zusammen:<br/></p><blockquote>...die Online-Durchsuchung und Quellen-TK&Uuml;, Mikrofon- und Video&uuml;berwachung, heimlicher Einbruch in Wohnungen, Rasterfahndung, der neue geheimdienstliche Charakter des BKA und die weitere Zerst&ouml;rung des Trennungsgebots, "Richterband" und zweifelhafter Richtervorbehalt, Eilfalleingriffe, pr&auml;ventives Belauschen der Internet- und Telekommunikation, Kernbereichsverletzungen usw. usf. ...</blockquote><br/>Fefe hat leider recht... wie immer:<br/><blockquote><a href="http://blog.fefe.de/?ts=b7e2ba04" target="_blank">[l]</a>&nbsp;Die S&uuml;ddeutsche Zeitung kl&auml;rt auf:&nbsp;<a href="http://www.sueddeutsche.de/kultur/658/326522/text/" target="_blank">Das FBI ist schlimmer als die Stasi</a>. Toll, das wir mit dem BKA jetzt auch sowas kriegen!1!!</blockquote><br/>Auch <a href="http://www.zdf.de/ZDFmediathek/content/584336?inPopup=true" target="_blank">einen Link</a> auf eine ziemlich genaue Abstimmungszusammenfassung des Bundestages beim ZDF zeigt er uns, diese Seite sollte ich mir wohl kurz vor der n&auml;chsten Wahl nochmal genauer ansehen und meine Kreuzchen etwas detailierter planen.

<p>Vlt. sollte man sich mal die Daten extrahieren und einen Wahl-O-Mat Programmieren der auf Basis von wirklich getroffenen Abstimmungen eine gute Wahlentscheidung vorschl&auml;gt.</p>
<p>Aber ich schweife schon wieder ab...</p>
<p>Es ging um Grundrechte und um welche wir mal wieder so ganz nebenbei betrogen werden. Dazu ist mir ebenfalls bei Fefe ist mir aufgefallen dass wir jetzt nichtmal mehr Demonstrieren d&uuml;rfen.</p>
<p>Zumindest d&uuml;rfen wir nicht gegen den Bundespr&auml;sidenten das Wort erheben und ihn pers&ouml;nlich kritisieren, denn das ist <a href="http://blog.fefe.de/?ts=b7e77a06" target="_blank">"Verunglimpfung"</a>. Wenn dies aber doch unbedingt sein muss, sollte man zumindest darauf achten keine offensichtlichen Idiotien zu begehen wie ein <a href="http://www.lawblog.de/index.php/archives/2008/11/06/plakat-ohne-impressum/" target="_blank">Plakat ohne Impressum</a> zu verwenden!</p>
<p>Aber auch allgemein sieht es mit unserer Versammlungs-/Demonstrations- und Redefreiheit nicht sonderlich gut aus. Neuerdings kommen solche Idioten wie Niedersachsens Innenminister Uwe Sch&uuml;nemann (lest euch ruhig mal die Links bei Fefe zu dem durch: "<a href="http://blog.fefe.de/?ts=bd4c5aff">Erinnert</a>&nbsp;<a href="http://blog.fefe.de/?ts=bbd2ff64">ihr</a>&nbsp;<a href="http://blog.fefe.de/?ts=bb7ea310">euch</a>&nbsp;<a href="http://blog.fefe.de/?ts=b8e9137a">an</a>&nbsp;<a href="http://blog.fefe.de/?ts=b81d32c6">den&nbsp;</a><a href="http://blog.fefe.de/?ts=b99922a2">Sch&uuml;nemann</a>?") auf die geniale Idee man solle doch die Kosten f&uuml;r Demonstrationen (Polizeieins&auml;tze und &auml;hnliches GEGEN die Demonstranten) <a href="http://blog.fefe.de/?ts=b7e543ad" target="_blank">auf die Demonstranten umlegen</a>.</p>
<p>Grunds&auml;tzlich ging es wohl um die Castor-Transporte, da ist das nat&uuml;rlich viel naheliegender als die Kosten denjenigen aufzuerlegen wer mit dem Zeug Gewinn macht (<a href="http://drazraeltod.wordpress.com/2008/11/11/eoff-eof/" target="_self">E.On/RWE?</a>). Aber Kosten verstaatlichen &nbsp;und Gewinne privatisieren war eh schon lange unser Motto.</p>
<p>Die Sache hat nat&uuml;rlich auch noch so kleine, positive Nebeneffekte.. nicht nur dass man weniger Geld ausgeben m&uuml;sste... NEIN! Es kann auch nur noch derjenige Demonstrieren der sich die Polizei leisten kann die ihn danach verpr&uuml;geln muss. (Die armen Schweine die sich dort st&auml;ndig mit irgendwelchen Aufst&auml;ndigen oder gar Fussballfans anlegen d&uuml;rfen k&ouml;nnen ja auch nichtmal unbedingt was daf&uuml;r)</p>
<p>Sollte jetzt jemand behaupten dass das doch so furchtbar unfair w&auml;re hat man nat&uuml;rlich auch schon Argumente parat: Man muss ja nicht so demonstrieren dass Polizei zur Kontrolle n&ouml;tig wird! Wie w&auml;re es denn mal mit billigeren Demonstrationen? So zuhause.. und alleine.. vor dem Fernseher? Da spart man sich auch gleich noch die Transparente und muss sich keine Sorgen um das Impressum machen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_889" onclick="set_comment_reference(889)" title="auf diesen Kommentar antworten">#889</a>:
    14.Nov.2008 09:11
    von
    
      
        <a href="http://codecocktail.wordpress.com/" target="_blank">
          Thomas
        </a>
</p>
<p>Ah man das ist wirklich bitter. Mir sagt man, ich lebe jetzt in einer viel besseren Zeit und zum Gl&uuml;ck musste ich den ganzen Stasi-Kram und so weiter noch nicht miterleben und dabei bewegen wir uns wieder genau in die gleiche Richtung...</p>

<p class="infos">
<a href="#comment_890" onclick="set_comment_reference(890)" title="auf diesen Kommentar antworten">#890</a>:
    14.Nov.2008 03:11
    von
    
      <a href="/blog/author/kleinezuzi/">
        kleinezuzi
      </a>
</p>
<p>Mit dem Unterschied, dass wir Dinge zu anderen Menschen sagen k&ouml;nnen, ohne Angst haben zu m&uuml;ssen, am n&auml;chsten Tag im Knast zu sitzen. Nat&uuml;rlich sind die diesbez&uuml;glichen Entwicklungen negativ, aber mit dem DDR-Regime vergleichen hinkt trotzdem m&auml;chtig...</p>

<p class="infos">
<a href="#comment_891" onclick="set_comment_reference(891)" title="auf diesen Kommentar antworten">#891</a>:
    14.Nov.2008 03:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Besser ein hinkender Vergleich als ein Minister im Rollstuhl oder wie der Spruch lautete...</p>
</div>