+++
title = "Google Chrome"
date = "2008-10-20T08:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/976"
aliases = "blog/976"
+++

<p>Wie bereits geschrieben habe ich das "Vergn&uuml;gen" einen PC mit Windows XP &nbsp;mein eigen zu nennen und dachte ich nutze die Situation um noch schnell Googles Browser Chrome zu testen bevor ich Linux installiere.</p>
<p>Das Ergebniss ist besser als ich vorher gedacht hatte, in der Tat scheint der Browser zumindest subjektiv ziemlich schnell zu sein. Das Arbeiten macht unter Chrome auf meinem Netbook sogar mehr Spa&szlig; als in Firefox auf einem (nicht ganz aktuellen, aber doch erheblich schnelleren) Desktop-PC wie ich ihn sonst &ouml;fters verwende.<!--more--></p>
<p>Selbst das ganze Javascript- und <a href="/2008/07/04/flash-in-die-toilette-and-please-flush/" target="_self">Flash</a>-gesocks scheint nicht ganz so zu nerven wie ich es sonst, auch wenn ich dieses ganze krampfhaft auf dynamisch getrimmte immer noch f&uuml;r die gr&ouml;&szlig;te Performanceverschwendung seit der Erfindung von mehrfach interpretiertem und neu generiertem Code halte.</p>
<p>Nat&uuml;rlich gibt es noch viele Ecken und Kanten, einige wichtige Funktionen wie Plugins fehlen (sollen aber noch kommen), Bugs gibts noch an etlichen Stellen und Fehlermeldungen bei Netzwerkfehlern beschr&auml;nken sich auch auf ziemlich nichtssagendes. Sprich: Man merkt dass es eine Beta ist und ich w&uuml;rde Chrome noch niemandem ernsthaft als Browser f&uuml;r jeden Tag ans Herz legen. (Wie auch, wenn es ihn nur f&uuml;r Windows gibt?)</p>
<p>Das Beste an Chrome ist jedoch die Bedienung. Da hat sich endlich mal jemand Gedanken gemacht was an aktuellen Browsern nervt und ge&auml;ndert werden sollte. Angefangen beim hohen verbrauch von Bildschirmplatz f&uuml;r Titelleiste, Men&uuml;s und Toolbars, &uuml;ber das Verwenden von Webapps in eigenst&auml;ndigen Fenstern, bis hin zum Verschieben von Tabs zwischen Fenstern.</p>
<p>Nat&uuml;rlich kann Firefox das alles auch wenn man die richtigen Einstellungen und Plugins w&auml;hlt... aber ich finde es immer besser wenn Software nicht erst stundenlang konfiguriert werden muss sondern einfach funktioniert. Au&szlig;erdem werden eh die wenigsten diese Einstellungen/Plugins kennen, geschweige denn nutzen und ein Browser mit hunderten Plugins wird weder schneller noch stabiler.</p>
<p>Sollte Chrome jedoch bald ein brauchbares Stadium erreichen (Hey, es ist Google, erwartet jemand ernsthaft was anderes?) h&auml;tte er durchaus das Potential Firefox f&uuml;r mich komplett zu ersetzen. Das ist etwas, was ich von Opera, Konquerror oder eLinks bisher nichtmal ansatzweise sagen konnte.</p>
<p>Leider sieht es im Moment nicht danach aus als w&uuml;rde in den n&auml;chsten Monaten eine Linux-Version erscheinen. Schlimmer noch, Chromes Thread-System ist extrem stark auf Windows zugeschnitten, selbst wenn eine Portierung begonnen wird, ist also nicht gesagt dass dies schnell geschieht. (Wenn wir die Portierung von Googles Jabber-Client als Beispiel nehmen, wird es wohl einfach NIE passieren.)</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_801" onclick="set_comment_reference(801)" title="auf diesen Kommentar antworten">#801</a>:
    22.Oct.2008 09:10
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Das Beste an Chrome ist aber dass die Leute anfangen dar&uuml;ber nachzudenken, wie viel Daten so ein Browser heimschickt und dadurch einige gemerkt haben, dass Google auch nicht b&ouml;ser ist als Mozilla.</p>
<p>aber ich finde es immer besser wenn Software nicht erst stundenlang konfiguriert werden muss sondern einfach funktioniert.<br/>
Und trotzdem magst du Linux? ;)</p>

<p class="infos">
<a href="#comment_802" onclick="set_comment_reference(802)" title="auf diesen Kommentar antworten">#802</a>:
    22.Oct.2008 09:10
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Entgegen der landl&auml;ufigen Meinung kann man ein Linux/FreeBSD/other system sehr viel schneller in einen Benutzbaren Zustand bringen als ein Windows system!</p>
<p>Ich habe ein darcs repository namens "skel" f&uuml;r die Konfiguration der wichtigsten programme wie zum Beispiel .zshrc, .vimrc und .vim etc pp. und eine Liste der Software, die installierenswert ist, und um ein System benutzbar zu machen reicht in erster Naeherung die Repository auszuchecken.</p>
<p>Um ein System aufzusetzen reicht bei g&auml;ngigen Distributionen einfach CD Rein, Installiern.</p>
<p>Wenns nat&uuml;rlich um Hardware geht die es nicht tut ist man evtl gefickt. Aber mal ehrlich: das passiert dir mit Winblows auch.</p>
<p>Alle andern k&ouml;nnen Spielzeug-OSe wie MacOSX verwenden (zu dem ich ausser der tatsache, dass es eben spielzeug ist, nicht viel sagen kann weil ich es nie &uuml;ber 2 klicks hinaus versucht habe zu benutzen).<br/>
Ich m&ouml;chte aber wetten, dass MacOS und Applikationen daf&uuml;r genauso Hackermist sind wie man &uuml;berall anders auch findet. Unter Sicherheitsaspekten beispielsweise lebt MacOS im moment fast ausschliesslich davon,dass es nicht so weit verbreitet ist wie Windows (zu einem gewissen grad gilt das auch f&uuml;r linux).</p>

<p class="infos">
<a href="#comment_803" onclick="set_comment_reference(803)" title="auf diesen Kommentar antworten">#803</a>:
    22.Oct.2008 09:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>gerade aus diesem Grund mag ich Linux!<br/>
Ich stelle erheblich l&auml;nger an einer Windows-Version rum als an Linux. Wenn vern&uuml;nftige Treiber von jedem Hersteller geliefert werden w&uuml;rden, w&auml;re das nochmal um den Faktor 10 schneller.</p>
<p>Bei einer Windows-Installation f&auml;ngt man jedes verdammte mal komplett bei Null an: suchen welche Programme man noch braucht, diese Einstellen, Start-Men&uuml; danach stundenlang aufr&auml;umen, Rechteverteilungen anpassen, Netzwerkdienste installieren, einen vern&uuml;nftigen Browser suchen, ...<br/>
Bei Linux spiele ich ein paar Configs aus nem altem Homedir ein und installier ein paar Programme die die Distri meiner Wahl nicht als Standard installiert. Ich muss nicht erst OpenOffice oder Firefox suchen, sowas ist dabei. Auch kleine Tools wie ssh, wget und ein vern&uuml;nftiger Editor sind eigentlich immer mitgeliefert...<br/>
Und wenn bei Linux was nicht installiert ist? "sudo apt-get install sshd" und schon hab ich sshd installiert... Bei Windows suche ich erstmal eine Webseite, versuche die aktuellste Version zu finden, lade es runter, starte das Programm, stelle allen m&ouml;glichen Bl&ouml;dsinn ein f&uuml;r den es vorgaben geben sollte (Installationsverzeichniss sollte f&uuml;r alle Programme via Systemsteuerung fest einstellbar sein) und fang dann auch noch an an den Einstellungen rumzuspielen (hab ich unter linux ja mit der Home-Partition &uuml;bernommen).</p>
<p>Kurz gesagt: In dem satz ist "funktionieren" sehr wichtig... und das tut Linux nunmal einfach.</p>

<p class="infos">
<a href="#comment_804" onclick="set_comment_reference(804)" title="auf diesen Kommentar antworten">#804</a>:
    22.Oct.2008 03:10
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Ach ja, sorry, hab vergessen dass das Humorzentrum ausf&auml;llt wenn man &uuml;ber Linux redet. Oder ist das Klischee einfach nicht g&auml;ngig genug um als lustig durchzugehen?</p>

<p class="infos">
<a href="#comment_805" onclick="set_comment_reference(805)" title="auf diesen Kommentar antworten">#805</a>:
    22.Oct.2008 03:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>eher letzteres...<br/>
Linux' Ruf als umst&auml;ndlich trifft vlt. auf das Erlernen der Bedienung f&uuml;r Neulinge zu.. aber ich w&uuml;sste nicht dass jemand das ernsthaft auf die Einrichtung bezogen h&auml;tte. Von daher w&uuml;rde ich das Klischee f&uuml;r diese Anwendung als nicht existent bezeichnen. ;-)</p>

<p class="infos">
<a href="#comment_806" onclick="set_comment_reference(806)" title="auf diesen Kommentar antworten">#806</a>:
    22.Oct.2008 03:10
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>aber ich w&uuml;sste nicht dass jemand das ernsthaft auf die Einrichtung bezogen h&auml;tte</p>
<p>Dann h&auml;ngst du eindeutig mit zu wenigen Leuten rum, die dich als seltsam bezeichnen. Wenn jemand, der keine Ahnung von der Materie hat, "Linux" h&ouml;rt denkt er nur an Begriffe wie "kompliziert" und "umst&auml;ndlich", nicht "Distribution". Meiner Erfahrung nach.</p>

<p class="infos">
<a href="#comment_807" onclick="set_comment_reference(807)" title="auf diesen Kommentar antworten">#807</a>:
    22.Oct.2008 03:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>also die Leute die ich kenne, denken bei erw&auml;hnung von "Linux" nur entweder:<br/>
a) super System!<br/>
b) da gibts keine Spiele, das ist nix f&uuml;r mich<br/>
oder<br/>
c) bekomme ich damit Kaffeeflecken raus? bzw. wenn sie wissen dass es ein Betriebssystem ist: Kam das vor XP oder vor NT?</p>
<p>Die oft beschriebenen abgeschreckten Nutzer kenne ich nahezu nicht, es gibt einige wenige denen mal vor 4-5 Jahren irgendwer Linux aufschwatzen wollte, aber f&uuml;r die breite Masse ist auf jedem PC Windows installiert... wenn nicht, ist es kein PC.</p>

<p class="infos">
<a href="#comment_808" onclick="set_comment_reference(808)" title="auf diesen Kommentar antworten">#808</a>:
    22.Oct.2008 04:10
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Und ohne iTunes ist es kein MP3-Player. Die Welt im Moment ist eigentlich richtig Schei&szlig;e, wenn man mal so dr&uuml;ber nachdenkt. Jetzt krieg ich wegen dir Depressionen, danke.</p>
<p>c) bekomme ich damit Kaffeeflecken raus?</p>
<p>Leider nicht, aber daf&uuml;r gibts ein Emacs-Plugin.</p>

<p class="infos">
<a href="#comment_809" onclick="set_comment_reference(809)" title="auf diesen Kommentar antworten">#809</a>:
    22.Oct.2008 04:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>MP3 ist ja gleich das n&auml;chste Beispiel... Warum MP3-Player? Warum nicht Vorbis? ;-D</p>
<p>und zum Thema Kaffeeflecken: Googlesuche!</p>

<p class="infos">
<a href="#comment_810" onclick="set_comment_reference(810)" title="auf diesen Kommentar antworten">#810</a>:
    22.Oct.2008 04:10
    von
    
      
        <a href="http://" target="_blank">
          sirsnookie
        </a>
</p>
<p>Link?</p>
</div>