+++
title = "Bundestrojaner gegen Steuerdelikte!"
date = "2009-03-16T01:03:00"
author = "Dr. Azrael Tod"
issoid = "blog/1333"
aliases = "blog/1333"
+++

<p>Wir mussten ja lange drauf warten... doch jetzt endlich gibt es <a href="http://www.heise.de/newsticker/meldung/134596" target="_blank">die ersten Forderungen</a> die erweiterten Rechte durch das neue BKA-Gesetz doch bitte auch f&uuml;r normale Prozesse einzuf&uuml;hren.<!--more--></p>
<p>Heise zitiert dazu die Frau Generalbundesanw&auml;ltin Monika Harms:<br/></p><blockquote>Die Generalbundesanw&auml;lting regte eine entsprechende &Auml;nderung der Strafprozessordnung an, um das BKA-Gesetz, in dem unter anderem die umstrittene heimliche Online-Durchsuchung privater PCs geregelt ist, auch f&uuml;r die Strafverfolgung einsetzen zu k&ouml;nnen. "Ich habe immer gefordert, dass die technische Ausstattung der Sicherheitsbeh&ouml;rden so erfolgen muss, dass wir auf Augenh&ouml;he mit denjenigen sind, die unsere Freiheit bedrohen. Eine Verbesserung ist jetzt durch die Ma&szlig;nahmen des BKA-Gesetzes erreicht worden &ndash; jedenfalls im pr&auml;ventiven Bereich. Man wird aber nicht darum herumkommen, auch f&uuml;r die Strafprozessordnung &uuml;ber neue Instrumente nachzudenken", erkl&auml;rte Harms.</blockquote>
<p>Ist ja auch v&ouml;llig logisch... wenn wir ein Gesetz unter dem Vorwand eingesetzt haben, dass unsere Freiheit bedroht ist, dann m&uuml;ssen wir damit nat&uuml;rlich auch unsere Freiheit einschr&auml;nken. Erst wenn wir keinerlei Freiheit mehr haben, ist auch jedwede Bedrohung von Freiheit unm&ouml;glich gemacht.</p>
<p>Auch sehr sch&ouml;n ist der Zweite Absatz:<br/></p><blockquote>Bedenken von Datensch&uuml;tzern wies Harms zur&uuml;ck. "Wer behauptet, Polizei und Staatsanwaltschaft wollten in jeden Computer hineinschauen, verkennt die Realit&auml;t", sagte sie. "Erkenntnisse aus diesen technischen Durchsuchungen werden nur in wenigen F&auml;llen genutzt und nat&uuml;rlich unter Wahrung der Beschuldigtenrechte im Ermittlungsverfahren." Solche Diskussionen k&auml;men ihr ohnedies merkw&uuml;rdig vor. "Einerseits regen sich die Leute &uuml;ber m&ouml;gliche Online-Durchsuchungen auf, andererseits geben sie ihre Daten &uuml;berall freigebig preis", sagte sie.</blockquote>
<p>Na dann ist ja alles gut! Wenn Sie mir versprechen dass mich kein perverser Polizist nur so aus Spa&szlig; abh&ouml;rt und die gesammelten Daten nie von irgendwem verschlampt werden, dann glaube ich Ihnen das nat&uuml;rlich und werde mich beruhigt zur&uuml;cklehnen.<br/>F&uuml;r mich w&auml;re es doch wirklich mal interessant wenn Politiker oder Juristen die derartige Forderungen bringen und so unhaltbaren Bl&ouml;dsinn erz&auml;hlen auch f&uuml;r ihre Behauptungen einstehen m&uuml;ssten.. Sprich: Wenn Frau harms der Meinung ist, dass keinerlei Daten verwendet werden die ich nicht ohnehin freiwillig ins Internet stelle (Wozu dann eigentlich noch das Gesetz? Wenn ich die Daten eh rausgebe w&uuml;rde doch ein Google-m&auml;&szlig;iger Crawlbot reichen?) und dass die Daten immer mit Wahrung aller Rechte verwendet werden, dann sollten diese Spinner doch malt tats&auml;chlich zur Verantwortung gezogen werden, wenn dem dann doch nicht so ist.</p>
<p>Das kann man sicher auch sehr gut mit dem von mir bereits geforderten <a href="http://drazraeltod.wordpress.com/2009/02/20/gezielte-gesetzgebung-und-verfallsdatum-fur-gesetze/">Verfallsdatum f&uuml;r Gesetze</a> verbinden.</p>
<p>Auf der anderen Seite w&auml;re es doch einfach mal sch&ouml;n, wenn derartige Aktionen auch wenigstens mit einer Grundmenge an Fachwissen entschieden werden. Irgendwie sehe ich noch immer keinen Weg wie jemand einen Bundestrojaner schreiben will, den man nicht nur den 08/15-DAUs unterschieben kann und der auch auf anderen Systemen als Windoof l&auml;uft.</p>
<p>Keiner kann sich die Entwicklung derartiger Systeme wirklich leisten, m&ouml;glich sind sie wenn &uuml;berhaupt nur theoretisch und brauchen werden wir sie noch viel weniger. Aber eine Forderung nach mehr Sicherheit durch mehr &Uuml;berwachung kann man zumindest erstmal so sch&ouml;n polemisch formulieren dass der Bauer Huber ohne PC davon begeistert ist. Immerhin werden damit nat&uuml;rlich auch gleich die ganzen Killerspielspieler und Terroristen die da drau&szlig;en rumrennen und st&auml;ndig seine Schafe mit dem ICE &uuml;berfahren endlich mal hopps genommen. Von denen hat er immerhin letzte Woche erst in der Bildzeitung gelesen, dagegen muss doch der Staat endlich mal was tun!!!!!!111111einseinself</p>
<p>(via <a href="http://www.lawblog.de/index.php/archives/2009/03/16/frau-harms-sagt-was-sie-will/" target="_blank">Lawblog</a>)</p>
<p>[UPDATE]<br/>via <a href="http://blog.fefe.de/?ts=b73ed9a6" target="_blank">Fefe</a> bin ich gerade mal auf ein paar aktuelle Zahlen gesto&szlig;en in welchem Bereich sich bereits jetzt unsere Abh&ouml;raktionen bewegen:<br/></p><blockquote><br/>Es gibt aktuelle Zahlen f&uuml;r das Telefon-Abh&ouml;ren. Das wird ja, wie ihr wisst, nur bei schweren Straftaten wie Menschen- und Drogenhandel angewendet, gegen organisierte Kriminalit&auml;t, M&ouml;rder, Kidnapper und Terroristen. Und so verwundert es auch nicht, dass sie <a href="http://www.tagesspiegel.de/berlin/Telefonueberwachung;art270,2753708" target="_blank">in Berlin letztes Jahr &uuml;ber 1,1 Millionen Telefonate abgeh&ouml;rt</a> haben. Krasse Schei&szlig;e! Berlin hat &uuml;berhaupt nur 3,4 Mio Einwohner!</blockquote><br/>Da sind jetzt die von Frau Harms geforderten erweiterten Einsatzgebiete nat&uuml;rlich noch garnicht dabei. Da k&ouml;nnen wir aber sowas von froh sein dass diese M&ouml;glichkeiten "nur in wenigen F&auml;llen genutzt [werden] und nat&uuml;rlich unter Wahrung der Beschuldigtenrechte".<br/>Aber dennoch... Ich finde es erstaunlich welchen Umfang die schwerkriminellen Machenschaften in Berlin angenommen haben. Ich vermute ja immer noch dass da irgendwo ein Richter mit Verstand (Ha! war das ein Witz) sitzt und Beschl&uuml;sse unterschreibt dass die ganzen Verfassungsfeinde dort abgeh&ouml;rt werden.... Sch&auml;uble und so.
      
    
  <div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1210" onclick="set_comment_reference(1210)" title="auf diesen Kommentar antworten">#1210</a>:
    18.Mar.2009 08:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Hab gestern noch schnell ein Update hinzugef&uuml;gt... schon etwas heftig -.-</p>
</div>