+++
title = "Systemschaden"
date = "2009-01-15T01:01:00"
author = "Dr. Azrael Tod"
issoid = "blog/1178"
aliases = "blog/1178"
+++

<p>Dass Deutschland ziemlich im Eimer ist, <a href="http://drazraeltod.wordpress.com/2008/10/23/brot-und-spiele/" target="_self">habe</a> <a href="http://drazraeltod.wordpress.com/2008/10/15/schrecken-ohne-ende-oder-ende-mit-schrecken/" target="_self">ich</a> <a href="http://drazraeltod.wordpress.com/2008/10/16/was-vertragen-wir/" target="_blank">ja</a> <a href="http://drazraeltod.wordpress.com/2008/07/13/das-einzige-was-die-politik-tun-kann/" target="_blank">schon</a> mehr als oft genug bemerkt (f&uuml;r mehr Links empfehle ich meine Suche zu verwenden) und sollte ohnehin schon lange allen klar sein. WIE extrem dieses System aber schon von Grund auf kaputt entwickelt wurde, ist mir gestern/heute mal wieder an mehreren Stellen klar geworden.<!--more-->Ausgangsposition waren wohlzum einen der <a href="http://www.lawblog.de/index.php/archives/2009/01/15/elf-jahre-nach-dem-grundsatzurteil/" target="_blank">interessante Post auf dem law blog</a>, in dem man mal wieder wundersch&ouml;n sieht was unsere Richter alles einfach abnicken ohne es auch nur gelesen zu haben. Meine Meinung dazu fasse ich mal der Einfachheit halber mit meinem dort bereits abgegebenem Kommentar zusammen:<br/></p><blockquote>Das ist ja eigentlich auch nur wieder ein Hinweis darauf, dass viele Richter einfach alles unterschreiben was ihnen vor die Nase gelegt wird&hellip; egal um welchen Hintergrund es sich handelt und worum es genau geht. Wirklich Zeit um sich genauer damit zu befassen haben sie nicht und sollen sie offensichtlich auch nicht haben.

<p>Aus genau diesem Grund sind solche Ideen wie bei der Onlinedurchsuchung ja auch so lachhaft &ldquo;aber das wird von einem Richter entschieden und somit nur in begr&uuml;ndeten F&auml;llen angewandt&rdquo;. Klar entscheidet ein Richter.. aber der hat keinen Einblick und will ihn auch nicht. Er tut halt was man ihm sagt. (&rdquo;Unterschreib mal, dann bringen wir Beweise&rdquo;)</p></blockquote><br/>Mindestens genauso interessant wie der eigentliche Artikel ist jedoch ein Link, den ich aus einem Kommentar von "Nicht-Staat" dazu habe: Ein <a href="http://vimeo.com/2659076?pg=embed&amp;sec=2659076" target="_blank">Vortrag von einem Herren G&ouml;rlitz</a> zu den Fragen warum unser Staat eigentlich nicht existiert, was die Alliierten noch immer an Rechten &uuml;ber die BRD haben und zur allgemeinen Rechtslage in Deutschland. Es wird mal eben kurz und knapp genannt was Deutschland eigentlich alles nicht ist, was unser Gesetz eigentlich alles nicht darf und was hier sonst noch eigentlich alles gegen bestehendes Recht l&auml;uft.

<p>Ein weiterer, sehr interessanter Beitrag kam mal wieder <a href="http://blog.fefe.de/?ts=b790ec37" target="_blank">von Fefe</a>, nicht nur dass es eine Frechheit ist mit welchen Forderungen die Kommision (Reisepass mit Fingerabdr&uuml;cken f&uuml;r Kinder ab 6 Jahren) an die ganze Sache rangegangen ist, schlimmer noch dass der "Kompromiss" bei 12 Jahren liegt.. Nein, ganz davon abgesehen verweist Fefe in diesem Artikel noch kurz auf die Britische Serie "<a href="http://en.wikipedia.org/wiki/Yes_Minister" target="_blank">Yes, Minister</a>", die z.B. auf einfach geniale, kurze Art<a href="http://www.youtube.com/watch?v=pIXH3-A8zMI" target="_blank"> erkl&auml;rt was an der EU so komplett im Eimer</a> ist.</p>
<p>Meine Aussage bleibt also weiterhin bestehen: Das System ist nicht krank, es ist schon lange tot. Wir sollten es endlich beerdigen und durch etwas wenigstens ann&auml;hernd sinnvolles ersetzen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1061" onclick="set_comment_reference(1061)" title="auf diesen Kommentar antworten">#1061</a>:
    15.Jan.2009 01:01
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>es ist ein Zombie. Und Zombies sind ja das, was am schlimsmten is!</p>

<p class="infos">
<a href="#comment_1062" onclick="set_comment_reference(1062)" title="auf diesen Kommentar antworten">#1062</a>:
    15.Jan.2009 01:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Zombie trifft es verdammt gut... stumfsinnig durch die Gegend wankend sucht das System nach neuen Hirnen die es konsumieren kann um neue untote (Beamte), ebenfalls ohne Hirn zu erschaffen.</p>
<p>BRAAAAAAAIIIINNNNSSSSSSS</p>

<p class="infos">
<a href="#comment_1063" onclick="set_comment_reference(1063)" title="auf diesen Kommentar antworten">#1063</a>:
    15.Jan.2009 02:01
    von
    
      
        <a href="http://friedenspanzer.blog.de/" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Ich will dir wirklich nix unterstellen, aber genau die Argumentation dass der Staat eigentlich nicht existiert kommt sehr oft aus dem extrem rechten Lager. So nebenbei erw&auml;hnt.</p>
<p>Stimmt aber trotzdem, das Grundgesetz hei&szlig;t genau deswegen Grundgesetz und nicht Verfassung, weil damals darauf spekuliert wurde dass die DDR eh bald wieder mit uns zusammen sein will. Das hei&szlig;t seit 1990 haben wir theoretisch kein Grundgesetz mehr und m&uuml;ssten endlich mal eine Verfassung schreiben.</p>
<p>(Wird so &auml;hnlich wahrscheinlich auch in dem Vortrag gesagt, hatte aber gerade keine 90 Minuten Zeit)</p>

<p class="infos">
<a href="#comment_1064" onclick="set_comment_reference(1064)" title="auf diesen Kommentar antworten">#1064</a>:
    15.Jan.2009 03:01
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Was ne paranoia! Weil Tod mal so einen Punkt aufgreift gleich wieder in die braune Suppe greifen!</p>
<p>Das mit dem Verfassung schreiben w&uuml;rde lustig werden. Schau dir mal an was auf EU ebene passiert ist. Es war eigentlich garnicht so schlecht von ein paar wirklich intelligenten leuten ein Grundgesetz aufzusetzen, dass ein paar Jahre wirklich bestand haben kann, und das nicht von einer breiten Bev&ouml;lkerungsmasse gew&auml;hlt werden muss.<br/>
Aus demselben Grund halte ich eigentlich die Idee von Volksabstimmungen f&uuml;r d&auml;mlich, weil dabei nicht unbedingt das rumkommt was gut f&uuml;r uns ist.</p>
<p>Problematisch ist nat&uuml;rlich, dass dadurch dass eben Politiker sich um unsere Geschicke k&uuml;mmern und die auch nur Menschen sind auch nicht immer das passiert, was gut f&uuml;r uns ist.</p>
<p>Gleich kommt der Universumsreboot.</p>

<p class="infos">
<a href="#comment_1065" onclick="set_comment_reference(1065)" title="auf diesen Kommentar antworten">#1065</a>:
    15.Jan.2009 04:01
    von
    
      
        <a href="http://friedenspanzer.blog.de/" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Ich dachte eigentlich ich h&auml;tte mich klar ausgedr&uuml;ckt, aber ich sage es gerne noch einmal: Ich will niemandem etwas unterstellen, ich wollte es nur mal erw&auml;hnen. Aber nicht themenrelevante Wissensvermittlung am Rande wird im Internet ja nicht so gerne gesehen.</p>

<p class="infos">
<a href="#comment_1066" onclick="set_comment_reference(1066)" title="auf diesen Kommentar antworten">#1066</a>:
    15.Jan.2009 04:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ja die Argumentation kann man ohne Hirn und Verstand auch verwenden um irgendwelchen braunen Mist zusammen zu spinnen... ist die Argumentation aus diesem Grunde falsch?<br/>
Ich sehe da keinerlei Zusammenhang, auch wenn der gr&ouml;&szlig;te Idiot behauptet dass 3=5.</p>
<p>Ich habe nichtmal ein Problem mit unserem Grundgesetz.. es ist eigentlich nicht schlecht aufgebaut und vermutlich besser als 99% unserer anderen Gesetzestexte. Das Problem liegt eher an verqueren Stellen wo wichtige Grundrechte (wie z.B. das Recht auf Privatsph&auml;re oder eigenen Willen) verloren gehen oder an Stellen wo sich einfach zu viel widerspricht um noch IRGENDEINEN Sinn zu ergeben.</p>
<p>Meiner Meinung nach jedoch soll unser System absichtlich keinerlei Sinn f&uuml;r Otto-Normal-B&uuml;rger ergeben, dies ist, wie z.B. auch &Uuml;berwachungsaktionen oder ewige Angstmache durch Terrorgefahr/Giftstoffe im Essen/Wirtschaftskrise, ein Kontrollsystem das besser funktioniert als die meisten anderen.</p>
<p>Solange die Menschen nicht anfangen selbst zu denken, wird sich nichts &auml;ndern. Man MUSS sie auf den Bl&ouml;dsinn aufmerksam machen der hier geschieht.</p>
<p>Um wieder auf die braunen Horden zur&uuml;ckzukommen: denen k&ouml;nnte nichts schlimmeres passieren als wenn ihre Anh&auml;nger pl&ouml;tzlich anfangen w&uuml;rden ihr Gehirn zu verwenden.</p>

<p class="infos">
<a href="#comment_1067" onclick="set_comment_reference(1067)" title="auf diesen Kommentar antworten">#1067</a>:
    15.Jan.2009 04:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>@Friedenspanzer<br/>
Das richtet sich jetzt auch nicht direkt an dich... Der Redner in dem Video ist ger&uuml;chteweise durchaus etwas in verrufene Bereiche einzuordnen. Das Problem was ich halt habe ist, dass man seine Behauptungen in 2 Gruppen einordnen kann.<br/>
Bei der einen kann ich schlecht  den Wahrheitsgehalt einsch&auml;tzen und die andere scheint mir durchaus begr&uuml;ndet.</p>
<p>Also auch wenn der Typ anf&uuml;hrer einer verbotenen, rechtsextremen Gruppierung w&auml;re, w&uuml;rden mir diese Aussagen noch immer zu denken geben... ohne damit seine Einstellung zu &uuml;bernehmen.</p>
</div>