+++
title = "Cranky Kong"
date = "2009-01-02T05:01:00"
author = "Dr. Azrael Tod"
issoid = "blog/1147"
aliases = "blog/1147"
+++

<p>Es soll doch jetzt tats&auml;chlich einen zweiten Teil zu "<a href="http://de.wikipedia.org/wiki/Crank_(Film)" target="_blank">Crank</a>" (<a href="http://de.wikipedia.org/wiki/Crank_(Person)" target="_blank">Wikipedia-Begriffserkl&auml;rung</a>, alternativ auch f&uuml;r "ankurbeln") geben. Ihr wisst schon welchen Film ich meine, den ziemlich miesen Film mit <a href="http://de.wikipedia.org/wiki/Jason_Statham" target="_blank">Jason Statham</a>, bei dem die Hauptfigur am Ende vom Boden abgekratzt werden musste.<!--more--></p>
<p>Aber es kommt noch besser: der neue Teil spielt direkt im Anschluss an den ersten, Hauptperson ist wieder die selbe und auch sonst kommen wieder viele Bekannte vor.</p>
<p>Ich will jetzt nicht kleinlich sein aber irgendwas nervt mich. Wahrscheinlich vertrete ich irgendwo tief in mir doch noch den l&auml;ngst &uuml;berholten Standpunkt dass es seltsam ist wenn man auf dieser Basis ein Drehbuch schreiben will.</p>
<p>Alle Feinde und Freunde der Hauptperson wurden so ziemlich der Reihe nach von dieser entsorgt. Er wurde mit einem Gift behandelt gegen das es kein Gegenmittel gibt und hat schon so die hundertfache Zeit &uuml;berlebt die er eigentlich laut Arzt gehabt h&auml;tte. Zu guter letzt f&auml;llt er derartig hoch aus einem Hubschrauber dass er noch in Ruhe ein l&auml;ngeres Telefongespr&auml;ch f&uuml;hren konnte, bevor er auf dem Boden aufschl&auml;gt.</p>
<p>Nat&uuml;rlich.. man hat gesehen wie sein Sturz von einem Auto gebremst wurde, aber da er sich verdammt knapp an die <a href="http://en.wikipedia.org/wiki/Terminal_velocity" target="_blank">endg&uuml;ltige Sturzgeschwindigkeit</a> &nbsp;von (grob gesch&auml;tzt f&uuml;r eine Person ohne Fallschirm die im Liegen f&auml;llt) 200km/h angen&auml;hert haben sollte (nach 15sec Fall sollte er bereits bei 99% sein), wird das verdammt wenig aussagen. Dabei h&auml;tte er auch im Wasser landen k&ouml;nnen und es h&auml;tte den gleichen Effekt gehabt wie wenn er auf eine Betonmauer trifft.</p>
<p>Es ist ja auch nicht so als h&auml;tte man diesen zweiten Film auf keine andere Art drehen k&ouml;nnen, ein "<a href="http://de.wikipedia.org/wiki/Prequel" target="_blank">prequel</a>" mit der vorherigen Hauptfigur (oberster Handlanger eines Verbrechersyndikates und Auftragskiller) w&auml;re sicherlich auch in irgendeiner Art spannend zu inszenieren gewesen. Vlt. w&auml;re das aber auch einfach zu naheliegend gewesen.</p>
<p>Wen das alles &uuml;berhaupt nicht st&ouml;rt, dem sei noch schnell ein <a href="http://www.traileraddict.com/emd/8005" target="_blank">Link zum Trailer</a> f&uuml;r diesen Film genannt, aufgrund mangelnder Handlung ist in dem Trailer nat&uuml;rlich sicher wieder so ziemlich jede Szene enthalten die im Film interessant gewesen w&auml;re aber das ist man ja sicher schon gewohnt.</p>
<p>Ein Hoch auf die Oberfl&auml;chlichkeit und Volksverdummung! So.. und jetzt geh ich mir nochmal Teil 1 ansehen und bei einem herrlich stumpfsinnigen Gewaltcrescendo geistig komplett abschalten.</p>
<p>(via <a href="http://www.aptgetupdate.de/2009/01/02/movie-crank-2-es-geht-noch-kranker/" target="_blank">apt-get update</a>)</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1026" onclick="set_comment_reference(1026)" title="auf diesen Kommentar antworten">#1026</a>:
    02.Jan.2009 06:01
    von
    
      
        <a href="http://crackpod.bplaced.net/" target="_blank">
          crackpod
        </a>
</p>
<p>Nun, der Film war von Anfang an nicht realistisch, warum sollte der 2te Teiler realistischer sein? Nimm es einfach mehr als Kom&ouml;die als einen Film der sich an Naturgesetze und &Auml;hnliches h&auml;lt.</p>

<p class="infos">
<a href="#comment_1027" onclick="set_comment_reference(1027)" title="auf diesen Kommentar antworten">#1027</a>:
    02.Jan.2009 06:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Naja, da ich eh nichts dran &auml;ndern werde, wird mir nat&uuml;rlich nichts anderes &uuml;brig bleiben...</p>
<p>Ich finde es nur schade dass immer (gef&uuml;hlt) h&auml;ufiger nicht mal mehr ansatzweise versucht wird wenigstens etwas ann&auml;hernd realistisches, oder auch nur etwas das man 5sec f&uuml;r realistisch halten k&ouml;nnte, zu schreiben.</p>

<p class="infos">
<a href="#comment_1028" onclick="set_comment_reference(1028)" title="auf diesen Kommentar antworten">#1028</a>:
    02.Jan.2009 08:01
    von
    
      
        <a href="http://www.neotrix.de/2009/01/02/crank-ii-jason-steht-unter-strom/" target="_blank">
          ['NeOtRiX']
        </a>
</p>
<p>Crank II - Jason steht unter Strom...</p>
<p>Der kommende Film mit Jason Statham tr&auml;gt den Titel &ldquo;Crank 2 - High Voltage&rdquo; und lehnt an den, aus dem Jahre 2006, stammenden Film an. Die Bezeichnung &ldquo;High Voltage&rdquo; und das Wort &ldquo;Fuck&rdquo; bekommen hier eine ganz neue ...</p>

<p class="infos">
<a href="#comment_1029" onclick="set_comment_reference(1029)" title="auf diesen Kommentar antworten">#1029</a>:
    02.Jan.2009 09:01
    von
    
      
        <a href="http://parkrocker.com" target="_blank">
          Parkrocker
        </a>
</p>
<p>Traurig, wie offensichtlich man mit solchen Machwerken nur noch auf die Geldb&ouml;rse der Zuschauer abzielt. Was &auml;rgert einen daran eigentlich mehr? Das man sein Geld zum Fenster rausgeschmissen hat oder das man f&uuml;r doof verkauft wurde...?</p>

<p class="infos">
<a href="#comment_1030" onclick="set_comment_reference(1030)" title="auf diesen Kommentar antworten">#1030</a>:
    02.Jan.2009 10:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>naja, zumindest <em>kann</em> man meist vorher einen eindruck erhalten was man sich da antun will.</p>
<p>Zumindest ich tu das auch meistens, wenn ich aber nur danach entscheide hab ich meist nicht mehr viel was man noch im kino ansehen will.</p>

<p class="infos">
<a href="#comment_1031" onclick="set_comment_reference(1031)" title="auf diesen Kommentar antworten">#1031</a>:
    03.Jan.2009 11:01
    von
    
      
        <a href="http://aberaberarne.de/" target="_blank">
          Arne
        </a>
</p>
<p>Ah. Ha. Ich habe Crank bisher noch nicht gesehen, aber zumindest sah der Trailer zum ersten Teil um einiges professioneller aus. Der Trailer zum zweiten Teil sieht ja mal nach einem richtig &uuml;blen Amateur-"B-Movie"-Trash-Klopfer aus ...</p>

<p class="infos">
<a href="#comment_1032" onclick="set_comment_reference(1032)" title="auf diesen Kommentar antworten">#1032</a>:
    03.Jan.2009 09:01
    von
    
      
        <a href="http://parkrocker.com" target="_blank">
          Parkrocker
        </a>
</p>
<p>Wer wei&szlig;, vielleicht kann Crank 2 sogar noch Death Race toppen... ^^</p>

<p class="infos">
<a href="#comment_1033" onclick="set_comment_reference(1033)" title="auf diesen Kommentar antworten">#1033</a>:
    03.Jan.2009 10:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Death race ist irgendwie v&ouml;llig an mir vorbei gegangen... ich hab bis heute glaube noch nichtmal nen Trailer gesehen (und das obwohl ich in der entsprechenden Zeit &ouml;fters zu flachen Actionfilmen im Kino war), nur die Pappaufsteller stehen &uuml;berall rum.</p>

<p class="infos">
<a href="#comment_1034" onclick="set_comment_reference(1034)" title="auf diesen Kommentar antworten">#1034</a>:
    10.Jan.2009 04:01
    von
    
      
        MAD_MAX
      
    
    
  </p>
<p>Hast denn film doch erst mal anlaufen bevor ihr euch das maul zereist so seh ich das</p>

<p class="infos">
<a href="#comment_1035" onclick="set_comment_reference(1035)" title="auf diesen Kommentar antworten">#1035</a>:
    10.Jan.2009 11:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Zumindest bist du optimistisch... ist ja auch was (ob positiv will ich hier mal nicht bewerten).</p>
</div>