+++
title = "Die Achse des Terrors VII - Reloaded HD"
date = "2016-01-19T11:01:00"
author = "Dr. Azrael Tod"
tags = ["Politik"]
issoid = "blog/1634"
aliases = "blog/1634"
+++

<p>Erinnert sich noch jemand daran <a href="/2014/2/3/Kinder-an-die-Macht">dass ich 2014 gesagt habe es g&auml;be bald noch viel mehr Ecken wo wir ganz dringend per Waffengewalt "Frieden hin bringen" m&uuml;ssen?</a></p>
<p>Unsere behelmte Laien-Kriegsministerin (ohne Doktortitel) <a href="http://www.tagesschau.de/inland/bundeswehr-libyen-103.html">ruft gerade zum n&auml;chsten Kreuzzug</a>. Dieses Mal sollen wir Libyen angreifen ("schloss sie nicht aus" ist tolles Neusprech f&uuml;r "sollten wir mal machen", ich schlie&szlig;e auch nicht aus dass wir Bayern milit&auml;risch befrieden!)</p>
<p></p><blockquote>Verteidigungsministerin von der Leyen warnt vor einer neuen "Achse des Terrors" in Afrika. Es w&auml;re "brandgef&auml;hrlich", wenn Boko Haram und IS kooperierten [...] Einen Bundeswehr-Einsatz zur Stabilisierung Libyens schloss sie nicht aus.</blockquote>
<p>Aber erst mal zum ersten Teil. Warum sollte der Zusammenschluss zweier Terroristengruppen gef&auml;hrlicher sein als beide getrennt? VdL nennt ja daf&uuml;r keinerlei Gr&uuml;nde.<br/>Im Gegenteil, Terroristische Angriffe sind umso gef&auml;hrlicher je dezentraler sie organisiert sind, je mehr Leute davon wissen desto wahrscheinlicher wird es dass man sie verhindern kann.</p>
<p>Aber vlt. meint VdL ja dass die milit&auml;rische Gefahr durch eine Kooperation dieser Gruppen steigen solle? Da ist dann halt bl&ouml;d dass die Gruppen beide keine nennenswerte, milit&auml;rische Gefahr f&uuml;r uns darstellen. Das w&auml;re aber zumindest auch das einzige Gebiet auf dem uns die Bundeswehr helfen k&ouml;nnte.</p>
<p>Sind wir jetzt im Krieg mit einer dieser Parteien? Wenn ja, wer hat uns angegriffen oder den B&uuml;ndnisfall erkl&auml;rt? Geht es um jenen Vorfall in Frankreich, bei dem sich auf die Beistandsklausel im EU-Vertrag berufen wurde? Also Artikel 42, Absatz 7 des Lissabon-Vertrags<br/></p><blockquote>Im Falle eines bewaffneten Angriffs auf das Hoheitsgebiet eines Mitgliedsstaats schulden die anderen Mitgliedsstaaten ihm alle in ihrer Macht stehende Hilfe und Unterst&uuml;tzung, im Einklang mit Artikel 51 der Charta der Vereinten Nationen. [...] Die Verpflichtungen und die Zusammenarbeit in diesem Bereich bleiben im Einklang mit den im Rahmen der Nordatlantikvertrags-Organisation eingegangenen Verpflichtungen, die f&uuml;r die ihr angeh&ouml;renden Staaten weiterhin das Fundament ihrer kollektiven Verteidigung und das Instrument f&uuml;r deren Verwirklichung ist.</blockquote>
<p>Einen NATO-B&uuml;ndnisfall gibt es nicht und so d&uuml;rfen wir entscheiden wie wir helfen.<br/>Genauer hat uns Frankreich direkt auch noch nicht um Hilfe gebeten, sondern sich nur an die EU als Ganzes gewandt. Wir haben daraufhin von uns aus zugesagt bei Aufkl&auml;rung und Transport zu helfen. Was wollen wir auch sonst tun? Bodentruppen haben wir nicht, Schiffe helfen im Inland recht wenig und um es mit Rainer Arnold, dem verteidigungspolitischen Sprecher der SPD, zu sagen:<br/></p><blockquote>Es gibt zu wenig Ziele f&uuml;r Luftangriffe, bei denen ausgeschlossen werden kann, dass sie Schaden in der Zivilbev&ouml;lkerung anrichten.</blockquote><br/>Viel aggressiver als <a href="http://www.harmbengen.de/toonpool/2015%2012%2002%20tornado-selfies_2601415.jpg" target="_blank">Selfies mit dem Tornado knippsen</a> wird es also nicht.

<p>Arnolds Gegenpart (Henning Otte) bei CDU/CSU kann dazu auch nur Beifall jubeln ohne dass es wirkliche Kriegseins&auml;tze g&auml;be:<br/></p><blockquote>Ich begr&uuml;&szlig;e sehr, dass die Kanzlerin Frankreich jedwede Unterst&uuml;tzung zugesagt hat. Das schlie&szlig;t erst mal nichts aus. Jeder bewaffnete Einsatz ist aber eine Einzelfallentscheidung des deutschen Bundestages</blockquote>
<p>Na es ist halt weiter nur <a href="https://www.youtube.com/watch?v=KdDULYzDBvg&amp;feature=youtu.be&amp;t=2m48s" target="_blank">"ein umgangssprachlicher Krieg".</a></p>
<p>Eine Entscheidung dort wirklich Truppen hin zu schicken die Leute erschie&szlig;en sollen gibt es nat&uuml;rlich nicht und wird es wohl auch nicht geben. Aber VdL kann einfach mal beide als Feinde darstellen und behaupten "Wenn die sich zusammenschlie&szlig;en ist das brandgef&auml;hrlich!!!11elf"</p>
<p>Leider bleibt Kriegstreiberei und "Schwachsinn labern" weiterhin straffrei. <a href="/2015/12/2/Krieg">Strafbare Dinge, wie uns z.B. Vorbereiten, tun wir ja nicht.</a></p>
<p>Achja: hatte sich Boko Haram nicht Anfang <a href="http://www.spiegel.de/politik/ausland/terror-gruppen-boko-haram-unterwirft-sich-is-a-1022370.html" target="_blank">letzten Jahres schon dem IS angeschlossen?</a></p>
<p>Nachtrag: um die Truppenst&auml;rke im Syrieneinsatz der Bundeswehr, "etwa 1200", mal in Relation zu setzen: das sind ziemlich genau <a href="https://blog.fefe.de/?ts=a860c484">2x Rigaer Stra&szlig;e 94</a>. <b>WIR K&Ouml;NNEN IN SYRIEN ZWEI H&Auml;USER PRO TAG NACH TERRORISTEN DURCHSUCHEN!</b></p>
