+++
title = "RB/RE/IRE-Bordradio"
date = "2008-06-12T08:06:00"
author = "Dr. Azrael Tod"
issoid = "blog/409"
aliases = "blog/409"
+++

<p>Mal eine Idee f&uuml;r die Bahn (vlt. liest ja einer von denen mit):</p>
<p>Wie w&auml;re es mit einem Bordradio? Man k&ouml;nnte in die Sitze (evtl. auch nur jeden 2. oder 4., alternative Montagem&ouml;glichkeit w&auml;re an den Oberlichtern) eine einfache Klinkensteckerbuchse (+Beschrifftung "Bordradio" und Lautst&auml;rkeregelung) anbringen &uuml;ber die eine Art Bordradio eingespielt werden kann. Das Bordradio k&ouml;nnte dann effektiv verwendet werden um den Bahn-Kunden Informationen und Unterhaltung zu bieten, finanzieren k&ouml;nnte man die Unterhaltung dieses Systemes problemlos &uuml;ber Werbung und den Verkauf (eigentlich billiger) Kopfh&ouml;rer in der Bahn selbst oder auf den Bahnh&ouml;fen.</p>
<p>Die Kosten f&uuml;r eine derartige Installation w&uuml;rden sich stark in &uuml;berschaubaren Grenzen halten (Okay, wenn man weiterhin die Z&uuml;ge bei Siemens bestellt kostet es nat&uuml;rlich das Doppelte) und im Gesamtpreis nichtmal auf Promillewerte kommen.</p>
<p>Dar&uuml;ber k&ouml;nnte man dann &uuml;brigens auch solche Kundendienste wie die aktuelle Durchsage der letzten Fu&szlig;ballergebnisse laufen lassen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_169" onclick="set_comment_reference(169)" title="auf diesen Kommentar antworten">#169</a>:
    13.Jun.2008 01:06
    von
    
      
        tsukama
      
    
    
  </p>
<p>Gabs oder Gibt es sowas nicht schon im ICE??? Oder habe ich mich schief gewickelt? Ich meine, da w&auml;re mal was gewesen....</p>

<p class="infos">
<a href="#comment_170" onclick="set_comment_reference(170)" title="auf diesen Kommentar antworten">#170</a>:
    13.Jun.2008 09:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Kann durchaus sein, ich fahre relativ selten im IC(E) (aus Geldgr&uuml;nden)</p>

<p class="infos">
<a href="#comment_171" onclick="set_comment_reference(171)" title="auf diesen Kommentar antworten">#171</a>:
    16.Jun.2008 11:06
    von
    
      
        <a href="http://www.drni.de/blog/" target="_blank">
          DrNI
        </a>
</p>
<p>Als ich das erste mal mit dem ICE gefahren bin (ein ICE 1, nat&uuml;rlich) war das eines der Highlights. In modernen ICEs gibt es statt dessen weniger Platz und 230V-Steckdosen.</p>

<p class="infos">
<a href="#comment_172" onclick="set_comment_reference(172)" title="auf diesen Kommentar antworten">#172</a>:
    16.Jun.2008 11:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Wie gesagt... ich habe keine Ahnung wie das im IC(E) aussieht, ich fahre fast immer nur RB/RE/IRE (und zum Urlaub dieses Jahr etliche male per EC, das war aber die bl&ouml;deste Idee seit langem -.-)</p>

<p class="infos">
<a href="#comment_173" onclick="set_comment_reference(173)" title="auf diesen Kommentar antworten">#173</a>:
    17.Jun.2008 11:06
    von
    
      
        Inu
      
    
    
  </p>
<p>Ich meine auch mal in einem ICE "Radio" per Kopfh&ouml;rer genossen zu haben. Das Programm war aber etwas mager, bis auf eine sch&ouml;ne Reportage bei der man wunderbar schlafen konnte. Deshalb erinnere ich mich auch noch dran. ;)<br/>
Was ich sch&ouml;ner f&auml;nde w&auml;re eine fl&auml;chendeckende Ausstattung mit 230 V Steckdosen. Dies hatte ich bis jetzt nur in einem EuroExpress, oder wie der hei&szlig;t, gehabt. Und da auch nur an sehr wenigen Sitzpl&auml;tzen. Aber ich denke bis es soweit ist h&auml;lt der Durchschnitts-Akku sicherlich entsprechend lange.</p>

<p class="infos">
<a href="#comment_174" onclick="set_comment_reference(174)" title="auf diesen Kommentar antworten">#174</a>:
    17.Jun.2008 11:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>230V-Steckdosen gibts im Raum Dresden in der S-Bahn massig. Da hat man in manchen Wagen fast an jedem Sitzplatz welche.</p>
</div>