+++
title = "Computerspiele Gestern und Heute"
date = "2009-03-06T12:03:00"
author = "Dr. Azrael Tod"
issoid = "blog/1288"
aliases = "blog/1288"
+++

<p>Fr&uuml;her (tm) wurden ja Computerspiele eine Zeit lang von relativ kleinen Teams entwickelt. Jemand hatte eine Idee, hat sie vlt. mit ein paar Kumpels zusammen umgesetzt und wenn die Sache mal wirklich umfangreich und/oder verkaufbar wurde, hat man sich einen Publisher gesucht.</p>
<p>Mit der Zeit jedoch wurden die Dinger (wie so ziemlich alles an Software) immer Umfangreicher. Ein kleines Team baut einfach keinen (oder zumindest kommt es seltener vor) Egoshooter mit Grafiken auf dem neuesten Stand, Levels f&uuml;r die man Monate zum virtuellen "Durchwandern" braucht und einer KI die f&uuml;r die Spieler einigerma&szlig;en realistisch wirkt.<!--more--></p>
<p>Entgegen vieler Behauptungen (auch von meiner Seite) sind die Spiele nicht schlechter geworden. Kaum einer der aktuellen Genremixe braucht sich auch nur in irgendeinem der Teilbereiche, die dieser nur so nebenbei bedient, vor einem der reinrassigen, alten Spiele zu verstecken. Es ist auch nicht so dass nur die Grafik besser geworden w&auml;re, schlie&szlig;lich w&uuml;rde z.B. keiner behaupten dass bei den schlechtesten, aktuellen FPS-Spielen die KI schlechter w&auml;re als bei den allerersten (egal ob <a href="http://de.wikipedia.org/wiki/Wolfenstein_3D" target="_blank">Wolfenstein</a>, <a href="http://de.wikipedia.org/wiki/Quake" target="_blank">Quake</a>, <a href="http://de.wikipedia.org/wiki/Duke_Nukem_3D" target="_blank">Duke Nukem 3D</a> oder was auch immer).</p>
<p>Was jedoch auff&auml;llt ist dass verschiedene Aspekte unterschiedlich schnell einer Entwicklung unterlaufen. So sind die verschiedenen Genres schon seit vielen Jahren relativ festgefahren und alles was es dort noch an neuen Entwicklungen gibt sind Kreuzungen: FPS-RPG-Mix, RPG mit Strategie, Strategie mit Panzer-fahr-spielchen... und was man halt sonst noch so an Ideen hatte. Die Grafik hingegen ist in einem Tempo besser geworden dass es einem schwindlig werden k&ouml;nnte.</p>
<p>Die Gr&uuml;nde daf&uuml;r sind leicht verst&auml;ndlich. Bessere Grafik kann man leicht erzeugen indem man genug Geld/Aufwand auf das Problem wirft, wirklich gute und neue Spielideen hingegen kommen nicht &uuml;ber Nacht. Auch Dinge wie eine bessere KI k&ouml;nnte man mit Aufwand erschlagen, aber das Verkauft sich einfach nicht so gut. Man sieht auf einem Bildschirmfoto nunmal eher wie viele Bl&auml;tter die B&auml;ume haben, als ob sich die Gegner koordiniert anpirschen.</p>
<p>Wir haben es also mal wieder mit einem Problem zu tun, dass durch unser kapitalistisches System gef&ouml;rdert oder &uuml;berhaupt erst erm&ouml;glicht wird. Beheben kann man es also nur wie all die anderen Probleme mit dieser Charakteristik</p>
<p></p><ul><br/> <li>Wir k&ouml;nnten es mit neuen Entwicklungen &uuml;berspringen. Neue Eingabemethoden oder Darstellungsformen k&ouml;nnen schlagartig den Weg f&uuml;r komplett neue Spielideen bereiten. Wer k&ouml;nnte sich schon ein MMORPG ohne gute Internetverbindung vorstellen?</li><br/> <li>Wir k&ouml;nnen die Marktwirtschaftlichen Hintergr&uuml;nde umgehen. Dies kann z.B. in Form von neuen Hobby-Projekten entstehen, die sich z.B. via OpenSource weiterentwickeln ohne direkt marktwirtschaftlichen Gesetzen zu folgen.</li><br/></ul><br/>Ein gutes und aktuelles Beispiel f&uuml;r die erste Variante w&auml;re z.B. Nintendos Wii. Durch neue Eingabem&ouml;glichkeiten und die st&auml;rkere Verlagerung auf Causal Gaming hat sich das Verhalten der Komsumenten grundlegend ge&auml;ndert. So wurde Grafik oder eine epische Geschichte von vielen pl&ouml;tzlich nicht mehr als so wichtig angesehen, viel interessanter ist es doch mit vielen Freunden vor einem gnadenlos infantilen Geschicklichkeitsspielchen zu sitzen und einfach nur Spa&szlig; zu haben.

<p>Die zweite Variante sehen wir bei Spielen wie <a href="http://sauerbraten.org" target="_blank">Cube2 Sauerbraten</a>, <a href="http://xmoto.tuxfamily.org/" target="_blank">XMoto</a> oder <a href="http://www.wesnoth.org" target="_blank">Battle for Wesnoth</a>. Diese Spiele entstanden rein als Hobby-Projekte und doch hat sich eine umfangreiche Community gebildet die bereits mehr Spielinhalte erzeugt haben als viele kommerzielle Projekte. Vor allem die ersten beiden realisieren dabei auch derzeit von keinem kommerziell vertretenen Spiel implementierte Funktionen, die vlt. v&ouml;llig neue Wege aufzeigen k&ouml;nnten.</p>
<p>F&uuml;r mich stellt sich bei all dem die Frage ob es sich &uuml;berhaupt noch lohnt mir teuere Spiele zu kaufen, bei denen mehr auf Grafik geachtet wird als auf Spielinhalte. In der Tat gibt es schon seit Jahren sehr wenige Spielver&ouml;ffentlichungen die mich ernsthaft interessiert haben. In "letzter Zeit" h&auml;tten wir da z.B. <a href="http://de.wikipedia.org/wiki/The_Elder_Scrolls" target="_blank">Oblivion</a> oder <a href="http://www.worldofgoo.com" target="_blank">World of Goo</a> (eigentlich auch ein denkbar mieses Beispiel f&uuml;r gro&szlig;e Produktionsfirmen, bei einem Entwicklerteam von 2 Personen), die einfach mit der reinen Menge an M&ouml;glichkeiten beeindruckten oder ein ge niales, neues Spielprinzip boten. Andere Spiele sind vlt. auch einfach nur wegen der verarbeiteten Themen interessant, so z.B. bei einer <a href="http://de.wikipedia.org/wiki/Otherland#Videospiel" target="_blank">neuen Produktion nach Tad Williams' Otherland-Romanen</a> (die B&uuml;cher waren einfach zu genial) oder der (eigentlich nicht) neuen Version von <a href="/2008/12/09/toplist-ruckfall-chrono-trigger/">Chrono Trigger</a> f&uuml;r Nintendo DS.</p>
<p>F&uuml;r den normalen Hausgebrauch jedoch spiele ich als allerh&ouml;chstes der Gef&uuml;hle mal noch ein SNES-Spiel, emuliere mir einen DOS-PC oder schlie&szlig;e mir das N64 an und spiele eine runde Smash Bros..<br/>Ich besitze auch schon seit vor meinem Studium eigentlich keinen wirklich "zum Spielen geeigneten" PC mehr. Zumindest nicht wenn man danach geht was die heutige Industrie f&uuml;r einen derartigen h&auml;llt.<br/>Mein kleines Akoya-Netbook hat z.B. eine erheblich gr&ouml;&szlig;ere Leistung als so ziemlich jeder PC in meinen Anfangsjahren mit dieser Platform. Es stellt selbst f&uuml;r dieses Ger&auml;t an der untersten Grenze der Preisskala kein Problem mehr dar sich wie eine diser alten Kisten zu verhalten und Spiele wie The <a href="http://de.wikipedia.org/wiki/The_Legend_of_Kyrandia#The_Legend_of_Kyrandia:_Book_Three:_Malcolm.27s_Revenge" target="_blank">Legend of Kyrandia</a>, <a href="http://de.wikipedia.org/wiki/Magic_Carpet_(Computerspiel)" target="_blank">Magic Carpet</a>, <a href="http://de.wikipedia.org/wiki/Gta2#Grand_Theft_Auto_.281997.29_und_GTA_2_.281999.29" target="_blank">GTA2</a> oder <a href="http://de.wikipedia.org/wiki/Z_(Computerspiel)" target="_blank">Z</a> in spielbarer Qualit&auml;t wiederzugeben.</p>
<p>Auch in den Medien scheint immer mehr anzukommen dass die alten Spiele nicht unbedingt schlechter als aktuelle sind. So habe ich vor einiger Zeit bereits im Zeitschriftenhandel gestanden und verwundert auf Magazine zum Thema Retrogaming gestarrt. Der Reiz diese zu kaufen und dann doch wieder Geld auszugeben hat sich dann aber beim ersten Blick hinein schnell wieder gegeben. Warum hatte ich auch erwartet dass mir eine Zeitung etwas neues sagen kann, wenn es um alte Themen geht, zu denen ich mich schon vor vielen Jahren <em>sehr ausgiebig</em> informiert habe?</p>
