+++
title = "HP Jornada"
date = "2008-06-26T01:06:00"
author = "Dr. Azrael Tod"
issoid = "blog/425"
aliases = "blog/425"
+++

<p>Oliver auf <a href="http://www.from-hades.de/" target="_blank">From Hades</a> mal wieder <a href="http://www.from-hades.de/apple-hardware/" target="_blank">einen langen Vergleich</a> zwischen Apple-Hardware und anderen Herstellern gebracht. Unter anderem beschwert er sich &uuml;ber seinen alten HP Jornada 520 und Windows CE im allgemeinen.</p>
<p>Ich pers&ouml;nlich finde Windows CE als Platform jetzt nicht ganz so grunds&auml;tzlich unbrauchbar wie er. Mein alter Jornada (auch ein 520er) ist eigentlich auch nicht sooo schlecht. Klar, verglichen mit aktueller Hardware ist die genauigkeit des Touchscreens grauenvoll und die Leistung grottig, ganz zu schweigen davon dass das Ding keinen sinnvollen Browser mitbringt, IE z&auml;hlt nun wirklich nicht, damit kann man sich nichtmal wirklich f&uuml;r PocketPC optimierte Seiten ansehen -.- (und davon gibt es nun wirklich nicht viele), auch ist es wahnsinnig hinderlich keinen brauchbaren internen speicher zu haben (16MB-System? WTF?) und st&auml;ndig CF-Karten mit Speicher gegen CF-Karten mit Wlan tauschen zu m&uuml;ssen (das tut man nicht lange -.-)<br/>Ich kann das Ding jedenfalls noch ganz als MP3-Player gebrauchen (Winampaq spielt sogar ogg-vorbis) und von Zeit zu Zeit mal ein GB(C)-Spiel drauf zocken. (Es gibt nat&uuml;rlich auch native Spiele, diese haben h&auml;ufig die um Welten bessere Grafik und der Sound ruckelt nicht, aber daf&uuml;r sind die wirklich guten etwas rar)<br/>Nat&uuml;rlich kann das Ding auch als Organizer verwendet werden und von Zeit zu Zeit tippe ich den einen oder anderen Blogpost grob darauf vor. Auch ist das Ding nahezu unkaputtbar, meiner hat unter anderem schon einen Autounfall &uuml;berlebt (hat jetzt nur eine Delle in der Front).</p>
<p>Wenn man bedenkt wie alt die Kiste ist, ist es eigentlich Beeindruckend was das Ding schon alles kann, neuere Ger&auml;te haben dann zwar auch noch einige Macken behoben die mich daran gest&ouml;rt haben (Internes Wlan, mehr Speicher, WPA-unterst&uuml;tzung, genug Speicher um Firefox oder Opera zu nutzen, echte Tastatur statt nur Einblendung, nur noch eine CPU-Architektur unterst&uuml;tzt statt dem urspr&uuml;nglichen Chaos ...) aber wirkliche Weiterentwicklungen vermisse ich auch.<br/>So w&auml;re es sch&ouml;n wenn man sich ein besseres Bedienkonzept h&auml;tte einfallen lassen (PocketNav ist noch immer unverzichtbar f&uuml;r mich) oder auch nur endlich mal den kleinen Schritt getan h&auml;tte, dass in 2Dimmensionalen Men&uuml;s auch etwas mit den Hoch/Runter-Tasten anzufangen gewesen w&auml;re. Wozu zum Henker habe ich 4 Richtungstasten am Geh&auml;use, wenn ich immer nur Rechts/Links steuern kann?<br/>&Uuml;berhaupt h&auml;tte man sich endlich mal ein besseres Design f&uuml;r die Tasten einfallen lassen k&ouml;nnen, der Standardentwurf mit Steuerkreuz in der Mitte und Zusatztasten rechts und links davon ist imho so ziemlich die schlechteste M&ouml;glichkeit die man w&auml;hlen konnte. SELBST BEIM NES LAG DIE STEUERUNG BESSER IN DER HAND!.</p>
<p>Kurz gesagt: Windows CE hatte durchaus einen guten Start und h&auml;tte durchaus ein Erfolg werden k&ouml;nnen, auf dem "Smartphone" scheint sich ja im Moment auch noch ein sp&auml;ter Durchbruch einzustellen, doch hat man einfach viele Entwicklungen verschlafen und h&auml;tte besser auf Probleme reagieren sollen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_209" onclick="set_comment_reference(209)" title="auf diesen Kommentar antworten">#209</a>:
    26.Jun.2008 09:06
    von
    
      
        <a href="http://www.from-hades.net" target="_blank">
          Oliver
        </a>
</p>
<p>Also WindowsCE damals war einfach der m&auml;&szlig;ige Versuch Windows 3.11 her&uuml;berzuhiefen und irgendwie bekam es MS nie wirklich hin das ganze passend f&uuml;r diese Kleinstger&auml;te zu etablieren. Palm beispielsweise war genial, verpa&szlig;te aber den Fortschritt. Und Apple, Apple ist zu bl&ouml;de diese Ger&auml;te richtig zu vermarkten, sprich offen nutzbar und auch als Kleinstcomputer plaziert. Der besagte HP hatte ja noch ganz andere Probleme, im Prinzip war die CPU (SH3) schnell genug, eine SH4 CPU trieb z.B. die Dreamcast an, vielmehr torpedierte das passive(!) Display die Show und die 256 Farben aus einer Menge von 4096. Dadurch mu&szlig;te die CPU schon st&ouml;hnen ob des Display und dem fortw&auml;hrenden Dithern der Grafik bei jedem Bildschirmaufbau. Mit einem aktiven Display war damals sogar PDF ertr&auml;glich nutzbar. Ansonsten ja es war nutzbar, zumindest konnte man WinCE von Anfang an programmiertechnisch zu Leibe r&uuml;cken. Der serielle Port war jedoch auch nicht wirklich der Bringer, auch wenn noch ohne tats&auml;chliche Alternative zu der Zeit.</p>

<p class="infos">
<a href="#comment_210" onclick="set_comment_reference(210)" title="auf diesen Kommentar antworten">#210</a>:
    26.Jun.2008 09:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Jegliche L&ouml;sung die es derzeit gibt hat leider ihre Macken und Probleme.<br/>
Windows mit seinem Interface, die Apple-Ger&auml;te mit ihrer geschlossenen Platform (es geht um mobile Computer, nicht um mobile Spielekonsolen, die haben wir schon lange in Form von Gameboy und co.) Symbian ist (wie die urspr&uuml;nglichen CE-Kleinger&auml;te) keine geschlossene Platform (daran arbeitet ja seit neuestem Nokia mit Unterst&uuml;tzung von vielen kleineren Anbietern) wenn auch diesmal wegen der verschiedenen Oberfl&auml;chen und nicht der CPUs. Linux ist derzeit einfach noch nicht Stromsparend genug und weit von Marktreife entfernt (Zaurus, OpenMoko und &auml;hnlichen Einzelsystemen zum Trotz)</p>
<p>Meiner Meinung nach haben in diesem Sektor ziemlich viele Firmen viel zu lange geschlafen und sind jetzt grade erst am Aufwachen, wohl auch aufger&uuml;ttelt von Googels einsteigen in das Gesch&auml;fft. (Eigentlich ist das mehr als erstaunlich wenn man bedenkt welcher Umsatz mit Handys und &auml;hnlichem gemacht wird.)<br/>
IMHO gibt es zur Zeit noch keine wirkliche Alternative zu Windows CE oder dem Iphone, da letzteres aber einfach nur im obersten Preissegment angesiedelt ist, mehr als Statussymbol fungiert als wirklich genutzt wird und nur sehr eingeschr&auml;nkt f&uuml;r Drittpersonen zur Softwareentwicklung tauglich ist, z&auml;hlt es f&uuml;r mich nicht wirklich unter "w&uuml;nschenswert".<br/>
Man kann nur hoffen dass sich mit Series60, Linux(!) und einem evtl. etwas offenerem Apple-System da m&ouml;glichst bald etwas tut.<br/>
Microsoft oder Palm sind meiner Meinung nach noch lange nicht aufgewacht und werden diese Entwicklung wohl viel zu lange verschlafen. (Auch bei Nokia k&ouml;nnte es imho knapp werden)</p>

<p class="infos">
<a href="#comment_211" onclick="set_comment_reference(211)" title="auf diesen Kommentar antworten">#211</a>:
    26.Jun.2008 10:06
    von
    
      
        <a href="http://www.from-hades.net" target="_blank">
          Oliver
        </a>
</p>
<p>Apple wird sich nie wirklich &ouml;ffnen, auch wenn das Gros der Basis im Prinzip offen ist. Denn man arbeitet heutzutage gem&auml;&szlig; dem Blackbox-Prinzip und das ist einfach immer &uuml;berlegen, denn so wirklich genau wei&szlig; nie irgendjemand etwas. Dar&uuml;ber hinaus hat das bei Apple Methode, man gibt Ger&auml;te und Software nur f&uuml;r sehr eingeschr&auml;nkte Zwecke frei, das viele gerade dort einen Hort der Kreativit&auml;t sehen erstaunt dann doch sehr. Auf meinem damaligen Quadra mu&szlig;te ich schon Klimmz&uuml;ge vollziehen, um n ur ein fremdes SCSI-Laufwerk von Sony zu installieren. Interessanterweise was das verstorbene Laufwerk zwar von Apple, jedoch OEM-Sony. Der Treiber kannte jedoch nur Apple-Laufwerke und so mu&szlig;te ich diesem ganz beherzt mit einem Hex-Editor zu Leibe r&uuml;cken :-) Und o Wunder, danach lief es besser als das Original und kostete nur einen Bruchteil von diesem (das war Mitte der 90er und CD-Laufwerke doch noch etwas teurer.</p>
<p>Das alles ist also nicht neu, man m&ouml;chte zufriedene Kunden und diese erh&auml;lt man gem&auml;&szlig; Apple-Credo nur in einem eng umgrenzten Habitat. Denn wenn man beispielsweise nur eine Hauptstra&szlig;e besitzt und diese noch einz&auml;umt, kann man sich nicht verlaufen. Risiken und Nebenwirkungen werden dabei willig in Kauf genommen - Apple hat z.B. inzwischen auch Probleme Developer zu finden :-)</p>
<p>Damit steuert man nicht nur das Erlebnis, sondern man sorgt auch f&uuml;r einen gepflegten Absatz der eigenen Hardware und die Halbwertszeit bei Apple ist kurz, sehr kurz. Warum wohl erw&auml;hnt Jobs in der Regel nie mit einer Silbe Opensource, obwohl dieses mit &uuml;ber 70% das System stellt? Nun man w&uuml;rde den Leuten die Illusion von der Uber-Maschine rauben. Einbu&szlig;en gabs da schon zu verzeichnen als man auf den Erzfeind Intel umschwenkte :-) Von daher sehe ich dort ein no-go pa&szlig;t nicht ins Firmenkonzept.</p>
<p>Palm? Palm ist imho tot. Man gurkt dort immer noch mit einem veralteten Palm-OS herum, versuchte mal fremd zu gehen mit Windows CE und fabulierte ein wenig von einem Linux-basiertem System. M&ouml;glich w&auml;re alles, wenn man nur m&ouml;chte. Google Android besteht aus Teilen von Linux und Teilen von NetBSD (libc).</p>
<p>Das Problem wohl eher ist man sucht nach der lukrativen Killerapplikation. Apple hat diese zum einen eine Art Smartphone und zum anderen einen Player - beide bieten mehr. Die anderen versuchen es mit der Positionierung als Navigations-Computer und bei den Mobiltelefonen fantasieren viele noch von UMTS und TV. Ehrlich bevor sich letzteres durchsetzt braucht es <em>echte</em> Flat-Raten zu anst&auml;ndigen Preisen.</p>
<p>Das Internet selbst erlangte auch wirklich erst Eigendynamik mit den ersten ISDN-Flatraten anno 2000, sowie dem initiierten DSL und den folgenden dauerhaften Flatraten, sowie stetig fallenden Preisen. Eben das fehlt den Mobilger&auml;ten und danach kann man sich Gedanken &uuml;ber die Killerapplikationen machen. Ich hatte mitte der 90er Zugang zu Compuserve, davor schon Mailboxen mit dem 64er usw., Problem: der Blick auf die Uhr ob der laufenden Kosten - die Uni gab mir da zwar sehr fr&uuml;h Alternativen mit damals zumindest wahnwitzigen 65kb/s :D aber allgemein war das ohne Bedeutung.</p>
<p>Kurzum man versucht das Pferd von hinten aufzuz&auml;umen und das funktioniert so einfach nicht. Eine echte und g&uuml;nstige UMTS-Flatrate und ich bin gekauft :-) dann denke ich auch &uuml;ber allerlei zus&auml;tzliche Dinge im Mobilbereich nach.</p>

<p class="infos">
<a href="#comment_212" onclick="set_comment_reference(212)" title="auf diesen Kommentar antworten">#212</a>:
    26.Jun.2008 10:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Kurzum man versucht das Pferd von hinten aufzuz&auml;umen und das funktioniert so einfach nicht. Eine echte und g&uuml;nstige UMTS-Flatrate und ich bin gekauft :-) dann denke ich auch &uuml;ber allerlei zus&auml;tzliche Dinge im Mobilbereich nach.</p>
<p>Eine echte UMTS-Flatrate w&auml;re f&uuml;r mich sogar zeitweise eine wirklich tolle Alternative zu DSL gewesen (in Zukunft nichtmehr f&uuml;r mich pers&ouml;nlich da ich erheblich sesshafter werde). Ich bin mir Sicher dass es daf&uuml;r eine ziemlich gro&szlig;e Zielgruppe gibt und verstehe nicht ganz warum sich dieses Gesch&auml;fft noch keiner Verschafft hat.<br/>
Ein weiteres Argument f&uuml;r eine gute Platform w&auml;re f&uuml;r mich einfach ein gutes SDK (bzw. allgemein gute Programmierbarkeit) und eine einfache Oberfl&auml;che. Wenn man das ganze mit guter Hardware kombiniert bin ich mir sicher dass die Nutzer schon selbst auf eine Killerapplikation kommen.</p>

<p class="infos">
<a href="#comment_213" onclick="set_comment_reference(213)" title="auf diesen Kommentar antworten">#213</a>:
    26.Jun.2008 11:06
    von
    
      
        sirsnookie
      
    
    
  </p>
<p>Eine UMTS Flatrate gibts schon ab 25 &euro;uronen bei E-Plus. Allderdings auf 384 Kbit/s beschr&auml;nkt. Dann gibts da noch die &uuml;blichen Verd&auml;chtigen: T-Mobile, Vodafone und Moobi, da hast dann bis satte 7,2 Mbit/s. Ab 34,95 &euro; aufw&auml;rts.</p>
<p>Wers nich glauben kann, kann nachlesen unter: <a href="http://www.flat-umts.de/%3C/p%3E" rel="nofollow">http://www.flat-umts.d...</a>
</p>
<p class="infos">
<a href="#comment_214" onclick="set_comment_reference(214)" title="auf diesen Kommentar antworten">#214</a>:
    26.Jun.2008 11:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ich zitiere mal E-Plus:<br/>
Die E-Plus Internet Flatrate gilt f&uuml;r paketvermittelte Daten im E-Plus UMTS- und GPRSNetz au&szlig;er Roaming- und Auslandsverbindungen. Die Nutzung von Voice over IP ist ausgeschlossen. UMTS- bzw. GPRS-f&auml;higes Endger&auml;t erforderlich. Die E-Plus Internet Flatrate wird als Tarif (in Verbindung mit einer UMTS Notebook Card) angeboten. Die Mindestvertragslaufzeit betr&auml;gt 24 Monate. Soweit die E-Plus Internet Flatrate nicht zum Ablauf der Mindestvertragslaufzeit gek&uuml;ndigt wird (K&uuml;ndigungsfrist: 1 Monat), verl&auml;ngert sich die Laufzeit automatisch um ein weiteres Jahr. Einmaliger Anschlusspreis &euro; 25, monatlicher Grundpreis &euro; 25. Die Nutzung von Sprachdiensten (z. B. Mailbox, Sprach-Informationsdienste) und Videotelefonie ist nicht m&ouml;glich.</p>

<p class="infos">
<a href="#comment_215" onclick="set_comment_reference(215)" title="auf diesen Kommentar antworten">#215</a>:
    27.Jun.2008 09:06
    von
    
      
        <a href="http://www.from-hades.net" target="_blank">
          Oliver
        </a>
</p>
<p>Die UMTS-Flatraten sind allesamt zu teuer, das Verbreitungsgebiet ist weitaus eingeschr&auml;nkter als es die Werbung verspricht und bisher drosselt jeder diese wanna-be Flatraten ab einem gewissen Volumen. Insgesamt gesehen kauft man also hier die Katze im Sack.</p>

<p class="infos">
<a href="#comment_216" onclick="set_comment_reference(216)" title="auf diesen Kommentar antworten">#216</a>:
    27.Jun.2008 09:06
    von
    
      
        <a href="http://www.from-hades.net" target="_blank">
          Oliver
        </a>
</p>
<p>Sorry habe den &uuml;ber mir nicht gesehen, deshalb hier noch: es hat nichts mit Glauben zu tun oder der blo&szlig;en Existenz, nur rede ich von <em>Flatraten</em> und nicht Mogelpackungen.</p>

<p class="infos">
<a href="#comment_217" onclick="set_comment_reference(217)" title="auf diesen Kommentar antworten">#217</a>:
    27.Jun.2008 11:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>passend dazu ein aktueller <a href="http://www.heise.de/newsticker/Palm-bleibt-tief-in-den-roten-Zahlen--/meldung/110092/from/atom10">Heise-Bericht</a> wie tief Palm grade in der Shice steckt...</p>

<p class="infos">
<a href="#comment_218" onclick="set_comment_reference(218)" title="auf diesen Kommentar antworten">#218</a>:
    10.Sep.2008 12:09
    von
    
      
        <a href="/2008/09/10/ppc-tools_top10/" target="_blank">
          10 PocketPC-Tools &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] auf CE-Basis, ich hab daher ihren alten IPaq H3800 &uuml;berlassen bekommen der nun meinen alten Jornada so langsam abl&ouml;st) und wieder feste Programme suche die ich installieren k&ouml;nnte, hier eine kurze [...]</p>
</div>