+++
title = "Homeservergehäuse#5"
date = "2008-10-14T01:10:00"
author = "Dr. Azrael Tod"
tags = ["Hardware", "Nerdig", "PC", "Technik", "Homeservergehäuse"]
issoid = "blog/938"
aliases = "blog/938"
+++

<p>Die unendliche Geschichte geht weiter -.- (<a href="/tags/homeservergehäuse">Teile</a>: <a href="/2008/9/5/Homeservergeh&auml;use/">0</a> <a href="/2008/9/19/Homeservergeh&auml;use1/">1</a> <a href="/2008/9/22/Homeservergeh&auml;use2/">2</a> <a href="/2008/9/22/Homeservergeh&auml;use3/">3</a> <a href="/2008/10/3/Homeservergeh&auml;use4/">4</a>). Gestern Abend habe ich die Platten aus denen das Geh&auml;use mal zusammengesetzt werden soll in ihrer Grundform fertiggestellt. Bilder gibt es heute allerdings noch keine, ich hatte gerade keine Kamera zur Hand.&nbsp; Ich versuch aber welche nachzuliefern.<!--more--></p>
<p>Nachdem ich vor fast 2 Wochen bereits die ersten 3 Platten mit Glasfaser und Kunstharz laminiert habe (und das ganze jeweils mit einer Schicht Alufolie &uuml;berzogen hab), musste ich leider feststellen dass nicht nur das Glasfasergeflecht zu knapp bemessen war sondern auch der Kunstharz gerade mal f&uuml;r die H&auml;lfte reichte.</p>
<p>kurzer Einwurf: Bez&uuml;glich Glasfaser bei &auml;hnlichen Projekten auf keinen Fall das Wirr gewobene Zeug kaufen, das l&auml;sst sich schlechter verarbeiten. Gleichm&auml;&szlig;igere Glasfasergeflechte bieten oft einen st&auml;rken Halt, lassen sich also besser zurechtschneiden fusseln beim Verarbeiten weniger und kleben auch nicht permanent am Pinsel.</p>
<p>Da Kunstharz aber alles andere als billig ist habe ich mein ganzes Projekt nochmal ziemlich &uuml;ber den Haufen geworfen. H&auml;tte ich noch eine Packung gekauft, w&auml;re ich bereits fast bei den Gesamtkosten f&uuml;r ein fertiges Geh&auml;use angekommen. Als neues Material habe ich diesmal nur Aluminiumfolie verwendet.</p>
<p>Davon habe ich sehr lange Bahnen zu dicken Platten zusammengekn&uuml;llt (je wirrer und fester verwoben umso besser), diese flachgedr&uuml;ckt und mit weiteren 1-2 Schichten umwickelt (um eine ebene Oberfl&auml;che zu erhalten.)</p>
<p>Diese neuen Platten sind nicht ganz so steif wie die Kunstharzplatten, aber ich hoffe mal es reicht um das Eigengewicht zu tragen. Verbinden werde ich die Platten im &uuml;bern&auml;chsten Arbeitsschritt mit Heiskleber, wodurch sich auch weitere Festigkeit an den R&auml;ndern ergeben sollte. L&ouml;cher und Ausschnitte werden ebenfalls mit Heisleim umfasst um ein weiteres Aufdr&ouml;seln der Schichten zu vermeiden.</p>
<p>F&uuml;r den n&auml;chsten Schritt ist erstmal geplant diese L&ouml;cher zu bohren, dabei k&ouml;nnte es sinnvoll sein die Platten zwischen zwei feste Pappschichten einzuspannen.</p>
<p>F&uuml;r die Laufwerksaufh&auml;ngungen habe ich jetzt auch eine Idee, ich werde dicke Schienen aus Alufolie kn&uuml;llen. Nat&uuml;rlich sollen nicht die ganzen Laufwerke komplett umfasst werden um eine Luftzirkulation zu gew&auml;hrleisten.</p>
<p>Bisher habe ich bereits eine volle 30m-Rolle an Folie verwendet, das f&auml;llt aber im Gesammtpreis wirklich fast nicht auf.</p>
<p>Das Endprodukt soll weiterhin als Abschluss mit Silberfarbe angespr&uuml;ht werden, bisher sieht die Oberfl&auml;che durch die Folie allerdings bereits ziemlich gut aus, so dass dies evtl. nicht so dringend ist.</p>
