+++
title = "Natürlich nur natürlich"
date = "2015-05-15T05:05:00"
author = "Dr. Azrael Tod"
tags = ["Politik", "Pseudoargumente", "Rant", "Sprache", "Säue durchs Dorf treiben"]
issoid = "blog/1601"
aliases = "blog/1601"
+++

<p>Nat&uuml;rlich nat&uuml;rlich!</p>
<p>Leute wollen dass in ihrer Nahrung nur "nat&uuml;rliche" Zutaten vorkommen. So k&uuml;nstliche Aromen aus S&auml;gesp&auml;nen oder K&auml;fern sind b&ouml;se.<br/>Mein Problem damit ist dass die Leute nicht definieren k&ouml;nnen was sie mit nat&uuml;rlich meinen.</p>
<p>Warum ist das Aroma aus S&auml;gesp&auml;nen schlimmer als z.B. Whisky in eine So&szlig;e zu werfen? Also <a href="#whisky">ihr wisst schon...</a><br/>Die Br&uuml;he die neben Holzkohle, Kupfer, biologischen Prozessen/Fermentierung, G&auml;rung auch noch Aromen aus verbranntem Torf, Eiche und gerne mal Reststoffe aus der Sherry/Portweinlagerung enth&auml;lt.</p>
<p>Da ist so ziemlich alles an chemischen Vorg&auml;ngen drin was man sich vorstellen kann.</p>
<p>Andere Zutaten die "nat&uuml;rlich" sind:<br/></p><ul><li>K&auml;se, gerne auch mit blauen Schimmelpilzen</li><br/><li><a href="http://www.chefkoch.de/rezepte/313741112834108/Tofu-selbstgemacht.html">Tofu</a> oder <a href="https://de.wikipedia.org/wiki/Seitan">Seitan</a></li><br/><li>raffinierter Zucker</li></ul>
<p>Dinge die nat&uuml;rlich nicht "nat&uuml;rlich sind:<br/></p><ul><li><a href="https://de.wikipedia.org/wiki/Ethylvanillin">Ethylvanillin</a></li><br/><li><a href="https://de.wikipedia.org/wiki/P%C3%B6keln">Nitritp&ouml;kelsalz</a></li><br/><li><a href="https://de.wikipedia.org/wiki/Lecithine">Lecithine</a></li></ul>
<p>Ich sehe ein Muster! Scheinbar ist alles nat&uuml;rlich was irgendwelche wirren Stoffgemische enth&auml;llt und alles f&uuml;r das man klare, chemische Summenformeln angeben kann ist "k&uuml;nstlich".<br/>Bl&ouml;d halt dass da die ziemlich einzigen Zutaten die man heute genauso wie vor 10K Jahren verwendet, rausfallen:</p>
<p></p><ul><li>Wasser</li><li>Spei&szlig;esalz</li><li>St&auml;rke</li></ul>
<p>Es gibt halt verdammt viele, &uuml;bliche <a href="https://de.wikipedia.org/wiki/Liste_der_Lebensmittelzusatzstoffe">Lebensmittelzusatzstoffe</a> und die Leute haben &uuml;blicherweise keine Ahnung.<br/>Ich meine damit nicht dass die Leute keine Ahnung von Chemie h&auml;tten.<br/>Ich meine damit auch nicht dass die Leute keine Ahnung von Ern&auml;hrung h&auml;tten.</p>
<p>Ich meine w&ouml;rtlich "sie haben keine Ahnung".<br/>..ohne Einschr&auml;nkungen</p>
<p>Schreib' irgendwo eine E-Nummer auf die Verpackung und das Lebensmittel ist "b&ouml;se". Auch wenn es mal wieder nur E260 (Essigs&auml;ure) oder E162 (Betenrot) ist.<br/>&Uuml;berhaupt! Farb- und Konservierungsstoffe!<br/>Das muss die abartigste Erfindung unserer modernen Industrienahrung &uuml;berhaupt sein!</p>
<p>...abgesehen davon halt dass wir dank k&uuml;nstlicher K&uuml;hlung, Luftabgeschlossener Verpackungen und kurzen Transportwegen heute vermutlich viel weniger haltbar machen m&uuml;ssen als jemals zuvor und die meisten Methoden um etwas haltbar zu machen schon Jahrtausende alt sind.</p>
<p>Die Idioten halten unsere Parks und Kulturw&auml;lder f&uuml;r Natur, Erbsen in Mitteleuropa f&uuml;r typisch, denken M&ouml;hren w&uuml;rden normalerweise orange aussehen und Erdbeeren von alleine 100g wiegen.<br/>Ich ertrag' diese Idioten bald nicht mehr.</p>
<p><img alt="I don't want to live on this planet anymore" src="/static/images/fun/futurama_idwtlotpa.jpg"/></p>
<p></p><h3 id="whisky">Grob&uuml;bersicht Whisky-Herstellung</h3><br/> <br/><ul><li>Getreide schroten</li><br/><li>einweichen</li><br/><li>mehrere Tage unter Luft-Zufuhr fermentieren (ankeimen) lassen um kurzkettigen Zucker aus langkettiger St&auml;rke zu erzeugen</li><br/><li>mit Hei&szlig;luft trocknen (dem Feuer f&uuml;r die Hei&szlig;luft evtl. Torf hinzuf&uuml;gen um dessen Aroma einzubringen)</li><br/><li>mahlen</li><br/><li>wiederholt mit Wasser vermengen, Zucker ausl&ouml;sen und andere Feststoffe ausfiltern</li><br/><li>Zuckerl&ouml;sung mit Hefe ansetzen und g&auml;ren lassen bis sich 8-9% Alkohol gebildet haben</li><br/><li>Destilieren bis 20-25% Alkoholgehalt erreicht sind</li><br/><li>zweites Mal Destilieren bis 65-70% Alkoholgehalt erreicht sind (die Wandst&auml;rke der Brennblase nimmt dabei &uuml;ber die Jahre hinweg ab, man kann also davon ausgehen dass auch Kupfer im Produkt landet)</li><br/><li>Eichen-Bretter trocknen, ca. 30min auf 200&deg;C erhitzen, 3-5min ausbrennen bis sich eine Holzkohleschicht bildet (alternativ alte F&auml;sser in denen Cherry oder Portwein gelagert wurde weiterverwenden)</li><br/><li>Destilat "ein paar Jahre" in den F&auml;ssern lagern (mindestens 3, &uuml;blich sind auch 12-21 Jahre)</li><br/><li>Inhalte verschiedener F&auml;sser so vermischen dass man einen gleichm&auml;&szlig;igen Geschmack erh&auml;lt</li><br/><li>bei Flaschenabf&uuml;llung meist noch durch Wasserzugabe den Alkoholgehalt auf 40-46% senken</li></ul>
