+++
title = "Frickelshice"
date = "2008-11-27T12:11:00"
author = "Dr. Azrael Tod"
issoid = "blog/1075"
aliases = "blog/1075"
+++

<p>Ich hab jetzt endg&uuml;ltig die Nase voll von meinem Homeserver... Die Kiste tut nichts von dem was sie soll.<!--more--></p>
<p>Die erste Aktion war ja dass ich mir eine zus&auml;tzliche Wlan-Karte kaufen musste weil ich via Kabel nur schwer vom Router zum Standort des Geh&auml;uses komme. (F&uuml;r 20&euro; h&auml;tte ich mir die n&ouml;tigen Flachkabel zulegen k&ouml;nnen, aber ein Wlan-Adapter war ja billiger -.-)</p>
<p>Also USB-Adapter bestellt, sch&ouml;n mit Chipsatz von dem ich wei&szlig; dass er unter Linux tut und angesteckt.. Was macht jetzt der Server? Er zeigt mir an dass das Netz mit "sehr guter Verbindungsqualit&auml;t" anliegt und verursacht alle 2min. Netzwerkabbr&uuml;che. Nat&uuml;rlich nicht einfach so, sondern alle 1-2 Stunden gleich so toll dass er aufh&ouml;rt &uuml;berhaupt eine Verbindung herzustellen.</p>
<p>BTW: wer kam eigentlich auf die geniale Idee dass man, in Ubuntu via default, Wlan oder &auml;hnliches nur dann braucht wenn man eine grafische Oberfl&auml;che gestartet und sich dort angemeldet hat? Ist ja nicht so als w&auml;re Linux ein NETZWERKBETRIEBSSYSTEM! -.-</p>
<p>Die zweite tolle Aktion war dann eindeutig als ich Filme auf meinem Mediaserver ansehen wollte... keine Chance das mal irgendwie Ruckelfrei zum Laufen zu bekommen. Das k&ouml;nnte an den schlechten Treibern f&uuml;r Via-Grafikchips liegen oder auch an der etwas knapp bemessenen Systemleistung meines C7.</p>
<p>Die Grafiktreiber sind eh fast v&ouml;llig f&uuml;rn Arsch, zumindest das was man unter Ubuntu als Standardeinstellung angeboten bekommt. Das Overlay meiner Fernsehkarte l&auml;sst sich nat&uuml;rlich nicht Zoomen... immer sch&ouml;n 768x576-Output auf eine Defaultaufl&ouml;sung von 1600x1200 schieben (gleich der n&auml;chste Bl&ouml;dsinn... nur weil mein CRT diese Aufl&ouml;sung schafft ist sie nicht unbedingt ideal).</p>
<p>Erster Workaround der mir eingefallen ist: 800x600-Aufl&ouml;sung einstellen! Doch was macht Ubuntu bei dieser Aufl&ouml;sung erstmal? Es ruiniert die Darstellung jeder 2. Schrift. Die H&auml;lfte der Programme wird normal dargestellt w&auml;hrend der Rest erstmal eine schriftgr&ouml;&szlig;e 12 auf 3px-H&ouml;he zusammenschieben muss.</p>
<p>Um mal zu einer Zusammenfassung zu kommen: Die Kiste erledigt von den 3 Aufgaben f&uuml;r die sie in der Ecke steht nur eine einzige.<br/></p><ul><br/> <li>Filme ansehen geht nicht da immer irgendwelche Hintergrundprozesse gestartet werden die das System soweit auslasten dass es ruckelt.</li><br/> <li>Netzwerkdienste kann man auch vergessen da das Netzwerk eigentlich permanent down ist</li><br/> <li>N64-Spiele kann ich laufen lassen... wenn ich die Bildschirmaufl&ouml;sung auf 800x600 runterstelle, was jeden Text im Filemanager unlesbar macht</li><br/></ul><br/>Keines dieser Probleme ist unl&ouml;sbar.. Wenn ich mich ein paar Stunden ransetz bekomme ich sicherlich das meiste in den Griff. Das Problem ist: Ich hab keinen Bock stundenlang an selbstverst&auml;ndlichkeiten <a href="http://drazraeltod.wordpress.com/2008/07/27/508/" target="_self">rumzufrickeln</a>! Auch f&uuml;r mich ist Zeit==Geld (eher Zeit&gt;&gt;Geld, da ich Zeit nicht neu auftreiben kann).

<p>Normalerweise w&auml;re meine erste Reaktion mein NotBook rauszuholen und wieder als Server einzusetzen... das hat halt nur die kleinen Sch&ouml;nheitsfehler dass ich keinen TV-In habe und die Kiste auch gerne mal lauter wird (was bei einem Ger&auml;t st&ouml;rt dass 24/7 laufen soll).</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_913" onclick="set_comment_reference(913)" title="auf diesen Kommentar antworten">#913</a>:
    27.Nov.2008 02:11
    von
    
      
        <a href="http://www.info-tain.de" target="_blank">
          geby
        </a>
</p>
<p>WLAN und GUI haben auf einem Server auch eigentlich nicht viel zu suchen ^^</p>

<p class="infos">
<a href="#comment_914" onclick="set_comment_reference(914)" title="auf diesen Kommentar antworten">#914</a>:
    27.Nov.2008 02:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Wlan war wie gesagt eine Notl&ouml;sung da das Verlegen eines Kabels sich etwas umst&auml;ndlich gestaltet h&auml;tte...</p>
<p>Und GUI l&auml;uft halt erstmal weil das Ding nicht nur Server sondern auch Media-Center-PC ist.<br/>
Die GUI wollte ich aber noch gegen FB-Progs austauschen, FBTV hat sich fr&uuml;her auf vorherigen Instanzen dieses Rechners z.B. als sehr praktisch erwiesen.</p>

<p class="infos">
<a href="#comment_915" onclick="set_comment_reference(915)" title="auf diesen Kommentar antworten">#915</a>:
    29.Nov.2008 12:11
    von
    
      
        <a href="http://aberaberarne.de/" target="_blank">
          Arne
        </a>
</p>
<p>Ich pers&ouml;nlich w&uuml;rde Ubuntu auch nie im Server-Einsatz betreiben. Als Desktop-System wirklich top, aber als Server? Ich wei&szlig; nicht ... da st&ouml;rt es mich auch schon grunds&auml;tzlich, dass es von der Standard-Einstellung her keinen "echten" root gibt.<br/>
Bei einem Server w&uuml;rde ich dann direkt Debian nehmen. Nur wei&szlig; ich dann nicht, wie gut sich der Server als Entertainment-System macht, denn damit habe ich noch keinerlei Erfahrung ...</p>

<p class="infos">
<a href="#comment_916" onclick="set_comment_reference(916)" title="auf diesen Kommentar antworten">#916</a>:
    29.Nov.2008 01:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>zugegeben.. ein echtes Debilian w&auml;re wohl wirklich sinnvoll gewesen. Ich habe jedoch den ganzen Frickelshice mit Mythtv (was ich immer noch hoffe irgendwann produktiv einsetzen zu k&ouml;nnen) und den dazugeh&ouml;rigen MySQL-Einstellungen umgehen wollen.<br/>
Daher mein Griff zu Mythbuntu...</p>
<p>BTW: den richtigen Root gibt es durchaus... er wird halt nur nicht verwendet.</p>
</div>