+++
title = "Untertanmodus - alles im ARGEn"
date = "2008-08-18T07:08:00"
author = "Dr. Azrael Tod"
issoid = "blog/563"
aliases = "blog/563"
+++

<p>Nachdem ja auch Snookie neulich erst wieder <a href="http://www.wangoo.de/2008/08/prufungszeugnis-fur-den-angelschein-was-ein-gelaufe/" target="_blank">Spa&szlig; mit diversen &Auml;mtern</a> hatte, musste ich mir das Heute auch gleich noch einmal antun.<br/>Diesmal wollte ich nur schnell zum Arbeitsamt.. &auml;h.. zur Arbeitsagentur.. achnee zum Jobcenter/ARGE (wer bezahlt eigentlich die dauernden Namenswechsel und Restrukturierungen um Geld zu sparen?).<br/>Der Grund meines Besuches war diesmal dass ich mich, nach einigen Monaten Arbeitssuche, nun doch arbeitslos melden muss um demn&auml;chst wieder eine Stelle annehmen zu k&ouml;nnen. (Schon der erste Irrsinn, es h&auml;tte f&uuml;r mich w&auml;hrend meiner Suche keinerlei Vorteile gebracht als Arbeitssuchender gemeldet zu sein, aber um jetzt eine neue, wahrscheinlich gef&ouml;rderte Stelle annehmen zu k&ouml;nnen muss ich mich noch schnell anmelden um mich dann wieder abmelden zu k&ouml;nnen.)<br/>Meine Theorie ist ja, dass wann immer ein deutscher Bundesb&uuml;rger das Wort "Amt" h&ouml;rt oder irgendetwas amt&auml;hnliches wittert, bei ihm irgend ein Schalter umgelegt wird und er sich sofort in eine Art "Untertanmodus" begibt.<br/><!--more--><br/>In diesem Modus wird so ziemlich alles hingenommen was an seltsamen Formularen, Wartezeiten oder Beschwerden bez&uuml;glich fehlender (wenn auch eigentlich unben&ouml;tigter oder woanders bereits eingetragener) Angaben so anf&auml;llt.<br/>Derartiges Verhalten w&uuml;rde wohl im Normalbetrieb niemals hingenommen werden. Wer kauft schon ein Auto bei einem H&auml;ndler der erstmal 4 Wochen Wartezeit bis &uuml;berhaupt die ersten Aktionen unternommen werden ank&uuml;ndigt und den Antrag 3x wegen eines fehlenden Datums oder so (man k&ouml;nnte ja das Antragsdatum zur Not selbst eintragen, evtl. das Datum neben der Unterschrifft abschreiben?) zur&uuml;ckschickt?<br/>Im Untertanmodus jedoch, wird sich h&ouml;chstens &uuml;ber den Amtsschimmel beschwert aber wirklich etwas dagegen unternehmen will nat&uuml;rlich keiner. Evtl. liegt auch einfach die Annahme zu nahe, die Leute im Amt h&auml;tten ja nur Aufwand f&uuml;r die eigene Person und die Leistungen von Amtswegen w&uuml;rden nur erfolgen weil da jemand Nett zu uns sein will.<br/>Eine seltend&auml;mliche Idee, wie ich hier einmal bemerken muss, immerhin werden die &Auml;mter ja von Staat finanziert, dieser vom Volk und das Volk sind nunmal immer noch wir alle! (BTW: Warum demonstriert eigentlich die <del datetime="00">SED</del> <del datetime="00">&auml;h PDS</del> Linke in Zwickau mit dem Spruch "Wir sind das Volk"? Will sagen warum nutzen heute diejenigen die selbe Parole, mit denen sie vor ein paar Jahrzehnten vom eigentlichen Volk abgesetzt wurden?)<br/>Mit dieser Sichtweise im Hinterkopf wird einem erstmal der ganze Bl&ouml;dsinn klar, den manche &Auml;mter verzapfen. Das beginnt bei Bearbeitungsgeb&uuml;hren, von denen <a href="http://www.lawblog.de/index.php/archives/2008/08/18/betrunkene-sollen-fur-zelle-bezahlen/" target="_blank">im Law Blog</a> erst wieder bemerkt wurde wie bl&ouml;dsinnig sie sind:<br/></p><blockquote>Die Mickergeb&uuml;hren verursachen zus&auml;tzlichen Verwaltungsaufwand auf den Wachen und beim Forderungseinzug, ganz zu schweigen von Gerichtsprozessen gegen die Kostenbescheide und erfolglosen Zwangsvollstreckungen. Da w&auml;chst nur eins - der b&uuml;rokratische Wasserkopf in den Polizeibeh&ouml;rden. Letztlich w&uuml;rde jedem eingenommenen Euro noch ein stattlicher Betrag an Steuergeldern hinterhergeworfen.</blockquote><br/>Au&szlig;er dass diese Geb&uuml;hren also eigentlich schon dadurch gedeckt sein sollten dass das Amt sich &uuml;ber das Volk finanziert, also auch durch den Antragssteller, erdreisten sich unsere Verwalter mal noch eben Geb&uuml;hren zu erheben die uns allen mehr Kosten verursachen als was sie an ausgleichender Wirkung bringen.

<p>Das gleiche gilt nat&uuml;rlich auch f&uuml;r Praxisgeb&uuml;hr und &auml;hnlichen Schwachsinn, nur dass dort der Aufwand auf die (eigentlich auch so schon ziemlich &uuml;berlasteten) Allgemeinmediziner abgew&auml;lzt wird. Dieser Bl&ouml;dsinn alleine w&auml;re schon wieder genug f&uuml;r 10 Blogeintr&auml;ge, darum will ich gleich thematisch weiterspringen.</p>
<p>Allgemein zeigt sich f&uuml;r mich die Tendenz dass alles so weit verkompliziert und teuerer gemacht wird, damit sich ja keiner mehr damit auskennt und jeder m&ouml;glichst gleich das Stellen von irgendwelchen Antr&auml;gen oder so l&auml;sst.<br/>In Deutschland wird also alles soweit mit der Begr&uuml;ndung der "sozialen Gerechtigkeit" totreguliert bis am Ende nur noch derjenige an seine staatliche Unterst&uuml;tzung kommt, der sich ein Heer von spezialisierten Beratern und Anw&auml;lten leisten kann.<br/>Dass es sich dabei nicht um den Harz4-Empf&auml;nger von nebenan handelt ist nat&uuml;rlich klar, doch was kann man schon gegen das Schlagwort "soziale Gerechtigkeit" sagen?</p>
<p>Ein weiteres Problem ist wohl die selbsterhaltende B&uuml;rokratie, sprich: Wenn B&uuml;rokraten die Regeln machen, wird keine Regel die B&uuml;rokratie abbauen. Warum auch? Damit w&uuml;rden sich die B&uuml;rokraten selbst ihre Arbeit wegnehmen.</p>
<p>Alle Steuern auf 50-70% Mehrwertsteuer zusammen zu k&uuml;rzen (wie das z.B. vor langer Zeit mal <a href="http://www.spiegel.de/wirtschaft/0,1518,386396,00.html" target="_blank">von DM-Gr&uuml;nder G&ouml;tz Werner vorgeschlagen</a> und ausformuliert wurde) w&uuml;rde zwar das System von Grund auf zu etwas besserem umbauen, kann jedoch in unserer aktuellen Staatsstruktur niemals realisiert werden. Das liegt in diesem Fall nichteinmal an irgendwelchen Wirtschafts-Lobbies oder sonstigen Bestechungsvorg&auml;ngen, sondern einfach daran dass wir damit mindestens die H&auml;lfte unserer Verwaltungsbeamten entlassen k&ouml;nnten. Warum sollten wir in einem derartigem System noch Leute brauchen die sich Steuersysteme ausdenken, diese totreden, dann verst&uuml;mmelt doch noch einsetzen und die n&auml;chste Verschlimmbesserung n&ouml;tig machen? (Warum brauchen wir solche Leute eigentlich &uuml;berhaupt?) Ganz zu Schweigen von den Leuten die Ausrechnen wie hoch die pers&ouml;nlichen Steuern sind, denjenigen die die Zahlungen verwalten, ausstehende Zahlungen einfordern, neue Steuerschlupfl&ouml;cher suchen oder alte Schlupfl&ouml;cher schlie&szlig;en... Naja, ich glaube ihr wisst worauf ich hinaus will.</p>
<p>Nat&uuml;rlich ist Geld nur ein Teil der Probleme, ein weiterer w&auml;re z.B. der Zeitaufwand. Ich pers&ouml;nlich wollte heute wie bereits oben geschrieben aufs Arbeitsamt um mich zu melden, leider habe ich bei den &Ouml;ffnungszeiten nicht richtig aufgepasst und durfte dann erst nach 1h 30min Fussweg (im Gro&szlig;raum Dresden scheint es ganze 3 Filialen der Arbeitsargentur zu geben) feststellen dass die &Ouml;ffnungszeiten Montags zwar bei 8-16 Uhr liegen, dies jedoch nichts mit der Sprechzeit zu tun hat und diese endet montags bereits 12Uhr. In diesem Fall ist es nat&uuml;rlich gut dass die nur mit Arbeitslosen zu tun haben, stell sich mal einer vor da w&uuml;rde ein fest angestellter zum Sozialamt wollen (was ja jetzt mit Arbeitsamt zur ARGE zusammengeschlossen wurde) und irgendeine Art Unterst&uuml;tzung beantragen. Ich kann mir irgendwie schwer vorstellen dass alle arbeitenden Leute zwischen 8 und 12 Uhr irgendwann mal f&uuml;r 2-3 Stunden von Arbeit weg k&ouml;nnen.</p>
<p>F&uuml;r mich war das nat&uuml;rlich erstmal nicht ganz so schlimm, ich kam nur auf die Idee mir pers&ouml;nlich mal die Frage zu stellen, wer mir denn den Aufwand erstatten k&ouml;nnte...<br/>4x anderthalb Stunden Fu&szlig;weg, bei einem Stundenlohn von 5&euro; w&auml;ren das bereits 30&euro;.<br/>Alternativ k&ouml;nnte ich nat&uuml;rlich auch mit den &ouml;ffentlichen Verkehrsmitteln fahren, Hin- und R&uuml;ckfahrt bei der DVB kosten derzeit 1,80&euro;, bei 4 Fahrten sind das bereits auch 7,20&euro;.<br/>Als arbeitsloser Exstudent hab ich ja auch das Geld nicht so locker in der Tasche sitzen...</p>
<p>Allerdings m&uuml;sste ich, selbst wenn ich die Unkosten irgendwie erstattet bekommen k&ouml;nnte, daf&uuml;r wahrscheinlich wieder 10 Antr&auml;ge ausf&uuml;llen, noch 4-5x beim Amt aufschlagen und w&uuml;rde wahrscheinlich noch mindestens eine Bearbeitungsgeb&uuml;hr von 50&euro; zahlen m&uuml;ssen...</p>
<p>Das einzige ann&auml;hernd sinnvolle was ich gegen derartige Methoden machen kann bleibt wohl weiterhin dar&uuml;ber zu bloggen und mich &uuml;berall dar&uuml;ber aufzuregen.</p>
<p>In diesem Sinne:</p>
<p>Los Sancho, sattel Rosinante! Wir haben Arbeit vor uns.</p>
<p>[Update]<br/>Aus irgend einem Grund hatte ich den ersten Link auf den Falschen Artikel gesetzt... ich meine nat&uuml;rlich nicht Snookies Artikel &uuml;ber Sch&auml;uble 2.0 sondern den nun Verlinkten "<a href="http://www.wangoo.de/2008/08/prufungszeugnis-fur-den-angelschein-was-ein-gelaufe/" rel="bookmark" title="Pr&uuml;fungszeugnis f&uuml;r den Angelschein, was ein gelaufe!">Pr&uuml;fungszeugnis f&uuml;r den Angelschein, was ein gelaufe!</a>"</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_443" onclick="set_comment_reference(443)" title="auf diesen Kommentar antworten">#443</a>:
    19.Aug.2008 01:08
    von
    
      
        Tsukama
      
    
    
  </p>
<p>Oh Jessas! Da kann man Dir nur Gut Holz, strake Nerven und Baldriantropfen herbei w&uuml;nschen!</p>
<p>In diesem Sinne: Das Amt ist tot, es lebe das Amt!</p>

<p class="infos">
<a href="#comment_444" onclick="set_comment_reference(444)" title="auf diesen Kommentar antworten">#444</a>:
    19.Aug.2008 03:08
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Danke.. nach einem Zweiten Besuch heute, der wieder alles andere als toll lief (ok, man kann ja erstmal Leute in IRGENDEINE Etage schicken, aber wenn die Etagen nach Zust&auml;ndigkeit f&uuml;r ein Einzugsgebiet geordnet sind, w&auml;re es doch sinnvoller, mich erstmal nach meiner PLZ zu fragen -.-) scheine ich es erst einmal hinter mir zu haben.<br/>
Nat&uuml;rlich nur bis &uuml;bern&auml;chste Woche oder so, wenn ich dann wahrscheinlich wieder als arbeitsloser abgemeldet werde.<br/>
Daf&uuml;r durfte ich heute aber noch schnell feststellen dass ich gestern zu recht nicht mit der Bahn gefahren bin. Eine Stra&szlig;enbahnfahrt zum Arbeitsamt dauert von hier aus eine knappe Stunde, das ist nicht wirklich viel besser als die anderthalbe Stunde Fu&szlig;weg von gestern.</p>

<p class="infos">
<a href="#comment_445" onclick="set_comment_reference(445)" title="auf diesen Kommentar antworten">#445</a>:
    19.Aug.2008 06:08
    von
    
      
        <a href="http://www.noqqe.de" target="_blank">
          noqqe
        </a>
</p>
<p>Einfach nur ... Oh mein gott.</p>

<p class="infos">
<a href="#comment_446" onclick="set_comment_reference(446)" title="auf diesen Kommentar antworten">#446</a>:
    19.Aug.2008 07:08
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Danke, du kannst mich aber auch DAT nennen. <em>G</em></p>
</div>