+++
title = "Windradbashing bei Spiegel?"
date = "2008-08-01T11:08:00"
author = "profmakx"
issoid = "blog/517"
aliases = "blog/517"
+++

<p>Also als ich letztens <a href="http://www.spiegel.de/video/video-33699.html">dieses Video</a> bei spiegel.de gesehen habe dachte ich noch: Naja. Was solls.</p>
<p>Heute morgen musste ich dann auch noch <a href="http://www.spiegel.de/video/video-33749.html">jenes Video</a> sehen.</p>
<p><!--more--></p>
<p>Eindrucksvoll zu sehen, das. Aber sind bei Spiegel Windradbashingdays? Erstmal: Warum war es "reines Gl&uuml;ck" dass sich niemand auf dem Feld aufhielt (in Video 2)? Bei so einem Sturm geht niemand der einigermassen gesund im Kopf ist vor die T&uuml;re.</p>
<p>Und warum lief das bl&ouml;de Windrad? Bei Sturm werden die Dinger normalerweise abgeschaltet damit nix passiert.<br/>W&auml;re das Teil dennoch am Netz gewesen h&auml;tte sich das niemals so schnell gedreht.<br/>Bei mir entsteht der Eindruck als w&uuml;rden diese Windr&auml;der als eine Bedrohung dargestellt, damit man irgendetwas hat was man ihnen entgegensetzen k&ouml;nnte.<br/>Windr&auml;der sind nicht nur scheiss billig sowohl in der Anschaffung als auch im Betrieb, sondern auch noch Umweltfreundlich und relativ effizient. Meines erachtens ist es sch&ouml;n jeden Tag zu sehen, dass auch Strom produziert werden kann ohne &Ouml;l, Gas oder Kohle oder schlimmer noch: Atomenergie.</p>
<p>Die zwei Millionen Euro Schaden sind zum einen ziemlich sicher Versichert und zum anderen sollte man mal die Betreiber von Kr&uuml;mmel fragen was der Transformator gekostet hat, der da abgebrannt ist.</p>
<p>Ist bald wieder Atomabstimmung im Bundestag? Ich sehe schon die Bildschlagzeile: "Wir haben Angst vor den Windr&auml;dern. Die kosten Arbeitspl&auml;tze, und stellen sie sich vor jemand wird davon erschlagen!"</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_414" onclick="set_comment_reference(414)" title="auf diesen Kommentar antworten">#414</a>:
    01.Aug.2008 04:08
    von
    
      
        <a href="http://fidel.vido.info/wordpress" target="_blank">
          fidel
        </a>
</p>
<p>Hast 2 mal das gleiche Spiegel Video verlinkt =)<br/>
gruss<br/>
fidel</p>

<p class="infos">
<a href="#comment_415" onclick="set_comment_reference(415)" title="auf diesen Kommentar antworten">#415</a>:
    01.Aug.2008 04:08
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>ist korrigiert.</p>

<p class="infos">
<a href="#comment_416" onclick="set_comment_reference(416)" title="auf diesen Kommentar antworten">#416</a>:
    02.Aug.2008 03:08
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Wurden nicht noch vor kurzem V&ouml;gel in Mitleidenschaft gezogen? interessant wie immer wieder neue Argumente gegen derartige Technologien an den Haaren herbeigezerrt werden...</p>

<p class="infos">
<a href="#comment_417" onclick="set_comment_reference(417)" title="auf diesen Kommentar antworten">#417</a>:
    05.Aug.2008 11:08
    von
    
      
        <a href="http://www.energynet.de" target="_blank">
          Andy
        </a>
</p>
<p>Das hat beim Spiegel System und wird schon seit Jahren so gemacht. Erinnere mich sogar an ein Titelthema zu Windenergie und vielen an den Haaren herbeigezogenen Nachteilen. Und k&uuml;rzlich (in der Diskussion zur &Uuml;berarbeitung des EEG) gab es einen gr&ouml;&szlig;eren Artikel zu Photovoltaik, dass wir damit doch nur Arbeitspl&auml;tze in Fernost schaffen w&uuml;rden.</p>
</div>