+++
title = "ARM Cortex-A9-Netbook - Toshiba AC100-10V"
date = "2011-09-12T07:09:00"
author = "Dr. Azrael Tod"
tags = ["Android", "Gadget", "Hardware", "Nerdig", "Technik"]
issoid = "blog/1555"
aliases = "blog/1555"
+++

<p>Ich war jetzt schon eine Weile auf der Suche nach einem kleinen, billigen, transportablen Rechner, der eigentlich nicht viel leisten muss. Bereits vor einiger Zeit, hatte ich da als bisher ertr&auml;glichste L&ouml;sung zu <a href="/2008/10/19/medion-akoya-mini-e1210/" target="_blank">einem Netbook auf Atom-Basis</a> gegriffen,  das aber dank seiner Platform ziemlich unausgereift ist.</p>
<p></p><h3>Netbooks haben sich auch die letzten Jahre kaum entwickelt</h3><br/>Vor 3 Jahren kaufte ich ein <a href="http://blog.nonstop-shopping.com/92-medion-akoya-mini-e1210-160gb-speicher-bluetooth/" target="_blank">MSI Wind (naja, fast)</a> mit 10" Display, max. 2h Akkulaufzeit, 160GB Festplatte, mieser Intel Grafik und 1GB RAM f&uuml;r 370&euro; und heute kann man f&uuml;r einen &auml;hnlichen Preis <a href="" target="_blank">folgendes Ger&auml;t bei MSI erhalten</a>.

<p>Noch immer halten die Standard-Akkus ca. 2h, noch immer haben die Dinger nur nen VGA-Out und nicht genug Leistung f&uuml;r etwas h&ouml;her aufl&ouml;sende Videos, noch immer wiegen sie 1,2kg, noch immer werden die Ger&auml;te sp&uuml;rbar warm (vor allem auf Textiloberfl&auml;chen abgestellt) und noch immer brauchen sie einen mechanischen L&uuml;fter den man h&ouml;rt (teilweise unter Last sogar recht laut).</p>
<p>Darauf hatte ich keinen Bock mehr und als der 2. Akku (der gro&szlig;e, klobige 8-Zellen-Akku mit 6-7h Laufzeit gab schon vor einer Weile den Geist auf) neulich aufh&ouml;rte zu funktionieren, hatte ich endlich eine Ausrede mich nach etwas neuem umzusehen.</p>
<p>Die nat&uuml;rliche Idee war dann ein vergleichbares Ger&auml;t mit ARM-CPU zu kaufen. Warum sollte ich auch bei x86ern bleiben, wenn die technisch nichtmal ann&auml;hernd mithalten k&ouml;nnen? In der Tat gibt es genug CPUs die den Atom einfach nur alt aussehen lassen. Allen vorran die <a href="http://www.nvidia.com/object/tegra-2.html" target="_blank">NVIDIA Tegra 2</a> zeigen <a href="http://www.youtube.com/results?search_query=Tegra+2+Leistung" target="_blank">enormes potential</a>. Es gibt nur ein Problem: man findet keine Rechner damit! Ein paar <a href="http://ecafe.hercules.com/" target="_blank">&auml;ltere Netbooks mit A8-CPU</a> und nat&uuml;rlich diese aktuell so gehypten Tablets gibts es (gleich dutzendweise)</p>
<p></p><h3>Tablets sind einfach kein sinnvolels Konzept!</h3><br/>Ich darf von berufs wegen &ouml;fters mal ein iPad in der Hand halten (um nicht zu sagen seit letztem Jahr liegt fast permanent eins an meinem Arbeitsplatz oder in der N&auml;he, weil ich so Sachen f&uuml;r iOS und Android programmieren soll) und ich hab in all der Zeit keine Anwendung daf&uuml;r gefunden.<br/>Bildschirmtastatur gibt kein haptisches Feedback, mit 700g ist die Kiste verdammt erm&uuml;dend wenn man sie einh&auml;ndig halten will und einh&auml;ndig bedienen ist bei diesem ganzen Multitouch-Zeugs auch nicht so das wahre. Besser noch: die Texteingabe auf einem gro&szlig;en Tablet ist _nachweislich_ schlechter als auf einem vergleichbarem Telefon, da man loslassen muss um die Tasten in der Mitte zu erreichen.

<p></p><h3>Dann fand ich das Toshiba AC100.</h3><br/>Im Prinzip ist es genau das was ich suchte. Ein kleines Netbook. Es bringt 875g auf die Wage ist nur 14-21mm dick, hat eine relativ brauchbare Tastatur, HDMI-out, Tegra2-CPU, &gt;6h Akkulaufzeit und das beste: das Betriebssystem ist ein ziemlich kaputtes Android.

<p>Das soll gut sein? Ja, denn das sorgt sch&ouml;n daf&uuml;r dass sich viele ahnungslose Leute diese Netbooks gekauft haben, festgestellt haben dass ihr Office nicht geht oder dass sie dank fehlendem Android-Market auch sonst kaum Anwendungen installieren k&ouml;nnen und wollten die Dinger wieder loswerden.<br/><b>Bei EBay bekommt man die jetzt jedenfalls f&uuml;r unter 100&euro; nachgeworfen.</b></p>
<p>Nat&uuml;rlich ist das ein billigger&auml;t und knarzt etwas. Auch w&auml;ren mehr als ein USB-Anschluss (es gibt einen f&uuml;r peripherie wie USB-Sticks oder M&auml;use und einen mini-USB um das AC100 an einen Rechner, als Speichermedium anzuschlie&szlig;en) sch&ouml;n gewesen. Auch hat man, wie heute &uuml;blich, vergessen das Display zu entspiegeln und das Touchpad ist f&uuml;r meinen Geschmack etwas zu sehr an der Vorderkante des Ger&auml;te angeordnet. Wirklich "schlimm" jedoch ist eigentlich nur dass <a href="http://tosh-ac100.wetpaint.com/page/Hardware#fbid=eggSRE3WGUY" target="_blank">die deutschen Versionen</a> kein Bluetooth haben (daher will man eigentlich UK-Versionen, aber die sind teuerer) und man das unter Android auch kaum via USB-Dongle nachr&uuml;sten kann.</p>
<p>Momentan hab ich erstmal tats&auml;chlich noch das originale Android 2.2 laufen, das von Toshiba bereit gestellt wurde (wenn ich auch ein paar System-Sachen nachger&uuml;stet hab, um z.B. Google-Kontenverwaltung zu bekommen, interessanterweise ist der fehlende Market eigentlich kaum ein Problem, nur gibt es verdammt viele Sachen die gerne Systemkonten haben wollen). Ich &uuml;berlege noch ob ich mir <a href="http://tabletroms.com/forums/ac100-rom-development/1928-meego-toshiba-ac100.html" target="_blank">Meego</a>, Android 2.3, <a href="http://tabletroms.com/forums/ac100-rom-development/1918-acomb100-v0-3-honeycomb-3-0-review-installation-android-3-0-toshiba-ac100.html" target="_blank">Android 3.0</a> oder ein <a href="http://tosh-ac100.wetpaint.com/page/bootloader#fbid=eggSRE3WGUY" target="_blank">richtiges Linux</a> draufwerfen soll, doch ich glaube dazu wird es dann jeweils gesonderte Beitr&auml;ge geben.<br/>Bis jetzt bin ich jedenfalls nach nicht ganz einer Woche immernoch ziemlich von der Kiste begeistert und glaube dass die Platform ziemlich gro&szlig;es Potential hat.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1621" onclick="set_comment_reference(1621)" title="auf diesen Kommentar antworten">#1621</a>:
    09.May.2013 07:05
    von
    
      
        <a href="http://linux-workers.posterous.com/" target="_blank">
          Ikem
        </a>
</p>
<p>Ich wollte mir mal so ein Ger&auml;t holen und Ubuntu draufspielen.</p>
<p>Das hat dann aber am n&ouml;tigen Kleingeld gescheitert.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1624">
<p class="infos">
<a href="#comment_1624" onclick="set_comment_reference(1624)" title="auf diesen Kommentar antworten">#1624</a>:
    09.May.2013 10:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>hat mich 70&euro; (also keinen relevanten Betrag) gekostet, ubuntu l&auml;uft recht zuverl&auml;ssig, aber RAM ist halt Mangelware. Man kann also alles tun, so lange man keinen Browser &ouml;ffnen will.</p>
</div>
</li>
</ul>
</div>