+++
title = "Beschwerdefrei"
date = "2011-09-12T08:09:00"
author = "Dr. Azrael Tod"
tags = ["Android", "Gadget", "Hardware", "Nerdig", "Softwareschrott", "Technik"]
issoid = "blog/1557"
aliases = "blog/1557"
+++

<p>Nach <a href="/2011/9/12/ARM-Cortex-A9-Netbook-Toshiba-AC100-10V/">dem (vor)letzten Artikel</a> zum <a href="http://heise.de/-1072519" target="_blank">Toshiba AC100</a> <a href="http://ac100.grandou.net/models" target="_blank">10V</a> gab es Leute die sich beschwert haben, dass ich mich ja immer so &uuml;ber alles aufregen w&uuml;rde, aber nicht wenn es um Sachen geht die ich selber gekauft habe. Da w&auml;re dann immer alles ok.<br/>Dazu kann ich sagen: <b>STIMMT!</b> (<a href="/2010/11/29/XOR(A,V)-Reciever:-Samsung-HW-C700/" target="_blank">zumindest</a> <a href="/2010/3/15/zahlender-Kunde/" target="_blank">manchmal</a>)<br/>Nun, woran liegt das? Amerikanische Forscher haben herausgefunden dass...<br/></p><ol><br/><li>Ich versuche Sachen zu kaufen die mich nicht schon konzeptuell ankotzen</li><br/><li>Man/ich nat&uuml;rlich erstmal instinktiv eine Meinung festlegt und die dann mit Argumenten versucht zu belegen. Sprich: ich hab foo gekauft, also ist foo toll, also &uuml;berlege ich warum foo toll ist.</li><br/></ol>
<p>Doch zur&uuml;ck zum Thema. Das AC100 ist definitiv nicht ohne Fehl. Es gibt eher verdammt viele Dinge die man daran verbessern k&ouml;nnte und die man auch bei neuen Ger&auml;ten verbessern muss, sollen solche Kisten jemals sowas wie "markttauglich" werden.<br/></p><h3>Hardware</h3><br/><ul><br/><li>Das Touchpad stinkt! Man sollte einen Touchscreen verbauen und idealenfalls noch einen Trackpoint als Erg&auml;nzung. Damit w&uuml;rde man die &uuml;belsten Android-Schmerzen mit einigen Anwendungen beheben.</li><br/><li>mehr USB-Ports w&auml;ren klasse. Ein einzelner USB-Port ist manchmal einfach nicht genug. Was habe ich davon ein superleichtes Netbook zu besitzen, wenn ich dann USB-Hub und co. mitschleppen muss?</li><br/><li>Der SD-Karten-Slot sollte tiefer sein, so dass die Karte im Ger&auml;t versenkt wird. (Ben&ouml;tigt dann nat&uuml;rlich einen Auswurfmechanismus)</li><br/><li>Das Display sollte bewegbarer sein. Idealenfalls, vor allem wenn ein Touchscreen verbaut werden sollte, auch umdreh und zuklappbar.</li><br/><li>Die Tastatur sollte eine weitere Reihe f&uuml;r die normalen Funktionstasten+ESC haben. Zwar braucht Android das selten, aber vlt. will ja mal jemand ein anderes System installieren oder SSH/VNC/&auml;hnliches nutzen.</li><br/><li>Alle Versionen sollten Bluetooth eingebaut haben oder zumindest sollte es auch eine deutsche Version mit Bluetooth geben, f&uuml;r diejenigen denen der Transport aus UK zu teuer ist oder so. </li><br/><li>Eigentlich sollte jegliche dieser kleinen IO-Sachen wie Bluetooth, Accelerometer oder gar NFC eingebaut sein, die Android so unterst&uuml;tzt.</li><br/></ul><br/><h3>Software</h3><br/><ul><br/><li>Android ist nur mit M&uuml;he auf einem Netbook zu gebrauchen und stark auf touch ausgelegt. (Wobei es trotzdem Tastaturbedienbarer als OSX ist, man kann zumindest schlechter)</li><br/><li>Die mitgelieferte Software muss <u>dringend</u> &uuml;berarbeitet werden. Mit einem sinnvollerem Browser, OpenStreetMap/Google Maps, Amazon Kindle und co. w&uuml;rde sich schon viel machen lassen.(Bzw. l&auml;sst sich machen, ich hab das gerade alles installiert.)</li><br/><li>Die Leute denken bei Android an Google, auch wenn Google gute Gr&uuml;nde hat derartige Ger&auml;te nicht f&uuml;r Market, GMail und co. freizugeben, sollte man es dem Nutzer wenigstens leicht machen derartiges nachzuinstallieren oder brauchbarere Alternativen mitliefern als Toshiba das getan hat</li><br/><li>Alternativ k&ouml;nnte man auch einfach ein sinnvolles Linux mitliefern und darauf optimieren. Aber das w&auml;re f&uuml;r viele Nutzer wohl auch nicht besser als Android.</li><br/><li>Wenn das Display doch, wider allen Versuchen es zu verhindern, mal in den Portrait-Modus geschalten wird, sollte auch das Touchpad entsprechend gedreht werden. Mit diesem winzigkleinen Hack k&ouml;nnte man dann vlt. sogar so weit kommen dass Dinge wie E-Book-Reader im Hochformat vlt. ganz benutzbar werden.</li><br/></ul>
<p></p><h3>ABER!</h3><br/>Es gibt momentan tats&auml;chlich Ger&auml;te zu kaufen, die viele dieser Punkte besser machen. Haupts&auml;chlich w&auml;ren das eigentlich die beiden EeePad Ger&auml;te von Asus namens "<a href="http://www.asus.de/Eee/Eee_Pad/Eee_Pad_Transformer_TF101/" target="_blank">Transformer</a>" und "<a href="http://www.amazon.de/EeePad-Slider-Tablet-PC-SD-Karten-Slot-Android/dp/B005I3233Q/ref=sr_1_1?ie=UTF8&amp;qid=1316628438&amp;sr=8-1" target="_blank">Slider</a>". Die bringen gleich mal Touchscreen, Bluetooth, aktuelles Betriebssystem, mehr RAM, mehr interner Speicher, wahrscheinlich l&auml;ngere Akkulaufzeit und noch viel mehr mit.<br/>Die beiden haben aber ein Problem: Mit Tastatur bekommt man beide Ger&auml;te jeweils kaum unter 500&euro;, das w&auml;re so ca. das 6 oder 7fache.<br/>Genau das war jedoch f&uuml;r mich das Argument, warum ich mir einfach mal ohne gro&szlig;e Planung bei Ebay ein AC100 bestellt hab.<br/>Es ist ein Spielzeug, ich brauche es nicht und alles wof&uuml;r es jemals verwendet werden wird, ist purer Zeitvertreib oder Dinge die ich auch prima mit anderen Ger&auml;ten erledigen k&ouml;nnte, die ich bereits besitze.<br/>Von daher sehe ich den Kauf, f&uuml;r einen Preis der unter dem eines neuen Akkus f&uuml;r mein altes Netbook liegt, als vollen Erfolg an, trotz  aller Fehler die dieses Ger&auml;t hat.

<p>W&uuml;rde ich es deswegen irgendjemandem empfehlen? JA! Aber nicht zu irgendwas produktivem oder f&uuml;r Personen die keinen blassen Schimmer haben was sie da tun. Windows- und Apple-Nutzer k&ouml;nnen sich ja gerne auch ein iPad oder ein 5KG-Notebook mit Windows drauf kaufen...</p>
