+++
title = "Postkarten als Dekoration"
date = "2008-10-30T07:10:00"
author = "Cindy"
issoid = "blog/1015"
aliases = "blog/1015"
+++

<p>Wir haben immer noch ein paar kahle W&auml;nde und &uuml;berall Wandtatoos anzubringen k&ouml;nnen wir uns finaziell nicht leisten und au&szlig;erdem w&auml;re es dann ja nichts besonderes mehr und recht langweilig, deshalb sind wir immer noch auf der Suche nach Ideen zur Versch&ouml;nerung unserer Wohnung.<!--more--></p>
<p>Seit nun etwa 11 Jahren sammle ich Postkarten von Freunden und Verwandten. Die erste bekam ich aus Italien von einer sehr guten Freundin von mir. Sie schrieb mir jedes Jahr mindestens 3 Karten, &uuml;ber die ich mich immer riesig freute. Die Karte mit dem weitesten Weg kam aus Malaysia. Ich bekam auch von anderen Postkarten, viele wissen wie sehr ich mich dar&uuml;ber freue. Allerdings verschwanden die &auml;lteren Karten dann irgendwann gestapelt im Schrank und ich habe sie erst wieder angesehen als ich zuhause auszog.</p>
<p>In diesem Jahr gab es dann noch 3 Karten, die an unserer Pinnwand hingen bis Frank auf die Idee kam die an die kahle Wand zu kleben. Gesagt, getan! Mit Fotoklebestickern bewaffnet fingen wir an die vielen Karten an die Wand zu pinnen. Es waren mehr als 40 Karten, die ich nun endlich jeden Tag bewundern kann und an alte Zeiten zur&uuml;ckdenken kann.</p>
<p>Aber nicht nur zum erinnern an alte Zeiten und Freunde sind sie da, sie lassen mich auch tr&auml;umen von den verschiedenen Orten und in Gedanken kann ich dann Urlaub machen.</p>
<p>[caption id="attachment_1018" align="aligncenter" width="497" caption="Postkartenwand"]<a href="http://localhost/wordpress/wp-content/uploads/2008/10/sl701734.jpg"><img alt="Postkartenwand" class="size-full wp-image-1018" height="372" src="http://localhost/wordpress/wp-content/uploads/2008/10/sl701734.jpg" title="sl701734" width="497"/></a>[/caption]</p>
<p>Was wir &uuml;ber den Schreibtisch von Frank anbringen wissen wir leider noch nicht, aber vielleicht hat ja der ein oder andere von euch eine hilfreiche Idee oder einen Tipp was man noch so machen kann.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_865" onclick="set_comment_reference(865)" title="auf diesen Kommentar antworten">#865</a>:
    30.Oct.2008 09:10
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>Hehe mein Klo sieht sehr &auml;hnlich aus ;)</p>

<p class="infos">
<a href="#comment_866" onclick="set_comment_reference(866)" title="auf diesen Kommentar antworten">#866</a>:
    30.Oct.2008 09:10
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>ich w&uuml;rde einen grossen Zankapfel an die Wand malen oder so...<br/>
(Nein warte <em>ich</em> w&uuml;rde irgendeine kranke mathematische konstruktion an die wand malen)</p>

<p class="infos">
<a href="#comment_867" onclick="set_comment_reference(867)" title="auf diesen Kommentar antworten">#867</a>:
    31.Oct.2008 03:10
    von
    
      
        Tsukama
      
    
    
  </p>
<p>Sch&ouml;n! Gef&auml;llt mir gut! Gerade die Postkarte mit dem traumhaften Sonnenuntergang sticht besonders ins Auge! Toll.</p>

<p class="infos">
<a href="#comment_868" onclick="set_comment_reference(868)" title="auf diesen Kommentar antworten">#868</a>:
    31.Oct.2008 03:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Wobei ich solche Karten mit Sonnenuntergang oder so sicher ganz nett zum hinh&auml;ngen finde.. aber was sagt das &uuml;ber die Gegend aus von wo man sie schickt? "Wir haben Meer und Sonnenunterg&auml;nge" w&uuml;rde ich jetzt nicht unbedingt als lokale Spezialit&auml;t einer Gegend ansehen, dann doch lieber die Gegend, beeindruckende Geb&auml;ude oder irgendwas anderes was es eindeutig NUR dort gibt auf ner Karte.</p>

<p class="infos">
<a href="#comment_869" onclick="set_comment_reference(869)" title="auf diesen Kommentar antworten">#869</a>:
    31.Oct.2008 03:10
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Wir haben keine Sonnenuntergaenge ueber dem Meer...</p>

<p class="infos">
<a href="#comment_870" onclick="set_comment_reference(870)" title="auf diesen Kommentar antworten">#870</a>:
    31.Oct.2008 04:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Aufg&auml;nge?^^</p>

<p class="infos">
<a href="#comment_871" onclick="set_comment_reference(871)" title="auf diesen Kommentar antworten">#871</a>:
    31.Oct.2008 06:10
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Mist. got me there.</p>

<p class="infos">
<a href="#comment_872" onclick="set_comment_reference(872)" title="auf diesen Kommentar antworten">#872</a>:
    05.Dec.2008 11:12
    von
    
      
        <a href="http://www.wandtattoos-online.de" target="_blank">
          Martin
        </a>
</p>
<p>Uiemlich genau so sah meine Wand auch mal aus.. aber irgendwann ist es mir zu unruhig geworden.. hast du mal versucht die Karten farblich zu sortieren? Ich k&ouml;nnte mir vorstellen, dass wenn man die Karten nach blau (Meer, Himmel), Gr&uuml;n (Palmen, Dschungel, Wald) und Wei&szlig; (Winter, St&auml;dte etc.) sortiert man einen sch&ouml;nen Effekt an der Wand erreichen kann..</p>
</div>