+++
title = "Firefuck"
date = "2009-02-23T11:02:00"
author = "Dr. Azrael Tod"
issoid = "blog/1269"
aliases = "blog/1269"
+++

<p>Irgendwie hab ichs satt... <a href="http://www.mozilla-europe.org/de/firefox" target="_blank">Firefox</a> ist so ziemlich das am h&auml;ufigsten verwendete St&uuml;ck GUI-Software bei mir (und wahrscheinlich auch bei verdammt vielen anderen) unter Linux (Windows nutze ich zwar momentan nicht, aber dort verwendete ich zuletzt immer st&auml;rker <a href="/2008/10/23/poses-google/">Googles Chrome</a>). Firefox ist aber auch so instabil wie sonst kaum etwas anderes. (zumindest wenn man <a href="http://www.heise.de/security/news/meldung/132289" target="_blank">mal IE ignoriert</a>)<!--more--></p>
<p>Wann immer ich feststelle dass mein System langsamer wird, ist die erste Vermutung inzwischen dass Firefox schuld ist... das zieht sich bei mir &uuml;ber die verschiedensten Systeme (sowohl Hardware als auch Software komplett unterschiedlich) und &uuml;ber die verschiedensten Firefox-Konfigurationen. Auch bei anderen scheint das Problem mehr als nur ein kleinwenig verbreitet zu sein, nicht umsonst ist die Beschwerde &uuml;ber Firefox wohl schuld an mehr <a href="http://code.google.com/p/pychao" target="_blank">pyChao</a>-Facts als alle anderen, einzelnen Computerthemen (vlt. <a href="http://code.google.com/p/pychao" target="_blank">pyChao</a> selbst mal ausgeschlossen, aber das wird auch knapp). Tats&auml;chlich f&uuml;hrt ein Firefox-Neustart in den meisten F&auml;llen auch erstmal zu einer erheblichen Linderung... f&uuml;r die n&auml;chste halbe Stunde oder so.</p>
<p>Nat&uuml;rlich sehe ich durchaus ein dass die Schuld nicht nur bei Firefox liegt.. es handelt sich immerhin um eine &auml;u&szlig;erst komplexe Platform, die mit hunderttausenden wirklich mies programmierter Seiten klar kommen muss, vom Nutzer mit schlechten Plugins bombardierd wird und selbst intern die verschiedensten Technologien verstehen muss.<br/>Man k&ouml;nnte Browser inzwischen schon teilweise als fast so wichtig wie das darunterliegende Betriebssystem halten. In der Tat ist der Browser momentan das Einzige was mich von einem komplett GUI-losem System auf meinem <a href="/2008/10/19/medion-akoya-mini-e1210">Netbook</a> abh&auml;llt.</p>
<p>Auch besteht ja dummerweise nicht wirklich viel an <strong>guten</strong> Alternativen zu Firefox. Andere Browser sind sonst evtl. etwas schneller (<a href="http://www.konqueror.org" target="_blank">Konquerror</a>?), stabiler (<a href="http://www.opera.com" target="_blank">Opera</a>?), erheblich kleiner (<a href="http://www.dillo.org" target="_blank">dillo</a>? midori? ...) oder bieten gar mehrere dieser Punkte (<a href="http://www.google.com/chrome" target="_blank">Chrome</a>?) aber es gibt so ziemlich KEINEN EINZIGEN Browser mit dem ich wirklich zufrieden w&auml;re. Keinen Browser der nicht an allen Ecken und Enden Macken hat.</p>
<p>Wie kann es sein dass ein Browser im Leerlauf (z.B. about:blank als einzige offene Seite) bereits mehr RAM frisst als so ziemlich jedes andere Programm auf meinem Netbook? Wie kann es sein dass diese Kisten bereits bei jedem 2. Flash-Applet erstmal die komplette CPU fressen oder sich derartig einfach in JS-Endlosschleifen schicken lassen um das gleiche zu erreichen?</p>
<p>Am schlimmsten aber: Warum tun wir uns das an? Vlt. sollte ich wirklich endlich mal ein sinnvolleres Protokoll als HTTP und die dazugeh&ouml;rige Browser-Software f&uuml;r eine HTML-Alternative bauen. (Etwas das auch wirklich f&uuml;r dynamische Inhalte gedacht ist, Verbindungen permanent &ouml;ffnet und schlie&szlig;t, nicht via Script auf Krampf ein Dateisystem zu emulieren versuchen muss und &uuml;berhaupt mehr Altlasten mitschleppt als so ziemlich jedes andere Protokoll das ich kenne.) Die rein skizzierten Entw&uuml;rfe wie sowas aussehen k&ouml;nnte habe ich schon im Kopf und im <a href="irc://chat.freenode.org/#zanzibar">IRC</a> hatten wir auch schonmal wieder ne l&auml;ngere Diskussion dazu, wie man sowas machen k&ouml;nnte.</p>
<p>Alles was jetzt noch bleibt ist ein wenig Entwicklungsarbeit... hat jemand Lust mir so 3-4 Jahre Arbeitszeit f&uuml;r sowas zu bezahlen? *G*</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1149" onclick="set_comment_reference(1149)" title="auf diesen Kommentar antworten">#1149</a>:
    23.Feb.2009 11:02
    von
    
      
        RobVinc
      
    
    
  </p>
<p>Vor allem k&ouml;nnte man bei dem neuen Protokoll gleich endlich mal den ganzen properit&auml;ten Mist &uuml;ber Bord werfen, ne gescheite Plattformunabh&auml;ngigkeit, ne harte Verschl&uuml;sselung und eine gute Komprimierung einbauen. Gerade die ganzen extras-w&uuml;rste f&uuml;r mobile Endger&auml;te und Barrierefreiheit k&ouml;nnte man dann gescheit implementieren.</p>

<p class="infos">
<a href="#comment_1150" onclick="set_comment_reference(1150)" title="auf diesen Kommentar antworten">#1150</a>:
    24.Feb.2009 12:02
    von
    
      
        <a href="http://blog.jbbr.net" target="_blank">
          foxx
        </a>
</p>
<p>Danke f&uuml;r den Beitrag. Stimme dem grunds&auml;tzlich zu. Firefox hat funktionsm&auml;&szlig;ig alles was ich brauche. Auch die Bedienung stimmt. Doch gibt es zumindest beim Mac noch einige nervige GUI bugs, es kommt gelegentlich zu Abst&uuml;rzen oder extrem steigendem RAM Verbrauch bzw. 100% CPU Nutzung.<br/>
Muss das sein?<br/>
Bei Chrome, Safari, Opera &amp; Co fehlt es mir an Funktionen, Erweiterbarkeit oder anderen Dingen.</p>
<p>Aber eins muss ich sagen: Mozilla ist dabei Firefox weiter zu entschlacken und die Geschwindigkeit zu verbessern. Mit der Version 3.1 (Beta) wird JS schneller ausgef&uuml;hrt und auch der Speicherverbrauch ist gesunken. Und meistens sind es Plugins von Drittanbietern die Probleme bereiten. Wie z.B. diverse Add-Ons oder besonders Plugins wie Flash.</p>
<p>Aber ohne diesE Extras unterschiede sich Firefox nicht wirklich von der Konkurrenz...</p>
<p>Schwierige Situation - aber das Geld um dich mal eben 3-4 Jahre lang ein Entwicklerteam zu finanzieren hab ich leider auch nicht :)</p>

<p class="infos">
<a href="#comment_1151" onclick="set_comment_reference(1151)" title="auf diesen Kommentar antworten">#1151</a>:
    24.Feb.2009 12:02
    von
    
      
        pheder
      
    
    
  </p>
<p>Ich hab mich vor nicht allzu langer Zeit (aus genannten Gr&uuml;nden) vom Feuerfuchs getrennt, und da ich eine GTK-Alternative gesucht habe, nutze ich jetzt Epiphany. Hat nicht so viele Plugins (AdBlock ist zum Gl&uuml;ck dabei), aber man kommt damit zurecht und es wirkt nicht so als ob man tonnenweise Kleber br&auml;uchte um den Browser ganz zu halten, im Gegenteil ;)</p>
<p>Wovon ich tr&auml;ume ist ja immernoch ein Weblayout, welches sich ins System einpasst... Wenn ich ein (Online)Programm nutze, will ich es auch so bedienen.</p>

<p class="infos">
<a href="#comment_1152" onclick="set_comment_reference(1152)" title="auf diesen Kommentar antworten">#1152</a>:
    24.Feb.2009 12:02
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          Sir.Snookie
        </a>
</p>
<p>hm lustigerweise saugt der FireFuck bei mir auf dem Mac ebenfalls. Der brauch auch erheblich l&auml;nger als der Opera/Safari zum start.</p>

<p class="infos">
<a href="#comment_1153" onclick="set_comment_reference(1153)" title="auf diesen Kommentar antworten">#1153</a>:
    24.Feb.2009 12:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Verschl&uuml;sselung ist ja gleich noch sowas.. ich werde wohl nie verstehen warum SSL bis heute noch nicht zum Normalfall geworden ist und bei unverschl&uuml;sselten Seiten erstmal IMMER eine Warnmeldung angezeigt wird. Ganz zu schweigen von defekten/abgelaufenen Signaturen oder sowas... ein kleines Symbol in der Statusleiste bemerkt doch keiner von den LUsern.</p>

<p class="infos">
<a href="#comment_1154" onclick="set_comment_reference(1154)" title="auf diesen Kommentar antworten">#1154</a>:
    24.Feb.2009 09:02
    von
    
      
        <a href="http://www.ra-melchior.de" target="_blank">
          verteidiger
        </a>
</p>
<p>Ohnehin unverst&auml;ndlich, dieser FiFo-Hype. OPERA, what else?</p>

<p class="infos">
<a href="#comment_1155" onclick="set_comment_reference(1155)" title="auf diesen Kommentar antworten">#1155</a>:
    24.Feb.2009 10:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>@verteidiger wie w&auml;re es mit was auf khtml/webkit-basis? (chrome, safari, konquerror, ...) oder mal was ganz anderes? Opera ist sicher nicht der tollste Browser der Welt und hat keinerlei Schw&auml;chen. Es kommt halt immer drauf an was man von seinem Browser will und welche Funktionen man eher nicht ben&ouml;tigt.</p>
<p>Plugins sind z.B. unter Opera schlimmstenfalls unm&ouml;glich und bestensfalls ein Krampf mit minimalen Funktionen au&szlig;erdem startet Opera auf meinem Netbook unter Gnome auch nicht gerade schneller als FF und braucht anf&auml;nglich auch erstmal mehr Ressourcen.</p>
<p>Das soll jetzt nicht bedeuten dass Opera grunds&auml;tzlich schlecht ist... aber es stellt eine Bitte dar, keine undurchdachten Aussagen ohne jegliche Argument von dir zu geben. Wenn du eine Meinung hast ist das sch&ouml;n, wenn du andere davon &uuml;berzeugen willst solltest du sie aber begr&uuml;nden k&ouml;nnen.</p>

<p class="infos">
<a href="#comment_1156" onclick="set_comment_reference(1156)" title="auf diesen Kommentar antworten">#1156</a>:
    27.Feb.2009 08:02
    von
    
      
        <a href="http://www.soulprayer.de" target="_blank">
          Bj&ouml;rn
        </a>
</p>
<p>Schonmal Kmeleon probiert?<br/>
<a href="http://kmeleon.sourceforge.net/%3C/p%3E" rel="nofollow">http://kmeleon.sourcef...</a>
</p>
<p class="infos">
<a href="#comment_1157" onclick="set_comment_reference(1157)" title="auf diesen Kommentar antworten">#1157</a>:
    27.Feb.2009 09:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>&auml;hm.. ein weiterer Gecko-Browser? Gibts davon nicht schon genug? Oh halt, warte! Ein weiterer Gecko-Browser <em>NUR</em> f&uuml;r Windows! Jetzt gibt das unter Linux nat&uuml;rlich sinn...</p>

<p class="infos">
<a href="#comment_1158" onclick="set_comment_reference(1158)" title="auf diesen Kommentar antworten">#1158</a>:
    23.Mar.2009 11:03
    von
    
      
        <a href="http://blog.canuco.de" target="_blank">
          thorben
        </a>
</p>
<p>Bitte umreiss mal den perfekten Browser in allen Details. Was braucht er, und was braucht er nicht?</p>
<p>Zu dem alternativen Protokoll/Markup hatte ich mir auch schon Gedanken gemacht, aber dann festgestellt, dass es wohl (selbst wenn es total rockt und nur Vorteile hat) fuer mindestens 10 Jahre dazu verdammt ist ein Nischendasein zu fuehren... Analog zum Nischendasein von Plan9 beispielsweise. Plan9 ist architekturell "Unix done right". Dummerweise funktioniert Unix gerade gut genug fuer die Allgemeinheit. Allerdings fliessen Ideen aus Plan9 von Zeit zu Zeit in den Linux Kernel ein (das proc und sys Dateisystem iirc), was auch fuer unsere Protokoll-/Markupverbesserungen noch Hoffnung uebrig laesst. So what the hell, let's build a second Internet, bin dabei.</p>

<p class="infos">
<a href="#comment_1159" onclick="set_comment_reference(1159)" title="auf diesen Kommentar antworten">#1159</a>:
    23.Mar.2009 12:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Wenn ich mir heutige Webseiten ansehe, dann braucht ein neuer Browser vor allem eins: Interaktivit&auml;t.<br/>
(damit fallen dann auch schonmal die ganzen Ans&auml;tze via statischem Markup raus, wir emulieren ja eh nur noch Verzeichnisstrukturen via dynamischem Code und lassen diese wieder von anderem Code anzeigen).</p>
<p>Es sollte mehr eine fernsteuerbare Darstellung sein, also eher in Richtung OpenGL als in Richtung HTTP gehen.<br/>
Semantisch formulierte Inhalte k&ouml;nnen ja gerne eingebettet werden, stellen aber schon l&auml;ngst nicht mehr als Hauptsache dar.</p>
<p>Rein Grunds&auml;tzlich finde ich dass selbst diese alten und grauenvoll h&auml;sslichen Java-Applets n&auml;her am Ziel liegen als alles was wir heute mit JS, Flash, CSS und (X)HTML3234241 generieren.<br/>
Nat&uuml;rlich... keiner will eine Java-Datei anklicken, 5min warten bis die VM geladen hat, ein Programm f&uuml;r 3sec. bedienen und dann die VM zu beenden um den Spa&szlig; f&uuml;r die n&auml;chste Seite zu wiederholen.<br/>
Au&szlig;erdem besteht bei Java per Default erstmal keine permanente Verbindung mit dem Server, wenn ich etwas &auml;ndere muss also f&uuml;r jedes geschriebene oder gelesene Byte erstmal wieder daf&uuml;r gesorgt werden. (und nat&uuml;rlich Hauptargument 1: Java ist potth&auml;sslich und frisst bereits im Urzustand massig RAM)</p>
<p>Irgendwie ist mein Artikel mit neuen Ans&auml;tzen leider erstmal in Hintertreffen geraten... ich nehms mir mal f&uuml;r die aktuelle Woche vor. :-)</p>
</div>