+++
title = "Schamlose Eigenwerbung"
date = "2008-11-07T09:11:00"
author = "Dr. Azrael Tod"
issoid = "blog/1036"
aliases = "blog/1036"
+++

<p>Die meisten werden sicher schon mein System kennen, nach dem ich entscheide was ich hier poste und was auf anderen Platformen landet.</p>
<p>Die besagte Mehrheit kann jetzt also ruhig erstmal kurz abschalten, f&uuml;r die gibt es nur am Ende des Artikels noch eine Aufforderung (Schamlose Eigenwerbung auch f&uuml;r euch!). F&uuml;r alle anderen erkl&auml;re ich es nochmal kurz...<!--more-->L&auml;ngere Artikel, Kommentare zu anderen Blogs die den Rahmen sprengen (mehr als 4-5 S&auml;tze) und selbsterzeugter Content von mir landet nat&uuml;rlich hier auf <a href="http://g33ky.de" target="_self">G33KY^2</a>. (Nat&uuml;rlich nicht nur von mir, G33KY^2 ist nur zu 80-90% mein Projekt... Tendenz gewollt sinkend, gute Inhalte sind immer erw&uuml;nscht und neue Autoren immer gesucht)</p>
<p>Nun lese ich auf ein paar hundert Newsfeeds mit, die Zahl hat sich etwa konstant bei 300 eingependelt (allerdings sind es in letzter Zeit fast nur noch private Blogs, was die Inhaltsmenge pro Tag drastisch reduzierte). Als schnellste methode diese Inhalte weiterzuleiten hat sich Google-Readers interne <a href="http://www.google.com/reader/shared/00910410964970600802" target="_blank">Share-Funktion</a> erwiesen. F&uuml;r Personen die einfach alles interessante aus dem Netz lesen wollen ist der <a href="http://feeds.feedburner.com/SharedByDrAzraelTod" target="_blank">dazugeh&ouml;rige Newsfeed</a> sicher die einfachste M&ouml;glichkeit aktuelle Nachrichten zu erhalten.</p>
<p>Jetzt ist "alles interessante" (10-20 Elemente am Tag) f&uuml;r viele Nutzer sicher etwas Overkill, daher gibt es noch einen <a href="http://feeds.feedburner.com/StarredByDrAzraelTod" target="_blank">zweiten Newsfeed</a> in dem nur die wirklich wichtigen Elemente landen.</p>
<p>Zus&auml;tzlich g&auml;be es dann noch einen etwas spammiger gehaltenen <a href="http://friendfeed.com/drazraeltod" target="_blank">FriendFeed-Account</a> auf dem so ziemlich ALLES aggregiert wird, was ich die ganze Zeit so im Netz von mir gebe. Angefangen bei Musik die ich &uuml;ber <a href="http://www.lastfm.de/user/Dr_Azrael_Tod" target="_blank">Last.fm</a> h&ouml;re, &uuml;ber den <a href="http://www.google.com/reader/shared/00910410964970600802" target="_blank">Google-Reader-Shared--Stream</a>, <a href="http://feeds.feedburner.com/G33ky" target="_blank">Blogposts</a>, <a href="https://twitter.com/DrAzraelTod" target="_blank">Twitter</a>, <a href="http://www.backtype.com/DrAzraelTod" target="_blank">Backtype</a>,... also die ganze Bandbreite am Web2.0-Ausverkauf der pers&ouml;nlichen Daten. Die <a href="http://de.wikipedia.org/wiki/Signal-Rausch-Verh&auml;ltnis" target="_blank">signal-to-noise-ratio</a> dort ist allerdings aus offensichtlichen Gr&uuml;nden wirklich nicht sonderlich gut.</p>
<p>Der <a href="http://drazraeltod.wordpress.com/2008/09/02/warum-bloggst-du-nicht-uber/" target="_self">Sinn hinter diesem System</a> ist dass ich nicht den gleichen Mist in meinem Blog breittreten will, den alle anderen schon totgeredet haben. Was bringt es mir zum hunderttausendsten Mal zu bemerken dass in China schon wieder ein Sack Reis umgefallen ist? Wenn ich nichts zu sagen habe, halte ich es mit <a href="http://www.nuhr.de/" target="_blank">Nuhr</a> und halte einfach mal die Fresse... aber ich verlinke auf Leute die was zu sagen haben.</p>
<p>An dieser Stelle kommt dann auch ihr ins Spiel. Derzeit suche ich wieder nach neuen Blogs f&uuml;r meinen Feedreader. Anforderungen stelle ich erstmal keine (was nicht gef&auml;llt, rumspamt oder nur nichtssagende &Uuml;berschriften im Feed liefert fliegt eh wieder raus), sendet mir einfach die Adresse unter der ich euere Inhalte abrufen kann (oder gerne auch die von anderen, bei denen ihr der Meinung seid dass sie dazu geh&ouml;ren).</p>
<p>Ich bekomme also neue Feeds und ihr Pl&auml;tze in meiner pers&ouml;nlichen Art einer "etwas dynamischeren Blogroll" bzw. neue Leser.</p>
<p>Kontaktieren k&ouml;nnt ihr mich &uuml;ber <a href="mailto:input@g33ky.de">input@g33ky.de</a>&nbsp;oder wie immer via Jabber (<a href="mailto:href=">drazraeltod@jabber.ccc.de</a>href="//drazraeltod@ja...&gt;). Dr. Azrael <span style="text-decoration:line-through;">Sommer</span>^WTod freut sich auf eure Zuschriften.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_875" onclick="set_comment_reference(875)" title="auf diesen Kommentar antworten">#875</a>:
    07.Nov.2008 12:11
    von
    
      
        <a href="http://aberaberarne.de/" target="_blank">
          Arne
        </a>
</p>
<p>Liest du mich schon? Du hast auf jeden Fall schon mal den ein oder anderen Beitrag &uuml;ber deinen Shared-Stream gejagt ... Naja, im Moment ist es mit den wirklich guten, umfangreichen Beitr&auml;gen etwas mager, aber das &auml;ndert sich in naher Zukunft auch wieder ... Ansonsten kann ich dir nur (leider noch etwas sp&auml;rlich gef&uuml;llten) technischen Blog "PsiLab Journal" (<a href="http://dot.psilab.de/" rel="nofollow">http://dot.psilab.de/</a>) ans Herz legen ...</p>

<p class="infos">
<a href="#comment_876" onclick="set_comment_reference(876)" title="auf diesen Kommentar antworten">#876</a>:
    07.Nov.2008 12:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Was schon im Shared angekommen ist, wird auch gelesen :-)<br/>
Vlt. sollte ich mal die OPML exportieren und online stellen. Wer sich dort drin entdeckt ist also bereits schon registriert. :-)</p>
<p>Psi-Lab werde ich gleich mal aufnehmen. Dass dort nicht viel gepostet wird ist nicht schlimm, lieber 100 Blogs die sich nur auf jeweils 1-2 Wichtige Nachrichten beschr&auml;nken im Reader als 10 Blogs die jeden Tag spammen aber nur alle 100 Posts interessant sind.</p>
</div>