+++
title = "Friendfeed/Last.FM"
date = "2009-01-19T01:01:00"
author = "Dr. Azrael Tod"
issoid = "blog/1187"
aliases = "blog/1187"
+++

<p>Da gerade mal wieder etwas Flaute bez&uuml;glich wirklich neuer Themen besteht (und ich erstmal genug politisches geschrieben habe), gibt es heute mal einen Beitrag zu 2 Diensten die ich in letzter Zeit immer st&auml;rker nutze: <a href="http://friendfeed.com/drazraeltod" target="_blank">Friendfeed</a> und <a href="http://www.last.fm/user/dr_azrael_tod/" target="_blank">Last.fm</a>.<br/><!--more--><br/>Bei Friendfeed handelt es sich eigentlich nur um eine zentrale Anlaufstelle f&uuml;r alle Daten die man den ganzen Tag &uuml;ber im Web so ansammelt. Dort landen meine<a href="https://www.google.com/reader/shared/00910410964970600802" target="_blank"> Google-Reader-Shared-Items</a>, neue Blogbeitr&auml;ge, Lieder die ich bei Last.FM (was sowohl ein personalisiertes Internetradio als auch ein soziales Netz darstellt) als "loved" notiert habe,..</p>
<p>Fr&uuml;her habe ich solche Aggregation noch selbst betrieben, teilweise &uuml;ber kleine PHP-Scripte die Newsfeeds abgerufen und gemerged haben (ziemlich mies programmiert, es musste mal wieder schnell gehen) oder indem ich einfach alles in meine FactDB geworfen habe und via RSS-Newsfeed zug&auml;nglich gemacht habe.<br/>Da mir allerdings mein FH-Account abhanden gekommen ist, ist erstmal die PHP-Version (auf Textdateibasis gespeicherte Facts und Newsfeed-Umleitung) ausgefallen. Heute h&auml;tte ich gen&uuml;gen Server zur Verf&uuml;gung auf die ich ein solches Script stellen w&uuml;rde, ich m&uuml;sste halt nur mal ein kleines Python-Script oder so schreiben dass bei Aufruf die letzten Facts aus der DB holt (derzeit SQLite) und in eine Atom-Datei formatiert ausgibt.<br/>Sollte kein Problem sein, ist halt aber arbeit und ich komme ja so schon kaum noch dazu etwas am Kern von <a href="http://code.google.com/p/pychao/" target="_blank">pyChao</a> zu machen.</p>
<p></p><h2>Friendfeed</h2><br/>Aber wieder zur&uuml;ck zum Thema! Friendfeed l&auml;sst mich das jedenfalls alles intern tun, nicht nur dass ich von &uuml;berall her, via Jabber, Zugriff auf alle neuen Nachrichten bekomme und jederzeit auch welche Schreiben kann, es zeigt auch automatisch f&uuml;r alle die es interessiert alle Inhalte an die ich den ganzen Tag so von mir gegeben habe. An Diensten wird nahezu alles unterst&uuml;tzt &uuml;ber was man heutzutage im Netz so stolpert (derzeit 59 Dienste, inkl. generischem Newsfeed-Support).

<p>Beim Thema Microblogging trifft man nat&uuml;rlich auch automatisch auf <a href="http://twitter.com/drazraeltod" target="_blank">Twitter</a>. Ich pers&ouml;nlich bin mit Twitter <a href="http://drazraeltod.wordpress.com/2008/05/26/twitter-ist-tot/">allerdings nie so wirklich warm geworden</a> und habe auch nicht die geringste Anwendungsm&ouml;glichkeit f&uuml;r mich gefunden. Wenn man dort eine Diskussion ernsthaft nachvollziehen will muss man sich entweder h&auml;ndisch durch alle Nachrichten und @-replies hangeln oder man hat alle diskutierenden Personen in der Follow-Liste (was dann sehr nervig werden kann). Anfangs hatte ich mal noch die M&ouml;glichkeit gesehen damit billig Gruppen-SMS im Freundeskreis zu verschicken, doch das hat sich ja auch schon lange erledigt.</p>
<p>Friendfeed als Gegensatz zeigt immer die volle Diskussion an. Wenn ich jemandem folge, dieser auf einen interessanten Artikel st&ouml;&szlig;t und ihn kommentiert, sehe ich sofort die komplette Diskussion in meinem Fenster ohne etwas daf&uuml;r tun zu m&uuml;ssen. Weiterhin bietet Friendfeed bereits intern die Unterst&uuml;tzung f&uuml;r alle m&ouml;glichen Dienste. Wenn ich meinen Blog damit vernetzen will, brauche ich nicht mein Passwort an einen anderen Dienst zu geben, es reicht die Newsfeed-URL einzutragen. Auch Kommentare auf anderen Platformen werden sehr sch&ouml;n eingebaut, so kann man via <a href="http://www.backtype.com/drazraeltod" target="_blank">Backtype</a> Blogkommentare abgrasen, Google-Reader-Shares mit Notiz werden sogar automatisch als Kommentar zu dieser URL angezeigt oder man kann zur Not sogar @relies an Twitter senden.</p>
<p></p><h2>Last.FM</h2><br/>Wie bereits geschrieben, handelt es sich bei diesem Dienst um die Mischung zwischen einem Internetradiosender und einem sozialen Netz ala Facebook, <del datetime="00">Fakebook</del> <del datetime="00">StasiVZ</del> StudiVZ/MeinVZ oder Xing. Durch die Verbindung aus beiden Anwendungen bietet Last.fm nicht nur einen starken Mehrwert durch personalisierung des Musikstreams, sie k&ouml;nnen auch so relativ leicht M&ouml;glichkeiten finden ihren Dienst in Geld umzusetzen. (Dies ist etwas, was sonst nur Xing bietet. Ich w&auml;re sehr vorsichtig bei datensammelnden Diensten ohne Gesch&auml;ftsmodell... Sie k&ouml;nnen jederzeit platzen und man wei&szlig; auch nie wer die Daten nach einem Bankrott kauft.)

<p>Last.FM bietet eine offene Schnittstelle (Audioscrobbler) &uuml;ber die beliebige Programme (inzwischen unterst&uuml;tzt so ziemlich jedes gr&ouml;&szlig;ere Programm diese Schnittstelle) der Platform mitteilen k&ouml;nnen, welches Lied der Nutzer gerade anh&ouml;rt und ob er es als besonders gut empfindet oder nie erneut h&ouml;ren will. &Uuml;ber andere Nutzer und Tags kann dann der Server einen personalisierten Musikstream zusammenstellen, der vom Musikgeschmack ger, dem des H&ouml;rers entsprechen sollte.<br/>Nat&uuml;rlich funktioniert das schlechter, je mehr verschiedene Musikrichtungen man anh&ouml;rt. Dennoch bietet dieser Dienst selbst f&uuml;r mich relativ viel Wert, da man die Musik auch via Angabe eines Tags oder &auml;hnlichen K&uuml;nstlers steuern kann.</p>
<p>Last.FM ist somit eine Art Radio, bei der nicht nur das sinnlose gequatsche und diverse nervige Jingles (Im Normalfall wei&szlig; ich welchen Sender ich h&ouml;re.. und nochgenauer warum ich das tu. Das muss mir keiner alle 5min. sagen.) wegfallen, sie spielt auch immer die Musikrichtung auf die ich gerade Lust habe (und wenn nicht, kann ich das aktuelle Lied noch immer einfach &uuml;berspringen).</p>
<p>Zus&auml;tzlich werden auch noch viele weitere Funktionen auf Basis dieser Daten angeboten z.B. Newsstreams f&uuml;r kostenlose Musikdownloads (CC?), die dem eigenem Geschmack entsprechen sollten, Statistiken, selbst zusammengestellte Playlists (anh&ouml;ren derzeit nur gegen Geld) oder die "Radiostationen" von Freunden oder Personen mit einem &auml;hnlichem Musikgeschmack.<br/>Auch kann man als Privatperson oder Netlabel sehr leicht seine <a href="http://www.lastfm.de/music/Dr.+Azrael+Tod" target="_blank">(oder meine^^) eingene</a> Musik bei Last.FM hochladen und so m&ouml;glicherweise eine erheblich gr&ouml;&szlig;ere Gruppe an Personen ansprechen.</p>
