+++
title = "zahlender Kunde"
date = "2010-03-15T08:03:00"
author = "Dr. Azrael Tod"
issoid = "blog/1516"
aliases = "blog/1516"
+++

<p>Jup.. alle 3-4 Jahre passiert es, da kaufe ich mir tats&auml;chlich f&uuml;r teuer Geld ein kommerzielles PC-Spiel.<br/>Die letzten 2-3 Iterationen dieses Naturschauspieles hatten jedoch immer st&auml;rker ansteigende Zwischenzeiten, da ich jedes Mal aufs neue geschockt war, wie beschissen sich eine Firma anstellen kann.<br/>Diese Woche habe ich mir eine Version von Unreal Tournament 3 aus der <del datetime="2010-03-15T17:49:37+00:00">M&uuml;lltonn</del>^W<del datetime="2010-03-15T18:27:39+00:00">Resteverwertung</del>^W"Schn&auml;ppchenpyramide" gesichert.</p>
<p>Nat&uuml;rlich hatte ich schon vorher ein schlechtes Gef&uuml;hl bei diesem Kauf, aber die Vorg&auml;nger waren immer toll und die vorher runtergeladene <del datetime="2010-03-15T17:49:37+00:00">Warez-Vers</del>^WDemo sagte mir eigentlich auch recht zu.<!--more--></p>
<p>Der erste &uuml;ble Geschmack war bereits der Zwang mich an einem fremden Server mit Benutzername und Passwort anmelden zu m&uuml;ssen. Da dies momentan nicht funktionierte ("Registrierung derzeit nicht m&ouml;glich") versuchte ich mich auch erstmal im Offline-Modus, nur um festzustellen dass das Spiel auf diese Art vlt. spielbar ist... aber jeglicher Fortschritt nicht gespeichert wurde.<br/>SUUUUPER!</p>
<p>Also nochmal ans registrieren, nach kurzer Zeit kam ich dann auch auf die Idee es k&ouml;nnte an meinem Benutzernamen liegen "Dr. Azrael Tod" sorgte auch tats&auml;chlich mit seinen Leerzeichen f&uuml;r den doch recht aussagekr&auml;ftigen Fehler. (Wenn ich solche Fehlermeldungen auf Arbeit gebaut h&auml;tte, h&auml;tte ich derartig eins auf den Deckel bekommen.)<br/>Jetzt also als "Dr_Azrael_Tod" unterwegs, kann ich auch endlich den Offline-Modus geniesen... doch halt.. was ist das f&uuml;r eine beschissene Deutsche Synchronisation? Die Stimmen klingen v&ouml;llig unpassend, der Ton der Leute ist v&ouml;llig unbeteiligt und zu allem &uuml;bel haben gleich in der 2. oder 3. Cutszene 2 wahrscheinlich verdammt wichtige Personen den gleichen Sprecher!</p>
<p>Nein, das kann ich mir wirklich garnicht antun... aber zum Gl&uuml;ck ist das Spiel ja viel mehr f&uuml;r seinen Multiplayermodus bekannt. Also ein Onlineprofil erstellt ("Bezahlen Sie jetzt Geld um Mehr Figuren ausw&auml;hlen zu k&ouml;nnen!") und ab gehts zum Serverbrowser.<br/>Unterwegs f&auml;llt dann bereits wieder auf wie viel schlechter das Interface, verglichen mit der 2004er Version, geworden ist und wieviele Klicks mehr ich zwischen Symbol f&uuml;r UT anklicken und Server ausw&auml;hlen brauche.<br/>Dann nat&uuml;rlich der n&auml;chste Tiefschlag! Auch wenn ich ein Spiel aus der Drittvermarktung gekauft habe und das Spiel beim pressen der DVD schon einige Monate alt war, liegt nat&uuml;rlich nicht der aktuelle Patch dabei. Also schnell <a href="http://www.unrealtournament3.com/" target="_blank">die Internetseite zum Spiel</a> aufgerufen und beinahe vom Stuhl gefallen als das Flash mir Werbung um die Ohren knallte.</p>
<p>Oh ganz toll.. eine Seite mit massiv Werbung, Trailern, Links zu l&auml;den wo ich das Spiel in welcher Version auch immer kaufen kann und &auml;h.. wo nur? Ach! Da, irgendwo rechts in der Mitte, unter den Trailern, gibt es einen kleinen Link in hellgrauer Schrift auf wei&szlig;em Hintergrund, wo ich zus&auml;tzliche Sachen runterladen kann.<br/>Nat&uuml;rlich steht da erstmal nicht welcher der aktuelle Patch ist oder was &uuml;berhaupt dort was sein soll... aber dann lade ich mir halt irgendein Content-Pack runter. Von dort aus komme ich dann &uuml;ber einen Vorschlag was ich mir denn sonst noch so runterladen k&ouml;nnte, auch endlich auf einen Patch... nat&uuml;rlich habe ich keine Ahnung welche Version die aktuelle ist, also lade ich halt einfach die angebotene.</p>
<p>N&auml;chste H&uuml;rde: Die Downloads kann Epic nat&uuml;rlich nicht direkt von seinen Servern anbieten! Nein, da muss schon irgendeine externe Seite ran, die mich dann wieder auffordert mich auf ihr zu registrieren ("Jetzt! F&uuml;r nur $5 pro Monat eine Premium-Mitgliedschaft kaufen!") und die selbst nachdem ich diesem Zwang z&auml;hneknirschend in Kauf genommen habe, mich noch weiter mit Werbung bombardiert. &Uuml;brigens: Auch wenn die Epic-eigene Seite sehr sch&ouml;n internationalisiert ist und man das Spiel auch unbedingt mit einer miesen, deutschen Sprachausgabe versehen musste... wenn ich einen Patch runterladen will, w&auml;re ich nat&uuml;rlich ohne Kentniss der englischen Sprache wieder angeschissen. Die Seite ist nat&uuml;rlich wieder nur auf englisch vorhanden. Vlt. liegt darin ja sogar Methode, manch einer  klickt vlt. schon deshalb auf die bunt leuchtende Werbung, weil er den Text nicht lesen kann.<br/>Ich will jedenfalls kein Geld weiter f&uuml;r dieses St&uuml;ck Drecksware ausgeben!</p>
<p>Der Dowload selbst ist dann der n&auml;chste Spa&szlig;. Server gibt es in den USA und &auml;h... ja, das wars dann auch schon. Aber daf&uuml;r muss ich nur 10-15min warten um mit dem Download der 316MB-Datei &uuml;berhaupt erstmal anfangen zu d&uuml;rfen. (Es sei denn, ich w&uuml;rde doch noch die Premium-Mitgliedschaft kaufen.)</p>
<p>&Uuml;brigens war die angebotene Version 2 des Patchs eigentlich eine Version 4, das wird aber wahrscheinlich auch ganz praktisch sein, denn immerhin habe ich inzwischen eine Aussage auf der Downloadseite gefunden dass die Version 3 aktuell w&auml;re. AKTUELL WIE BILD!</p>
<p>Inzwischen habe ich reichlich eine Stunde mit diesem St&uuml;ck Softwarem&uuml;ll verbracht.</p>
<p>Jetzt nur noch schnell den Patch installiert, das Spiel gestartet, mich erneut mit 8 Klicks durch die Anfangsvideos navigiert und... DEN CD-KEY NEU EINGEGEBEN? Was zum Henker? Naja, ich hab ja einen legalen... also die DVD-H&uuml;lle erneut aus dem Schrank gesucht und nochmal die 16-Zeichen eingegeben.<br/>Neuerdings muss ich f&uuml;r jeden Men&uuml;eintrag doppelklicken, sicher eine Verbesserung des Interfaces das man in einem der Patches hinzugef&uuml;gt hat, aber immerhin, JETZT kann ich spielen.</p>
<p>Wenn ich mir noch einmal 2-3 Stunden Zeit nehme, kann ich mir vlt. sogar noch was von diesem Zusatzcontent runterladen von dem ich geh&ouml;rt habe... oder ich lass es und spiel doch weiterhin UT2004. Das macht ohnehin viel mehr Spa&szlig;...</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1376" onclick="set_comment_reference(1376)" title="auf diesen Kommentar antworten">#1376</a>:
    15.Mar.2010 08:03
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Epic Fail sozusagen.</p>
<p>SCNR</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1377">
<p class="infos">
<a href="#comment_1377" onclick="set_comment_reference(1377)" title="auf diesen Kommentar antworten">#1377</a>:
    15.Mar.2010 08:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Muhahaha.. schade dass ich nicht dran gedacht habe</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1378" onclick="set_comment_reference(1378)" title="auf diesen Kommentar antworten">#1378</a>:
    16.Mar.2010 01:03
    von
    
      
        <a href="http://mindplug.org/blog" target="_blank">
          Yuri
        </a>
</p>
<p>Ich mag ja UT99 am liebsten.</p>
<p>Zum Glueck hat mir den Link zum Patch einfach irgendein zockwilliger Kumpel mal vor die Nase geknallt... finde naemlch auch die Webseite absolut unuebersichtlich.</p>
<p>Die Sprache - uebrigens auch bei Installation der ungeschnittenen englschen Version standardmaessig die Systemsprache - kann man uebrigens gluecklicherweise noch auf Englisch umschalten [man muss dazu auch 'nur' ein paar sonstwo verstecke .inis manipulieren]. Der UnrealEd geht danach aber leider nicht mehr.</p>

<p class="infos">
<a href="#comment_1379" onclick="set_comment_reference(1379)" title="auf diesen Kommentar antworten">#1379</a>:
    16.Mar.2010 02:03
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>wenn ich mich daran erinnere was von der Unreal3 Engine geschw&auml;rmt wurde bei einem Event, das ich besucht habe w&uuml;rde ich mal ziemlich locker mein Vorurteil best&auml;tigt sehen, dass die Spieleindustrie Softwareeengineeringtechnisch 30 Jahre in der Vergangenheit lebt...</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1380">
<p class="infos">
<a href="#comment_1380" onclick="set_comment_reference(1380)" title="auf diesen Kommentar antworten">#1380</a>:
    17.Mar.2010 06:03
    von
    
      
        <a href="http://ag7.alltagsgrauen.info/" target="_blank">
          fwolf
        </a>
</p>
<p>Eher noch nur 15 Jahre. Damals, als AVM noch die Zwangsaktivierung integriert hatte, und man die ISDN-Treiber alle 6 Monate nach Hause telefonieren lassen musste, damit sie weiterhin funktionierten ...</p>
<p>cu, w0lf.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1439">
<p class="infos">
<a href="#comment_1439" onclick="set_comment_reference(1439)" title="auf diesen Kommentar antworten">#1439</a>:
    15.Oct.2010 03:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Wer sagt eigentlich dass AVM damals auf einem aktuellem Stand war? ^^</p>
</div>
</li>
</ul>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1381" onclick="set_comment_reference(1381)" title="auf diesen Kommentar antworten">#1381</a>:
    22.Mar.2010 12:03
    von
    
      
        <a href="http://malison.org/2010/allgemein/und-da-war-da-noch-2010-03-21/" target="_blank">
          Und da war da noch&amp;#8230; 2010-03-21 | h t t p : / / m a l i s o n . o r g
        </a>
</p>
<p>[...] Kunde -&gt; /2010/03/15/zahlender-kunde/ [...]</p>

<p class="infos">
<a href="#comment_1547" onclick="set_comment_reference(1547)" title="auf diesen Kommentar antworten">#1547</a>:
    22.Sep.2011 12:09
    von
    
      
        <a href="http://www.felixnagel.com/" target="_blank">
          Felix Nagel
        </a>
</p>
<p>Erinnert mich eindeutig an: <a href="http://www.ravn.de/blog/tante-emma-runterladen%3C/p%3E" rel="nofollow">http://www.ravn.de/blo...</a>
</p><ul class="referencing_comments">
<li>
<div class="comment" id="comment_1548">
<p class="infos">
<a href="#comment_1548" onclick="set_comment_reference(1548)" title="auf diesen Kommentar antworten">#1548</a>:
    22.Sep.2011 01:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ja, den Beitrag kannte ich zu dem Zeitpunkt glaube sogar schon :-)</p>
<p>Leider hat sich ja seitdem die Situation allerh&ouml;chstens weiter ins negative verschoben. :-/<br/>
UT2K7 war dann glaube auch zu Recht das letzte oder vorletzte Spiel welches ich mir f&uuml;r PC gekauft habe.<br/>
Momentan hab ich mich wieder sehr stark drauf verlegt so Sachen wie Alpha Centauri oder Chrono Trigger zu zocken.</p>
</div>
</li>
</ul>
</div>