+++
title = "Flash in die Toilette (and please flush!)"
date = "2008-07-04T04:07:00"
author = "Dr. Azrael Tod"
issoid = "blog/447"
aliases = "blog/447"
+++

<p>Dies ist eine Reaktion auf <a href="http://craplog.de/adobe-trash/" target="_blank">"adobe trash"</a> von <a href="http://craplog.de" target="_blank">Craplog.de</a><br/></p><blockquote>wenn ich surfe, und das mache ich in 99,9% der f&auml;lle mit <em>firefox</em>, habe ich immer notorisch viele tabs offen. kann auch mal vorkommen, &uuml;ber wochen hinweg. jetzt gibt es dieses ph&auml;nomen, dass immer webseiten, die <em>adobe flash</em> nutzen, eine ungeheure last an den prozessor abgeben. normalerweise, ich kann so viele tabs offen lassen, wie ich will, liegt meine cpu-temperatur zwischen 50&deg; und 60&deg;. damit l&auml;sst sich formidabel arbeiten. wird auf einer website jedoch <em>flash</em> genutzt, wom&ouml;glich noch mehrmals gleichzeitig, &uuml;ber anzeigen, eingebundene videos oder wasweissich, &auml;chzt meine maschine...</blockquote><br/>Mir geht es &auml;hnlich.. nur halt dass ich ein altes Notebook mit nem alten Centrino mein eigen nenne, dass im normalfall auf 600mhz runtergetaktet laufen sollte...<br/>Da ich aber immer Firefox offen hab und dort meine CPU-Last sofort auf 100% geht wenn ich eine Flash-Seite ansehe l&auml;uft nat&uuml;rlich auch mein L&uuml;fter die ganze Zeit auf Vollast und summt wie irre.<br/>Schon ein Umstieg auf interne Mediaplayer w&auml;re ein gro&szlig;er Schritt in die richtige Richtung, mit Flash ist es mir gerade so m&ouml;glich ein mini-Youtube-Video anzusehen, alles was &uuml;ber diese Aufl&ouml;sung hinaus geht ruckelt sofort.<br/>Das ist Performancem&auml;&szlig;ig ein Witz! DVDs kann ich doch auch ohne Jegliche Probleme ansehen und noch nebenbei surfen ohne meine CPU auszulasten. Ach halt.. nur solange ich keine Seite mit Flash finde, versteht sich. -.-

<p>Von den vielen anderen Nachteilen und Bugs die Flash mit sich bringt will ich lieber garnicht erst anfangen. (oder hat mal jemand unter Linux versucht auf <a href="http://www.adobe.com/" target="_blank">Adobes eigener Webseite</a> das Men&uuml; zu verwenden? Braucht ihr auch nicht, es funktioniert schlicht nicht weil eine Flashanimation es permanent &uuml;berlagert.)</p>
<p>Also bitte liebe Webentwickler: VERMEIDET FLASH!</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_262" onclick="set_comment_reference(262)" title="auf diesen Kommentar antworten">#262</a>:
    04.Jul.2008 04:07
    von
    
      
        <a href="http://cipha.de/" target="_blank">
          cipha
        </a>
</p>
<p>wir sitzen im selben boot: auch ich muss unter linux (opensuse, egal welche version!) die &uuml;belsten kr&auml;mpfe hinnehmen, wenn es um flash geht.</p>
<p>gerade eben habe ich allerdings diese neuigkeit gesehen: <a href="http://digg.com/linux_unix/Flash_on_Linux_no_longer_breaks_webpages">"flash on linux no longer breaks webpages"</a>.</p>
<p>wer's glaubt wird selig. hey, das geht jetzt in die ZEHNTE version! wtf...</p>
<p>mfg</p>

<p class="infos">
<a href="#comment_263" onclick="set_comment_reference(263)" title="auf diesen Kommentar antworten">#263</a>:
    04.Jul.2008 05:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>zumindest kann es ja nichtmehr schlechter kommen..<br/>
Die Geschwindigkeitsverbesserungen die auf deinem Link angepriesen werden, werden evtl. den Schmerz etwas lindern, ich glaube jedoch auch nicht dass es irgendwann im ertr&auml;glichen Bereich endet.<br/>
Wir k&ouml;nnen nur hoffen dass irgendwer demn&auml;chst mal bemerkt dass all die tollen Nettops die jetzt verkauft werden die gleichen Probleme haben und dass man mit Flash einfach nicht sinnvoll arbeiten kann.</p>

<p class="infos">
<a href="#comment_264" onclick="set_comment_reference(264)" title="auf diesen Kommentar antworten">#264</a>:
    05.Jul.2008 12:07
    von
    
      
        <a href="http://www.drni.de/blog/" target="_blank">
          DrNI
        </a>
</p>
<p>Flash kann so grausam sein. Meine Consumer-Recording-Karte kann (im Gegensatz zur richtigen Recording-Karte) auf der Hardware 32 Streams mischen. Also k&ouml;nnen 16 Anwendungen gleichzeitig das Sound-Device &ouml;ffnen und Stereo absondern. Also sitzt man da gem&uuml;tlich mit der Tasskaff vor den zwei Schirmen, h&ouml;rt m&auml;&szlig;ig laut sch&ouml;ne Musik, bis einem mittendrin eine nervige Flash-Werbung sehr laut irgendwelche Ger&auml;usche in die Geh&ouml;rg&auml;nge ballert. Klar, der Flash-Player kann zus&auml;tzlich zum Amarok ja auch auf die Karte zugreifen! Noch schlimmer ist nur MySpace, da gibt es nach dem Login erst mal Fernsehwerbung, sowas von l&auml;stig und nervig, geht kaum schlimmer. Das dumme ist: MySpace kann sich auf die Flashtauglichkeit seiner Clientel verlassen... ohne Flash kann man n&auml;mlich nicht die Musik der K&uuml;nstler h&ouml;ren, und warum sonst sollte man sich &uuml;berhaupt mit MySpace abm&uuml;hen.</p>

<p class="infos">
<a href="#comment_265" onclick="set_comment_reference(265)" title="auf diesen Kommentar antworten">#265</a>:
    05.Jul.2008 11:07
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>...and then there is me. FreeBSD x86-64, no flush, no problems.</p>

<p class="infos">
<a href="#comment_266" onclick="set_comment_reference(266)" title="auf diesen Kommentar antworten">#266</a>:
    05.Jul.2008 11:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Klar.. nur die Seiten die Flash verwenden werden dadurch auch nicht gerade besser dargestellt...</p>

<p class="infos">
<a href="#comment_267" onclick="set_comment_reference(267)" title="auf diesen Kommentar antworten">#267</a>:
    05.Jul.2008 02:07
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Ich habe nicht behauptet, dass ich die Situation tragbarer finde ;)</p>
</div>