+++
title = "Twitter-Linkflush (kommentiert)"
date = "2008-04-24T09:04:00"
author = "Dr. Azrael Tod"
issoid = "blog/360"
aliases = "blog/360"
+++

<p></p><blockquote>Wir wollen unseren Peilsender zur&uuml;ck! <a href="http://tinyurl.com/3mecdg" target="_blank">http://tinyurl.com/3mecdg</a> via Snookie</blockquote><br/>Schon ein starkes St&uuml;ck.. vor allem warum zum Henker will es erst keiner gewesen sein und dann kommen solche Beschwerden.<br/><br/><blockquote>W&auml;rme per Container haben wir: <a href="http://tinyurl.com/5dwkwa" target="_blank">http://tinyurl.com/5dwkwa</a> wo bleibt jetzt das Licht in S&auml;cken? </blockquote><br/>Eigentlich keine Wahninnig neue Idee, inwiefern das ganze effektiv ist bleibt aber fragw&uuml;rdig, immerhin erhitzt sich das ganze nur auf reichlich 50&deg;C.<br/><br/><blockquote>Wer will mal sehen welche seiner Bekannten GANZ dringend nen anderen Messenger brauchen? <a href="http://www.testticker.de/news/security/news20080424019.aspx" target="_blank">http://www.testticker.de/ne...</a> Statusmeldung gen&uuml;gt</blockquote><br/>Als g&auml;be es noch nicht genug Argumente gegen ICQ und f&uuml;r Jabber... Wer noch nicht umgestiegen ist sollte das dringend in Angriff nehmen. "Ich habe ja nichts zu verbergen" ist eine miese Ausrede f&uuml;r Faulheit. Wem Jabber zu kompliziert vorkommt, der kann ja per Google Talk das ganze mit einer h&uuml;bschen und einfachen Oberfl&auml;che vorkonfiguriert bekommen. (und alternative Clients funktionieren nat&uuml;rlich auch immer)<br/><br/><blockquote>Javascript, wo parseInt('09') ohne Fehler zu 0 aufgel&ouml;st wird -&gt; <a href="http://tinyurl.com/6dgd6q" target="_blank">http://tinyurl.com/6dgd6q</a></blockquote><br/>Merke: Javascript nimmt an, dass alles was mit einer 0 anf&auml;ngt eine Oktalzahl ist und wenn Ziffern vorkommen, die in Oktalzahlen nicht vorkommen k&ouml;nnen (8,9) dann wird einfach dennoch angenommen dass das eine Oktalzahl ist. Nat&uuml;rlich k&ouml;nnte man dann einen Fehler auswerfen, aber einfach 0 zur&uuml;ckliefern ist doch viel einfacher. Nur ein Grund unter 1000en warum Javascript nicht grade meine Lieblingssprache ist und es auch niemals wird.<br/><br/><blockquote>Thats Life: <a href="http://pixdaus.com/pics/b1xIvJNQdCS2nYEWuh.jpg" target="_blank">http://pixdaus.com/pics/b1x...</a></blockquote><br/><br/>Schade dass das so nahe an der Wahrheit ist.<br/><br/><blockquote>eine Konsole f&uuml;r alles: <a href="http://tinyurl.com/5u2svx" target="_blank">http://tinyurl.com/5u2svx</a> (leider ohne Kontroleranschl&uuml;ssen f&uuml;r alles in einem)</blockquote><br/><br/>Leider hat der Hersteller einfach nur die verschiedenen Platinen so gut wie m&ouml;glich in ein Geh&auml;use gequetscht und die Ausgabe &uuml;ber nen Umschalter geleitet. Eine wirklich gute Version bei der man auch f&uuml;r alle Konsolen den selben Controler verwenden kann oder gar Images &uuml;ber eine alternative Speicherkarte verwenden kann (auf Linuxbasis mit Emulator?) w&auml;re mal ein richtig geniales Projekt. Nichts dagegen die Originalcontroler anstecken zu K&Ouml;NNEN, aber ich w&uuml;rde auch dann gerne zu 4. spielen k&ouml;nnen, wenn ich bei einer bestimmten Konsole nur einen Controler habe.<br/><br/><blockquote>Fahrrad stilvoll sichern: <a href="http://tinyurl.com/34kt7x" target="_blank">http://tinyurl.com/34kt7x</a></blockquote><br/><br/>Jetzt brauch man nur noch das Fahrrad vor nem SM-Studio parken und schon wird nicht mehr das Fahrrad gestohlen sondern das Schloss.<br/><br/><blockquote>Kaffee bedrucken geht nicht? Geht ja wohl! <a href="http://tinyurl.com/2c2vnh" target="_blank">http://tinyurl.com/2c2vnh</a></blockquote><br/><br/>Ich frage mich, wie lange es dauert bis alle m&ouml;glichen Coffee2Go-Verk&auml;ufer (Starbucks und Nachahmer) auf die Art ihre Produkte mit dem eigenen Logo verzieren.<br/><br/><blockquote>Thematisch geordnet: <a href="http://tinyurl.com/6x6m77" target="_blank">http://tinyurl.com/6x6m77</a></blockquote><br/><br/>Jetzt bekommt Stephen Hawking schon seine eigene Abteilung und seine B&uuml;cher m&uuml;ssen nichtmehr unter "Unterhaltung" eingeordnet werden.<br/><br/><blockquote>kreative Viagra-Werbung: <a href="http://tinyurl.com/6r5kyl" target="_blank">http://tinyurl.com/6r5kyl</a></blockquote><br/><br/>Es gibt sicher kaum ein anderes Produkt f&uuml;r das sich so leicht werben l&auml;sst aber dies ist doch mal eine bessonders sch&ouml;ne Variante. &Uuml;brigens schade, dass der Spam per Email immer so unkreativ ist.<br/><br/><blockquote>Tipp f&uuml;rs Leben: <a href="http://tinyurl.com/6fbjys" target="_blank">http://tinyurl.com/6fbjys</a> #webcomic #fun</blockquote><br/><br/>SMBC ist &uuml;brigens immer einen Lacher wert und wirft absurde Szenen in einem Tempo ins Netz f&uuml;r das man sonst mindestens 10 Webcomics braucht.
      
    
  