+++
title = "EeeRotate"
date = "2009-05-18T12:05:00"
author = "Dr. Azrael Tod"
issoid = "blog/1397"
aliases = "blog/1397"
+++

<p>Heute geht es mal wieder um <a href="/2008/10/19/medion-akoya-mini-e1210/">mein kleines Alltagswerkzeug Akoya</a> (typisches Wind-Netbook von MSI, gelabelt als Medion, verkauft bei Aldi). Wie so ziemlich alle Ger&auml;te in dieser Klasse verf&uuml;gt die Kiste &uuml;ber ein 10,2" Display mit einer Aufl&ouml;sung von 1024x600 Bildpunkten.<br/>Das Ger&auml;t ist klein, leicht und mit meinem kleinen Akku-Upgrade h&auml;llt die Kiste 8-9 Stunden im Dauerbetrieb durch ohne dass ich nach einer Steckdose suchen muss.<!--more--></p>
<p>Neben den vielen anderen Dingen die man mit einem solchen kleinen Wunderwerk tun kann, bietet es sich geradezu an das System doch auch als EBook-Reader zu verwenden. Nat&uuml;rlich bringt das Display nicht die tollen Eigenschaften von <a href="http://de.wikipedia.org/wiki/Elektronisches_Papier" target="_blank">E-Ink</a> mit, doch es ist f&uuml;r die meisten Anwendungen gut genug und kann halt auch eben mal schnelle Animationen in Farbe darstellen (take that <a href="http://www.amazon.com/gp/product/B00154JDAI?amp;rw_absolute=y" target="_blank">kindle</a>!).</p>
<p>Nun ist eine 16:10-Aufl&ouml;sung sicher f&uuml;r vieles geeignet, f&uuml;r die Darstellung von langen Texten und das ausdauernde lesen der selbigen jedoch auf Garantie nicht. Doch zum Gl&uuml;ck beherrschen so ziemlich alle Grafiktreiber schon seit vielen Jahren den kleinen Trick doch mal die Daten zu drehen und so aus einer 16:10 eine 10:16-Aufl&ouml;sung zu machen.<br/><a href="http://lifehacker.com/5249179/eeerotate-orients-your-laptop-screen-for-easy-reading" target="_blank">&Uuml;ber Livehacker</a> bin ich nun auf ein kleines Tool gestolpert, dass diese Funktion endlich recht sinnvoll verwendbar macht, <a href="http://vk.edward.li.googlepages.com/eeerotate" target="_blank">EeeRotate</a>. Dies geschieht durch 2 Funktionen:<br/></p><ul><br/> <li>das Drehen wird mit einer einfachen Tastenkombination ausgel&ouml;st, niemand will sich erst durch 3 dutzend Men&uuml;b&auml;ume klicken, nur um f&uuml;r 10min einen Text &uuml;bersichtlicher dargestellt zu bekommen</li><br/> <li>Das Touchpad wird mitgedreht.. der Computer bleibt also bedienbar ohne dass man sich das Hirn verbiegen muss (schlauerweise betrifft dies NICHT irgendwelche externen M&auml;use)</li><br/></ul><br/>In der Tat ist die Sache ziemlich verwendbar und sorgt daf&uuml;r dass ich wirklich schon erw&auml;ge in Zukunft tats&auml;chlich &ouml;fters komplette B&uuml;cher am PC zu lesen. Leider gibt es momentan von der Hardwareseite noch einige Beschr&auml;nkungen. So ist mein Akoya f&uuml;r derartiges nicht gedacht und auf die Seite gedreht liegen die &Ouml;ffnungen f&uuml;r den L&uuml;fter unten. Wenn ich also so lesen will, muss ich das Netbook permanent etwas anheben, was wieder schnell unbequem wird.

<p>Auch ist es schade dass zwar mein Touchpad gedreht wird, aber dabei leider die M&ouml;glichkeit verloren geht den Rand als Scrollbalken zu verwenden (zumindest bei mir).<br/>Ideal w&auml;re es auch noch, wenn die Pfeiltasten der Tastatur anders angeordnet w&auml;ren und ebenfalls um 90&deg; gedreht werden k&ouml;nnten (das sollte zumindest unter Linux m&ouml;glich sein).<br/>So k&ouml;nnte man auch auf diese Art viel flexibler und ohne sich die Finger zu brechen im Dokument scrollen.</p>
<p>Alles in allem ist das Tool also wirklich sinnvoll. Es bringt neue M&ouml;glichkeiten ohne wirklich neue Dinge zu erfinden. Man merkt nat&uuml;rlich noch stark dass die Sache nicht ausgereift ist, doch mir gef&auml;llt wohin der Weg f&uuml;hrt.</p>
<p>Was mir jetzt noch bleibt ist das Warten auf bessere Geh&auml;useentw&uuml;rfe. Ideal w&auml;re ja ein Netbook, dessen Display sich komplett auf die R&uuml;ckseite klappen l&auml;sst (dabei sollte m&ouml;glichst aus bequemlichkeit heraus bereits das Display umgeschaltet werden) und bei dem die Richtungstasten und das touchpad dann so angeordnet sind dass man das Ger&auml;t &auml;hnlich eines Schreibblockes halten und auf der R&uuml;ckseite blind bedienen kann.<br/>Die dazu n&ouml;tige Hardware sollte nicht sonderlich aufw&auml;ndiger sein als was wir eh bereits &uuml;berall verbaut haben. Es wird weder ein Drehgelenk noch ein Touchscreen n&ouml;tig, wie wir sie von Tablet-PC-Hybriden kennen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1297" onclick="set_comment_reference(1297)" title="auf diesen Kommentar antworten">#1297</a>:
    18.May.2009 09:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ok.. also dass die externe USB-Maus nicht mitgedreht wird, scheint nicht in allen F&auml;llen zu stimmen. Ich hab aber momentan keine Ahnung wovon das abh&auml;ngig sein k&ouml;nnte. (ist auch wohl kaum der Rede wert, wer verwendet schon eine externe Maus w&auml;hrend er das Notebook in den H&auml;nden h&auml;llt und beliebig umdreht?)</p>
</div>