+++
title = "Auch eine blinde Leyen findet mal einen Korn"
date = "2010-09-14T12:09:00"
author = "Dr. Azrael Tod"
tags = ["Bücher/Literatur", "GEZ", "Kulturflatrate", "Säue durchs Dorf treiben"]
issoid = "blog/1533"
aliases = "blog/1533"
+++

<p>Vor ein paar Wochen (ja, meine Beitr&auml;ge sind wirklich so aktuell) hat sich Zensursula hingestellt und die Forderung in den Raum geworfen, man solle eine Kulturkarte f&uuml;r Kinder von Harz4-Empf&auml;ngern einf&uuml;hren. Nat&uuml;rlich gab es auf den ganzen Blogs wie immer gleich Diskussionen und gel&auml;chter, was sich diese Irre jetzt schon wieder in den Kopf gesetzt hat.</p>
<p>In der Tat k&ouml;nnte ein derartiger Sonderausweis zu diskriminierung und anderen Problemen f&uuml;hren, die Planung der ganzen Idee ist sowieso nicht vorhanden und alles was ge&auml;u&szlig;ert wurde, war mal wieder nicht viel sinnvoller als einfach zusammenhangslose Wortfetzen in den Raum zu werfen. (Die ernsthaft auftretenden Probleme haben andere sowieso schon zu gen&uuml;ge breit getreten, siehe dazu auch den sehr empfehlenswerten Beitrag vom <a href="http://www.spiegelfechter.com/wordpress/3857" target="_blank">Spiegelfechter</a>).</p>
<p></p><h3>Aber:</h3><br/>Die Grundidee ist eigentlich garnicht so schlecht (Kultursubventionierung, bzw. Eine verbilligte Abbo-Karte um ernsthaften Kultur-Konsum zu steigern). Das Zeug geh&ouml;rt halt nur auch f&uuml;r alle anderen ordentlich Subventioniert, so dass sich so ziemlich JEDER so eine Karte f&uuml;r seine Kinder zulegt (ruhig auch mit Zuzahlung, sagen wir mal Besser noch: Warum auf Kinder beschr&auml;nken? Brauchen Erwachsene keine Kultur mehr? Baut ein gutes System, mit dem sich jeder mindestens einmal w&ouml;chentlich leisten kann irgendwas Kulturelles oder Sportliches (Museum, Oper, Kabarett, Freibad, ...) zu unternehmen und sagt dann nur im Nachhinein dass das f&uuml;r Harz-Empf&auml;nger komplett bezahlt wird!

<p>Auf die Art k&ouml;nnen wir eine dringend ben&ouml;tigte Subventionierung f&uuml;r derartiges einf&uuml;hren UND gleichzeitig die geistig n&ouml;tige &Uuml;berwindung f&uuml;r den Besuch eines Theaters oder Museums verringern. Wenn man den Besuch eh schon bezahlt hat, warum dann nicht auch nutzen?</p>
<p>In der Tat h&auml;tte ein solches System wohl auch bessere Chancen realisiert zu werden als z.b. die Idee derartiges generell kostenlos zu machen, k&ouml;nnte aber &auml;hnlich positive Auswirkungen haben. DAS w&uuml;rde ich unter Kulturflatrate verstehen, nicht sowas engstirnig auf Musik und Filme beschr&auml;nktes wie das wovon im Internet immer die Rede ist.<br/>Im Gegensatz dazu, lie&szlig;e sich sowas auch brauchbar abrechnen. Ein Museum oder Kino bekommt den Eintritt dann halt nicht vom Besucher, sondern f&uuml;r jede Zahlung mit Kulturkarte vom Staat.</p>
<p>Was bleibt ist die Frage nach der Finanzierung und auch generell scheint die Idee ja bereits wieder in der Schublade verschwunden zu sein. Gescheitert an der Person die es vorgeschlagen hat, an politischer Engstirnigkeit und an einem Konzept das schon von Anfang an viel zu eng gefasst war.</p>
<p>Eigentlich sollte die Finanzierung auf den gesammthaushalt unseres Landes kaum auffallen, dann m&uuml;ssen wir halt mal irgendwas anderes weglassen f&uuml;r das wir sonst immer so Geld ausgeben. Mautsysteme von Tollcollect, Laufzeitverl&auml;ngerungen von Atomkraftwerken (mit staatlich finanzierter Sicherheitsaktualisierung), dem BND, BKA oder Bundeswehrfinanzierung w&uuml;rden sich da z.B. anbieten.</p>
<p>Gut.. das Konzept hat dann eigentlich fast garnichts mehr mit dem zu tun worum es eigentlich ging... aber ich finde es brauchbar.</p>
