+++
title = "Procrastination"
date = "2009-01-05T01:01:00"
author = "Dr. Azrael Tod"
issoid = "blog/1155"
aliases = "blog/1155"
+++

<p>Da ist es wieder jenes Wort das ich erst seit 1-2 Jahren kenne... Es scheint das absolut b&ouml;seste zu bedeuten was man als Person tun kann und es werden mehr B&uuml;cher dar&uuml;ber geschrieben wie man Procrastination vermeiden kann als dar&uuml;ber wie man richtig Auto f&auml;hrt.<!--more--></p>
<p>Was bezeichnet dieser Begriff eigentlich? "Procrastination" k&ouml;nnte man auch als "<a href="http://de.wikipedia.org/wiki/Aufschieben" target="_blank">Aufschieben</a> wichtiger Arbeiten" bezeichnen. Wann immer man &uuml;berlegt "Ich m&uuml;sste jetzt XYZ tun" aber sich doch entscheidet "ABC" zu erledigen weil das erstmal mehr Spa&szlig; macht oder einfacher ist, k&ouml;nnte man das als Procrastination bezeichnen. (Man kann es aber auch lassen und z.B. lieber ein Wort verwenden was auch ein nicht-Geek versteht.)</p>
<p>Mein Problem mit dieser Ansicht ist, dass erstmal alles als schlecht angesehen wird was mich von "wichtigen" Erledigungen abh&auml;lt. F&uuml;r mich als chronisch faulen, studiengesch&auml;digten Informatiker fallen also sowohl Computerspielen, Bloggen, lesen von Newsfeeds oder Linux-basteln als auch die Programmierung eines <a href="http://code.google.com/p/pychao/" target="_blank">IRC-Bots</a> darunter. Unangenehme Dinge wie Hausputz sollten sofort erledigt werden, wohingegen Dinge ohne sofortigen Nutzen erstmal wegfallen oder aufgeschoben werden.</p>
<p>Damit wird die Steuererkl&auml;rung zum Lebenszweck.</p>
<p>Ich will nun aber mein Leben nicht mit Steuererkl&auml;rung und Hausputz verbringen, noch viel weniger will ich permanent &uuml;berlegen was ich als n&auml;chstes tu. Wenn ich diesem Denkschema bis ans Ende folge, lande ich dabei emsig zu arbeiten und alle Probleme sofort aus der Welt zu schaffen. Zum faulenzen, Buch lesen oder Film ansehen komme ich dann jedoch erheblich weniger.</p>
<p>Meiner Meinung l&ouml;sen sich viele Probleme nunmal von selbst. (Manche nicht immer zum Vorteil, Beziehungsprobleme l&ouml;sen sich z.B. auch  fast immer nach 1-2 Wochen oder sp&auml;testens Monaten ohne Aktion als nicht mehr existend auf... mieses Beispiel)</p>
<p>Wenn wir mal unsere gesammte Weltbev&ouml;lkerung ansehen, dann f&auml;llt verd&auml;chtig auf dass wir viele Probleme haben. Eines geh&ouml;rt jedoch nicht dazu, wir haben durchaus genug Arbeitskr&auml;fte. Wir haben sogar zu viele davon, wenn wir alle Menschen mit aktuellen technischen Mitteln ausstatten stehen wir mit derartig viel Produktionskraft da, wie wir unm&ouml;glich derzeit verwenden k&ouml;nnten. Wir merken also: es gibt einen Grund f&uuml;r Arbeitslosigkeit und dieser Grund wird durch den technischen Fortschritt auch nicht weniger.</p>
<p>Zus&auml;tzlich zu all dieser Produktiv- und Schaffenskraft unserer Weltbev&ouml;lkerung und zus&auml;tzlich zu allen technischen M&ouml;glichkeiten wollen wir also jetzt noch die Leistung der Einzelpersonen steigern. Doch stellt sich f&uuml;r mich hier die Frage: Was wollen wir damit erreichen? W&auml;re es nicht sch&ouml;ner wenn jeder vlt. nicht so effektiv, daf&uuml;r aber mit Spa&szlig; an Dingen arbeiten k&ouml;nnte die ihm oder ihr gerade einfallen? Wie ich gerne an IRC-Bots schreibe, kann ich auch an ernsteren Projekten schreiben, andere schnitzen z.B. gerne Holzfiguren, schneidern Kleider oder bauen evtl. sogar gerne H&auml;user.</p>
<p>Nat&uuml;rlich wird nicht jede Arbeit von genug Menschen gerne gemacht um den Bedarf zu decken... das w&auml;re dann auch Kommunismus und dass dieser nicht wirklich m&ouml;glich ist, sollte jedem Menschen klar sein wenn er dar&uuml;ber nachdenkt ob er allen seinen Nachbarn ungebremst alle seine G&uuml;ter in die Hand dr&uuml;cken w&uuml;rde.</p>
<p>Es ist jedoch ein Hinweis darauf, dass auch unser System nicht mehr ewig funktioniert. Besser noch: unser System funktioniert bereits jetzt nicht mehr (wie man an den immer gr&ouml;&szlig;er werdenden sozialen Unterschieden merkt) und l&auml;uft nur aus dem Grund weiter dass wir kein besseres haben und auch niemanden der es einsetzen k&ouml;nnte.</p>
<p>Aber sehen wir es mal lokal: Mein Leben lang war ich bereits derartig faul dass es eigentlich zum Himmel stinken m&uuml;sste. Ich habe sicher nur die H&auml;lfte meines Potentials ausgesch&ouml;pft und h&auml;tte erheblich mehr leisten k&ouml;nnen. Wenn ich dazu noch etwas Gl&uuml;ck in den Topf geworfen h&auml;tte, h&auml;tte ich jetzt vlt. einen erheblich besser bezahlten Job oder eine eigene Firma, w&auml;re weltweit f&uuml;r irgendwas bekannt oder w&uuml;rde sonst irgendwie mit einem Projekt gl&auml;nzen k&ouml;nnen.<br/>Wenn man von diesem Idealfall ausgeht, h&auml;tte ich mit wirklich richtig viel Gl&uuml;ck, Aufwand und K&ouml;nnen vlt. schon in 20-30 Jahren in Ruhestand begeben k&ouml;nnen.<br/>Ich k&ouml;nnte also in wenigen Jahrzehnten schon anfangen Spa&szlig; in meinem Leben zu haben... oder ich tu das halt jetzt.</p>
<p>Nat&uuml;rlich bedeutet das nicht, dass ich bei meinem Arbeitgeber nur rumgammeln w&uuml;rde. Ich verstehe durchaus dass dieser von mir eine Arbeitsleistung f&uuml;r sein Geld erwartet und dass er es sich weder leisten kann, noch will mich ohne Gegenleistung bei sich rumsitzen zu lassen. Anders sieht es aber aus, wenn ich als Privatperson die Wahl zwischen einer Arbeitszeit von 40h/Woche f&uuml;r 3000&euro; oder einer 20h/Woche f&uuml;r 1500&euro; h&auml;tte.</p>
<p>Zeit ist nicht Geld, dann k&ouml;nnte ich mir f&uuml;r mein Geld auch wieder Zeit zur&uuml;ckkaufen. Das kann ich nicht, daher muss Zeit wertvoller sein als Geld.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1036" onclick="set_comment_reference(1036)" title="auf diesen Kommentar antworten">#1036</a>:
    05.Jan.2009 11:01
    von
    
      
        <a href="http://codeschmie.de" target="_blank">
          fa
        </a>
</p>
<p>Normalerweise st&auml;nkere ich ja immer, dass die englische Sprache manchmal so sch&ouml;ne pr&auml;gnante Worte hat, wof&uuml;r der Deutsche gerne mal ein bis zwei Halbs&auml;tze aufwenden muss, aber bei "procrastination" ist das was anderes. Wenn ich zum Beispiel zur Belustigung mal wieder <a href="http://www.lifehacker.com" rel="nofollow">http://www.lifehacker.com</a> lese, finden sich dort neben Anleitungen zum gesunden Menschenverstand (Caution, your coffee may be hot!) auch gewisse Schlagworte wie jenes, das zielsicher auf die absolut stumpfesten Methoden des GTD hinweist. Oder auf die "personal development"-Blogs ala "How getting up at 5 am made me earn twice as much per year". Oder so.</p>

<p class="infos">
<a href="#comment_1037" onclick="set_comment_reference(1037)" title="auf diesen Kommentar antworten">#1037</a>:
    06.Jan.2009 09:01
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>Tjaaaa ...</p>
<p>Ich sach immer dazu "Wenn alles perfekt laufen w&uuml;rde, w&auml;hren wir alle arbeitslos"<br/>
Das das ganze System sich nach und nach auffrisst, da wir aufgrund voranschreitender Medizin immer &auml;lter werden und unserer relativ guten Lebensverh&auml;ltnisse immer mehr usw.</p>
<p>Es gibt eben Dinge, die sollte man nicht aufschieben, wie Hausputzt und &auml;hnliches, einfach um sich ein wohles Umfeld zu schaffen, aber Karriere und dergleichen k&ouml;nnen f&uuml;r mich pers&ouml;nlich nicht darunter fallen. F&uuml;r manch einen mag das zum wohligen Umfeld f&uuml;hren, f&uuml;r mich ist das immer ein hang zum extremen und ich mag Extreme nicht.</p>
<p>Ein wenig Zeit f&uuml;r unwichtige Dinge muss sein, vor allem in Zeiten, in denen der Fokus der wichtigkeit stark verschwimmt.</p>

<p class="infos">
<a href="#comment_1038" onclick="set_comment_reference(1038)" title="auf diesen Kommentar antworten">#1038</a>:
    06.Jan.2009 10:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Warum sollte man Hausputz nicht aufschieben d&uuml;rfen? Solange es im Rahmen bleibt kann man alles aufschieben. (Nat&uuml;rlich sollte es nicht in unappetitlichen Bereichen enden, aber wenn man mal die Fenster 2 Wochen nicht putzt werden dadurch auch nicht sofort BKA und Nachbarn die Wohnung st&uuml;rmen)<br/>
Man sollte halt immer wissen was man nicht mehr aufschieben sollte um die Lage &uuml;berhaupt noch unter Kontrolle bekommen zu k&ouml;nnen.</p>

<p class="infos">
<a href="#comment_1039" onclick="set_comment_reference(1039)" title="auf diesen Kommentar antworten">#1039</a>:
    06.Jan.2009 03:01
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>mhmmm ... vllt liegt hier die Schwierigkeit darin zu sagen, in welchem Umfang man etwas nicht aufschieben sollte.<br/>
Alle 2 Wochen Fensterputz ... oh Herr ^^'</p>
<p>Und da liegt allerdings auch f&uuml;r viele das Problem zu erkennen, wann etwas nun gemacht werden muss, oder wann man es liegen lassen kann.</p>
<p>"Caution, the Cup is hot!" ... Klar das Menschen, die automation gew&ouml;hnt sind denken, das wenn sie den Automat bedienen und einen Kaffee bekommen, davon ausgehen, das sie ihn sich ma eben reinschl&uuml;rfen k&ouml;nnen.</p>
<p>Mhmm ... gesunder Menschenverstand wird leider rar</p>

<p class="infos">
<a href="#comment_1040" onclick="set_comment_reference(1040)" title="auf diesen Kommentar antworten">#1040</a>:
    06.Jan.2009 03:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Alt. sollte man dann wirklich einfach ALLE Warnungen auf irgendwelchen Maschinen oder so entfernen und das Problem mit dem mangelnden Verstand w&uuml;rde sich darwinistisch selbst l&ouml;sen...</p>

<p class="infos">
<a href="#comment_1041" onclick="set_comment_reference(1041)" title="auf diesen Kommentar antworten">#1041</a>:
    06.Jan.2009 08:01
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>... ein Motto dem eine Stadt aktuell folgt, welche Verkehrswarnschilder entfernt hat und seit dem einen krassen R&uuml;ckgang an Verkehrsdelikten erf&auml;hrt ^^</p>
<p>Man kann Menschen also erziehen ^^</p>
</div>