+++
title = "Schlafen ist Luxus"
date = "2008-10-06T09:10:00"
author = "Cindy"
issoid = "blog/888"
aliases = "blog/888"
+++

<p>In New York lassen sich Einrichtung Schlaf richtig teuer bezahlen, da kann eine Minute Schlaf schon mal einen Dollar kosten. Aber auch ohne Geld bezahlen zu m&uuml;ssen, ist Schlaf in der heutigen Zeit ein sehr kostbares Gut geworden.</p>
<p>Denn in der Zeit wo man schl&auml;ft (bei einem 80j&auml;hrigen sind das immerhin 22 Jahre) k&ouml;nnte man ja was wichtiges verpassen. Was allerdings Thomas Alva Edison damit zu tun hat und welche Schlafverhalten es gibt werde ich im Folgenden erl&auml;utern.<!--more--></p>
<p>In den letzten Jahrzehnten hat sich das Schlafverhalten ge&auml;ndert, wir schlafen im Durchschnitt eine halbe Stunde weniger, Schuld daran ist Edison, denn er gilt als Erfinder der Gl&uuml;hbirne.<br/>Der K&ouml;rper ist darauf ausgerichtet in eine Ruhephase zu wechseln, wenn es dunkel ist und mit Sonnenaufgang wieder aktiv zu werden. Aber wer ber&uuml;cksichtigt das denn heute noch? In der heutigen Gesellschaft sind wir nicht mehr davon abh&auml;ngig, ob die Sonne scheint oder nicht, denn durch das k&uuml;nstliche Licht wird auch die Nacht zum Tag.</p>
<p>Der K&ouml;rper ger&auml;t im Extremfall aus dem Gleichgewicht, wir f&uuml;hlen uns m&uuml;de, tr&auml;ge und kaputt. Doch das interessiert die Gesellschaft nicht. Wenn der Chef sagt, es geht um 6 Uhr morgens los, dann muss der Arbeitnehmer das akzeptieren oder er sucht sich einen andren Job. Wie mein Freund, der dann eben bis 8 Uhr schlafen kann und erst gegen 10 Uhr auf Arbeit sein soll.<br/>In einem Fertigungsunternehmen wo rollende Woche ist, ist dies allerdings nicht denkbar. Da muss sich der Mensch eben anpassen. Dies durfte ich auch erfahren, als ich in die Kontischicht integriert wurde.</p>
<p>Es werden 2 Tage Tagschicht gearbeitet, dann noch 2 Tage Nachtschicht (immer 12h) und zum Schluss hat man 4 Tage frei um seinem K&ouml;rper Ruhe zu g&ouml;nnen und wieder in einen angemessenen Bio-Rhythmus zu kommen. Was nebenbei bemerkt gar nicht so leicht ist.</p>
<p>Daran ist aber nicht nur die Tag-Nacht-Umstellung Schuld, sondern auch der eigene K&ouml;rper. Es gibt 3 Typen von Schl&auml;fern:<br/></p><ul><br/> <li>die Langschl&auml;fer, die im Durchschnitt 8-10h Schlaf brauchen</li><br/> <li>die Mittellangschl&auml;fer, die 6-8h Schlaf brauchen</li><br/> <li>die Kurzschl&auml;fer die mit gerademal 5-6h Schlaf auszukommen scheinen.</li><br/></ul><br/>Ich geh&ouml;re eindeutig zu den Langschl&auml;fern. Ich schlafe gern und ich schlafe viel. Das bemerkte auch die Tante meines Freundes, als ich auf der Hollywoodschaukel ein Vormittagsschl&auml;fchen hielt und erst zum Mittagessen geweckt wurde. Solche Geschichten werden einem dann auch st&auml;ndig wieder erz&auml;hlt und leugnen ist zwecklos.

<p>Mein Freund dagegen ist ein Kurzschl&auml;fer. (Der ist aber auch Informatiker. Die sind sowieso bisschen anders als Andere.) Er kommt mit sehr wenig Schlaf aus, ist allerdings dann auch ein Morgenmuffel. Denn alles was vor 8 Uhr morgens ist, ist eindeutig noch Nacht.</p>
<p>Wer selbst nicht wei&szlig;, was f&uuml;r ein Schlaftyp er ist, f&uuml;r den habe ich hier <a href="http://www.psychotherapie.onlinehome.de/fachinfo/allgschlaf.html#Schlafdauer" target="_blank">einen Link.</a></p>
<p>New York ist "Die Stadt, die niemals schl&auml;ft". Doch das hat ernste Konsequenzen nach sich gezogen. Die Stadt ist im Dauerstress und es kommt immer h&auml;ufiger zu Kurzschlafphasen bei den Menschen, was dann schon mal zu Unf&auml;llen f&uuml;hren kann. Um dem entgegen zu wirken haben sich die New Yorker etwas einfallen lasse. In sogenannten Wellness-Centern ist es m&ouml;glich f&uuml;r ein kurzes Nickerchen (nap) zu bezahlen. Denn das kann Wunder bewirken, naja sollte es auch, wenn man f&uuml;r 20 Dollar gerademal 20min. Schlaf bekommt und der simulierte Sonnenaufgang ist dann ja hoffentlich im Preis mit inbegriffen. Mehr dazu unter <a href="http://www.yelonap.com/" target="_blank">www.Yelonap.com</a></p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_714" onclick="set_comment_reference(714)" title="auf diesen Kommentar antworten">#714</a>:
    06.Oct.2008 01:10
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Ach bin dann doch eher der Extremlangschl&auml;fer, wenn ich zeitig ins Bett komme und lang genug liegen bleiben kann kommen da auch mal 14(!) Stunden zusammen. Unter der Woche bricht dann aber auch bei mir der Informatiker durch und ich gleiche meine 5 Stunden Schlaf mit intraven&ouml;sem Kaffee aus.</p>

<p class="infos">
<a href="#comment_715" onclick="set_comment_reference(715)" title="auf diesen Kommentar antworten">#715</a>:
    06.Oct.2008 01:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Naja, dass ich mit SEHR wenig schlaf auskomme w&uuml;rde ich auch mal bestreiten...<br/>
Ich schlafe gerne, ich hab halt nur immer das Gef&uuml;hl dass ich da was verpassen w&uuml;rde. Auch wenn es nur Freizeit ist, in der mir langweilig ist, Schlaf erscheint mir dagegen meist noch unwichtiger.</p>

<p class="infos">
<a href="#comment_716" onclick="set_comment_reference(716)" title="auf diesen Kommentar antworten">#716</a>:
    07.Oct.2008 10:10
    von
    
      <a href="/blog/author/toranor/">
        toranor
      </a>
</p>
<p>Ich find schlafen toll. k&ouml;nnte aber daran liegen, das ich einer der wenigen menschen bin die luzidtr&auml;ume haben, was wohl die beste erfindung seit der entstehung des lebens ist.</p>

<p class="infos">
<a href="#comment_717" onclick="set_comment_reference(717)" title="auf diesen Kommentar antworten">#717</a>:
    07.Oct.2008 12:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Luzidtr&auml;ume gibts bei mir nur wenn ich eh gerade so halb am Aufwachen bin... zumindest glaube ich das, da dies auch die einzigen Tr&auml;ume sind an die ich mich wenigstens noch kurz erinnern kann (10-15min sp&auml;ter ist auch das alles weg), ist nat&uuml;rlich auch das etwas unklar.</p>
</div>