+++
title = "Welche Config-Fomate?"
date = "2008-10-06T06:10:00"
author = "Dr. Azrael Tod"
tags = ["PC", "Softwareschrott", "Technik"]
issoid = "blog/901"
aliases = "blog/901"
+++

<p>Nachdem ich mich im <a href="/2008/10/6/Wo-sollten-Config-Daten-liegen/">letzten Post</a> bereits dar&uuml;ber ausgelassen habe, wo die Konfigurationsdaten liegen sollten hier nun der dazu passende Eintrag in dem ich mich mal damit besch&auml;fftigen will welche Formate zur Verf&uuml;gung stehen (war ja auch schon angek&uuml;ndigt).<!--more--><br/></p><h2>Plain-Data</h2><br/>Zu meinen Anfangszeiten mit dem PC hielt ich dies neben benutzerdefinierten Textformaten, noch so ziemlich f&uuml;r die einzige Art wie man Daten ablegen konnte. Einfach immer sch&ouml;n die kompletten Speicherstrukturen auf die Platte (oder damals auch gerne Diskette) schieben.<br/>Schneller gehts kaum noch, kann aber daf&uuml;r nat&uuml;rlich keiner lesen der nicht entweder genau wei&szlig; was in der Datei stehen sollte oder ziemlich viel Aufwand reingesteckt hat.<br/>Wir k&ouml;nnen uns daher sicher auch darauf einigen dass es f&uuml;r Menschenlesbare Konfigurationen bessere Formate gibt.<br/><h2>INI</h2><br/><a href="http://de.wikipedia.org/wiki/Initialisierungsdatei" target="_blank">Initialisierungsdateien</a> waren gegen Windows 3 DER gro&szlig;e Vortschritt bei Windows. Ein standardisiertes Dateiformat, f&uuml;r dessen Schreib- und Lesevorg&auml;nge recht handliche Funktionen bereitgestellt werden.<br/>INI ist sehr gut menschenlesbar, da es nur aus Bereichsdefinitionen und darin ein paar Zuweisungen besteht. Das Ganze ist dann nat&uuml;rlich aus dem selben Grund nicht so wirklich flexibel.<br/>Z.B. bereits bei mehrdimmensionalen Arrays wird die ganze Sacheetwas nervig.<br/><h2>UNIXoide-Configfiles</h2><br/>Lange Zeit au&szlig;erhalb meines privaten Dunstkreises, aber schon l&auml;nger existent als ich selbst: die UNIX/Linux/BSD-typischen Konfigurationsformate!<br/>Eigentlich handelt es sich eher um Sammlungen von groben Beschreibungen wie es bei anderen Projekten aussieht, wirkliche Standards gibt es imho nicht.<br/>Die Meisten sind relativ gut menschenlesbar, wenn die Daten etwas komplexer werden geht es aber Bergab. In j&uuml;ngerer Zeit finden sich hier oft starke Anleihen an XML, besonders bei komplexeren Datenstrukturen.<br/>Besonders hervorzuheben ist die starke Verbreitung von Kommentaren. W&auml;ren INI-Dateien generell so gut kommentiert wie die durchschnittliche *.conf unter Linux, w&auml;re INI durchaus gut verwendbar.<br/><h2>XML</h2><br/>Die <a href="http://de.wikipedia.org/wiki/Extensible_Markup_Language" target="_blank">eXtensible Markup Language</a> war eigentlich eher als ein klar definierbares Datenaustauschformat gedacht denn als Format f&uuml;r Konfigurationsdateien.<br/>Dies macht sich sehr deutlich bemerkbar wenn man sich komplexere Datensammlungen ansieht. Wenn der XML-Code ordentlich formatiert ist, mag es durchaus m&ouml;glich sein sich durchzuk&auml;mpfen, aber dies macht eindeutig keinen Spa&szlig;.<br/>Da allerdings in so ziemlich allen Sprachen ziemlich gute XML-Parser und Generatoren bereitstehen sind einige Entwickler auf die bl&ouml;de Idee gekommen dieses Format auch hier einzusetzen.<br/>F&uuml;r alles was komplexer als eine kurze INI-Datei ist sollte man sich die Verwendung dieses Formates mehrmals &uuml;berlegen, die Lesbarkeit liegt oft wirklich nur sehr knapp oberhalb der von Plain-Data-Formaten, das nat&uuml;rlich bei erheblich geringerer Geschwindigkeit.<br/>(F&uuml;r Dinge die weniger komplex als eine kurze INI-Datei sind w&auml;re es nat&uuml;rlich ebenfalls Schwachsinn.. da kann man wohl gleich INI verwenden.)<br/><h2>YML</h2><br/><a href="http://de.wikipedia.org/wiki/Yml" target="_blank">YAML</a> steht f&uuml;r "YAML Ain't Markup Language" und stellt ein relativ junges Format dar, dessen Verbreitung noch in den Kinderschuhen steckt.<br/>Das Format versucht grob Daten so zu notieren wie man es auch als Mensch tun w&uuml;rde, wenn man sich die entsprechenden Datenformate in einer einfachen Textdatei aufschreiben will.<br/>Dadurch wird eine extrem gute Lesbarkeit erreicht, man kann innerhalb weniger Minuten verstehen was mit einer solchen Datei erreicht werden soll und wie man selbst solche Daten formuliert.<br/>Die notierten Daten sind &auml;u&szlig;erst flexibel und dennoch durch relativ strikte Standards gut zu parsen. F&uuml;r JavaScript, Perl, PHP, Python, Java und Ruby bestehen bereits gute Parser, die meist komplexeste Datenstrukturen ohne gr&ouml;&szlig;ere Umst&auml;nde gut lesbar ausgeben k&ouml;nnen.

<p>Es ist meiner Meinung nach w&uuml;nschenswert dass sich dieses geniale Konzept weiter verbreitet. Ich durfte die letzten Wochen und Monate dank Arbeit mit dem <a href="http://www.symfony-project.org/" target="_blank">Symfony-Framework</a> permanent damit arbeiten und bin einfach nur begeistert.<br/>Ich kann es jedem nur empfehlen sich die <a href="http://de.wikipedia.org/wiki/Yml" target="_blank">Wikipedia-Seite</a> dazu gr&uuml;ndlich durchzulesen und eine Implementierung f&uuml;r seine Lieblingssprache zu suchen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_718" onclick="set_comment_reference(718)" title="auf diesen Kommentar antworten">#718</a>:
    30.Oct.2008 10:10
    von
    
      
        <a href="/2008/10/30/irc-bot-hauptfunktionalitat-newsfeeds/" target="_blank">
          IRC-Bot Hauptfunktionalit&auml;t: Newsfeeds &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] unterst&uuml;tzen wir nur eine Art von Feeds, diese werden relativ statisch in der Config (Yaml-Format) mit URL und gew&uuml;nschtem Befehlsstring eingetragen und sind dann je nach Parameterzahl und [...]</p>
</div>