+++
title = "Spamschwund"
date = "2008-11-21T11:11:00"
author = "Dr. Azrael Tod"
issoid = "blog/1068"
aliases = "blog/1068"
+++

<p>Gerade habe ich mich im IRC noch gewundert dass diese Woche verd&auml;chtig wenig Askimet-Kommentarspam auf G33KY^2 angefallen ist...<!--more--></p>
<p><a href="http://www.dc6xs.de" target="_blank">RobVinc </a>bemerkte dann dass dies auch f&uuml;r E-Mail-Spam gilt (was ich ebenfalls best&auml;tigen kann, wenn auch nicht ganz so stark) und meinte dass es k&uuml;rzlich erst bei /. oder heise einen Beitrag &uuml;ber die Netz-Trennung eines ISPs der f&uuml;r einen gro&szlig;teil des Spamaufkommens verantwortlich w&auml;re, gegeben h&auml;tte.</p>
<p>Tats&auml;chlich war der Beitrag schnell gefunden (McColo wars):&nbsp;<a href="http://www.heise.de/netze/US-Provider-ziehen-Spam-Schleuder-den-Stecker--/news/meldung/118804/" target="_blank">US-Provider ziehen Spam-Schleuder den Stecker</a><br/></p><blockquote>Nun d&uuml;rfen Spam-geplagte E-Mail-Anwender darauf hoffen, dass in n&auml;chster Zeit deutlich weniger Werbem&uuml;ll in den Postf&auml;chern landet. Tats&auml;chlich ist das allgemeine Spam-Aufkommen am Dienstagabend deutlich gesunken.&nbsp;</blockquote><br/>Es scheint also tats&auml;chlich geholfen zu haben.
      
    
  <div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_904" onclick="set_comment_reference(904)" title="auf diesen Kommentar antworten">#904</a>:
    21.Nov.2008 11:11
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Eine wichtige Frage ist: Wenn es gen&uuml;gt 2-3 Stecker zu ziehen um einen wirklichen St&ouml;renfried und Produktivit&auml;tsbremser aus dem Internet zu entfernen, warum wird auf SPAMMER nicht mindestens genauso hart Jagd gemacht wie auf ... Raubkopierer?</p>

<p class="infos">
<a href="#comment_905" onclick="set_comment_reference(905)" title="auf diesen Kommentar antworten">#905</a>:
    21.Nov.2008 11:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Weil Spam eine koplette Industrie f&uuml;r sich ist, die Jagt auf Raubkopierer und Spamfilter jeweils auch?</p>

<p class="infos">
<a href="#comment_906" onclick="set_comment_reference(906)" title="auf diesen Kommentar antworten">#906</a>:
    24.Nov.2008 12:11
    von
    
      
        <a href="http://dc6xs.de" target="_blank">
          RobVinc
        </a>
</p>
<p>Update: <br/>
<a href="http://www.heise.de/newsticker/Spam-faellt-auf-Jahrestief--/meldung/119321%3C/p%3E" rel="nofollow">http://www.heise.de/ne...</a>
</p>
<p class="infos">
<a href="#comment_907" onclick="set_comment_reference(907)" title="auf diesen Kommentar antworten">#907</a>:
    24.Nov.2008 01:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Hmm Askimet-Spam ist noch immer niedrig, hat aber bereits wieder zugenommen (das kann auch an der geringeren, allgemeinen Aktivit&auml;t  auf G33KY^2 liegen). EMail-Spam hingegen ist bereits wieder auf gewohnt hohem Niveau.</p>
</div>