+++
title = "Diverse Minitools"
date = "2009-01-21T01:01:00"
author = "Dr. Azrael Tod"
issoid = "blog/1192"
aliases = "blog/1192"
+++

<p>Jedes der folgenden 4 Tools/Webdienste/Projekte/wasauchimmer ist mir momentan nicht wirklich einen vollen Post wert, aber jedes finde ich durchaus interessant. Darum hier kurz eine Zusammenfassung der Dinge &uuml;ber die ich in den letzten Tagen gestolpert bin.<br/>Wem die Namen GCalcCli, Shell-FM, ZOMG und Imagestatuscheck also bereits etwas sagen, der braucht diesen Artikel nicht zu lesen.<br/><!--more--><br/></p><h2>Imagestatuscheck.com</h2><br/>Auf <a href="http://www.imstatuscheck.com/" target="_blank">Imagestatuscheck</a> bekommt man die M&ouml;glichkeit ohne eigenen Code (von html mal abgesehen) und somit auch ohne gro&szlig;en Aufwand, Bilder f&uuml;r eine Statusanzeige von so ziemlich allen Messengerprotokollen einzubinden. Man kann also sowohl f&uuml;r Jabber-Accounts (wenn auch nur GTalk als Auswahl steht, es funktioniert dennoch) als auch f&uuml;r ICQ, MSN, Y! und was auch immer man noch so braucht das selbe Statussymbol einbinden.

<p>Nicht nur dass f&uuml;r alle Protokolle einheitliche Symbole zur Verf&uuml;gung stehen und man auch ein Symbol f&uuml;r das jeweilige Protokoll angepasst verwenden kann (dennoch mit einem einheitlichen Stil), man kann sogar die Weiterleitung auf eine eigene Bild-Datei umleiten lassen und so das Aussehen komplett individualisieren.</p>
<p>Das Default-Aussehen seht ihr ab sofort in meiner Seitenleiste unter dem Punkt "Jabber", ich werde in n&auml;chster Zeit mal noch sehen ob ich dort auch die Adressen der anderen Autoren einbinde. Auch was Spambots und &auml;hnliches Betrifft hat man mitgedacht. Man kann die URL komplett anonymisieren und so verhindern dass die Jabber-Adresse oder ICQ-Nr. vollst&auml;ndig im Img-Tag steht.</p>
<p></p><h2>ZOMG</h2><br/><a href="http://zomg.alioth.debian.org/" target="_blank">zomg</a> ist eigentlich nur ein ziemlich kleines Script, das mpg123 ansteuert und dar&uuml;ber Musik abspielt. Allerdings kann ZOMG die gespielten Tracks auch gleich an Last.FM &uuml;bermitteln und auch lastfm://-URIs abspielen. Kleines Tool mit gro&szlig;er Wirkung also und ein Muss f&uuml;r jeden Shell-Nutzer (naja, fast). Leider fehlen noch einige Funktionen wie "love" oder "ban".

<p></p><h2>Shell-FM</h2><br/>Bei <a href="http://nex.scrapping.cc/code/shell-fm/" target="_blank">Shell-FM</a> handelt es sich ebenfalls um einen Last.FM-Player f&uuml;r die Konsole. Allerdings liegt hier das Augenmerk viel st&auml;rker auf dem Abspielen von lastfm://-URIs als auf dem Abspielen von lokalen Dateien, so dass er das auch viel besser beherrscht. Die Steuerung funktioniert wunderbar einfach und der Client bietet mindestens die selbe Funktionalit&auml;t wie der von Last.FM angebotene Originalclient. Wenn ich also nur Internetradio abspielen will, w&uuml;rde ich dieses Programm zomg unbedingt vorziehen, nur f&uuml;r lokale Dateien funktioniert es nicht wirklich (aber das tut der grafische Client ja auch nicht)

<p></p><h2>GCalCli</h2><br/>Bei <a href="http://code.google.com/p/gcalcli/" target="_blank">GCalCli</a> handelt es sich um einen ausgewachsenen Client f&uuml;r den Google Calender. Besser noch: Es handelt sich um einen ausgewachsenen Client f&uuml;r die Konsole und um das alles noch zu toppen: er wurde in Python geschrieben. Die Bedienung ist ziemlich einfach, es besteht auch die M&ouml;glichkeit sich grafische Nachrichten f&uuml;r Terminbenachrichtigungen anzeigen zu lassen und auch sonst sieht das Projekt ziemlich ausgereift aus.

<p>Momentan bin ich bereits am &uuml;berlegen ob ich einiges dieser Funktionalit&auml;t nicht in <a href="http://code.google.com/p/pychao" target="_blank">pyChao</a> &uuml;bernehmen sollte. Es w&auml;re doch irgendwie cool mich von meinem IRC-Bot benachrichtigen zu lassen wenn ein neuer Termin ansteht und gleich vom IRC aus f&uuml;r andere Termine vorschlagen zu k&ouml;nnen.</p>
