+++
title = "iBashing"
date = "2008-12-10T09:12:00"
author = "Dr. Azrael Tod"
issoid = "blog/1111"
aliases = "blog/1111"
+++

<p>In letzter Zeit sehe ich immer mehr Leute mit Apple-Ger&auml;ten rumrennen. Gleichzeitig nimmt nat&uuml;rlich das L&auml;stern &uuml;ber die Dinger auch immer mehr zu.</p>
<p>Erst neulich wurde das Thema bei den Simpsons aufgegriffen, andere bezeichnen das iBrick als "Parris Hilton unter den Handys" und auch diverse Blogs schreiben gerne dar&uuml;ber (z.B. <a href="http://fieser-admin.de/allgemein/apple-wenn-marketing-zum-hype-wird/" target="_blank">Fieser Admin</a>)</p>
<p><!--more--></p>
<p>Wenn wir also gereade mal alle so schon am Lachen &uuml;ber diese Deppen sind, die sich f&uuml;r 1-2 KiloEuro ein extrem &uuml;berdimmensioniertes Dongle zu einem brauchbaren Betriebssystem oder einen MP3-Player der Farbe der zugeh&ouml;rigen Kopfh&ouml;rer wegen kaufen... dann wird es evtl. auch mal sinnvoll sich ein paar harte Fakten anzusehen.</p>
<p>Repr&auml;sentativ h&auml;tte ich da mal den Link zu Apples <a href="http://www.apple.com/de/macbookpro/17-inch/specs.html" target="_blank">neuem MacBook Pro</a> (wo ist eigentlich dort das i abgeblieben?). Sicher ein sch&ouml;nes St&uuml;ck Hardware, wenn jemand mir sowas spendieren will w&uuml;rde ich es auf alle F&auml;lle auch annehmen. Dual Core CPU mit 6MB L2 Cache, 4GB Ram, 320GB SATA HDD, 1920x1200 Display mit 17 Zoll Diagonale... ja, da frohlockt doch das Herz eines Hardwarjunkies.</p>
<p>Aber sehen wir erstmal was die entgegengesetzte Fraktion anzubieten hat...</p>
<p>Nehmen wir doch mal ein anderes &uuml;bergro&szlig;es Notebook, mit etwas weniger Prestige das man bezahlen muss und ohne leuchtenden Apfel auf dem Deckel. Und welche Hardwarequelle k&ouml;nnte weniger Prestige anbieten als Aldi? Medion hat zuf&auml;llig ebenfalls <a href="http://www.aldi-sued.de/de/html/offers/2827_9545.htm" target="_blank">ein Notebook mit &auml;hnlichen Spezifikationen</a> im Angebot.</p>
<p>Zugegeben, die CPU ist nicht ganz so schnell, das Display wohl nicht LED-Beleuchtet, der Akku h&auml;llt bestimmt auch nicht wirklich so lange (wobei das bei dieser Klasse wohl nicht so wichtig ist) und wer auch immer auf die bescheuerte Idee gekommen ist ein 32bit WinXP Home mit 4GB Ram auszustatten will ich lieber garnicht wissen.</p>
<p>Man kann also sicher zu Recht behaupten dass das Apple Ger&auml;t dem Akoya in vielen Bereichen etwas &uuml;berlegen ist... aber um den Faktor 3? Das ist n&auml;mlich der Preisunterschied zwischen den beiden Ger&auml;ten, f&uuml;r ein Apple Notebook kann man sich mal eben 3 Medion Notebooks kaufen und hat dann mal eben noch 100&euro; &uuml;brig.</p>
<p>Von Zubeh&ouml;r dass man bei Apple lustigerweise meistens vom Originalhersteller (Fernbedienungen, Grafikadapter, Zusatzakkus, ..) kaufen darf und die sicher auch alle nochmal ein gutes St&uuml;ck teurer sind als beim Discounter haben wir hier noch garnicht geredet.</p>
<p>Also sagt was ihr wollt.. f&uuml;r das Geld kann ich mir auch eine apfelf&ouml;rmige Leuchte selbst auf den Deckel kleben und meine Kopfh&ouml;hrer in Farbe tunken (w&uuml;rde ich nicht ausgerechnet diese beiden Details am allgemeinen Apple-Design potth&auml;sslich finden).</p>
<p>Dazu kann ich nur noch sagen:<br/></p><blockquote><a href="http://www.dailymotion.com/video/x7kr6e_mapple-the-simpsons_fun" target="_blank">I will never get a Mapple-Anything!</a></blockquote><br/>iVerbibsch!
      
    
  <div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_987" onclick="set_comment_reference(987)" title="auf diesen Kommentar antworten">#987</a>:
    11.Dec.2008 12:12
    von
    
      
        <a href="http://var-log.de" target="_blank">
          zypral
        </a>
</p>
<p>Amen!</p>

<p class="infos">
<a href="#comment_988" onclick="set_comment_reference(988)" title="auf diesen Kommentar antworten">#988</a>:
    11.Dec.2008 12:12
    von
    
      
        SirSnookie
      
    
    
  </p>
<p>Ich weiss ja nicht ob ich &Auml;pfel mit Birnen vergleichen w&uuml;rde aber bitte. Dank Umstieg auf die x86 Arch. scheints jedem Deppen aufzuerliegen seinen Heimwerkerpc mit einem Apple-PC vergleichen zu m&uuml;ssen.</p>
<p>Wir m&uuml;ssen nun garnicht weiter rumreden das die Quallit&auml;tsunterschiede zwischen der Butterbrotsdose von Medion zum Alu-Geh&auml;use des Apples f&uuml;r jeden ersichtlich seien sollten.</p>
<p>Auch f&auml;llt in der Aldi-Werbung auf: Keine Akkulaufzeiten (warum wohl?) und nein, ich kaufe mir kein Notebook f&uuml;r 2.500 Euro um es auf dem Schreibtisch stehen zu haben sondern um damit mobil zu arbeiten (Sonst w&uuml;rd ich mir ja nen iMac kaufen ;)).</p>
<p>Grandios find ich ja das Thema Support, hier mal einfach unter den Tisch gekehrt - ich - stolzer Besitzer eines iMacs geh zum n&auml;chsten Apple-Reseller und lass die Kiste reparieren oder ruf dort bei Problemen an. Geh mal in die Aldi-Filiale und frag die Verk&auml;uferin mal etwas zu dem Ger&auml;t. Je nachdem welche Landessprache sie beherrscht wird sie dir unmissverst&auml;ndlich klar machen: "Ich nix Ahnung". Stimmt, Beratung darf man bei dem Preis auch nicht erwarten, steht ja schon in der Anzeige: "Support per Email und Telefon". Bring-In Service? Kundenservice @Home bzw in deiner Stadt? Fehlanzeige. Wenn man immer nur die Hardware vergleicht, ohne all das drumherum ist es klar das man zu solchen Wunschergebnissen kommt, als PC Nutzer. Dar&uuml;ber hinaus muss man sich auch klar machen, wer benutzt eigentlich so ein Apple-Geschoss? Designer, Medienproduzenten und &auml;hnliche wo es nicht auf das Geld sondern auf die Quallit&auml;t der Anzeige drauf an kommt. Klar hat das Apple-Notebook nur 1 Ghz mehr Leistung und pauschal bei Auslieferung 4GB <em>nutzbaren</em> Arbeitsspeicher, aber egal da ja jeder G33k sofort WIN l&ouml;scht und Linwixx drauf pr&uuml;gelt. (Ob da &uuml;berhaupt was unter Linwixx l&auml;uft?)</p>
<p>Wie gesagt, der Vergleich hinkt so sehr, das mir die Kotze gleich wieder ausm Klo hoch kommt. Vergleich doch mal gescheit: Lenovo ThinkPad mit nem PowerBook oder was sch&ouml;nes von Apple oder Dell. Achso geht ja nich: Das Aldi-Angebot w&auml;re ja Hardwarem&auml;&szlig;ig pauschal g&uuml;nstiger als vergleichbare Angebote von Dell, Lenovo, IBM ....</p>

<p class="infos">
<a href="#comment_989" onclick="set_comment_reference(989)" title="auf diesen Kommentar antworten">#989</a>:
    11.Dec.2008 12:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Wo fangen wir denn da an...</p>
<p>Also.. niemand hat gesagt die Angebote w&auml;ren gleichwertig. Ich w&uuml;rde nur gerne mal den sehen, der behauptet das apple-ger&auml;t w&auml;re ernsthaft 3x so wertvoll wie das Aldi-Ding.</p>
<p>Sicher sind verarbeitung, Softwar, Akkuleistung, CPU und viele weitere Dinge besser... aber wenn z.B. die Verarbeitung so mies ist dass das Medion nur die halbe Lebensdauer hat st&ouml;rt das keinen, wir haben noch 2 St&uuml;ck &uuml;brig.</p>
<p>Support ist ein tolles Stichwort. Ich pers&ouml;nlich habe noch bei KEINEM PC den ich je gekauft habe irgendeine Art qualifizierten Support vom Verk&auml;ufer gesehen. Ich habe ihn allerdings auch nicht vermisst. Von daher w&uuml;rde ich das f&uuml;r meine Bed&uuml;rfnisse mal auch ganz weit hinten anstellen. (und wie du so sch&ouml;n bemerkst sind die Apple-K&auml;ufer nicht unbedingt 0815-Nutzer die den support am dringendsten brauchen)</p>
<p>Wer ernsthaft ein 17-18" Notebook kauft um es jeden Tag auf Arbeit zu schleppen und um in Bus und Bahn damit zu arbeiten tut mir &uuml;brigens aufrichtig leid. Das letzte Mal als ich nachgesehen hatte, konnte ich mit M&uuml;h und Not mein Netbook auf die Tische in der Bahn stellen, das w&auml;re mit einem derartigem Notebook etwas schwierig. @Work und @Home hingegen habe zumindest ich meistens irgendeine Netzverbindung in der N&auml;he.<br/>
Ein 17" Notebook richtet sich wohl eher an Leute die einen Desktop-Ersatz wollen bzw. nicht 2 Rechner kaufen wollen.</p>
<p>Die Nutzer sind wohl auch das Problem: Designer, Grafiker, Medienproduzenten... Leute halt die schon von Berufs wegen auf &auml;u&szlig;erlichkeiten fixiert sind. Ich behaupte nicht dass das grunds&auml;tzlich schlecht ist, mir pers&ouml;nlich geht es bei Technik jedoch um Funktion und nicht um Darstellung.<br/>
Aber wenn ich mit einem Notebook angeben will oder ein Statussymbol brauche, komme ich sicher nochmal auf Apple zur&uuml;ck.</p>

<p class="infos">
<a href="#comment_990" onclick="set_comment_reference(990)" title="auf diesen Kommentar antworten">#990</a>:
    11.Dec.2008 09:12
    von
    
      
        <a href="http://codeschmie.de" target="_blank">
          fa
        </a>
</p>
<p>Also son macbook (ohne pro) f&uuml;r unterwegs f&auml;nd ich schon ok, und die sind f&uuml;r knappe 1000 auch eher in der Liga der ThinkPads, die ich qualitativ und leistungsm&auml;&szlig;ig nun einfach mal frech vergleiche.</p>
<p>Aber die MacBook Pro find ich vom Preis schon auch arg &uuml;berteuert, und den angesprochenen, und unbestreitbaren, Hype kann ich auch nicht ganz verstehen<br/>
Im Moment reicht mir allerdings erstmal mein hp nx7010 von 2004 - auch wenn die 1.6 GHz mit der Zeit etwas langsam werden... aber ich hab ja kein Vista und auch kein VMWare laufen :P</p>

<p class="infos">
<a href="#comment_991" onclick="set_comment_reference(991)" title="auf diesen Kommentar antworten">#991</a>:
    11.Dec.2008 09:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Stimmt nat&uuml;rlich.. nicht alles von apple ist gnadenlos &uuml;berteuert. :-)</p>

<p class="infos">
<a href="#comment_992" onclick="set_comment_reference(992)" title="auf diesen Kommentar antworten">#992</a>:
    11.Dec.2008 11:12
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>Komme selber aus dem Apple-Lager .... man muss da wie schon richtig festgestellt wurde sicherlich klare Unterscheide machen. Es war in der Vergangenheit so und wird auch in der Zukunft so sein, dass die Top-Modelle (Pro-Serie) bei Apple nicht preisg&uuml;nstig sind.</p>
<p>Im Ansatz vergleichbare Hardware wird man immer g&uuml;nstiger finden wenngleich das 17" auch ein nicht aktualisiertes Modell ist. Dieses wurde im letzten Neumach-Rausch meines Wissens ignoriert.</p>
<p>So oder so vergleicht man die Top Modelle nahmhafter Anbieter landet man in &auml;hnlichen Preisregionen.</p>
<p>Wobei sicherlich bei Apple wie bei manch anderne Firmen eben auch der Name mitgekauft wird..... und ich w&uuml;rde es als Firma genauso machen, es funktioniert offensichtlich hehe.</p>
<p>At work verwenden wir viele Macs und so kam auch mein Wechsel zustanden - bin hochzufrieden mit dem OS (die Hardware ist mir weniger wichtig), was f&uuml;r mich immer als User immer noch das Kernargument ist...sprich ich w&uuml;rde mir auch ein Thinkpad (dai ch mit denen Hardware-seitig nur gute ERfahrungen gemacht habe) kaufen wenn ich darauf problemslos und ohne Frickelei langfristig mein OSX laufen lassen k&ouml;nnte.<br/>
Warum ?<br/>
Weil ich selten so ein stressfreies OS f&uuml;r den Heimgebrauch hatte und nach x Stunden Admin-T&auml;tigkeit nicht zuhause auch noch administrieren will. Debian at home lief lange, war aber bedeutend mehr arbeit, zumindest f&uuml;r mich.</p>
<p>Der aktuelle Hype um Macs in der Usermasse ist gerade f&uuml;r Langzeit-Mac-Verwender etwas sehr eigenartiges....merke ich bei meinem Kollegen immer wieder und missf&auml;llt gerade dieser Schicht absolut.</p>
<p>Denke so hat jeder seine eigene Erkl&auml;rung f&uuml;r seine OS &amp; Hardware-Wahl =)</p>

<p class="infos">
<a href="#comment_993" onclick="set_comment_reference(993)" title="auf diesen Kommentar antworten">#993</a>:
    11.Dec.2008 11:12
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>achso: das i gibts bei den Laptops seit dem Intel-WEchsel nicht mehr.<br/>
inzwischen wird das ganze als:<br/>
Macbook, MacbookPro und MacbookAir bezeichnet.</p>
<p>Gerade das Air w&auml;re ein viel einfacheres Ziel f&uuml;r Bashing um zur&uuml;ck auf das Grundthema zu kommen =)</p>
<p>Lenovo selber hatte da mal ein nettes Video parat:<br/>
<a href="http://www.youtube.com/watch?v=_hnOCUkbix0%3C/p%3E" rel="nofollow">http://www.youtube.com...</a>
</p>
<p class="infos">
<a href="#comment_994" onclick="set_comment_reference(994)" title="auf diesen Kommentar antworten">#994</a>:
    11.Dec.2008 11:12
    von
    
      
        <a href="http://friedenspanzer.blog.de/" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Noch lustiger kann es hier nur werden wenn jemand einen Vergleich zwischen Windows und Linux zieht. Hm...</p>
<p>Windows sieht sch&ouml;ner aus und bringt mehr Treiber mit! Linux ist Frickelkram! Pinguine haben kleine Schw&auml;nze!</p>
<p>Mensch Kinder, fasst euch doch mal an den H&auml;nden und habt euch lieb. Wenn DAT am liebsten einen billigen PC mit Linux, SirSnookie am liebsten einen Mac und ich am liebsten einen teuren PC mit Windows habe ist das doch in Ordnung, ihr Computer-Faschisten ;)</p>

<p class="infos">
<a href="#comment_995" onclick="set_comment_reference(995)" title="auf diesen Kommentar antworten">#995</a>:
    11.Dec.2008 11:12
    von
    
      
        <a href="http://friedenspanzer.blog.de/" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Da in einem Satz oben ein n fehlt und ich richtigstellen will, dass es nicht an mangelnden grammatikalischen Kenntnissen sondern nur der F&auml;higkeit richtig zu Tippen fehlt h&auml;nge ich es hier an: n.</p>

<p class="infos">
<a href="#comment_996" onclick="set_comment_reference(996)" title="auf diesen Kommentar antworten">#996</a>:
    11.Dec.2008 11:12
    von
    
      <a href="/blog/author/toranor/">
        toranor
      </a>
</p>
<p>2500 euro f&uuml;r nen mittelklasse notebook.<br/>
ich hab im februar 07 (also vor fast 2 jaheren) ein notebook, welches das aktuelle macbook pro in sachen leistung das wasser reicht f&uuml;r 1400 euro von dell gekauft. (gut, der proz ist etwas schw&auml;cher, damals gabs nix gr&ouml;sseres, ansonsten hab ich 8x dvd-+-rwdl, 17'' display 1920er aufl&ouml;sung, 320gb hdd, 4 gig ram (ok, ich hab f&uuml;r 70euro 2 gig nachger&uuml;stet)). und wehe mir kommt einer mit dell ist nicht bekannt, oder die qualit&auml;t von dell ist schlecht, ist leider beides nicht der fall.<br/>
schauen wir mal , was wir f&uuml;r 2500 euro so bekommen <em>k&ouml;nnten</em>:</p>
<p>alienware:<br/>
- f&uuml;r das gleiche geld kriegt man ne graka mehr</p>
<p>dell:<br/>
- man bekommt 2 bessere grakas(8800m) (um l&auml;ngen besser) und ne gr&ouml;ssere hdd.</p>
<p>one:<br/>
- ne bessere graka (9800m) ne gr&ouml;ssere hdd und nen schnellern proz.</p>
<p>ergo: das macbook ist einfach nur scheisse teuer.</p>

<p class="infos">
<a href="#comment_997" onclick="set_comment_reference(997)" title="auf diesen Kommentar antworten">#997</a>:
    11.Dec.2008 12:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Weil ich gerade aktuell mal dar&uuml;ber gestolpert bin mal ein Link dazu, wie toll der Support bei Apple ist... Das scheint also auch nicht die Grube zu sein in der das Geld versickert.</p>
<p>http://neunzehn72.de/time-maschine-zerstort-meine-festplatten/</p>

<p class="infos">
<a href="#comment_998" onclick="set_comment_reference(998)" title="auf diesen Kommentar antworten">#998</a>:
    08.Jan.2009 12:01
    von
    
      
        <a href="http://www.real-satire.de" target="_blank">
          Real Satire
        </a>
</p>
<p>Ich hatte vor Jahren einmal das Problem, einen Monitor ausm Aldi ersetzen zu lassen. Die kamen zu mir nach Hause und ham den anstandslos ausgetauscht. Soviel zum Thema Aldi-Service.</p>

<p class="infos">
<a href="#comment_999" onclick="set_comment_reference(999)" title="auf diesen Kommentar antworten">#999</a>:
    08.Jan.2009 01:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Bildschirme haben diesbez&uuml;glich etwas eine Sonderstellung... dort schlie&szlig;en (historisch gewachsen) die Hersteller meist Vertr&auml;ge mit lokalen Dienstleistern ab, die dann eigentlich immer vorbei kommen und die Ger&auml;te gleich vor Ort umtauschen.</p>
</div>