+++
title = "Krieg"
date = "2015-12-02T04:12:00"
author = "Dr. Azrael Tod"
tags = ["Politik", "Pseudoargumente", "Sprache"]
issoid = "blog/1632"
aliases = "blog/1632"
+++

<p>Deutschland zieht in den Krieg... <a href="http://www.harmbengen.de/toonpool/2015%2012%2002%20tornado-selfies_2601415.jpg" target="_blank">oder halt nicht</a>?</p>
<p>Zum Gl&uuml;ck hat es die stellvertretende Regierungssprecherin Christiane Wirtz klar und deutlich gesagt:<br/></p><blockquote>Das Ziel des Einsatzes der Bundeswehr in Syrien ist eindeutig definiert. Es lautet: Krieg gegen den Terror.</blockquote>
<p>Also Krieg!</p>
<p>Andernseits hat sie hinterher gleich eingeschr&auml;nkt:<br/></p><blockquote>...dass Krieg im v&ouml;lkerrechtlichen Sinne nat&uuml;rlich eine Auseinandersetzung zwischen zwei Staaten ist</blockquote><br/>Und da die Bundesregierung den Daesh (oder "IS"/"ISIS" wie das Ding gern' genannt werden will) gerade nicht f&uuml;r einen Staat h&auml;lt... sollte laut Wirtz, das Wort Krieg nur im<br/><blockquote>umgangssprachlichen Sinne verstanden wissen.</blockquote>
<p>Also ein "Einsatz" mit dem Ziel eines umgangssprachlichen der Krieges gegen den Terror.</p>
<p>...also kein Krieg.</p>
<p>Unsere Verteidigungsministerin Ursula von der Leyen stimmt ihr da auch zu:</p>
<p></p><blockquote>Wir w&uuml;rden ja dem IS eher einen Gefallen tun, wenn wir in diese Rhetorik verfallen w&uuml;rden [...] Er ist kein Staat, sondern eine Terrorbande, menschenverachtend, sehr ernst zu nehmen, sehr schwer zu bek&auml;mpfen, aber er ist kein anderer Staat.</blockquote>
<p>...also kein Krieg.</p>
<p>Jetzt folgen wir aber dem Ruf von Frankreichs Ministerpr&auml;sidenten Fran&ccedil;ois Hollande. Der rief' halt zum Krieg gegen den IS auf!</p>
<p>...also Krieg?</p>
<p>Aber das Entkr&auml;ftet unsere Leyen-Politikerin:<br/></p><blockquote>[das habe etwas mit Emotionalit&auml;t nach den Pariser Anschl&auml;gen zu tun] aus der heraus er dieses Wort gebraucht hat.</blockquote>
<p>...also kein wirklicher Krieg!</p>
<p>Jetzt hat dieser aber seine Worte absichtlich so gew&auml;hlt. Denn nur wenn es ein Staat ist der den anderen angreift, kann man von einem B&uuml;ndnisfall reden.</p>
<p></p><blockquote>sowohl das V&ouml;lker- als auch das Europarecht setzen f&uuml;r die milit&auml;rischen Ma&szlig;nahmen, mit denen Frankreich auf die Anschl&auml;ge reagiert hat, einen bewaffneten Angriff von au&szlig;en auf das Hoheitsgebiet eines Staates voraus.

<p>Aus einem solchen kriegerischen Akt folgt das naturgegebene Recht zur Selbstverteidigung, so steht es in Artikel 51 der Charta der Vereinten Nationen. Und gem&auml;&szlig; Artikel 42 Absatz 7 der EU-Vertr&auml;ge schulden die Mitgliedsstaaten einem angegriffenen Land "alle in ihrer Macht stehende Unterst&uuml;tzung".</p></blockquote>
<p>Darauf berufen wir uns auch <a href="https://de.wikipedia.org/wiki/Bundeswehreinsatz_in_Syrien#Rechtsgrundlage" target="_blank">im Mandatstext f&uuml;r besagten Bundeswehreinsatz</a> (bezieht sich Ausdr&uuml;cklich auf Artikel 51 UN-Charta und Artikel 42 EU-Vertrag, soll &uuml;brigens <a href="http://m.welt.de/politik/deutschland/article149475833/Anti-IS-Einsatz-wird-weit-mehr-als-10-Jahre-dauern.html" target="_blank">auch nur 10 Jahre dauern</a>)</p>
<p>...definitiv Krieg!</p>
<p>Aber wenigstens ist es eindeutig und v&ouml;llig Widerspruchsfrei was wir hier tun!</p>
<p></p><div style="text-align: center;"><iframe allowfullscreen="" frameborder="0" height="315" src="https://www.youtube.com/embed/KdDULYzDBvg" width="560"></iframe></div>
<p><b>Achja:</b></p>
<p>Egal ob es jetzt Krieg oder nicht Krieg ist, es ist ist jedenfalls gut <a href="http://www.sueddeutsche.de/politik/bundeswehr-von-der-leyen-spricht-von-breitem-spielraum-beim-tornado-einsatz-1.2763796">dass wir unvorbereitet sind</a>!</p>
<p></p><blockquote>H&auml;lfte der "Tornados" nicht einsatzbereit (30) - Von der Leyen: Wir brauchen nur sechs</blockquote>
<p>Denn die <a href="http://dejure.org/gesetze/StGB/80.html">Vorbereitung eines Angriffskrieges ist in Deutschland strafbar</a>. Unvorbereitet einen zu f&uuml;hren ist aber ok.</p>
<p></p><blockquote>Nach dem eindeutigen Wortlaut der Vorschrift ist nur die Vorbereitung an einem Angriffskrieg und nicht der Angriffskrieg selbst strafbar, so dass auch die Beteiligung an einem von anderen vorbereiteten Angriffskrieg nicht strafbar ist</blockquote><br/>(Generalbundesanwalt, 26.01.2006, Az. 3 ARP 8/06-3)
      
    
  