+++
title = "Personal(w/qu)ahl!"
date = "2008-10-08T03:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/908"
aliases = "blog/908"
+++

<p>Kann mir mal einer erkl&auml;ren was der tolle Vorteil eines indirekten Wahlsystems sein soll? Ich steh da n&auml;mlich gerade etwas auf dem Schlauch...</p>
<p>Warum haben wir in Deutschland kein System, in dem sich jeder Politiker einzeln f&uuml;r seine Entscheidungen verantworten muss? Warum kann man immer alles auf die Partei abw&auml;lzen?<!--more--><br/>Ich mein: Die Amerikaner sind doch sonst immer DAS tolle Vorbild f&uuml;r alles.. privatisiertes Gesundheitssystem (selbst das System von Kuba ist nachweislich besser), eine RICHTIG freie Marktwirtschaft (wir sehen ja gerade wohin das f&uuml;hrt) und alle m&ouml;glichen anderen Verschlimmbesserungen wollten die Politiker doch auch in den letzten Jahren m&ouml;glichst &uuml;bernehmen. Warum also nicht unser Wahlsystem etwas direkter an das dortige anlehnen?</p>
<p>Es kann doch nicht der Sinn einer Abstimmung sein, dass die Abgeordneten 1:1 die gleichen Ergebnisse liefern, wie die Parteien als Sitzverteilung im Saal anwesend sind. Wenn das der Sinn w&auml;re, k&ouml;nnten wir gleich sagen dass das die Parteien intern l&ouml;sen sollen und dann nur noch die Vertreter f&uuml;r die jeweilige Fraktion vortreten m&uuml;ssen.<br/>Das w&auml;re &uuml;brigens wieder ein Punkt, der uns enorm Geh&auml;lter einsparen k&ouml;nnte.</p>
<p>Mal an die Abgeordneten gerichtet ausgedr&uuml;ckt: Ihr seid nicht eurer Partei verpflichtet sondern euerem eigenen Gewissen und dem deutschen Volk das euch gew&auml;hlt hat! Wenn ihr gegen einen Entschluss seid ist es GRUNDFALSCH daf&uuml;r zu stimmen, wie dies ja <a href="http://www.heise.de/newsticker/SPD-Abgeordnete-bauen-auf-Karlsruhe-bei-der-Vorratsdatenspeicherung--/meldung/98821" target="_blank">offensichtlich getan wird</a>. Dies gilt &uuml;brigens doppelt, wenn ihr der Meinung seid dass euren W&auml;hlern die Entscheidung so besser gefallen w&uuml;rde.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_733" onclick="set_comment_reference(733)" title="auf diesen Kommentar antworten">#733</a>:
    08.Oct.2008 04:10
    von
    
      
        <a href="http://www.wangoo.de/2008/10/dem-deutschen-volke-wahlen-zum-whlen/" target="_blank">
          Dem deutschen Volke&amp;#8230; Wahlen zum W&amp;auml;hlen | Wangoo Blog
        </a>
</p>
<p>[...] hat in seinem Blog den passenden Beitrag dazu.   Tags &raquo;   Trackback: Trackback-URL&nbsp;|&nbsp;Feed zum Beitrag: RSS 2.0Thema: [...]</p>
</div>