+++
title = "WOPR-Ersatz: Mini2.0"
date = "2015-03-14T10:03:00"
author = "Dr. Azrael Tod"
tags = ["Hardware", "Nerdig", "PC", "Technik"]
issoid = "blog/1610"
aliases = "blog/1610"
+++

<p>Mini? WOPR? Wat?<br/>Das sind Namen meiner bis gerade aktiven Rechner im Heimnetz. Beide sind &auml;hnlich alt, haben jedoch v&ouml;llig unterschiedliche Einsatzzwecke.</p>
<p></p><ul><li>kleine, leise Mediacenter-Kiste</li><li>l&auml;rmender Spiele-Rechner</li></ul>
<p></p><h3>Mini</h3><br/>Bei Mini handelt es sich um ein <a href="https://www.google.de/search?q=shuttle+x27d&amp;safe=off&amp;tbm=isch">Shuttle X27d</a> (<a href="http://www.shuttle.eu/de/produkte/discontinued/barebones/x27d/spezifikation/">Daten</a>), das w&auml;re ein typisches thin-mini-ITX-Ger&auml;t, wenn es diesen Standard zur Entwicklungszeit damals schon gegeben h&auml;tte. Stattdessen enth&auml;lt die Kiste ein recht Flaches Brett mit einem aktiv gek&uuml;hltem Atom330, eine Art fest verbauter, propriet&auml;rer pico-PSU und Platz f&uuml;r 2 Laufwerke, typischerweise 1x 2,5" HDD und 1x Slimline DVD (in meinem Fall 2 HDDs)

<p><b>Fazit</b>: super Geh&auml;use, Atom 330 war damals schon schei&szlig;e, aber minimal besser als die Via Nano-Kiste die ich vorher hatte. Problem: reicht halt nicht f&uuml;r ordentliche Video-Wiedergabe oder was auch immer ich sonst auf meinem Mediacenter tun will und frisst zu viel Strom und ist zu laut um ihn 24/7 laufen zu lassen. Total &uuml;berraschend (nicht) war der L&uuml;fter auch schon immer die gr&ouml;&szlig;te Schwachstelle und gab irgendwann in den letzten Monaten komplett den Geist auf.<br/><a href="/2012/1/23/Nachfolge-f%C3%BCr-mein-MediaserverNAS">Aus genau dem Grund</a> wurde Mini jetzt durch ein Cubietruck ersetzt. Mehr dazu wenn ich die Kiste ein paar Monate l&auml;nger verwendet hab.</p>
<p></p><h3>WOPR</h3><br/>WOPR im Gegensatz war genau das was der Name vermuten l&auml;sst. <a href="/2009/05/04/because-i-can!/">Eine gro&szlig;e, laute Kiste mit blinkenden (nicht wirklich) L&auml;mpchen, die haupts&auml;chlich auf Leistung ausgelegt ist.</a> Der Name klingt heute um L&auml;ngen passender als damals, da ich mit selbigen auchnautomatisch eine &uuml;berholte Vorstellung, wie gute/schnelle/moderne Rechner funktionieren sollen, verbinde.<br/>Die Ausstattung damals:<br/><blockquote><ul><li>Intel Core 2 Duo Prozessor E8500</li><li>ATI Radeon HD4870 PCI-E</li><li>4GB DDR2 (PC2-6400)</li><li>Mainboard: ASUS P5N-D</li><li>CPU K&uuml;hler: Akasa AK-956CP K&uuml;hler</li><li>Geh&auml;use: Thermaltake Armor JR Midi Tower (Schwarz)</li><li>Netzteil: 450 Watt BeQuiet</li><li>mechanische Festplatte 500 GB SATA</li><li>optisches Laufwerk, Front-USB/Kartenleser, ...</li></ul></blockquote><br/><b>Fazit</b>: eine verdammt laute, gro&szlig;e, stromfressende Kiste. Die Festplatte ist weder sonderlich schnell noch ausreichend gro&szlig; (auch damals h&auml;tte ich eine SSD kaufen sollen) und der RAM ist unterdimmensioniert. Oben drauf hat man unter Linux mit der Grafikkarte so wenig Spa&szlig; (AMD-Treibersupport ist unter aller Sau) dass ich mir diese fast v&ouml;llig h&auml;tte sparen k&ouml;nnen. Das Geh&auml;use ist schick, aber gr&ouml;&szlig;tenteils Leer und "aufr&uuml;sten" ist 

<p></p><h3>Mini 2.0 - Hybrid</h3><br/>Ziel ist es nun mehr Leistung als bei WOPR in das &uuml;brig gebliebene Geh&auml;use von Mini zu packen. Das ganze nat&uuml;rlich m&ouml;glichst ger&auml;uscharm, k&uuml;hl, stromsparend und billig.<br/>Bestellt habe ich jetzt erstmal:<br/><ul><li>Asus H81T thin-Mini-ITX-Board f&uuml;r Sockel 1150</li><li>8GB RAM</li><li>Intel Core i3-4130T (stromsparende Variante des aktuellen i3)</li><li>120GB mSATA-SSD</li><li>COOLTEK ITX30 CPU-L&uuml;fter (aktiver L&uuml;fter mit 3cm Bauh&ouml;he)</li><li>GPU: Intel HD 4400 (on-chip)</li></ul><br/>Leider ist es halt nicht ganz passiv geworden, aber vlt. reicht die K&uuml;hlleistung auch ohne Ventilator aus, das bleibt noch abzuwarten.  Hauptsache ist erstmal dass der L&uuml;fter &uuml;berhaupt unter die Laufwerksk&auml;fige passt und ich mir die M&ouml;glichkeit f&uuml;r zus&auml;tzliche Film-Festplatte(n) und optisches Laufwerk nicht auf dauer verbau.<br/>Der bereits eingebaute Spannungswandler fliegt weg, da das Motherboard einen mitbringt. Mit einem toten Anschluss f&uuml;r das alte Netzteil am Geh&auml;use kann ich leben.

<p>Der einzige Teil der nach dem Umbau langsamer als bei WOPR sein wird, ist die Grafik. Nachdem ich aber in den letzten Jahren kaum noch ernsthaft gespielt habe und wenn, dann eigentlich nur Android-Zeugs, GOG.com-gekauftes oder Morrowind/UT2k4/RedEclipse, ist das eher irrelevant. Au&szlig;erdem habe ich ja bereits erw&auml;hnt dass die Treiber f&uuml;r die ATI/AMD-Karte so schlecht sind, dass ich fast schon besser mit meinem Bay-Trail-Atom unter Windows spielen kann. Damit sollte sich auch da nicht viel verschlechtern.</p>
<p>Dienstag/Mittwoch sollte die neue Hardware geliefert werden, dann werden wir ja sehen ob das alles so funktioniert wie ich es mir gedacht habe oder ob das mit dem ersten mal PC aufr&uuml;sten seit einem Dutzend Jahren eine Schnappsidee war.</p>
