+++
title = "Opensource ist gescheitert"
date = "2014-04-15T07:04:00"
author = "Dr. Azrael Tod"
tags = ["\"Freie\" Software", "Nerdig", "Open Source", "Pseudoargumente", "Quählkot", "Rant", "Softwareschrott", "Säue durchs Dorf treiben", "Technik"]
issoid = "blog/1585"
aliases = "blog/1585"
+++

<p>Ach ja... <a href="http://de.wikipedia.org/wiki/Heartbleed" target="_blank" title="Wikipedia: Heartbleed-Sicherheitsl&uuml;cke in OpenSSL">Heartbleed</a>.<br/>Da gibt es ja jetzt die sch&ouml;nste Panik und jede Menge Leute die wie ein kopfloses Huhn durch die Gegend rennen und panisch rufen "OpenSource ist gescheitert".<br/>Gestern erst hab ich es beim &Ouml;R-Rundfunk geh&ouml;rt (zusammen mit "da muss man jetzt auch konzeptuell dar&uuml;ber nachdenken wie man das besser machen kann") und gerade eben <a href="http://blog.fefe.de/?ts=adb29937" target="_blank" title="Frontalangriffs-Fefe">hat selbst Fefe noch einen v&ouml;llig Thema verfehlenden Rant dar&uuml;ber abgelassen dass das alle sagen w&uuml;rden</a>.</p>
<p></p><blockquote>Ach na super. Jetzt passiert, was ich schon bef&uuml;rchtet habe. <a href="http://www.zeit.de/digital/internet/2014-04/heartbleed-openssl-open-source-heilsversprechen" target="_blank">Der Frontalangriff auf Open Source</a>. Da ist von "Heilsversprechen" die Rede, und dass man das jetzt professionalisieren m&uuml;sse. Die Programmierer m&uuml;ssen bezahlt werde! 

<p>Das muss wie ein Unternehmen gef&uuml;hrt werden!</p></blockquote>
<p>Ich antworte: <b>WAS ZUM FICK IST FALSCH MIT EUCH?</b></p>
<p>Nein, OpenSource ist bei Heartbleed genau so wenig gescheitert wie wenn ein Bug in Microsoft-Betriebssystemen, den seit 10 Jahren keiner gesehen hat, bedeutet dass Closett-Source gescheitert ist.<br/>Der Sinn von OpenSource ist "Freiheit". OpenSource ist vlt. gescheitert wenn wir nur noch so <a href="/2011/5/24/Zurechtgepoettert" title="G33KY: Zurechtgepoettert">undurchsichtigen Schrott wie libPoettering rumliegen haben die alles tun und wo keiner mehr durchsieht</a>.<br/>OpenSource ist vlt. gescheitert wenn keiner mehr sowas entwickelt.<br/>OpenSource ist vlt. gescheitert wenn Google und Co. krampfhaft versuchen den Code weg von GPL zu BSD/MIT-Lizenzen zu bewegen um mehr ihrer propriet&auml;ren Softwareschei&szlig;e zu bundlen und mit Android ein quasi-geschlossenes System aus urspr&uuml;nglich mal offenen Bauteilen aufzubauen.</p>
<p>OpenSource ist <strong>NICHT GESCHEITERT</strong> wenn wir eine Bibliothek aus solchem haben, diese von millionen verwendet wird und es in dieser einen Fehler gibt, der entdeckt wird und in k&uuml;rzerer Zeit behoben wird.<br/>Dann hat OpenSource sein Ziel erreicht!<br/>Software zu schreiben die Freiheiten f&ouml;rdert und von vielen Personen/Organisationen eingesetzt wird ist das Ziel.</p>
<p>Dann ist nichtmal OpenSSL gescheitert. Denn offensichtlich wird OpenSSL verwendet. Welchen besseren Beweis daf&uuml;r k&ouml;nnte es geben? OpenSSL hat jetzt ein Ruf-Problem und wahrscheinlich auch ein Softwarequalit&auml;tsproblem. Ich w&uuml;rde sogar sagen OpenSSL hat mindestens 2-3 konzeptuelle Probleme, aber ein Problem hat es nicht: OpenSource.</p>
<p>Der Unterschied zwischen OpenSource und unfreiem ist halt eben nicht dass dieser Fehler bei unfreiem entdeckt worden w&auml;re. Unfreier Code w&auml;re f&uuml;r diesen Einsatzzweck niemals so gro&szlig;fl&auml;chig verbreitet worden. Das w&auml;re in diesem speziellen Fall vlt. sogar von Vorteil gewesen, aber wir haben ja genug Stellen wo sich unfreier Code marktf&uuml;hrend durchgesetzt hat.</p>
<p>Jeder der glaubt dass unfreier Code solch ein Problem nicht hat, der kann jetzt beruhigt Windows XP weiterverwenden. Schlie&szlig;lich ist das seit Jahren gut erprobter, unfreier Code, mit marktwirtschaftlich organisierter Qualit&auml;tskontrolle.</p>
<p>Wenn also unfreier Code keine solchen jahrelang unentdeckten, katastrophalen Fehler enthalten k&ouml;nnte, dann w&auml;re Windows XP jetzt DAS Betriebssystem der Wahl.</p>
<p></p><h3>Aber es sind Dinge gescheitert</h3>
<p>Ja. <br/>Was ist gescheitert? Die Qualit&auml;tskontrolle bei OpenSSL ist offensichtlich &uuml;ber Jahre hinweg gescheitert. Diese C-basierenden Sprachen scheitern schon ewig daran Speicherzugriffssicherheit herzustellen. Softwarediversifikation, die uns davor bewahren sollte dass jeder genau das gleiche St&uuml;ck Software einsetzt, ist m&ouml;glicherweise gescheitert. Und <a href="http://blog.fefe.de/?ts=adb50052" target="_blank" title="schon wieder Fefe...">SSL-Zertifikate scheitern sowieso</a> permanent.</p>
<p>Gescheitert ist auch dass Leute die Code verwenden, diesen zumindest mal ansehen sollten. Das muss nicht jeder tun. Sicherlich versteht nicht jeder jedes Detail was eine SSL-Bibliothek tut. Da w&auml;re der Nutzen minimal.<br/>Aber zumindest Codequalit&auml;t und Verst&auml;ndlichkeit seiner verwendeten Bibliotheken sollte man mal grob &uuml;berfliegen. Das haben kaum Leute getan.<br/>Es gibt jede menge sehr lukrativer Projekte, sowohl OpenSource als auch unfrei, die OpenSSL verwendet haben. keiner von denen hat sich hingesetzt und mal den OpenSSL-Code ernsthaft auf Fehler untersucht.<br/>Man k&ouml;nnte also direkt sagen: <strong>Marktwirtschaftlich orientiert entwickelter Code ist hier grandios gescheitert.</strong></p>
<p><strong>Die Presse ist gescheitert</strong>. Sie hat ihre Informationspflicht nicht erf&uuml;llt. Nirgendwo in der nicht-technikaffinen Presse habe ich auch nur eine Erkl&auml;rung zu diesem Thema gefunden die OpenSource oder auch nur Heartbleed weit genug verstanden hat um das Problem zu erkl&auml;ren.</p>
<p>Wir haben Dinge wie <a href="http://de.wikipedia.org/wiki/Bundesamt_f%C3%BCr_Sicherheit_in_der_Informationstechnik" target="_blank" title="Wikipedia: Bundesamt f&uuml;r Sicherheit in der Informationstechnik">das BSI</a> und unser <a href="http://de.wikipedia.org/wiki/Nationales_Cyber-Abwehrzentrum" target="_blank" title="Wikipedia: Nationales Cyber-Abwehrzentrum">nationales Zaiber-Abwehrzentrum</a>. Andere L&auml;nder haben &auml;hnlichen Schei&szlig;. Selbst bei Polizei und Geheimdiensten k&ouml;nnte man sich eine Pflicht zusammen reimen wie die daf&uuml;r verantwortlich sind uns vor solchen Dingen zu sch&uuml;tzen.</p>
<p>Die M&ouml;glichkeiten waren da. Der Sourcecode ist verf&uuml;gbar. Sie h&auml;tten nur Geld in die Hand nehmen m&uuml;ssen und Infrastruktur auf Schwachstellen untersuchen m&uuml;ssen.</p>
<p>Wenn die Aufgaben dieser Beh&ouml;rden enthalten uns vor Sicherheitsproblemen in wichtiger IT-Infrastruktur zu sch&uuml;tzen. Was haben die dann getan? Gerade hier, bei offensichtlichen Problemen in grundlegender Infrastruktur, fragt keiner wozu wir diese Zentren haben.<br/>Warum bezahlen die nicht mal Code-Audits von Linux, OpenSSL, verbreiteten SQL-Datenbanken, Webservern und &auml;hnlichem?</p>
<p><strong>Diese Regierungs-Institutionen sind gescheitert</strong>. Sie haben ihre Aufgabe nicht erf&uuml;llt.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1676" onclick="set_comment_reference(1676)" title="auf diesen Kommentar antworten">#1676</a>:
    25.Apr.2014 10:04
    von
    
      
        <a href="http://www.netzweit.de/" target="_blank">
          Peter Macheli
        </a>
</p>
<p>Recht haste. In allen Punkten! Auch wenn es kribbelt und ich gern ein paar Kommata hinzuf&uuml;gen w&uuml;rde, um die Lesbarkeit Deines Codes zu verbessern. Trotzdem, volle Zustimmung, besonders nochmal zum zweiten Teil!</p>
</div>