+++
title = "SMS und RSS"
date = "2009-03-11T01:03:00"
author = "Dr. Azrael Tod"
tags = ["Rant", "Softwareschrott", "Technik", "Telefon"]
issoid = "blog/1302"
aliases = "blog/1302"
+++

<p>Mir ist gerade aufgefallen dass SMS und RSS so ziemlich vergleichbare Technologien sind. Beides ist jeweils eigentlich eine ziemlich beschissene L&ouml;sung die sich ziemlich weit verbreitet hat, beides k&ouml;nnte man viel eleganter l&ouml;sen.. wenn irgendjemand Interesse daran h&auml;tte und dennoch sind beides Dinge die ich relativ oft verwende (bei SMS eher weniger, zumindest wenn man "oft" als die Menge festlegt die andere daf&uuml;r halten). Das nat&uuml;rlich obwohl ich das System f&uuml;r so schlecht wie irgendwie m&ouml;glich halte.<!--more--></p>
<p>Bei SMS (oder auch Short Message Service, wehe ich h&ouml;re noch einmal den Kommentar dass mir jemand eine "SMS-Nachricht" aufs "Handy" schicken will!) handelt es sich eigentlich um die Idee dass man mit nicht-ben&ouml;tigten Sendebl&ouml;cken im Netz doch eigentlich auch irgendwelche Daten &uuml;bertragen k&ouml;nne. Gesagt, getan und schwups haben wir ein Nachrichtensystem das den Provider nichts kostet und J&auml;hrlich riesige <a href="/fid/308">Gewinne</a> <a href="/fid/265">abwirft</a>.</p>
<p>Das beste an diesem System kommt aber noch: 160 Zeichen (Die Menge die sich aus der Blockgr&ouml;&szlig;e ergibt) sind gerade so gro&szlig;, dass permanent Leute diese Grenze &uuml;berschreiten. Was tut man also? Man h&auml;ngt mehrere Bl&ouml;cke hintereinander und bereichnet jeden einzeln. Ein Antwortsystem baut man sich auf die selbe Art, wer auch nur wieder ein Ja/Nein zur&uuml;ckgeben will zahlt gleich noch eine Nachricht. Alternativ kann man nat&uuml;rlich auch Nachrichten an mehrere Leute senden... also mehrmals die Gleiche absenden und f&uuml;r jeden Empf&auml;nger erneut bezahlen.<br/>V&ouml;llig unbeachtet davon: eine solche Nachricht kostet meistens fast den gleichen Betrag wie eine Minute gespr&auml;ch via Telefon. Ich m&ouml;chte jetzt doch schon gerne mal sehen wer es nicht schafft in 60sec den Informationsgehalt von 160 Zeichen  per Stimme zu &uuml;bertragen.</p>
<p>Dazu kommt dann nat&uuml;rlich noch das Eingabeproblem, wodurch man erstmal wieder alle m&ouml;glichen neuen Ideen f&uuml;r Telefontastaturen oder neue Software verkaufen kann. Nat&uuml;rlich keine brauchbaren, dann k&ouml;nnten die Nutzer ja bei einem System bleiben und br&auml;uchten kein Geld mehr auszugeben.</p>
<p><a href="http://de.wikipedia.org/wiki/RSS" target="_blank">RSS</a> hingegen (kurzform f&uuml;r Really Stupid Syndication) ist ein gaaaanz ganz tolles Polling-Format auf XML-Basis (und wie wir ja alle wissen ist XML schon rein grunds&auml;tzlich toll). Polling an sich sagt einfach schon genug aus und <a href="/2008/08/28/newsfeeds-defective-by-design/">ich werde bestimmt jetzt nicht anfangen wieder alle Nachteile dieses Systemes aufzuf&uuml;hren</a>. Die Twitter-Generation scheint eh nie zu verstehen dass es eben NICHT "echtzeit" bedeutet wenn ich alle 5min nachsehe ob es etwas neues gibt.</p>
<p>Trotz aller Fehler und Idiotien die bereits die Grundideen hinter diesen Systemen beinhalten, nutze ich diesen Mist, genau wie all die anderen Deppen. Warum?<br/>Der Grund ist einfach.. alle anderen tun es auch!!!!!!111111einseinself</p>
<p>Das nervt mich echt.. ich kann meine Termin-Erinnerungen via SMS aufs Handy bekommen, viele Leute in meiner Umgebung senden mir Kurznachrichten um mich schnell was zu fragen, meine Daten zwischen diesen vielen "tollen" Web2.0-Diensten tausche ich via RSS/Atom aus und selbst unser <a href="http://code.google.com/p/pychao" target="_blank">Python-IRC-Bot</a> <a href="/feed/facts">schreibt</a> und liest diese Feeds (fast schon mehr als er andere Dinge tut).</p>
<p>Es ist irgendwie auch keine Besserung in Aussicht... es gibt ja bereits anerkannte L&ouml;sungen die alle Verwenden, warum sollte man dann schwach Verbreitete Sachen wie z.B. <a href="http://xmpp.org/extensions/xep-0060.html" target="_blank">Jabber-Pubsub</a> verwenden und quasi das Rad neu erfinden?</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1204" onclick="set_comment_reference(1204)" title="auf diesen Kommentar antworten">#1204</a>:
    11.Mar.2009 10:03
    von
    
      
        <a href="http://ag7.alltagsgrauen.info/" target="_blank">
          fwolf
        </a>
</p>
<p>Zum Thema SMS: In letzter Zeit kommen ja immer mehr so Handys etc. mit der "neuen" Idee namens QUERTZ/Y-Tastatur auf den Markt. Damit geht das nat&uuml;rlich recht fix.</p>
<p>Tja. Ich kann das schon sehr lange geniesen - mein Akku spinnt zwar manchmal, und das Handy an sich ist schon ein ziemlicher Business-Schlagstock, aber: An mein SK65 kommt echt nix ran, was die Bedienbarkeit anbelangt. Und sch&ouml;n geekig siehts obendrein aus ;)</p>
<p>cu, w0lf.</p>

<p class="infos">
<a href="#comment_1205" onclick="set_comment_reference(1205)" title="auf diesen Kommentar antworten">#1205</a>:
    11.Mar.2009 10:03
    von
    
      
        <a href="http://ag7.alltagsgrauen.info/" target="_blank">
          fwolf
        </a>
</p>
<p>hm .. <a href="http://www.sk65.info/" rel="nofollow">http://www.sk65.info/</a> sollte das eigentlich sein .. irgendwelche dummen anti-spam-plugins wieder?</p>
<p>cu, w0lf.</p>

<p class="infos">
<a href="#comment_1206" onclick="set_comment_reference(1206)" title="auf diesen Kommentar antworten">#1206</a>:
    11.Mar.2009 10:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>nuja, ich hab nicht vor mein Nokia 6020 in den n&auml;chsten anderthalb jahren zu ersetzen.<br/>
Dem Ding fehlen zwar in der Software massig Funktionen (die vor allem zu gro&szlig;en Teilen in den Vorg&auml;ngern schon drin waren), aber es funktioniert ziemlich gut, der Akku h&auml;llt mehrere Wochen, die Gespr&auml;chsqualit&auml;t und der Empfang reichen mir vollkommen und selbst f&uuml;r gelangweilte Minuten ohne sinnvolle Hardware (gibts sowas noch?) habe ich mir vor Jahren mal ein paar Dutzend wirklich gute Spiele als Java-Progs drauf geladen.</p>
<p>Sollte ich mir wirklich mal ein neues Telefon kaufen, dann sicher auch nicht weil ich mehr Funktionen brauche. F&uuml;r alles aufw&auml;ndigeres habe ich ja eh mein Netbook eigentlich immer mit.</p>
<p>Interessanter w&auml;re etwas kleineres, das dann auch nur telefonieren und SMS empfangen k&ouml;nnen muss. Wenn es ganz luxori&ouml;s sein soll, w&auml;re evtl. noch eine MP3-Player-Funktion und ein Speicherkarteneinschub f&uuml;r selbige nett... das muss aber nicht.</p>
<p>Kamera, Bluetooth, MMS, PTT, TLA, (S)XTLA, IR, Kalender, und was es sonst noch so an sinnlosen Kaizen-Ideen gibt, nutze ich eh nicht.</p>
</div>