+++
title = "Kino 2"
date = "2008-09-03T01:09:00"
author = "Dr. Azrael Tod"
tags = ["Zwickau"]
issoid = "blog/670"
aliases = "blog/670"
+++

<p>Heute war ich <a href="/2008/07/05/kino/">mal wieder</a> mit meiner besseren H&auml;lfte im Kino. <a href="http://wwws.warnerbros.de/thedarkknight/" target="_blank">The Dark Knight</a> musste ich mir einfach selbst ansehen. Der Film selbst war auch wirklich verdammt gut, es war zwar etwas schade dass die schauspielerischen Qualit&auml;ten eines <a href="http://de.wikipedia.org/wiki/Christian_Bale" target="_blank">Christian Bale</a> h&ouml;chstens am Ende etwas st&auml;rker zum Tragen kamen, <a href="http://de.wikipedia.org/wiki/Heath_Ledger" target="_blank">aber</a> <a href="http://de.wikipedia.org/wiki/Aaron_Eckhart" target="_blank">der</a> <a href="http://de.wikipedia.org/wiki/Michael_Caine" target="_blank">Film</a> <a href="http://de.wikipedia.org/wiki/Gary_Oldman" target="_blank">strotzt</a> <a href="http://de.wikipedia.org/wiki/Morgan_Freeman" target="_blank">ja</a> nur so von anderen hochkar&auml;tigen Schauspielleistungen.</p>
<p>Ich w&uuml;rde diesen Film, wenn auch noch nicht unter perfekt, so doch ganz deutlich als ziemlich gut und unter "ideales Beispiel um zu zeigen was mit dem Produkt Kino nicht stimmt" einordnen.<!--more--></p>
<p>Immerhin kann eine schlechte Meinung &uuml;ber den Film nicht auf das Kino als solches zur&uuml;ckschlagen wenn der Film gut war. Auch die Kinder im Publikum die mehr damit zu tun haben Popcorn zu mampfen und am Handy zu spielen blieben uns erspart. Das Publikum war eh mal wieder eine sch&ouml;ne Abwechslung, auch wenn der Saal seit langem mal wieder ziemlich voll war (und das einige Zeit nach Filmstart, am Dienstag), war es ziemlich ruhig und mir ist keine einzige Person wirklich negativ w&auml;hrend des Filmes aufgefallen. (An dieser Stelle muss ich mich wohl f&uuml;r einen ziemlich entr&uuml;steten Blick bei meiner Nachbarin entschuldigen, sie hat WIRKLICH sofort aufgeh&ouml;rt mit ihren Beutelchen zu knistern, noch lange bevor der Film begann.)</p>
<p>Das gr&ouml;&szlig;te Problem war wohl dass meine Freundin eigentlich morgen recht zeitig aufstehen muss, der Film aber erst gegen halb 12 endete. Sie kann jetzt wohl noch so grob 5 Stunden schlafen. :-/<br/>Das hatten wir nat&uuml;rlich nicht bedacht, immerhin sind wir ja mit Absicht in die 20Uhr-Vorstellung gegangen. Die 20Uhr-Vorstellung ist jedoch eigentlich eine 20:15-Vorstellung, 20:15-20:45 lief nat&uuml;rlich erstmal Werbung, der Film hatte &Uuml;berl&auml;nge (Na gut.. das ist mal nicht wirklich Negativ.) und in der Mitte des Filmes wurde mal eben f&uuml;r 20min unterbrochen.</p>
<p>20 Minuten Pause? Wof&uuml;r? Pinkelpause f&uuml;r den Vorf&uuml;hrer? Musste die 2. iso mit der n&auml;chsten H&auml;lfte svcd.ts.ld erst entpackt werden? Oder ist das doch nur wieder eine neue, bescheuerte Idee die Kinobesucher &uuml;ber den Verkauf von &uuml;berteuerten Nahrungsmitteln und Getr&auml;nken auszunehmen?</p>
<p>Selbst wenn man die Pause als notwendig hinnimmt, war die Realisierung dennoch mies.. an einer v&ouml;llig unpassenden Stelle, mitten in der Handlung wird pl&ouml;tzlich f&uuml;r 10sec "Pause" eingeblendet, das Licht geht an und die Leute st&ouml;hnen genervt auf. Nach der Pause geht der Ton weiter, der Projektor wird hochgefahren, das Licht gedimmt und der Vorhang geht wieder auf... in dieser Reihenfolge!</p>
<p>Positiv war diesmal eindeutig die Tonqualit&auml;t, eindeutig besser als die letzten paar Kinobesuche. Das k&ouml;nnte daran liegen dass der Kinosaal seit langem mal wieder so besetzt war, wie es eigentlich vorgesehen ist, k&ouml;nnte aber auch einfach daran liegen dass der UFA-Palast in Dresden etwas hochwertiger (wenn auch Ticketm&auml;&szlig;ig etwas billiger) als das Cinestar in Zwickau ist.</p>
<p>Die Sessel waren unbequem wie immer, wir konnten leider keinen "Kuschelplatz" f&uuml;r 2 Personen bekommen, zumindest keinen auf dem man den Film auch annehmbar sehen kann. (Kein Wunder, es gibt genau eine Reihe Kuschelpl&auml;tze an jeder der 4 Seiten des Kinosaales, das wars.) Wann werden die Kinos endlich wieder anfangen ihre Sitze mit hochklappbaren Armlehnen auszustatten wie ich sie von fr&uuml;her kenne?<br/>Wenn ich neben jemandem unbekannten sitze, sind die aktuellen Armlehnen sowieso sinnlos, es gibt ja immer nur eine f&uuml;r 2 Personen. (Am Ende sitzt man eh zwischen 2 Personen, die die Lehne jeweils f&uuml;r sich selbst beanspruchen.)<br/>Wenn ich jedoch mit meiner Freundin dort sitze, gibt es beinahe keine M&ouml;glichkeit bequem zu sitzen UND irgendeine Art K&ouml;rperkontakt zu halten. (z.B. H&auml;ndchenhalten)<br/>Nichts st&ouml;rt den Filmgenuss so sehr wie ein schmerzender R&uuml;cken und eingeschlafene Gliedma&szlig;en, ich w&uuml;nschte das w&uuml;rden die Betreiber endlich mal erkennen.</p>
<p>Recherchen im Internet ergaben &uuml;brigens noch dass wir f&uuml;r eine Vorbestellung mal eben noch 10% Geb&uuml;hr bezahlt h&auml;tten. Andere Branchen w&auml;ren froh wenn sie vorher ziemlich sicher w&uuml;ssten dass ein Kunde diese und jene Kaufabsicht hat. Ich glaube es braucht sich hier keiner wundern, wenn das Internetgesch&auml;fft f&uuml;r Kinos recht wenig Erfolg verzeichnet.</p>
<p>Die Karten waren &uuml;brigens ein Geschenk meiner Schwiegereltern (naja, noch nicht ganz) zum Geburtstag. Genau genommen habe ich nicht die Karten selbst bekommen, sondern Kinogutscheine... warum werden die &uuml;brigens in 5&euro;-Scheinen verkauft?<br/>Ein Schelm wer bei diesem Preis daran denkt, dass Kinokarten preislich immer recht weit von den n&auml;chsten vollen 5&euro; entfernt liegen und man somit entweder eine Karte nur halb nutzt und Geldwert verf&auml;llt oder der Beschenkte auch noch draufzahlt...</p>
<p>Ich hab jetzt jedenfalls 2&euro; drauf gezahlt und noch 2 meiner urspr&uuml;nglich 4 Gutscheine &uuml;brig, ihr k&ouml;nnt euch schonmal auf die n&auml;chsten Beschwerden bez&uuml;glich des Kinos freuen. Ich bin nur noch am &Uuml;berlegen welchen Film ich mir ansehen sollte.. Bisher sieht <a href="http://www.babylonadmovie.com/" target="_blank">Babylon A.D.</a> am vielversprechendsten aus, aber so richtig begeistert bin ich von keinem Film der demn&auml;chst ansteht. (Klar.. wenn jetzt was StarWars- oder James Bond-M&auml;&szlig;iges im Kino kommen w&uuml;rde... aber die Zeigen Heute ja nur noch Schnulzen mit heulenden Memmen oder Zeichentrickfilme.)</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_508" onclick="set_comment_reference(508)" title="auf diesen Kommentar antworten">#508</a>:
    03.Sep.2008 03:09
    von
    
      
        <a href="http://blog.b-o-f-h.net" target="_blank">
          Thorsten
        </a>
</p>
<p>Die Pause war &uuml;brigens unn&ouml;tig im Cinestar in Mainz wurde er ohne Pause gezeigt. Der Ton ist ein kracher, die B&auml;sse sind so wie sie sein sollen, liegt aber mMn. am extrem guten Soundtrack von Hans Zimmer und James Newton Howard.</p>

<p class="infos">
<a href="#comment_509" onclick="set_comment_reference(509)" title="auf diesen Kommentar antworten">#509</a>:
    03.Sep.2008 09:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Naja, sicher ist der Ton von Dark Knight genial... aber sicher nicht derartig besser als Hancock. Anders ausgedr&uuml;ckt: Hancock sollte keinen derartig schlechten Ton haben, wie es in Zwickau der Fall war, Einstellung der Anlage und Menge der Kinobesucher machen viel aus.</p>

<p class="infos">
<a href="#comment_510" onclick="set_comment_reference(510)" title="auf diesen Kommentar antworten">#510</a>:
    12.Nov.2008 12:11
    von
    
      
        <a href="/2008/11/12/007-ein-quant-hoffnung/" target="_blank">
          007 - Ein Quant Hoffnung &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] hatte ich ja nicht vor mir den neuen &ldquo;Bond-Film&rdquo;&nbsp;a quantum of solace im Kino anzusehen. Allerdings ist der Mensch ja Herdentier (und davon unabh&auml;ngig auch ich manchmal) und ich &auml;nderte [...]</p>
</div>