+++
title = "A2DP - Bluetooth-Stereo-Audio"
date = "2011-08-08T12:08:00"
author = "Dr. Azrael Tod"
tags = ["Android", "Gadget", "Hardware", "Milestone", "PC", "Softwareschrott", "Technik", "Telefon"]
issoid = "blog/1553"
aliases = "blog/1553"
+++

<p>Wenn es um drahtlose Audio-&Uuml;bertragung geht, hat man momentan die Wahl aus einem gro&szlig;en Haufen propriet&auml;rer L&ouml;sungen die alle nicht kompatibel sind (und auch gerne mal noch auf IR aufsetzen), ein paar "professionelleren" Systemen mit enormen Anschaffungskosten und.. &auml;h.. <a href="http://de.wikipedia.org/wiki/A2DP" target="_blank">Bluetoothfrickel</a>!</p>
<p>Mit letzterem habe ich mich in den letzten Monaten mal etwas genauer befasst. Schon die Grundlagen auf denen das Zeug aufbaut sind &uuml;belkeitserregend. Als Codec wird z.B. nur die Unterst&uuml;tzung eines propriet&auml;ren, richtig miesen Drecksdings vorgeschrieben, MP3 oder AAC wird aber mal eben als M&ouml;glichkeit einger&auml;umt, die aber eigentlich keiner verwendet, da es ja nicht verlangt wird und was alles verbrochen wird um Bluetooth einigerma&szlig;en dazu zu bringen echtzeit-&auml;hnlich berechenbar zu reagieren, das will man eigentlich garnicht wissen.</p>
<p>Dennoch: dieser Mist hat einige Vorteile gegen&uuml;ber allen anderen L&ouml;sungen.<br/></p><ul><br/> <li>es funktioniert einigerma&szlig;en</li><br/> <li>&uuml;berall ist entsprechende Hardware bereits eingebaut (zumindest Telefone/PCs/... k&ouml;nnen prima als Sender dienen)<br/> </li><li>Hardware daf&uuml;r ist billig</li><br/> <li><a href="http://en.wikipedia.org/wiki/A2DP#Audio.2FVideo_Remote_Control_Profile_.28AVRCP.29" target="_blank">Ferbedienung geht auch</a></li><br/></ul><br/><h3>Hardware</h3><br/><h4>Phillips SHB9000/SHB6110</h4><br/><a href="http://www.philips.de/c/kopfhoerer/bequem-verstellbarer-buegel-shb9000_10/prd/" target="_blank">Kopfh&ouml;rer</a>/<a href="http://www.p4c.philips.com/cgi-bin/dcbint/cpindex.pl?ctn=SHB6110/10&amp;scy=at&amp;slg=de" target="_blank">Headsets</a>, haupts&auml;chlich daf&uuml;r gedacht mit einem Telefon verbunden zu werden und neben dem abspielen von Musik und dem Fernbedienen des Mediaplayers, noch so nebenbei Headset beim Telefonieren zu spielen. (Da wird mal eben auf <a href="http://en.wikipedia.org/wiki/A2DP#Headset_Profile_.28HSP.29" target="_blank">ein anderes BT-Protokoll</a> umgeschalten. Das geht &uuml;brigens nicht gleichzeitig, man kann also nicht am PC in Stereo anh&ouml;ren und das Mikrofon nutzen.)<br/>Technisch unterscheiden sich die beiden Varianten kaum. Das Geh&auml;use ist anders gestaltet und w&auml;hrend die 9000er als klassische Kopfh&ouml;hrer mit Kunstleder-Polstern und h&ouml;herem Gewicht getragen werden, sind die 6110er als Neckholder mit kleineren Schaumstoffpolstern konstruiert.<br/>Die Bedienkn&ouml;pfe sind leicht unterschiedlich gestaltet, was bei den 9000ern schonmal dazu f&uuml;hrt dass man versehentlich Play/Pause ber&uuml;hrt und versehentlich (wenn es doppelt erfolgt) auf Wahlwiederholung dr&uuml;ckt oder den Mediaplayer startet.<br/>Daf&uuml;r haben die 9000er noch zus&auml;tzlich eine Klinkenbuchse als alternativen Eingang, um sie auch an klassischen MP3-Playern oder &auml;hnlichem zu verwenden. Das funktioniert, aber ehrlich gesagt hab ich es nie ernsthaft verwendet. (Das Steckergeh&auml;use muss daf&uuml;r auch ziemlich schmal sein, ich hab nur 1 einziges Kabel in meiner Kiste gefunden das wirklich ran passt ohne am Geh&auml;use h&auml;ngen zu bleiben)

<p>weitere Daten:<br/></p><ul><br/><li>Akkulaufzeit: mehrere Wochen normalbetrieb bei mir. Ich hab es nie geschafft die Kopfh&ouml;rer in weniger als 2 Wochen leer zu bekommen, auch nicht bei mehreren Stunden benutzung pro Tag.</li><br/><li>Reichweite: im Geb&auml;ude vlt. 10-15m, v&ouml;llig ausreichend f&uuml;r eine Verbindung Telefon-Kopfh&ouml;rer o.&auml;. und auch wenn man ins Nebenzimmer geht bricht die Verbindung nicht sofort ab.</li><br/><li>Preis: beide jeweils ca. 60&euro;</li><br/><li>Tragekomfort: die 9000er dr&uuml;cken etwas stark auf die Ohren und sind damit etwas gew&ouml;hnungsbed&uuml;ftig f&uuml;r manche Leute wenn mehrere Stunden lang verwendet. Auch k&ouml;nnen da die Ohrmuscheln im Sommer etwas warm sein. Daf&uuml;r wirken sie nat&uuml;rlich erheblich besser schallisolierend als die 6110er.</li><br/><li>Klangqualit&auml;t: bisher mit die besten Kopfh&ouml;rer in diesem Format die ich gekauft habe.<br/></li></ul><br/>Kommentar: Beides sind sehr gute Kopfh&ouml;rer und die Unterschiede zwischen den Bauformen sind eher eine Frage des Geschmacks. Wenn heute meine 9000er kaputt gehen w&uuml;rden, bin ich mir ziemlich sicher dass ich mir genau das gleiche Modell noch einmal kaufen w&uuml;rde, einfach weil ich noch nichts besseres gefunden habe.

<p></p><h4>Belkin N90</h4><br/><a href="http://www.reichelt.de/index.html?ARTICLE=98127" target="_blank">Ein einfacher Empf&auml;nger</a>, eigentlich nur ein kleines K&auml;stchen mit Stromeingang (5V, noch ein Steckernetzteil.. irgendwann muss ich mir mal ein AT-Netzteil oder so uml&ouml;ten um den ganzen Mist hier sinnvoll mit einem Netzteil zu behandeln) und Klinkenbuchse als Ausgang. Keine Kn&ouml;pfe, keine gro&szlig;en Probleme.<br/><ul><br/> <li>Reichweite: ebenfalls ca. 10-15m im Geb&auml;ude</li><br/> <li>Preis: ca. 25&euro;</li><br/> <li>Merkt sich 8 Ger&auml;te, bei mehr muss man das pairing halt wiederholen.</li><li><br/></li></ul><br/>Kommentar: ein kleiner Kasten den ich hinter meinen AV-Reciever geworfen hab und der unauff&auml;llig und zuverl&auml;ssig seinen Dienst tut. Ich muss mein Telefon jetzt nicht mehr anstecken wenn ich Musik zuhause auf den Lautsprechern h&ouml;ren will. Was will man mehr?<br/><h4>B-Speech Tx2</h4><br/><a href="http://www.reichelt.de/index.html?ARTICLE=87261" target="_blank">Eine Art Dongle</a> welches man an einen Klinken-Audio-Ausgang klemmt und das dann Ton via BT &uuml;bertragen soll.<br/><ul><br/> <li>Reichweite: beim Verbinden vlt. 2-3m, danach angeblich 10m (wird eher schwierig)</li><br/> <li>Preis: ca. 15-20&euro;</li><br/> <li>Akkubetrieben, aufladbar via USB-Mini, Akkulaufzeit laut Handbuch max. 7h</li><br/></ul><br/>Kommentar: ziemlich unbrauchbar. Hatte ich mir mehr der Vollst&auml;ndigkeit halber zugelegt, aber tut nicht so richtig was es soll. Die Akkulaufzeit ist mager und die Reichweite viel zu kurz.<br/><h3>Software</h3><br/>Kommen wir zum gro&szlig;en Problem bei A2DP. Die Software der sendenden Ger&auml;te ist oft derartig mies, dass man sie kaum verwenden kann. Grob zusammengefasst geht alles was Telefon ist einigerma&szlig;en und alles was PC ist, braucht man garnicht probieren.<br/>Details gibt es nat&uuml;rlich auch zusammengefasst <a href="http://en.wikipedia.org/wiki/A2DP#Operating_systems" target="_blank">bei Wikipedia</a><br/><h4>Linux</h4><br/>Nun... wie alles bei dem irgendwie Linux und Audio vorkommt: es funktioniert... manchmal. Grunds&auml;tzlich k&ouml;nnte man sich ein uBUNTu installieren, pairing durchf&uuml;hren und Spa&szlig; haben. Bl&ouml;derweise h&auml;ngt da aber mal wieder diese <a href="/2011/5/24/Zurechtgepoettert/">verpoetterte Schei&szlig;e</a> wie <a href="http://upload.wikimedia.org/wikipedia/commons/0/00/Pulseaudio-diagram.svg" target="_blank">PulseAudio</a> dazwischen die Ausgaben aufs falsche Ger&auml;t lenkt, Pegel nicht &uuml;ber Null heben kann oder &auml;hnlichen Mist fabriziert.<br/>Alles in Allem ist es noch immer das Desktopsystem mit dem ich A2DP-Kopfh&ouml;hrer noch am ehesten zum Funktionieren bekommen kann. Man sollte sich nur halt nicht auf klickibuntu-Mist verlassen und z.B. bei Spa&szlig; mit der Lautst&auml;rkeregelung lieber mal in Alsamixer nachsehen statt sich stundenlang zu wundern warum alles leise ist wenn Regler lauter gestellt werden.<br/><h4>Windows XP</h4><br/>Nein, tut nicht.<br/>Windows hat einen Bluetooth-Stack der einfach nur halb implementiert ist. Was dann auch dazu f&uuml;hrte dass jeder Hardwarehersteller seinen eigenen mitbringt. Mit einigen dieser Dinger soll es schonmal funktioniert haben. Ich habe das aber noch nie gesehen.<br/><h4>Windows Vista/7</h4><br/>Ja, funktioniert manchmal. Das Ausw&auml;hlen der Ausgabeger&auml;te ist noch verbugter als unter uBUNTu/Fedora/Whatever-KlickiBunti-Linux und mit dem falschen BT-Stack geht es gleich mal garnicht. Aber ich habe es schonmal ne weile benutzt ohne mich sofort aufregen zu m&uuml;ssen.<br/>Spa&szlig;ig wird es wenn schlechte Software wie Flash dazu kommt, die noch irgendwo zus&auml;tzliche Buffer oder so einbaut. Da habe ich beim Daylishow-gucken schonmal 5min Versatz zwischen Bild und Ton produzieren k&ouml;nnen.<br/><h4>OSX</h4><br/>Funktioniert teilweise, Man kann sich verbinden, Ton wird auch &uuml;bertragen aber wenn z.B. 5min kein Audio &uuml;bertragen wird, schaltet OSX gerne mehr Sachen in Standby-Modus als sinnvoll sind und meine Kopfh&ouml;hrer schalten sich ganz aus weil kein Sender mehr da war.<br/>Das einzige System das sich teilweise noch unverwendbarer verh&auml;llt als Windows 7.<br/><h4>Windows Mobile (also vor Mobile 7 und ab 5)</h4><br/>Funktioniert. Die Ger&auml;te sind oft etwas &auml;lter, haben nur Klasse-2 BT-Sender (und somit auch Ger&auml;te vor Windows CE5 haben noch keine passende Software (funktioniert also nicht) und Windows Mobile 7 ist wohl eine ziemlich komplette Neuentwicklung die ich nicht getestet habe (also keine Aussage meinerseits).<br/><h4>Android</h4><br/>Ja, funktioniert ziemlich gut. Mein <a href="/2010/7/12/These-aren't-the-Droids-you're-looking-for!/">Milestone</a> hatte zeitweise einige Ressourcenprobleme, die unter Android 2.1 zu regelm&auml;&szlig;igen Aussetzern f&uuml;hrten, die ich erst auf Empfangsprobleme geschoben hatte. Mit Android 2.2 wurde es besser und seitdem ich Cyanogenmod mit 2.3 drauf hab, kann ich sowas nur noch selten feststellen.<br/><h4>iOS</h4><br/>Hab ich nur mal kurz getestet, funktionierte brauchbar<br/><h4>Symbian</h4><br/>Auch hier hatte ich nur mal kurz das Telefon meiner Schwester angeschlossen. Sie konnte meine Kopfh&ouml;rer verwenden und sich zumindest in einem gr&ouml;&szlig;erem Zimmer ohne Empfangsprobleme bewegen. Keine Ahnung welche Version oder welches Telefon das war.<br/>
