+++
title = "Alice - Wir haben Zeit..."
date = "2008-09-01T12:09:00"
author = "Dr. Azrael Tod"
issoid = "blog/664"
aliases = "blog/664"
+++

<p>Wie glaube bereits geschrieben, habe ich Anfang Juli bei <a href="https://www.alice-dsl.de" target="_blank">Alice</a> einen DSL-Anschluss beauftragt, in der Hoffnung dass ich m&ouml;glichst bald nach meinem Umzug Internet in Dresden habe.</p>
<p>Bereits als ich feststellte dass bei Alice AOL irgendwie involviert ist, h&auml;tte ich die ganze Aktion abbla&szlig;en sollen, sp&auml;testens jedoch wenn man auf Kontakt klickt und in der "Alice Hilfe" landet. Ich will keine Hilfe, ich will jemanden dem ich in den Hintern treten kann und der dann etwas gegen meine Probleme unternimmt.<!--more--></p>
<p>Eine Telefonnummer zu finden ist bei Alice generell nicht gerade leicht, als einfachste Methode hat es sich erwiesen bei einem <a href="http://www.tk-anbieter.de/0180/suche.html" target="_blank">0180-Verzeichnis</a> einfach Alice einzugeben. Das l&ouml;st dann auch gleich das Problem dass man mit einem Handy (Festnetz hat man ja nicht weil Alice keine Lust hat) auf einer 0180-Nummer anrufen m&uuml;sste.</p>
<p>Jedenfalls haben mehrmalige Anrufe, mit jeweils etlichen Minuten Wartezeit (beim letzten Anruf &uuml;ber 15min), dann irgendwann auch mal Ergebnisse gebracht:</p>
<p>Nein, die Anzeige im Internet &uuml;ber den Auftragsstatus stimmt nicht (diese Zeigt immer reichlich 1 Monat nach dem aktuellem Datum f&uuml;r die vollendung des ersten Schrittes an)! Tats&auml;chlich hat Alice schlicht keinen Plan wann man uns einen Internetzugang freischalten k&ouml;nne. Zumindest konnten die Leute an der Hotline kein Wort mehr sagen.</p>
<p>3 Monate ohne Internet (und da ist noch nicht drin wie lange es noch dauern k&ouml;nnte) sind nicht zumutbar, ich bin von Berufs wegen darauf angewiesen! (Eigentlich sollte man Schadensersatz fordern...)</p>
<p>Dementsprechend habe ich nun darum gebeten dass mein Auftrag storniert wird (eine Best&auml;tigung daf&uuml;r per Email oder so gibt es nat&uuml;rlich auch nicht, hoffentlich gibts am Ende nicht 2 Rechnungen).</p>
<p>Fazit: TeleColumbus mit seinen Macken (von diesem Mist als Schl&uuml;sselwort bekomme ich &uuml;brigens mittlerweile mehr Google-Hits als von allem anderem) war kein Einzelfall. Telekommunikationsanbieter scheinen in der Servicew&uuml;ste Deutschland generell zu denken dass sie noch immer ein Amt darstellen und der <span style="text-decoration:line-through;">Bittsteller</span> Kunde erstmal ein paar Jahre warten sollte.</p>
<p>Ich such mir jetzt einen Internetanbieter der mir auch mal zur Abwechslung Internet anbietet.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_499" onclick="set_comment_reference(499)" title="auf diesen Kommentar antworten">#499</a>:
    01.Sep.2008 01:09
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Ich sag das nicht gerne: Telekom. Die sind bei mir mittlerweile als die stress&auml;rmsten registriert, auch wenn sie nat&uuml;rlich nicht das Optimum darstellen.</p>

<p class="infos">
<a href="#comment_500" onclick="set_comment_reference(500)" title="auf diesen Kommentar antworten">#500</a>:
    01.Sep.2008 01:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Bislang ziehe ich erstmal Arcor und evtl. noch Telekom in Betracht... Telekom hat allerdings Preislich kaum eine Chance mitzuhalten, das st&ouml;rt mich atm noch ziemlich.</p>
<p>Nachtrag:<br/>
Hab gerade mal ein wenig bei Telekom rumgesurft (nachdem ich trotz Flush-&Uuml;berlagerung das Men&uuml; mal anklicken konnte -.-), die Tarifstruktur ist mist.. nat&uuml;rlich gibts nen DSL-Anschluss nicht ohne Telefonanschluss, aber es ist ne bl&ouml;de Idee das vom Kunden ausw&uuml;rfeln zu lassen, erh&ouml;ht nicht unbedingt die &Uuml;bersichtlichkeit.<br/>
Au&szlig;erdem bieten die auch nur Vertr&auml;ge mit 12Monate Mindestlaufzeit an, das st&ouml;&szlig;t mir auch immer etwas sauer auf. :-/</p>

<p class="infos">
<a href="#comment_501" onclick="set_comment_reference(501)" title="auf diesen Kommentar antworten">#501</a>:
    02.Sep.2008 01:09
    von
    
      
        <a href="http://ag7.alltagsgrauen.info" target="_blank">
          fwolf
        </a>
</p>
<p>was ist mit QSC bzw. Q-DSL? Und: <a href="http://Kamp.net" rel="nofollow">Kamp.net</a> haben glaube ich auch eine entb&uuml;ndelte Nur-DSL-Flat.</p>
<p>cum, w0lf.</p>
</div>