+++
title = "Wahnsinn Studium"
date = "2008-02-13T11:02:00"
author = "Dr. Azrael Tod"
issoid = "blog/317"
aliases = "blog/317"
+++

<p>Dinge die ich gelernt habe und Dinge die ich h&auml;tte lernen sollen<br/><br/><br/>Ich habe gelernt:<br/></p><ul><br/><li>Cobol (!)</li><br/><li>Verwendung Neuronaler Netze</li><br/><li>NURBS und &auml;hnliche Freiformkurven bzw. -Fl&auml;chen</li><br/><li>Verwendung von AutoCAD</li><br/><li>Statistik</li><br/><li>Verkehrsleittechnik (!)</li><br/><li>Qualit&auml;tmanagement (Damit ist die mathematischen Grundlagen und messtechnische Realisierung f&uuml;r mechanische Probleme gemeint, nicht etwa die Verwaltung gro&szlig;er Softwareprojekte)</li><br/><li>VRML (!)</li><br/><li>...</li><br/></ul><br/><br/>Ich habe nicht wirklich gelernt:<br/><br/><ul><br/><li>Serverkonfiguration (wurde nichtmal angeschnitten)</li><br/><li>Bedienung von UNIX, Linux oder &auml;hnlichem (h&ouml;chstens in Betriebssysteme mal kurz cp, ls und Konsorten erw&auml;hnt)</li><br/><li>GUI-Design/Web-Design (inkl. Farblehre, Hinweise zu intuitiv verwendbaren Interfaces oder Grundtechniken wie Javascript)</li><br/><li>...</li><br/></ul><br/><br/>Sollten diese fehlenden Dinge problemlos vom Studenten selbst nachgeholt werden? Nat&uuml;rlich!<br/><br/>Sind die als gelernt erw&auml;hnten Dinge nutzlos? Nat&uuml;rlich nicht!<br/><br/>Allerdings sollte hinter dem Studium imho schon irgendwo ein System stehen. Ich bezweifle dass das meiste gelernte von den Studenten ernsthaft nochmal gebraucht wird. Wenn ich mir ansehe, was die meisten Studenten sp&auml;ter mal beruflich tun (die meisten im Fachbereich aush&auml;ngenden Angebote f&uuml;r Diplomthemen beziehen sich auf Dinge wie "Erstellung einer Webpr&auml;senz") und wie viele noch heute keine Ahnung von Linux oder dem Entwerfen einer Oberfl&auml;che, die ohne extreme Kr&auml;mpfe per Keyboard bedienbar ist, haben, so dr&auml;ngt sich mir einfach auf, dass man evtl. Nicht gar so viele hochwissentschafliche Themen in dieses Studium h&auml;tte quetschen sollen.<br/><br/>Es w&auml;re wohl doch besser gewesen, man h&auml;tte ein paar Themen nicht nur kurz angerissen und als trivial abgetan.<br/><br/><br/>Was n&uuml;tzt es mir, wenn ich mich nach meinem Diplom (dank Selbststudium) in der Lage f&uuml;hle diverse Aufgaben auszuf&uuml;hren, wenn ein gro&szlig;er Teil der anderen Dipl. Informatiker vom selben Institut das nicht k&ouml;nnten?<br/><br/>Welche Firma soll mich dann noch ernsthaft auf Grund des Rufes meines Abschlusses als geeignet einstufen?<br/><br/><br/>(Dieser Effekt h&auml;lt sich auf Grund des allgemein guten Rufes des deutschen Diplomes evtl. zur Zeit noch in Grenzen... Aber zum Gl&uuml;ck ist ja ab dem n&auml;chsten Jahrgang das Ganze auf B&auml;htscheller umgestellt. Ich bin gespannt wie die Wirtschaft in 2-3 Jahren reagiert, wenn diverse Vorschusslorbeeren wegfallen und sich die Informatiker ihren eigenen Ruf aufgebaut haben...)
      
    
  <div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_41" onclick="set_comment_reference(41)" title="auf diesen Kommentar antworten">#41</a>:
    03.Mar.2008 08:03
    von
    
      
        Oliver
      
    
    
  </p>
<p>Also mein erstes wtf bezieht sich auf diesen Blog :D Wtf? Du hast nen Blog, gut die Erkenntnis ist inzwischen bei mir angelangt <em>g</em>Mein zweites wtf bezieht sich auf dieses hier:&gt;Bedienung von UNIX, Linux oder &auml;hnlichem (h&ouml;chstens in Betriebssysteme mal kurz cp, ls und Konsorten erw&auml;hnt)Meister das ist okay, das lernst du selbsst&auml;ndig nebenher in der Regel, ebenso wie coden (jedenfalls bei den &uuml;blichen Informatik Studieng&auml;ngen die auf Dipl enden).Last not least mein drittes wtf. Wtf? Cobol? Ich lernete Cobol und Fortran, sowie jede Menge Pascal mal mitte der 80er aber heute? Gut Fortran ist immer noch eine Gr&ouml;&szlig;e in diversen Ingenieurswissenschaften, aber Cobol? Na okay, ich w&uuml;nsche dir auf jeden Fall viel Erfolg beim Studium :D</p>

<p class="infos">
<a href="#comment_42" onclick="set_comment_reference(42)" title="auf diesen Kommentar antworten">#42</a>:
    03.Mar.2008 08:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Mein Problem ist weniger, dass ich die wichtigen Dinge nebenbei lerne, viel mehr dass alle diese Sachen sich nur nebenbei selber aneignen.Ich finde weit &uuml;ber die H&auml;lfte der Sachen, die hier an unserer FH gepr&uuml;ft und beigebracht werden v&ouml;llig nutzlos, die Zeit h&auml;tte man einfach f&uuml;r besseres verwenden k&ouml;nnen.Und was n&uuml;tzt es mir wenn ich sp&auml;ter mal sagen kann "das hab ich mir nebenbei selber angeeignet"? Ich studiere doch nicht, weil ich etwas lernen will, sondern damit ich nen Beweis hab dass ich das richtige gelernt hab. Das hab ich aber nicht und viele bei uns werden trotz gutem Abschluss immer noch keinen Plan auf solchen Gebieten haben.</p>

<p class="infos">
<a href="#comment_43" onclick="set_comment_reference(43)" title="auf diesen Kommentar antworten">#43</a>:
    03.Mar.2008 11:03
    von
    
      
        Oliver
      
    
    
  </p>
<p>Du in der Praxis hei&szlig;t es zumindest an der Uni 30% Studium, 70% Selbststudium. In Zeiten von Bachelor &amp; Co ist das nat&uuml;rlich ein Unding. Aber was willst du machen? Auf gut Deutsch, gekotzt hat jeder zu seiner Zeit dr&uuml;ber. Die Realit&auml;t schl&auml;gt meist schon hart zu, wenn man mit dem Abi fertig ist und an die Uni kommt? Auch im Prinzip nutzlos.</p>

<p class="infos">
<a href="#comment_44" onclick="set_comment_reference(44)" title="auf diesen Kommentar antworten">#44</a>:
    03.Mar.2008 11:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>ja.. da liegt der Hund begraben. Was will man machen? Mehr als dr&uuml;ber Meckern, es hinnehmen und weiterhoffen dass das System zusammenbricht und mal ausnahmsweise von was besserem ersetzt wird kann man wohl nicht.(Traurigerweise erinnert mich das an verdammt viele Probleme die ich in unserem Land zur Zeit sehe.)</p>
</div>