+++
title = "31.12.2008 - Ende meiner ICQ-Nutzung"
date = "2008-09-07T06:09:00"
author = "Dr. Azrael Tod"
issoid = "blog/696"
aliases = "blog/696"
+++

<p>Ich verwende jetzt seit geraumer Zeit f&uuml;r viele pers&ouml;nliche und gesch&auml;ftliche Kontakte Jabber. Verwandte und andere Personen in meinem pers&ouml;nlichen Umfeld sind auch gr&ouml;&szlig;tenteils zu Jabber migriert, teilweise &uuml;ber "normale" Server wie <a href="http://jabber.org" target="_blank">jabber.org</a> oder <a href="http://web.jabber.ccc.de/" target="_blank">Jabber.ccc.de</a>, zu gro&szlig;en Teilen aber &uuml;ber <a href="http://mail.google.com/" target="_blank">Googlemail</a> und <a href="http://www.google.com/talk/" target="_blank">Google Talk</a>. (Jabber hat wirklich <a href="http://web.swissjabber.ch/index.php/Protokoll_Jabber_vs._ICQ" target="_blank">viele</a> <a href="http://www.zeroathome.de/wordpress/jabber-10-gruende/" target="_blank">Vorteile</a>)</p>
<p>Ich plane nun meine IM-Nutzung auf eine neue Stufe zu bringen, veraltete Kontakte aufzur&auml;umen und die Jabber-Verbreitung in meinem Umfeld weiter zu verst&auml;rken. Um dies zu erreichen werde ich mit Ende diesen Jahres die Nutzung meiner ICQ/MSN/AIM/Wasauchimmer-Accounts vollst&auml;ndig einstellen und nur noch &uuml;ber Jabber erreichbar sein.<!--more--><br/>Haupts&auml;chlich werde ich dazu mein Account <a href="mailto:href=">drazraeltod@jabber.ccc.de</a>href="//drazraeltod@ja...&gt; nutzen, f&uuml;r Googlemail-Nutzer werde ich zus&auml;tzlich noch h&auml;ufig unter @googlemail.com erreichbar sein. (Nat&uuml;rlich kann man auch von Googlemail an ccc.de schreiben, Zeitweise plane ich jedoch per Jingle-Audio oder &auml;hnlichem auch im Voicechat erreichbar zu sein, f&uuml;r derartiges wird daher auch diese Adresse noch beibehalten.)</p>
<p>Wem nicht klar ist was Jabber ist und wie alles Funktioniert, dem stehe ich gerne mit Rat und Tat zur Verf&uuml;gung (Bis zu diesem Termin auch noch per ICQ: 263266567 oder MSN: <a href="mailto:drazraeltod@hotmail.de">drazraeltod@hotmail.de</a>). Ich m&ouml;chte jedoch anmerken dass die Nutzung dieses Protokolles auf keinen Fall schwieriger ist als die von ICQ oder MSN.</p>
<p>Viele Leute verf&uuml;gen bereits &uuml;ber ein Jabber-Konto, ohne davon zu wissen. Namentlich vor allem alle Nutzer mit einem Email-Konto bei <a href="http://www.google.com/talk/" target="_blank">Googlemail/Gmail</a>, <a href="http://service.gmx.net/de/cgi/g.fcgi/products/messenger?cc=subnav_multimessenger&amp;from=products_overview&amp;srcArea=product_navi&amp;did=2&amp;sid=babhdeb.1214987579.28236.r0mmuvqirm.75.sql" target="_blank">GMX</a> oder <a href="https://www2.produkte.web.de/messenger/" target="_blank">Web.de</a>.</p>
<p>Auch wenn ihr noch keinen Jabber-Account habt, ihr k&ouml;nnt euch jederzeit kostenlos einen registrieren, k&ouml;nnt Jabber parallel zu ICQ oder MSN nutzen, bei vielen Clients k&ouml;nnt ihr sogar alle Protokolle gleichzeitig nutzen (z.B. <a href="http://miranda-im.de" target="_blank">Miranda</a>, <a href="http://sim-im.org" target="_blank">SIM</a>, <a href="http://www.pidgin.im" target="_blank">Pidgin/Gaim/Finch</a>, <a href="http://www.trillian.cc" target="_blank">Trillian</a>, ...) und wenn ihr euch einen wirklich guten Jabber-Client wie <a href="http://gajim.org/" target="_blank">Gajim</a> oder <a href="http://psi-im.org" target="_blank">Psi</a> installiert k&ouml;nnt ihr euch auch relativ problemlos einen Transport suchen, der andere Protokolle &uuml;ber Jabber selbst einbindet. (Das habe ich die letzten Monate/Jahre getan.) Letzteres hat dann auch gleich solche Vorteile wie dass ihr eure ICQ-Kontakte &uuml;ber <a href="https://mail.google.com" target="_blank">Googlemails-Webmailclient</a> sehen k&ouml;nnt.</p>
<p>Mehr Informationen erhaltet ihr z.B. auch in meinem <a href="http://drazraeltod.wordpress.com/2008/07/02/jabber-howto/" target="_blank">Jabber-Howto</a>, bei den Anbietern der Clients oder, wie bereits gesagt, wenn ihr mich direkt per Mail/Messenger/Handy/IRC ansprecht.</p>
<p>Ich werde jetzt jeden Monat erinnerungs-Nachrichten an alle meine ICQ-Kontakte schreiben und auf diese Adresse verweisen, ich hoffe dass ich so viele von euch wie m&ouml;glich davon &uuml;berzeugen kann mir zu folgen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_555" onclick="set_comment_reference(555)" title="auf diesen Kommentar antworten">#555</a>:
    08.Sep.2008 07:09
    von
    
      
        <a href="http://noqqe.de" target="_blank">
          noqqe
        </a>
</p>
<p>Super Sache! W&uuml;rd ich auch gern machen. aber ich kenn einfach viel zu viel leute die nicht so in der materie sind... :(</p>

<p class="infos">
<a href="#comment_556" onclick="set_comment_reference(556)" title="auf diesen Kommentar antworten">#556</a>:
    08.Sep.2008 07:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Aus dem Grund hab ich ja allen Angeboten ihnen bei der Umstellung zu helfen ;-)<br/>
Zur Not kann man ja auch immer noch zu googlemail oder &auml;hnlichen Diensten raten, bei denen nur noch der mitgelieferte Client installiert werden muss und adresse+passwort eingegeben werden soll.</p>

<p class="infos">
<a href="#comment_557" onclick="set_comment_reference(557)" title="auf diesen Kommentar antworten">#557</a>:
    08.Sep.2008 08:09
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Ich bin dabei. 31.12.2008: Ende meiner ICQ Nutzung.</p>

<p class="infos">
<a href="#comment_558" onclick="set_comment_reference(558)" title="auf diesen Kommentar antworten">#558</a>:
    08.Sep.2008 10:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Der Kommentar durchschl&auml;gt die nach oben offene Sarkasmusskala. <em>g</em></p>

<p class="infos">
<a href="#comment_559" onclick="set_comment_reference(559)" title="auf diesen Kommentar antworten">#559</a>:
    15.Sep.2008 10:09
    von
    
      
        raz0rblade
      
    
    
  </p>
<p>Genau das selbe mache ich auch grade. Skype ist schon ausgemustert und Icq ebenso. Nur noch Jabber und Msn. Wobei Msn noch bisschen arbeit wird. ^^ vielleicht kann man die Leute &uuml;berreden wenigstens OTR zu nutzen.</p>

<p class="infos">
<a href="#comment_560" onclick="set_comment_reference(560)" title="auf diesen Kommentar antworten">#560</a>:
    16.Sep.2008 09:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Naja, OTR ist ja schon ganz nett.. leider aufgrund der seltsamen Implementierungen da drau&szlig;en etwas frickelkram.<br/>
Aber das kann sich ja noch bessern. <em>hoff</em></p>

<p class="infos">
<a href="#comment_561" onclick="set_comment_reference(561)" title="auf diesen Kommentar antworten">#561</a>:
    17.Sep.2008 09:09
    von
    
      
        <a href="http://thedifferentway.6x.to" target="_blank">
          raz0rblade
        </a>
</p>
<p>Naja eigentlich nehm ich ja pgp aber das is ja unter windows wieder an zus&auml;tzliche programme gebunden etc... mehr aufwand als otr (einfach als plugin bei pidgin)</p>

<p class="infos">
<a href="#comment_562" onclick="set_comment_reference(562)" title="auf diesen Kommentar antworten">#562</a>:
    18.Sep.2008 09:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>also pgp hatte damals unter miranda erheblich weniger aufwand verursacht als otr.. zumindest wenn ich mich richtig erinner.<br/>
Kommt halt auch immer auf den Client an (und pidgin ist nicht gerade mein lieblingsclient).</p>

<p class="infos">
<a href="#comment_563" onclick="set_comment_reference(563)" title="auf diesen Kommentar antworten">#563</a>:
    08.Dec.2008 09:12
    von
    
      
        <a href="/2008/12/08/letzte-chance-icq-ausstieg/" target="_blank">
          Letzte Chance: ICQ Ausstieg &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] Chance: ICQ&nbsp;Ausstieg  Wie bereits vor etlichen Monaten geschrieben, plane ich meinen ICQ-Ausstieg mit Ende diesen Jahres. Wer auch immer noch meine ICQ-Adresse in [...]</p>

<p class="infos">
<a href="#comment_564" onclick="set_comment_reference(564)" title="auf diesen Kommentar antworten">#564</a>:
    31.Dec.2008 06:12
    von
    
      
        <a href="http://parkrocker.com" target="_blank">
          Parkrocker
        </a>
</p>
<p>Konsequente Entscheidung. Hut ab :)</p>

<p class="infos">
<a href="#comment_565" onclick="set_comment_reference(565)" title="auf diesen Kommentar antworten">#565</a>:
    15.Jan.2009 06:01
    von
    
      
        <a href="http://kinderporno.tk/" target="_blank">
          Funatiker
        </a>
</p>
<p>Verwende ICQ seit November nicht mehr und das ist auch gut so!</p>
<p>Au&szlig;erdem benutze ich auch keinen ICQ-Transport, da es unsinnig ist, 200 ICQ-Accounts &uuml;ber Transport in Jabber zu addieren, wenn man doch eh nur maximal 10 regelm&auml;&szlig;ig anschreibt.</p>

<p class="infos">
<a href="#comment_566" onclick="set_comment_reference(566)" title="auf diesen Kommentar antworten">#566</a>:
    15.Jan.2009 10:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>So &auml;hnlich ging es mir auch... die meisten meiner wirklich wichtigen ICQ-Kontakte haben eh schon seit langem Jabber von mir aufgeschwatzt bekommen.</p>
</div>