+++
title = "Wikia noch immer nicht ernstzunehmen"
date = "2008-09-07T01:09:00"
author = "Dr. Azrael Tod"
issoid = "blog/693"
aliases = "blog/693"
+++

<p>Das Urteil habe ich in der &Uuml;berschrifft ja schon einmal vornweg genommen, doch wie komme ich dazu?</p>
<p><a href="http://re.search.wikia.com/tools/mostqueried.html" target="_blank">Wikia</a> als <a href="http://re.search.wikia.com/index.html" target="_blank">Suchmaschine</a> auf <a href="http://re.search.wikia.com/about/about.html" target="_self">Mitarbeitsbasis</a> sollte ja dazu dienen ernsthafte Recherchen im Internet durchzuf&uuml;hren. (Ja, auch eine Google-Suche nach Pr0n+"Britney Spears" w&uuml;rde ich in diesem Fall mal ausnahmsweise als ernsthaft z&auml;hlen.)</p>
<p>Nun bietet Wikia permanent eine <a href="http://re.search.wikia.com/tools/mostqueried.html" target="_blank">&Uuml;bersichtsseite f&uuml;r die meistgesuchten Schl&uuml;sselw&ouml;rter</a> an. Die Top-10 sieht atm. so aus:<!--more--><br/></p><ol><br/> <li><a href="http://re.search.wikia.com/metrics/querytrends.html?query=google&amp;lang=en">google</a> <span class="metrics-count">16,411 queries</span> <span class="metrics-lang">[en]</span></li><br/> <li><a href="http://re.search.wikia.com/metrics/querytrends.html?query=sex&amp;lang=en">sex</a> <span class="metrics-count">8,567 queries</span> <span class="metrics-lang">[en]</span></li><br/> <li><a href="http://re.search.wikia.com/metrics/querytrends.html?query=porn&amp;lang=en">porn</a> <span class="metrics-count">7,691 queries</span> <span class="metrics-lang">[en]</span></li><br/> <li><a href="http://re.search.wikia.com/metrics/querytrends.html?query=test&amp;lang=en">test</a> <span class="metrics-count">7,395 queries</span> <span class="metrics-lang">[en]</span></li><br/> <li><a href="http://re.search.wikia.com/metrics/querytrends.html?query=java&amp;lang=en">java</a> <span class="metrics-count">6,209 queries</span> <span class="metrics-lang">[en]</span></li><br/> <li><a href="http://re.search.wikia.com/metrics/querytrends.html?query=wikia&amp;lang=en">wikia</a> <span class="metrics-count">5,877 queries</span> <span class="metrics-lang">[en]</span></li><br/> <li><a href="http://re.search.wikia.com/metrics/querytrends.html?query=linux&amp;lang=en">linux</a> <span class="metrics-count">5,811 queries</span> <span class="metrics-lang">[en]</span></li><br/> <li><a href="http://re.search.wikia.com/metrics/querytrends.html?query=wikipedia&amp;lang=en">wikipedia</a> <span class="metrics-count">5,707 queries</span> <span class="metrics-lang">[en]</span></li><br/> <li><a href="http://re.search.wikia.com/metrics/querytrends.html?query=britney&amp;lang=en">britney</a> <span class="metrics-count">5,296 queries</span> <span class="metrics-lang">[en]</span></li><br/> <li><a href="http://re.search.wikia.com/metrics/querytrends.html?query=denzel&amp;lang=en">denzel</a> <span class="metrics-count">5,006 queries</span> <span class="metrics-lang">[en]</span></li><br/></ol><br/>Also nehmt es mir nicht &uuml;bel, aber ernsthafte Suchen stelle ich mir irgendwie anders vor... Wenn die Suche nach "test" noch auf Platz 4 landet scheinen ziemlich viele Leute Wikia einfach nur mal auszuprobieren und dann auf nimmerwiedersehen zu verschwinden. Die Suche nach "google" k&ouml;nnte man schon sarkastisch nennen und die was die Leute bei einer Suche nach "sex" oder "linux" ernsthaft an Ergebnissen erwarten (au&szlig;er sicher der Wikipedia-Seite zu diesem Thema und &auml;hnlich vielsagenden Dingen) will ich lieber garnicht erst wissen.

<p>Ich selbst finde Wikia h&auml;tte durchaus das Potential Google f&uuml;r mich abzul&ouml;sen und ernsthaft verwendet zu werden.. dies aber nur unter der Bedingung dass es viele Leute verwenden. Da das aber eine ziemlich schlecht erf&uuml;llbare rekursive Bedingung ist w&uuml;rde ich nicht allzusehr darauf hoffen. Das bedeutet nicht dass ich Wikia komplett abschreiben w&uuml;rde, aber im Moment ertappe ich mich einfach selbst immer wieder dabei wie ich (auch als ich Wikia zeitweise als Standardsuche eingestellt hab) lieber bei Google und &auml;hnlichem suche, wenn ich etwas ernsthaft finden will.</p>
<p>Ein haufen Geeks die mit einem Tool rumspielen und dann weiter 08/15 mit dem <a href="http://www.google.de/" target="_blank">Platzhirsch</a> arbeiten sind halt doch keine ernste Nutzerbasis.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_543" onclick="set_comment_reference(543)" title="auf diesen Kommentar antworten">#543</a>:
    07.Sep.2008 01:09
    von
    
      
        <a href="http://www.klonblog.com" target="_blank">
          Kloni
        </a>
</p>
<p>ich habe generell das Gef&uuml;hl, dass wenn ich andere Suchmaschinen als Google nutze, ich irgendetwas verpasse. Dass diese mir einfach nicht alles anzeigen. Wobei nat&uuml;rlich Google auch nicht alles anzeigt und die anderen SM nicht unbedingt schlechtere Resultate liefern.<br/>
Daher denke ich der unbewusste, subjektive Eindruck spielt die gr&ouml;sste Rolle! Und da komme ich vom "Platzhirsch" einfach nicht los...!</p>

<p class="infos">
<a href="#comment_544" onclick="set_comment_reference(544)" title="auf diesen Kommentar antworten">#544</a>:
    07.Sep.2008 08:09
    von
    
      
        <a href="http://www.bunix.de" target="_blank">
          reaper
        </a>
</p>
<p>Hmmm, ernstnehmen man mache sich mal die M&uuml;he zu schauen welche Seiten da auf wikia so JavaScripten wollen:</p>
<p>googleapis.com<br/>
isc.com<br/>
wikia.com</p>
<p>&Uuml;rgendwie komisch, schon das Wikia nicht ohne JavaScript funktioniert ist ja schon peinlich aber dann auch noch <a href="http://googleapis.com" rel="nofollow">googleapis.com</a> auf irgendeine Weise zu verwenden ist suspekt...</p>

<p class="infos">
<a href="#comment_545" onclick="set_comment_reference(545)" title="auf diesen Kommentar antworten">#545</a>:
    07.Sep.2008 10:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>das ist allerdings auch mehr als fragw&uuml;rdig..<br/>
wobei ich diverse Funktionen von Wikia auch interessant finde, z.B. die Integration eines Scriptes (via browsererweiterung) in andere Suchmaschinen (gesehen bei Google und Yahoo) zum bewerten der dortigen Suchergebnisse auf Wikia...<br/>
Das ist schon etwas sehr dreist.</p>

<p class="infos">
<a href="#comment_546" onclick="set_comment_reference(546)" title="auf diesen Kommentar antworten">#546</a>:
    08.Sep.2008 07:09
    von
    
      
        <a href="http://www.bunix.de" target="_blank">
          reaper
        </a>
</p>
<p>aja man darf ja gar nicht weitergucken... Erstmal geht suchen nur mit Javascript und schlimmer noch, nur wenn man die oben erw&auml;hnten googleapis aktiviert. Fatal finde ich ja dann das zu den Ergebnissen angezeigt wird welche IPs welche Aktion mit den Ergebnissen get&auml;tigt haben. Ahhhh ich glaubs ja wohl nicht, google tut ja wenigstens so als ob sie keine Daten sammen w&uuml;rden <em>roleeyes</em></p>

<p class="infos">
<a href="#comment_547" onclick="set_comment_reference(547)" title="auf diesen Kommentar antworten">#547</a>:
    08.Sep.2008 07:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Das h&auml;ngt wohl eher mit dem Wiki-Ursprung zusammen...<br/>
Wenn du angemeldet bist wird halt dein Nickname statt deiner IP angezeigt, ich finde das ist noch das geringste &Uuml;bel an der ganzen Sache.</p>

<p class="infos">
<a href="#comment_548" onclick="set_comment_reference(548)" title="auf diesen Kommentar antworten">#548</a>:
    03.Oct.2008 02:10
    von
    
      
        <a href="http://wikipedistik.de" target="_blank">
          Tim 'avatar' Bartel
        </a>
</p>
<p>Du hast mit deinem Artikel nat&uuml;rlich vollkommen recht - der wichtigste Faktor f&uuml;r ein erfolgreiches Wikia-Search ist eine entsprechende Nutzerbeteiligung.</p>
<p>Unter der Adresse <a href="http://re.search.wikia.com/metrics/queries.html" rel="nofollow">http://re.search.wikia...</a> kannst du nachvollziehen, wieviele Suchen durchgef&uuml;hrt werden.</p>
<p>Interessanterweise kommt rund jede zweite Anfrage aus Deutschland (das kann man den Graphen momentan noch nicht entnehmen).</p>

<p class="infos">
<a href="#comment_549" onclick="set_comment_reference(549)" title="auf diesen Kommentar antworten">#549</a>:
    03.Oct.2008 02:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Wie gesagt... rekursive Bedingungen.<br/>
Wenn man Wikia nur dann generell verwenden kann, wenn es alle verwenden, kann man nunmal nur darauf hoffen dass es genug Geeks da drau&szlig;en gibt die immer sch&ouml;n Suchergebnisse liefern.</p>
<p>Ich versuche auch teilweise noch weiterhin via Browserplugin wenigstens so nebenbei ein Paar Ergebnisse von anderen Suchmaschinen bei Wikia einzutragen. (Wie bereits bemerkt ist diese Funktion des Plugins etwas sehr frech bis fragw&uuml;rdig, aber wohl auch eine der wenigen M&ouml;glichkeiten f&uuml;r Wikia an Daten zu kommen ohne vorher selber schon welche zu haben.)<br/>
Allerdings verwende ich Wikia nicht mehr/noch nicht ernsthaft als wirkliche Alternative zu Google und ich hoffe nicht wirklich darauf dass sich dies innerhalb der n&auml;chsten paar Monate pl&ouml;tzlich &auml;ndert. Ich glaube einfach noch nicht dass sich mehr als ein paar ganz wenige Enthusiasten finden die daf&uuml;r genug Daten liefern.</p>
<p>Ich h&auml;tte nat&uuml;rlich nichts dagegen wenn mir die Beteiligten das Gegenteil beweisen. ;-)</p>

<p class="infos">
<a href="#comment_550" onclick="set_comment_reference(550)" title="auf diesen Kommentar antworten">#550</a>:
    03.Oct.2008 02:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>&Uuml;brigens ist <a href="http://technorati.com/search/wikia?authority=a4&amp;language=de&amp;page=2" rel="nofollow">http://technorati.com/...</a> doch mal ein sehr netter Referer f&uuml;r jemanden der als Homepage <a href="http://wikipedistik.de/" rel="nofollow">http://wikipedistik.de/</a> angibt und Kommentare zu Wikia-Artikeln abgibt. Ein Schelm wer b&ouml;ses dabei denkt...</p>
<p>(Da der Kommentar aber gerade noch so auf den Inhalt eingeht und relativ sinnlos ist hab ich ihn mal doch wieder aus dem Spamfilter geholt)</p>

<p class="infos">
<a href="#comment_551" onclick="set_comment_reference(551)" title="auf diesen Kommentar antworten">#551</a>:
    03.Oct.2008 04:10
    von
    
      
        <a href="http://wikipedistik.de" target="_blank">
          Tim 'avatar' Bartel
        </a>
</p>
<p>Relativ sinnlos? ;-)</p>
<p>Ich hatte nicht die Absicht, hier "unerkannt" zu kommentieren. Darauf, dass ich vorbelastet bin, wollte ich eigentlich mit der "internen" Nutzungsstatistik hinweisen.</p>
<p>Konkret bin ich der hier: <a href="http://de.wikia.com/wiki/Benutzer:Avatar" rel="nofollow">http://de.wikia.com/wi...</a>  - aber bin seit Jahren unter meiner "normalen Blogger-Identit&auml;t" in der Blogosph&auml;re unterwegs und mag das nicht nur aufgrund meiner Arbeit &auml;ndern. Ich k&ouml;nnte allerdings mal auf Wikipedistik selbst prominenter auf meinen Job hinweisen.</p>

<p class="infos">
<a href="#comment_552" onclick="set_comment_reference(552)" title="auf diesen Kommentar antworten">#552</a>:
    03.Oct.2008 05:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>'tschuldige ich wollte sinnvoll schreiben.<br/>
Ich w&uuml;rde ja auch kaum Kommentare stehen lassen weil sie sinnlos sind.. gibt irgendwie keinen sinn oder?^^</p>
<p>Ich habe auch nicht gemeint dass du unerkannt als Wikia-"Mitarbeiter" unterwegs bist.</p>
<p>Was ich meinte war Vorgehensweise nach Blogs mit einer gewissen Technorati-Grundautorit&auml;t zu suchen, die &uuml;ber Wikia berichtet haben um dann dort zu kommentieren. ;-)<br/>
Wie gesagt.. ein Schelm wer seine Schlussfolgerungen daraus zieht und b&ouml;ses dabei denkt.</p>

<p class="infos">
<a href="#comment_553" onclick="set_comment_reference(553)" title="auf diesen Kommentar antworten">#553</a>:
    04.Oct.2008 03:10
    von
    
      
        <a href="http://wikipedistik.de" target="_blank">
          Tim 'avatar' Bartel
        </a>
</p>
<p>Ah, ok. Dann habe ich dich missverstanden. Kurz zu meiner Vorgehensweise um f&uuml;r mich interessante Inhalte zu finden (die IMHO nicht so un&uuml;blich ist): Ich suche bei Technorati nach allen m&ouml;glichen Themen, die mich interessieren - von Wikia &uuml;ber Wikipedia, Katzen (ich habe zwei Kater), Degus (Nagetierart), Demoszene (Computer-Kunst) und &auml;hnliches. Damit finde ich ich bei Ausschluss der Blogs mit der niedrigsten Relevanz (um "Spamblog-Funde" zu vermeiden), relativ viele Blogpostings, die mich interessieren.</p>
<p>Ob ich dann einen Kommentar schreibe oder nicht, entscheide ich genauso, wie wenn ich einen Blogeintrag per Google, in meinem Agregator oder auf welchem Weg auch immer finde.</p>

<p class="infos">
<a href="#comment_554" onclick="set_comment_reference(554)" title="auf diesen Kommentar antworten">#554</a>:
    04.Oct.2008 09:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>H&auml;tte ich wirklich ernsthaft auf Spamgr&uuml;nde getippt st&uuml;nde dein Kommentar auch schon seit einiger Zeit nicht mehr hier... ;-)</p>
</div>