+++
title = "Fragebogen von Max Frisch"
date = "2008-10-15T01:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/943"
aliases = "blog/943"
+++

<p>Bei Max Frisch gibt es <a href="http://www.wikiservice.at/buecher/wiki.cgi?MaxFrisch/Fragebogen" target="_blank">einen kurzen Fragebogen</a> zur eigenen Meinung &uuml;ber Menschheit und Kultur. Die Antworten vom Autor gibts wohl <a href="http://www.amazon.de/Fragebogen-Max-Frisch/dp/3518394525" target="_blank">nicht direkt</a> im Internet, aber ich habe mit mal selber Gedanken dar&uuml;ber gemacht und einige Antworten notiert.<!--more--><br/></p><ol><br/> <li>Ich bin mir ziemlich sicher dass es universell genug gesehen egal ist... wie so ziemlich alles andere.</li><br/> <li>Weil alles ziemlich nichtig wird, wenn man es auf den Status des ganzen Universums hochrechnet.</li><br/> <li>Seltsame Frage, ich hatte noch nicht die Gelegenheit... (Wenn ich die Frage richtig interpretiert habe zumindest)</li><br/> <li>Da gibt es einige... Diverse Ex-Gesch&auml;ftspartner (ok, allen bin ich nicht begegnet), Klassenkammeraden, Professoren, ... und nat&uuml;rlich ganz generell allen die ich ganz subjektiv f&uuml;r "unter meinem Niveau" bewertet habe.</li><br/> <li>Nicht dass ich w&uuml;sste. ICH HABE IMMER RECHT! (Etwas Spa&szlig; muss sein)</li><br/> <li>Was reine Fakten betrifft ja, sehr gerne. Was Erlebnisse und Gef&uuml;hle betrifft nein.</li><br/> <li>Wolfgang Sch&auml;uble w&auml;re sicher nicht falsch... allerdings w&auml;re mir ein "zur&uuml;ckrollen" erheblich lieber. F&uuml;r wirkliche Hoffnung reicht das allerdings nicht, unser System ist einfach schon zu sehr zerschossen und es gibt genug die ihn gerne vertreten w&uuml;rden.</li><br/> <li>Keinen, nicht aus religi&ouml;sen Gr&uuml;nden oder weil Tote tot bleiben sollen.. einfach aus &Auml;sthetischen Gr&uuml;nden.</li><br/> <li>Die Liste wird lang... Angefangen bei Personen wie Adolf Hitler, &uuml;ber irgendwelche verstorbenen Grundschullehrer, bis hin zu religi&ouml;sen Fanatikern.</li><br/> <li>Es gibt leider keine perfekte Kultur und mir fehlt der Einblick in andere Kulturen um wirklich bestimmen zu k&ouml;nnen in welcher ich mich wohler f&uuml;hlen&nbsp; w&uuml;rde. Die aktuelle Lage mag untragbar sein, aber zumindest habe ich genug Einblick bekommen um langsam zu wissen was daran kaputt ist.</li><br/> <li>Ohne Auswirkungen eines Alterungsprozesses gerne auch 100 Jahre... ansonsten m&ouml;chte ich VOR schwereren Auswirkungen entsorgt werden.</li><br/> <li>JA! Unbedingt! Mehrheit ist nicht automatisch im Recht. Ich halte es da mit Schiller: &bdquo;Was ist die Mehrheit? Die Mehrheit ist der Unsinn. Verstand ist stets bei wenigen nur gewesen.&ldquo;</li><br/> <li>Das h&auml;tte sich damit erledigt...</li><br/> <li>Ich hasse viele einzelne Personen und das System das sie hervorgebracht hat. <a href="/2008/10/15/schrecken-ohne-ende-oder-ende-mit-schrecken/">Gr&uuml;nde nannte ich erst im letzten Post.</a></li><br/> <li>F&uuml;r die beantwortung dieser Frage w&auml;re es sinnvoll zu wissen mit wem man sich vergleichen soll. Mit der Mehrheit? Dann auf JEDEN Fall. Es gibt sehr viele dumme N&uuml;sse da drau&szlig;en. Mit allen? Auf KEINEN Fall, es gibt einige Lichtblicke. Die oberen 90%? 80? 99? Ich habe keine Ahnung. (Mein Alter: 24)</li><br/> <li>W&auml;re dem nicht so, w&uuml;rde ich sie doch wohl anpassen oder?</li><br/> <li>Ehrlichkeit nimmt man IMMER &uuml;bel. Keiner will die Wahrheit &uuml;ber sich h&ouml;ren.</li><br/> <li>Warum sollte sie?</li><br/> <li>Nein, es mangelt mir in meinem Lebenslauf schlicht an Verstorbenen. Ich lebe noch in der Gegenwart, das &auml;ndert sich erst mit h&ouml;herem Alter.</li><br/> <li>Ja</li><br/> <li>Aus vielen Details die mir sofort einfallen wenn ich auch nur den Gedanken tangiere und meinen Verlust&auml;ngsten.</li><br/> <li>Ich hatte wahrscheinlich Angst vor der Strafe.</li><br/> <li>Freiheit... Sei es in Form der Freiheit zu Handeln wie man gerade will oder bestimmten Menschen zu sagen was man gerade denkt.</li><br/></ol><br/>Die letzten beiden Fragen waren dann so ziemlich Niveaubefreit (also noch mehr als einige vorherige), da habe ich mir eine Antwort komplett gespart.

<p>(<a href="http://sprechblase.wordpress.com/2008/10/15/links-zum-lunch/" target="_blank">via Cem</a>)</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_758" onclick="set_comment_reference(758)" title="auf diesen Kommentar antworten">#758</a>:
    15.Oct.2008 02:10
    von
    
      <a href="/blog/author/toranor/">
        toranor
      </a>
</p>
<p>ok, wag ich mich auch mal ran. ich hoffe man traut mir dann noch &uuml;ber den weg.</p>
<ol>
<li>
<p>Kann die Frage nicht beantworten, weil si impliziert, dass mich die erhaltung des menschengeschlechtes interessiert, was jedoch nicht der fall ist.</p>
</li>
<li>
<hr/>
</li>
<li>
<p>Null, weil ich noch kein Kind hatte.</p>
</li>
<li>
<p>keinem, einige begegnungen w&uuml;rd ich aber gern wiederholen, die h&auml;tten anders laufen k&ouml;nnen.</p>
</li>
<li>
<p>weder noch.</p>
</li>
<li>
<p>nein. vergessen ist die st&auml;rkste waffe der menschheit.</p>
</li>
<li>
<p>jeder ist ersetzbar. jeder wird ersetzt.</p>
</li>
<li>
<p>Jesus. Ich will wissen, ob er am Kreuz gestorben ist, oder ob er &uuml;berlebt hat, und es wirklich bis zum fuss des himalaya geschafft hat.</p>
</li>
<li>
<p>gott. der kann tot bleiben (siehe nietsche)</p>
</li>
<li>
<p>Nation: nein, Kultur: ja.</p>
</li>
<li>
<p>Mir egal, ich kann nur sagen was ich noch erleben will: Das ende des &Ouml;ls, die erste kolonie auf einem anderen Planeten und den niedergang der menschheit.</p>
</li>
<li>
<p>ja.</p>
</li>
<li>
<hr/>
</li>
<li>
<p>Ich hasse allein. mein hassi st stark genug, ich brauch da keine unterst&uuml;tzeung. Ich kann einzelne und kollektive gleich hut hassen.</p>
</li>
<li>
<p>Ich denke, mit 23 werde ich noch kl&uuml;ger, aber nicht mehr viel.</p>
</li>
<li>
<p>ja.</p>
</li>
<li>
<p>Ich nehme &uuml;bel, wenn jemand ungefragt mit seiner pr&auml;senz in meine beschaulichkeit tritt. im klartext:  jemand reisst mich unangek&uuml;ndigt aus dem schlaf. Was ich &uuml;bel nehme: verpissen. Wof&uuml;r ich eher um verzeihung bitte ? da ich f&uuml;r die fehler anderer nich um verzeihung bitten kann, spar ich mir die antwort.</p>
</li>
<li>
<p>nein.</p>
</li>
<li>
<p>die toten sollen mal sch&ouml;n die gusche halten.</p>
</li>
<li>
<p>nein.</p>
</li>
<li>
<p>weil ich noch nie jemand geliebt hab.</p>
</li>
<li>
<p>ich war zu faul. (kein scheiss)</p>
</li>
<li>
<p>eine welt, in der ich so sein kann wie ich will und auch die m&ouml;glichkeiten habe dies zu tun.</p>
</li>
<li>
<p>meine phantasie und mein vorstellungsverm&ouml;gen.</p>
</li>
</ol>
<p>25.ich w&auml;r lieber tot, aber wenn schon tier dann bitte etwas canides.</p>
<p>24.</p>
</div>