+++
title = "Schrecken ohne Ende oder Ende mit Schrecken?"
date = "2008-10-15T11:10:00"
author = "Dr. Azrael Tod"
tags = ["Politik", "Rant"]
issoid = "blog/940"
aliases = "blog/940"
+++

<p>Ich ertappe mich in letzter Zeit immer &ouml;fter bei der Hoffnung dass dieses System doch bitte endlich endg&uuml;ltig zusammenbricht. Wir brauchen ganz einfach diese Gelegenheit um ein sinnvolles System aufzustellen.<br/>Wir haben Staatsverschuldung auf einem Niveau dass der Staat mehr f&uuml;r Zinsen zahlt als f&uuml;r alle Bildungsprogramme zusammen.<br/>Wir haben Einzelpersonen die &uuml;ber Geldwerte verf&uuml;gen die sie auch dann niemals ausgeben K&Ouml;NNTEN wenn sie es wirklich bewusst versuchen w&uuml;rden.<!--more--></p>
<p>Geld sollte ganz fr&uuml;her mal Tauschwaren repr&auml;sentieren, welche Tauschware hatte denn ein solcher Gro&szlig;aktion&auml;r oder B&ouml;rsenspekulant f&uuml;r die er das Geld bekommen hat?<br/>Die B&ouml;rse an sich ist nur wieder eine neue Variante eines Gl&uuml;cksspieles, allerdings mit leicht ver&auml;nderten Regeln: Wer mehr Geld hat, bekommt automatisch gr&ouml;&szlig;ere Gewinnchancen.</p>
<p>Dementsprechend ist es auch logisch wenn sich soziale Unterschiede immer weiter verst&auml;rken. Das Geld flie&szlig;t nunmal kaum in die Breite, es t&uuml;rmen sich allein durch die Regeln eines solchen Systemes immer gr&ouml;&szlig;ere Haufen mit immer kleinerer Grundfl&auml;che auf.<br/>Weil Personen die auf dem gr&ouml;&szlig;tem Haufen sitzen auch gleich die Regeln bestimmen kann dieses System sich von Natur aus niemals von innen heraus &auml;ndern.</p>
<p>W&uuml;rden wir davon ausgehen, das die Politik einen &auml;u&szlig;eren Einfluss bildet, w&auml;re dies also der logischste Ansatzpunkt um &Auml;nderungen herbei zu f&uuml;hren. Das hat allerdings einen Haken: Politiker sind (wie wir alle wissen) nicht die gewissenhaften und unabh&auml;ngige Kontrollquelle. Sie sind korrupt, richten sich lieber nach der Meinung ihrer Partei statt nach ihrer eigenen und entscheiden eher nach ihrem eigenem Vorteil statt nach dem f&uuml;r die Allgemeinheit.</p>
<p>Versteht mich nicht falsch, dies ist weder Vorwurf noch Anschuldigung an die Adresse der Politiker. Es ist eine Feststellung, dieses System muss aufgrund seiner Regeln derartige Ergebnisse liefern.<br/>Als Politiker steht man auch nur vor der Wahl "M&ouml;chte ich den einfachen Weg gehen oder den schweren?".<br/>Dabei gibts auf dem einfachen nicht nur mehr Geld... man lebt auch in ruhiger Koexistenz mit all den anderen Politikern, muss sich keine gro&szlig;en Anfeindungen seitens der Medien gefallen lassen und bekommt nat&uuml;rlich auch Unterst&uuml;tzung von h&ouml;heren Instanzen wie Parteispitze oder Vorsitzenden der Gremien denen man angeh&ouml;rt.<br/>Die Alternative des schweren Weges hingegen wird &uuml;berhaupt nicht belohnt.</p>
<p>Theoretisch sollte die Belohnung aus W&auml;hlerstimmen bestehen, doch wann entscheiden die schonmal nach Inhalten? Glaubt hier ernsthaft noch jemand ein Gerhard Schr&ouml;der w&auml;re Bundeskanzler geworden weil er die besseren Inhalte brachte? Oder eine Angela Merkel?</p>
<p>Schr&ouml;der kann einfach reden, wenn der sich hinstellt und die Leute eine Weile dusslig redet glauben die ihm irgendwann sogar. Das hat mit seinen politischen Entscheidungen etwa so viel zu tun wie ein Brecheisen mit Wackelpudding. Merkel auf der anderen Seite ist Frau und Ostdeutsche... In einem Land in dem diese beiden Gruppen noch nie als Anf&uuml;hrer gew&auml;hlt waren und die Menge der Personen die einer oder beiden Gruppen angeh&ouml;ren weit &uuml;ber der H&auml;lfte liegt bringt das nat&uuml;rlich auch Punkte.<br/>Die klitzekleine Tatsache nicht zu vergessen, dass es zu beiden eigentlich jeweils keine Alternative gab.</p>
<p>So und jetzt mal ehrlich: Wem ist aufgefallen dass ich im letzten Absatz genau das getan habe, was der extremste Fehler ist? Wir haben NICHT Schr&ouml;der oder Merkel gew&auml;hlt! Wir haben die Parteien bei der Bundestagswahl gew&auml;hlt, die einen der Beiden als Kanzlerkandidaten aufgestellt haben.<br/>Danach hat sich aber wieder keiner entschieden, was haben Parteien schon f&uuml;r vergleichbare Daten? Inhalte? PAH! Erstens sind die bei allen gro&szlig;en Parteien ziemlich die gleichen, zweitens kann keine Partei diese Inhalte "r&uuml;berbringen" und drittens kann man doch viel sch&ouml;ner nach einer einzelnen Person entscheiden.</p>
<p>Dieses Wahlsystem ist einfach im Arsch... <a href="/2008/10/8/Personal(wqu)ahl!/">Ich kanns nur immer wieder sagen.</a></p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_749" onclick="set_comment_reference(749)" title="auf diesen Kommentar antworten">#749</a>:
    15.Oct.2008 12:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Alternativtitel: "Ach ich bin von dieser Welt so m&uuml;d..."</p>

<p class="infos">
<a href="#comment_750" onclick="set_comment_reference(750)" title="auf diesen Kommentar antworten">#750</a>:
    15.Oct.2008 02:10
    von
    
      <a href="/blog/author/toranor/">
        toranor
      </a>
</p>
<p>Angenommen wir st&uuml;rzen den Kapitalismus, was kommt dann ? Was  sind unsere Alternativen ?</p>
<p>Kommunismus:<br/>
Geld spielt eine untergeordnete Rolle, jeder ist gleich. Sch&ouml;ner Ansatz, aber das scheiter an den Menschen selber, niemand ist bereit sich aufzugeben, und seinen pers&ouml;nlichen Vorteil zu verschenken, um jemand , der nicht so viel getan hat auf sein niveau zu heben. Hier sieht letztendlich der Egoismus und der Geiz des einzelnen.</p>
<p>Faschismus:<br/>
Wir suchen uns einen F&uuml;hrer und beten ihn an. Vollbesch&auml;ftigung. Scheint zu klappen, nur ist nicht ganz billig. Gegenfinanzierung nur durch Krieg m&ouml;glich. Scheiss Idee. Mit uns deutschen will keiner Krieg spielen solange wir nicht anfangen.<br/>
Wenn wir das nicht gegenfinanzieren, dann enden wir wie Nordkorae unter Kim Jong Il, ein mensch, der seine Krankheit schon im Name tr&auml;t. Hungersnot, Stagnation, Armut. Aber die haben das zweitgr&ouml;sste Heer der Welt. Wird zeit dass die mal loslegen, sonst k&ouml;nnen sie ihre SOldaten bald nicht mehr bezahlen.</p>
<p>Feudalismus:<br/>
Kleinstaaterei, Leibeigenschaft. Nicht das optimum, um an der Weltspitze mitzureden. Geld ist egal, das hat dein Herr. Der hat auch deine Frau, deine Kinder, dein Land und dein Leben. Deinen Laptop, dein Auto, dein Internetanschluss und dein Wissen. Nicht grad rosig, und das Geld sammelt sich schon wieder bei einigen Wenigen.</p>
<p>Absolutismus &amp; Diktatur:<br/>
Wie feudalismus nur schlimmer. Hier geh&ouml;rt ALLES dem K&ouml;nig. Das Recht die Armee das Land, mit allem was daruf ist. Geld ist egal, hat eh der K&ouml;nig. Le roi es mort, vive le roi.</p>
<p>Despotismus:<br/>
Yeah, back to the roots. Geld is egal, weil keiner spart, da er nicht weiss ob er am n&auml;chsten Tag noch lebt. Es regiert das Recht des st&auml;rkeren. Und der st&auml;rkere regiert so lange bis jemand kommt und ihn umboxt. und so weiter.</p>
<p>Anarchie:<br/>
Kein Herrscher, keine Ordnung, keine Sorgen ? Nicht ganz, wo kirgest du was zu futtern her ? Wenn jeder macht, wonach ihm ist, kommen wir da hin wo wir angefangen haben.</p>
<p>du siehts die Alternativen sind nicht so rosig.</p>

<p class="infos">
<a href="#comment_751" onclick="set_comment_reference(751)" title="auf diesen Kommentar antworten">#751</a>:
    15.Oct.2008 02:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ist mir klar, meine Aussage war ja auch nur dass das System so ziemlich am Ende ist und wir es offensichtlich nichtmehr wirklich zum funktionieren bringen werden.<br/>
Manchmal ist neu aufbauen halt einfacher als renovieren.<br/>
Der Kapitalismus hat sich ja bisher auch noch am sinnvollsten erwiesen (Wobei.. wie komm ich eigentlich zu der seltsamen Aussage? Feudalismus und Diktaturen haben teilweise erheblich l&auml;nger durchgehalten), das Problem ist halt dass die relativ gute Idee der Sozialen Marktwirtschaft so vollkommen verloren gegangen ist.<br/>
Unser Staat hat sich schlicht selbst von einer eigentlich teilweise sinnvollen Ausgangslage zu dieser aktuellen Absurdit&auml;t entwickelt.</p>
<p>Ich pers&ouml;nlich w&auml;re ja z.B. f&uuml;r ein System bei dem Richter mehr beauftragt werden Gesetze nach der dahinter stehenden Intention zu interpretieren statt sich immer alles Wortw&ouml;rtlich vorgelegt zu brauchen. Dementsprechend k&ouml;nnte man dann auch ein Gesetzessystem aufstellen dass man ohne mehrj&auml;hriges Studium verstehen k&ouml;nnte.<br/>
Das gleiche gilt nat&uuml;rlich auch f&uuml;r das Steuersystem. Ich glaube wir sind in Deutschland zu sehr darauf bedacht immer alles zu tote zu regulieren. Universelle gerechtigkeit kann man mit Gesetzen und Verordnungen nunmal nicht erreichen und wenn man das System zu komplex macht landet man dort wo wir heute schon stehen: Nur wer sich die teuersten Anw&auml;lte leisten kann, wird noch dazu kommen alle seine Rechte aus&uuml;ben zu k&ouml;nnen.</p>

<p class="infos">
<a href="#comment_752" onclick="set_comment_reference(752)" title="auf diesen Kommentar antworten">#752</a>:
    15.Oct.2008 04:10
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>bzgl Beitrag: leider volle Zustimmung - ist bitter - ist aber leider so.</p>
<p>bzgl anderen Ans&auml;tzen:<br/>
Wie w&auml;rs mit demokratisch gew&auml;hlter Diktatur auf beschr&auml;nkte Zeit inkl. kompletter Verantwortungs&uuml;bername seitens des jeweiligen Diktators ? ;)</p>

<p class="infos">
<a href="#comment_753" onclick="set_comment_reference(753)" title="auf diesen Kommentar antworten">#753</a>:
    15.Oct.2008 04:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>@fidel:<br/>
Keine sonderlich gute Idee...<br/>
Es gibt zu viele Spinner da drau&szlig;en, Verantwortung gleichm&auml;&szlig;ig auf ALLE Schultern verteilen ist ein Fehler, aber sie auf einen zu konzentrieren auch. Bei einem derartigem System k&ouml;nnte man sofort darauf warten dass sich jemand findet der das mal so zum Spa&szlig; &uuml;bernimmt um 2-3 Jahre seinen Spa&szlig; zu haben, auch wenn er hinterher mit der H&ouml;chststrafe rechnen muss.</p>

<p class="infos">
<a href="#comment_754" onclick="set_comment_reference(754)" title="auf diesen Kommentar antworten">#754</a>:
    15.Oct.2008 08:10
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Mein alter Sozi-Lehrer hat einmal gesagt "Von allen schlechten Staatsformen haben wir uns eben die beste ausgesucht." Und er hat Recht: Im Kapitalismus ist alles fair, im Kommunismus geht es jedem gut, in einer Diktatur kann man eine funktionierende Wirtschaft aufbauen... bei uns funktioniert gar nix, aber das sehr gut.</p>
<p>Anarchie w&uuml;rd ich &uuml;brigens niemals als Staatsform bezeichnen, sondern eher als Zustand, der zu einer anderen Staatsform f&uuml;hren wird. Genau genommen fangen Staaten wohl immer bei der Anarchie an und h&ouml;ren bei der Demokratie auf, damit es wieder von vorne losgehen kann, aber das w&auml;re eine zu weitf&uuml;hrende Meinung f&uuml;r den Kommentar hier.</p>

<p class="infos">
<a href="#comment_755" onclick="set_comment_reference(755)" title="auf diesen Kommentar antworten">#755</a>:
    16.Oct.2008 12:10
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>@Dr. Azrael Tod:<br/>
war auch nicht so ganz ersnthaft gemeint - wobei ob es wirklich schlimmer werden w&uuml;rde kann ich trotzdem nicht zu 100% unterschreiben ;)</p>

<p class="infos">
<a href="#comment_756" onclick="set_comment_reference(756)" title="auf diesen Kommentar antworten">#756</a>:
    16.Oct.2008 12:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Verst&auml;ndlich... Ich bin mir ja auch nicht sicher ob jemand bewusst gr&ouml;&szlig;eren Bl&ouml;dsinn verzapfen kann als unsere gew&auml;hlten F&uuml;hrer mal so eben nebenbei veranstalten.</p>

<p class="infos">
<a href="#comment_757" onclick="set_comment_reference(757)" title="auf diesen Kommentar antworten">#757</a>:
    16.Oct.2008 12:10
    von
    
      
        <a href="/2008/10/16/was-vertragen-wir/" target="_blank">
          Was vertragen wir? &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] vertragen&nbsp;wir?  In meinem Beitrag &ldquo;Schrecken ohne Ende oder Ende mit Schrecken?&rdquo; habe ich die These aufgestellt dass unser System einem totalem Kollaps sehr nahe ist. Sp&auml;ter ist [...]</p>
</div>