+++
title = "Kauft nicht bei Buchhandelsketten!"
date = "2010-07-03T03:07:00"
author = "Dr. Azrael Tod"
tags = ["Bücher/Literatur", "Dresden", "Säue durchs Dorf treiben", "Zwickau"]
issoid = "blog/1528"
aliases = "blog/1528"
+++

<p>Derzeit wird mal wieder eine <a href="http://eria.blogger.de/stories/1656058/" target="_blank">Sau</a> durch <a href="http://www.stoibaer.de/ich-kaufe-nicht-mehr-bei-thalia.html" target="_blank">klein</a> <a href="http://noricus.wordpress.com/2010/07/01/thalia-vs-ennsthaler-endlich-frieden/" target="_blank">Bloggersdorf</a> <a href="http://www.charmingquark.de/?p=3813" target="_blank">getrieben</a>, weil Thalia als gro&szlig;e Buchhandlung ein kleines <a href="http://books4you.buchmedia.at/" target="_blank">Verlagshaus/Buchhandlung</a> zur &Uuml;bernahme zwingen wollte. <br/>Nat&uuml;rlich hat sich auch gleich wieder eine <a href="http://www.facebook.com/group.php?gid=133968329964945" target="_blank">Gruppe auf Facebook gegr&uuml;ndet</a>, in der die Mitglieder, unter verwendung von viel zu vielen Ausrufezeichen, androhen nicht mehr bei Thalia einkaufen zu gehen.</p>
<p>...und trotzdem kaufe ich gerne bei Thalia ein.. einfach schon daher weil ich kaum noch kleinere Buchl&auml;den in der N&auml;he kenne, die nicht zu Thalia geh&ouml;ren (Haus des Buches oder so.. <a href="http://www.boersenblatt.net/254719/">alles an Thalia gegangen</a>) und weil dadurch Thalia so ziemlich das einzige in Dresden und Zwickau ist, wo man &uuml;berhaupt noch gepflegt in einer gro&szlig;en Buchhandlung st&ouml;bern kann.</p>
<p>Nach l&auml;ngerem &Uuml;berlegen bin ich &uuml;berhaupt nur auf Bahnhofsbuchhandlungen gekommen, so gibt es z.B. im Dresdner Hauptbahnhof noch eine Filiale von <a href="http://www.wittwer.de/" target="_blank">Wittwer</a>. Aber auch dort muss ich mit weit weniger Auswahl leben, SciFi und Fantasy teilen sich einen kleinen Teil eines Regales und mehr als die aktuell gerade gefragent Standardgeschichten (Nein verdammt, ich will keine romantisch-angehauchte Vampirgeschichte f&uuml;r kleine M&auml;dchen kaufen!) gibt es dort auch kaum noch. Wirklich sch&ouml;n ist noch Hugendubel in der Altmarktgalerie in Dresden, aber wenn ich eine gro&szlig;e Kette gegen eine andere eintausche, was erreiche ich damit?</p>
<p>Dann h&auml;tten wir noch sowas wie Weltbild oder so, aber das ist kein Buchladen. Die verkaufen nur noch nebenbei B&uuml;cher und eigentlich wollen die einem lieber Spielzeug, DVDs oder Deko-Artikel verkaufen, das scheint wohl mehr Umsatz zu generieren.</p>
<p>Wo gehe ich sonst meistens so B&uuml;cher kaufen?<br/></p><ul><br/><li>Haus des Buches zwischen Altmarktgalerie und Centrumgalerie -&gt; Thalia</li><br/><li>Haus des Buches in Zwickau im Zentrum -&gt; Thalia</li><br/><li>Buchhandlung in Dresden-Neustadt an der Hauptstra&szlig;e -&gt; Thalia</li><br/><li>Roter Turm (Einkaufszentrum) in Chemnitz -&gt; Thalia</li><br/><li>Elbepark (Einkaufszentrum) in Dresden -&gt; Thalia</li><br/><li>...</li><br/></ul>
<p>Ich bleibe also dabei: Ich gehe gerne bei Thalia einkaufen, erstens schon weil ich keine Alternative dazu habe und zweitens weil die L&auml;den im Verh&auml;ltnis zur Konkurrenz verdammt nett sind. Nat&uuml;rlich gibt es hier auch unsch&ouml;ne Dinge (englische B&uuml;cher die nicht in .de geschrieben wurden irgendwer?) aber die Leute sind (f&uuml;r Menschen) ziemlich nett, die Auswahl ist gro&szlig; und die B&uuml;cher sind einigerma&szlig;en sinnvoll sortiert (alleine das ist schon etwas was viele andere nicht zu schaffen scheinen).<br/>Thalia (und Hugendubel, zugegebenerma&szlig;en finde ich das fast noch besser) haben es sich redlich verdient dass ich mein Geld bei denen lass und in meinem Fall ist das wohl auch nicht wenig (alle 1-2 Wochen gehen wir B&uuml;cher kaufen, meist werden es mindestens 2-3 St&uuml;ck). Nat&uuml;rlich kann ich meine B&uuml;cher auch bei Amazon bestellen, im Lebensmitteldiscounter (z.B. Globus in Zwickau) mitnehmen oder bei Egay ersteigern, aber das w&uuml;rde den kleinen Buchhandlungen auch nicht helfen. Die sind tot.. kommt damit klar!</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1408" onclick="set_comment_reference(1408)" title="auf diesen Kommentar antworten">#1408</a>:
    03.Jul.2010 04:07
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>In Aachen gibt es die Meyersche Buchhandlung. Erst seit ich diese kenne gehe ich &uuml;berhaupt gerne nach B&uuml;chern st&ouml;bern :)</p>

<p class="infos">
<a href="#comment_1409" onclick="set_comment_reference(1409)" title="auf diesen Kommentar antworten">#1409</a>:
    03.Jul.2010 08:07
    von
    
      
        <a href="http://noricus.wordpress.com/" target="_blank">
          -noricus-
        </a>
</p>
<p>G&uuml;&szlig;e aus Bloggersdorf :D<br/>
Du sagst es ja in Deinem Beitrag: Wenn es kaum mehr Alternativen gibt, dann bleibt einem nichts Anderes &uuml;brig, als seine B&uuml;cher bei irgendwelchen Handelsriesen zu kaufen. Ob gerne oder nicht, das ist dem Riesen und auch dem geschlossenem Kleinh&auml;ndler egal.<br/>
Gerade am Beispiel Thalia vs. Ennsthaler l&auml;&szlig;t sich aber sehr gut erkennen, da&szlig; mehr m&ouml;glich ist als blo&szlig; einen Sto&szlig;seufzer gen Himmel zu schicken: Menschen (Kunden!) k&ouml;nnen sich anla&szlig;bezogen zusammentun, Protest einlegen und Druck aus&uuml;ben.<br/>
Der Einzige Druck, der heute noch irgendwie machbar ist, ist die Androhung finanzieller Verluste. Da Konzerne &amp; Co. nur mehr gewinnorientierte Firmenpolitik betreiben, ist nur die Aussicht auf schm&auml;lere Gewinne der einzige Angstfaktor, der sie zum Einlenken bewegen kann.<br/>
Genau das ist auch in diesem Fall gelungen.<br/>
Viele Kunden werden nun weiter mit Freude bei einem Kleinverlag, einem Familienbetrieb ihre B&uuml;cher kaufen k&ouml;nnen.<br/>
Das ist doch was, oder?</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1410">
<p class="infos">
<a href="#comment_1410" onclick="set_comment_reference(1410)" title="auf diesen Kommentar antworten">#1410</a>:
    03.Jul.2010 11:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>&Auml;h.. und was hat sich jetzt ge&auml;ndert? Mal f&uuml;r eine Woche wird eine Sau durchs Dorf getrieben und dann ist das wieder vergessen. Schlimmstenfalls kaufen ein paar Leute weniger B&uuml;cher bei Thalia und gehen stattdessen lieber zu Amazon, Hugendubel (wo ich heute btw. erst wieder ein englisches Pratchett-Buch "unseen academicals" erstanden hab \o/) oder gar zu Weltbild.<br/>
Auf Dauer erreicht man damit &uuml;berhaupt nichts.</p>
<p>Das ist wie (um mal einen aktuellen Vergleich zu ziehen der so sch&ouml;n hinkt wie m&ouml;glich) wenn Leute &uuml;ber BP schimpfen, desshalb nicht bei Aral tanken gehen, sondern lieber zu Shell gehen. ( <a href="http://de.wikipedia.org/wiki/Royal_Dutch_Shell#Kritik" rel="nofollow">http://de.wikipedia.or...</a> )</p>
</div>
</li>
<li>
<div class="comment" id="comment_1411">
<p class="infos">
<a href="#comment_1411" onclick="set_comment_reference(1411)" title="auf diesen Kommentar antworten">#1411</a>:
    04.Jul.2010 01:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>achja.. ganz vergessen, es gibt auch immer 2 Seiten. So meint z.B. Thalia auf ein Schreiben eines Kunden:</p>
<p>"Die Fa. Ennsthaler betreibt einen Buchverlag und eine Buchhandlung in Steyr. Mit dem Buchverlag bestand eine langj&auml;hrige Lieferantenbeziehung, die Gottfried Ennsthaler im Mai 2010 abgebrochen hatte. Wir haben das mit Bedauern zur Kenntnis genommen. Thalia war immer an einer positiven L&ouml;sung interessiert und ich habe am 28.6.2010 nach einem Telefonat mit Herrn Ennsthaler seinem Wunsch entsprochen, die Gesch&auml;ftsbeziehung zu Thalia wieder aufnehmen zu wollen. Es werden ab sofort von Thalia wieder Bestellungen erfolgen."</p>
<p>Auch der ORF berichtet folgenderma&szlig;en davon:</p>
<p>"...in einer Aussendung hie&szlig; es aber, es habe gemeinsame &Uuml;berlegungen &uuml;ber eine Buchhandlung am Ennsthaler-Standort in Steyr gegeben &ndash; ein Kaufangebot sei aber nie erfolgt."</p>
<p>"Thalia sei bem&uuml;ht gewesen, eine f&uuml;r beide Seiten positive L&ouml;sung zu finden, sowohl in Bezug auf die Lieferantenbeziehung als auch auf den Standort in Steyr. Ennsthaler habe die Gespr&auml;che aber abgebrochen.</p>
<p>Laut Thalia stimmt es, dass derzeit keine B&uuml;cher mehr bei Ennsthaler bestellt w&uuml;rden. Das liege aber daran, dass Gottfried Ennsthaler die Gesch&auml;ftsbeziehung beendet habe."</p>
<p>Es gibt also f&uuml;r die Aussage dass Thalia hier Konkurrenz ausschalten will nur eine einzige Quelle: die Konkurrenz selbst. Wie zuverl&auml;ssig und vertrauenserweckend das ist, muss wohl jeder selbst einsch&auml;tzen.</p>
<p>Auch finde ich (wenn der Vorwurf an Thalia wirklich wahr ist) ein derartiges Vorgehen durchaus gerechtfertigt. Warum soll irgendwen seine direkte Konkurrenz auch noch unterst&uuml;tzen? Das wird kaum eine Firma gerne tun, egal ob es sich um einen gro&szlig;en Konzern oder um den kleinen Tante-Emma-Laden an der Ecke handelt.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1412">
<p class="infos">
<a href="#comment_1412" onclick="set_comment_reference(1412)" title="auf diesen Kommentar antworten">#1412</a>:
    04.Jul.2010 02:07
    von
    
      
        <a href="http://noricus.wordpress.com/" target="_blank">
          -noricus-
        </a>
</p>
<p>Sicher, wem man glauben m&ouml;chte, liegt letztlich bei einem selbst.<br/>
Da du ja offensichtlich meinen Blog-Artikel gelesen hast, wirst du auch gemerkt haben, da&szlig; ich beide Seiten mit ihren Argumenten zu Wort kommen lie&szlig;.<br/>
Tatsache ist f&uuml;r mich aber, da&szlig; ich gerne die Wahl haben m&ouml;chte, wo ich meine B&uuml;cher kaufe. Da habe ich sicher einen kleineren Buchladen lieber, der &uuml;berdies auch ein Familienbetrieb ist.<br/>
Gebracht hat die Sache aber sehr wohl etwas, zumal die Gesch&auml;ftsbeziehungen zwischen den beiden H&auml;ndlern wieder aufgenommen wurden. Ob das auch ohne Proteste geklappt h&auml;tte, wage ich zu bezweifeln.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1413">
<p class="infos">
<a href="#comment_1413" onclick="set_comment_reference(1413)" title="auf diesen Kommentar antworten">#1413</a>:
    04.Jul.2010 11:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>ahja stimmt, die zitate stammen ja direkt von deiner eigenen seite... dann war das ja gerade agumentativ &auml;u&szlig;erst sinnvoll von mir :D</p>
</div>
</li>
</ul>
</div>
</li>
</ul>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1415" onclick="set_comment_reference(1415)" title="auf diesen Kommentar antworten">#1415</a>:
    06.Jul.2010 03:07
    von
    
      
        <a href="http://www.felixnagel.com/" target="_blank">
          Felix Nagel
        </a>
</p>
<p>Halten wir fest: du k&auml;ufst bei Thalia ein weil alle anderen bereits geschluckt wurden. Das nenn ich mal ne Begr&uuml;ndung! <em>blog von der liste nehm</em></p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1416">
<p class="infos">
<a href="#comment_1416" onclick="set_comment_reference(1416)" title="auf diesen Kommentar antworten">#1416</a>:
    06.Jul.2010 03:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>erstens das, zweitens aus den gr&uuml;nden warum die anderen geschluckt wurden, die so ganz nebenbei daf&uuml;r sorgen dass ich die L&auml;den auch noch "mag".</p>
<p>Sprich: gro&szlig;e Auswahl (versuch das mal als mini-Laden), englische B&uuml;cher im un&uuml;bersetzten Original (zugegeben wenige.. aber immerhin gibts welche), nette Bedienungen, ...</p>
<p>Wo bleiben die Argumente dagegen? Dass der b&ouml;se, b&ouml;se H&auml;ndler seine Konkurrenz nicht unterst&uuml;tzt - das ist kein Argument, das interessiert mich als Kunden ehrlich gesagt nen Dreck.</p>
<p>[Edit]<br/>
Gnarf.. jetzt argumentier ich auch schon nur noch ob man dort kaufen sollte oder nicht. Dabei war meine Motivation urspr&uuml;nglich um den Artikel zu schreiben eher die Aussage dass es eh egal ist. Kleine L&auml;den gibt es kaum noch und selbst wenn will da auch kaum jemand was kaufen.<br/>
Die Blogger und Facebook-Nutzer treiben mal wieder eine Sau durchs Dorf, aber &auml;ndern wird sich nichts. Sp&auml;testens in 2-3 Wochen denkt eh keiner mehr daran und alles bleibt wie immer.<br/>
Einer Facebook-Gruppe beizutreten ist halt auch einfacher als wirklich etwas zu tun das pers&ouml;nlich irgendwelche Opfer verlangt.</p>
</div>
</li>
</ul>
</div>