+++
title = "Tauss is' raus"
date = "2010-05-30T09:05:00"
author = "Dr. Azrael Tod"
issoid = "blog/1517"
aliases = "blog/1517"
+++

<p>So ziemlich alle politischen Blogs merken heute an dass sich Tauss bei den Piraten abgemeldet hat, da er zu einer Bew&auml;hrungsstrafe verurteilt wurde und dem Ruf der Partei nicht noch weiter schaden will<br/><br/><br/><a href="http://www.burks.de/burksblog/2010/05/30/tauss-tritt-aus-der-piratenpartei-aus" target="_blank">Burks schreibt dazu</a> zum Beispiel:<br/></p><blockquote><br/>&hellip;schreibt er <a href="http://www.tauss-gezwitscher.de/?p=1006" target="_blank">hier</a>. Ich halte das f&uuml;r unn&ouml;tig. &ldquo;Damit aber kein Missverst&auml;ndnis entsteht: Dieser Austritt erfolgt, um die Piraten und unsere Sache zu st&auml;rken.&rdquo; Wenn die Piratenpartei die mediale Hetze nicht aush&auml;lt, dann kann sie auch gleich aufgeben. Man muss eben Eier haben und dagegenhetzen&hellip;. Auf einen groben Klotz geh&ouml;rt ein grober Keil.<br/></blockquote>
<p>Auch die Piratenpartei selbst, <a href="http://www.piratenpartei.de/Pressemitteilung-100530-Joerg-Tauss-erklaert-seinen-Austritt-aus-der-Piratenpartei" target="_blank">&auml;u&szlig;ert sich nat&uuml;rlich.</a></p>
<p>Meine Meinung dazu:<br/><br/>Nat&uuml;rlich ist es unn&ouml;tig! aber es ist ein sch&ouml;nes Zeichen von ihm, meine Meinung &uuml;ber ihn steigt damit gleich mal erheblich.<br/>Mit diesem Schritt bringt er sich selbst sicher kaum Vorteile, zeigt aber immerhin dass er den Piraten m&ouml;glichst wenig Nachteile w&uuml;nscht (auch wenn das denen wohl auch kaum Vorteile bringen wird).</p>
<p>Imho war die Kipo-Aktion mit Tauss schon etwas sehr zwielichtig, nat&uuml;rlich fehlt mir ein genauer Einblick in alle Details um da ein Urteil zu abzugeben, aber ein Makel bleibt halt doch.<br/>Allerdings muss ich auch sagen dass der Besitz von Kipo imho nun bei weitem nicht das schlimmste ist was deutsche Politiker so fabriziert haben. Z.B. finden andere mal eben auf ihrem Schreibtisch ein paar tausend Euro und weil sie offenbar so gut Geld finden k&ouml;nnen das keiner Vermisst, machen wir sie dann halt zum Finanzminister! Immerhin ist das eine klare Qualifikation!</p>
<p>Ich sage nicht dass der Kipo-Besitz ok ist, oder gar dass ich Leute die sich sowas ansehen nicht ernsthaft krank sind. Ich sage noch nichtmal dass Tauss unschuldig sein wird oder gar einen tollen Charakter hat. Alles was ich sage ist dies: Wir haben Politiker in wichtigeren Stellungen, die weit mehr Schaden angerichtet haben und keiner beschwert sich &uuml;ber jene oder fordert gar deren R&uuml;cktritt.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1382" onclick="set_comment_reference(1382)" title="auf diesen Kommentar antworten">#1382</a>:
    31.May.2010 10:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Kommentare funktionieren momentan leider nicht... wird baldm&ouml;glichst behoben.</p>
<p>Inzwischen bitte per IRC (#zanzibar auf Freenode, siehe auch Link in der Seitenleiste), Jabber (<a href="mailto:drazraeltod@jabber.ccc.de">drazraeltod@jabber.ccc.de</a>) oder E-Mail (<a href="mailto:comments.b0rken@g33ky.de">comments.b0rken@g33ky.de</a>) antworten.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1383">
<p class="infos">
<a href="#comment_1383" onclick="set_comment_reference(1383)" title="auf diesen Kommentar antworten">#1383</a>:
    31.May.2010 11:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>So, Kommentare gehen endlich wieder</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1489" onclick="set_comment_reference(1489)" title="auf diesen Kommentar antworten">#1489</a>:
    08.Nov.2010 09:11
    von
    
      
        <a href="http://bunix.de/" target="_blank">
          reaper
        </a>
</p>
<p>Ich find ja sich &uuml;ber den R&uuml;cktritt Einzelner Gedanken zu machen ist Zeitverschwendung. Einfach den ganzen Schei&szlig; mit Parlamenten und Ministern wegtreten. Manchmal muss es eben ein grundlegendes Refaktoring geben :P</p>

<p class="infos">
<a href="#comment_1490" onclick="set_comment_reference(1490)" title="auf diesen Kommentar antworten">#1490</a>:
    08.Nov.2010 11:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ein Gedanke dem ich durchaus zustimmen muss :-)</p>
<p>siehe dazu auch: <a href="http://www.wir-treten-zurueck.de/%3C/p%3E" rel="nofollow">http://www.wir-treten-...</a>
</p></div>