+++
title = "Kochen für Informatiker... Einführung"
date = "2006-04-28T09:04:00"
author = "Dr. Azrael Tod"
issoid = "blog/281"
aliases = "blog/281"
+++

<p>Ab und zu bin selbst ich noch auf materielle Nahrung angewiesen. (Ich vermute es liegt daran, dass die Elektro-Magnetische Strahlung meines PCs nicht stark genug ist um mich allein davon zu ern&auml;hren... verdammte TFTs^^) Wenn mich nun also mal wieder dazu gezwungen sehe aus Schw&auml;che den Computer zu verlassen und mich dem ungewohntem Terrain "K&uuml;che" zu n&auml;hern.<br/>Was dann folgt ist meist nichts f&uuml;r schwache Nerven... Aus dem knappen Inventory meines K&uuml;hlschrankes suche ich mir Wahllos die wirrsten Zutaten zusammen, die auch nur ann&auml;hernd genug Energie f&uuml;r die n&auml;chsten Tage enthalten k&ouml;nnten und mische sie unter Zuf&uuml;hrung von E_therm zu seltsamm riechenden Massen (Allein f&uuml;r die Auswahl der Zutaten m&uuml;sste ich eigentlich schon mit Alchemie einen Level aufsteigen^^) Auch die mangelhaften Utensilien tragen nicht gerade positiv zu dem Ergebniss bei (Errinert mich daran, mir demn&auml;chst einen neuen Level "Experte" Destilierkolben zu organisieren)<br/>Meist erstelle ich mit viel Rauch- und Geruchsentwicklung eine unf&ouml;rmige Masse in den seltsammsten Farben. (Wegen dem Rauch ist der Feuermelder in der K&uuml;che dank diverser schlechter Erfahrungen schon ohne Strom... w&auml;ren wir bei den Sims k&ouml;nnte mein Mitbewohner demn&auml;chst eine Urne in seinem Schrank plazieren. *g*)<br/>Manchmal jedoch geschieht mit viel g&ouml;ttlicher Unterst&uuml;tzung (an dieser Stelle m&ouml;chte ich Eris/Diskordia danken) ein Wunder und das was sich am Ende in meinem Kochgeschirr befindet kann sogar gegessen werden ohne bef&uuml;rchten zu m&uuml;ssen sich wenige Sekunden nach Genuss (oder gar schon zuvor dank Geruch/Aussehen) mit schweren Vergiftungserscheinungen aufdem Boden windend wieder zu finden. (oder auch gleich nur noch ruhig da zu liegen)<br/>Manche dieser Mischungen scheinen sogar reproduzierbar gut zu schmecken und da mir dies meist erheblich lieber ist als die Giftbr&uuml;he, die sonst so meine T&ouml;pfe zerfrisst (von den seltenen Ausnahmen, in denen ich mir unliebsamme G&auml;ste bewirten darf mal abgesehen, eigentlich immer), habe ich beschlossen die Algorithmen daf&uuml;r in Pseudocode zu notieren.<br/><br/>Da ich bef&uuml;rchte, es k&ouml;nnten noch andere meine unglaubliche Geschicklichkeit auf diesem Gebiet teilen und ich ungern bei jemandem derartigem mitessen m&ouml;chte (auch wenn ich scheinbar bereits eine Giftimunit&auml;t von mindestens +120 zu haben scheine) habe ich beschlossen diese Algorithmen unter OpenSource zu ver&ouml;ffentlichen... (Leider habe ich keine Passende Lizens gefunden... macht einfach damit, was auch immer ihr wollt. Um damit Geld oder Anerkennung zu verdienen ist das Zeug eh zu schlecht)</p>
