+++
title = "Werbeblocker"
date = "2009-01-24T02:01:00"
author = "Dr. Azrael Tod"
issoid = "blog/1205"
aliases = "blog/1205"
+++

<p>Auf dem <a href="http://www.klonblog.com/2009/01/24/werbeblocker-gefahr-fur-das-internet/" target="_blank">Klonblog</a> wurde gerade mal wieder die Frage nach der Verwendung von Werbeblockern gestellt. F&uuml;r jede Einzelperson kann man diese zwar beantworten, doch ich wollte mir  mal die M&uuml;he machen und die komplette Situation untersuchen. Wen interessiert schon ob Fritzchen Maier Werbung blockt, wenn das Verhalten der restlichen Menschheit keine Relation dazu besitzt?<br/><!--more--><br/>Um sinnvoll argumentieren zu k&ouml;nnen, brauchen wir erstmal Ausgangsdaten. Ich setze also mal folgende Theorien als Grundlagen/"Tatsachen" fest:<br/></p><ul><br/> <li>Internetseiten finanzieren sich derzeit durch Werbung</li><br/> <li>Nutzer m&ouml;gen keine Werbung, wenn sie dadurch Aufwand haben (wegklicken, dr&uuml;berscrollen, Ablenkung durch Blinken)</li><br/> <li>Je st&auml;rker eine Werbung nervt, umso mehr Nutzer werden darauf aufmerksam</li><br/></ul><br/>Kommen wir nun zu meinen Schlussfolgerungen:

<p>Das Problem ist nicht der Werbeblocker, sondern die Art der Werbung.<br/>Werbeblocker an sich haben einen gewissen Grat an Nervigkeit. Man muss sie konfigurieren, zu blockende Werbung ausw&auml;hlen, schleppt sie permanent im RAM mit sich herum und sollte auf Updates achten.</p>
<p>Wenn Werbung jedoch erheblich nerviger ist als der Blocker, wird der Nutzer zu blockern greifen um sich den Vorteil des geringeren Aufwandes zu sichern. Gegen diese Handlungsweise kommt man nunmal nicht mit logischen Argumenten wie "es schadet dem Internet an sich" an, es geht immerhin um den pers&ouml;nlichen Vorteil.</p>
<p>Internetangebote handeln im Gegenzug genauso. Sie sind auf ihren privaten und kurzfristigen Vorteil bedacht. Sie setzen solche besonders nervige Werbung wie LayerAds (am besten mit "schlie&szlig;en"-Button der ein Popup &ouml;ffnet) oder seitenlange Eintrittsseiten bei denen man an der untersten Kante auf "enter" klicken muss ein, ohne auf solche Argumente wie "es schadet dem Internet an sich" zu h&ouml;ren.</p>
<p>Dadurch wird ich das Problem auch nicht von selbst l&ouml;sen. Einen "Waffenstillstand" wie "Jeder blockt nur nervige Werbung und l&auml;sst sie auf seinen oft besuchten Seiten zu" kann und wird es also nicht geben. <strong>Wir stehen also gerade erst am Anfang eines digitalen Wettr&uuml;stens zwischen dem besseren Werbeblocker und der fieseren Werbung.</strong></p>
<p>Einzig bei einigen, wenigen Werbeformen kann man noch auf Besserung hoffen. So stellen besagte Layer-Ads mit Popup beim wegklicken eine Quelle von nahezu unendlichen Klicks dar... immerhin geht jeder Zweite Nutzer ohne Blocker erstmal auf die entsprechende Seite. Da diese Nutzer aber nicht wegen der Aussage der Werbung auf dieser Seite sind, sondern nur weil sie mit Tricks dazu gebracht wurden auf entsprechende Links zu klicken, werden sie auf der Zielseite kaum so viel Umsatz erzeugen wie Nutzer die z.B. Textwerbung gelesen haben und das Angebot interessant fanden. Da nun also die Werbekunden f&uuml;r klicks bezahlen die ihnen weit weniger bringen als andere, kann man immerhin hoffen dass, mit steigender Kompetenz der Kunden auf diesem Gebiet, auch die Preise f&uuml;r derartige Werbung aufgrund mangelnder Nachfrage einbrechen werden.<br/>Wenn die nervigste Werbung also nicht viel Geld bringt, wird nat&uuml;rlich auch kaum ein Seitenbetreiber es noch riskieren f&uuml;r wenig Geld seine Besucher damit zu behelligen.</p>
<p>Im Gegensatz dazu wird sich kontextbezogene Werbung nat&uuml;rlich aus den umgekehrten Gr&uuml;nden verst&auml;rken.</p>
<p>Wenn nun also die Kunden irgendwann doch weniger von Werbung genervt sind, als sie es durch den Aufwand eines Blockers sind, wird auch der Einsatz der Blocker wieder zur&uuml;ckgehen.</p>
<p>Was bleibt sind folgende Fragen:<br/></p><ul><br/> <li>Werden die Werbekunden schnell genug realisieren wie sie ihr Geld besser investieren k&ouml;nnen, oder werden sie weiterhin nach festen, aber inhaltlich v&ouml;llig unsinnigen Kenngr&ouml;&szlig;en wie Klicks bezahlen?</li><br/> <li>Wird (und wenn ja wann) die kritische Grenze zwischen den Nervigkeiten &uuml;berschritten werden?</li><br/> <li>Kann eine Partei im Wettr&uuml;sten eine Technologie erfinden mit der die andere komplett geschlagen wird. Wenn es die Werbung schafft, w&auml;re das nat&uuml;rlich besser f&uuml;r die Wirtschaft und w&uuml;rde das platzen der aktuellen .com-Bubble evtl. noch etwas verz&ouml;gern. Wenn es die Blocker-Fraktion hingegen schafft (danach sieht es eher aus) w&uuml;rde das v&ouml;llig neue Gesch&auml;ftsmodelle f&uuml;r online-Angebote erfordern. (Es w&auml;re aber auch die bei weitem spannender Variante.)</li><br/></ul>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1081" onclick="set_comment_reference(1081)" title="auf diesen Kommentar antworten">#1081</a>:
    26.Jan.2009 09:01
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>anderer Vorschlag ... wir schaffen Werbung einfach ab und f&uuml;hren gesunden Menschenverstand ein ...</p>
<p>... ach dammich ... ich habe den mit der Gie&szlig;kanne grob verteilten IQ vergessen -.-</p>

<p class="infos">
<a href="#comment_1082" onclick="set_comment_reference(1082)" title="auf diesen Kommentar antworten">#1082</a>:
    26.Jan.2009 10:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ich w&auml;re eh der Meinung dass Werbung (vor allem bei Leuten die etwas mehr als der normale Hauptsch&uuml;ler mit Intellekt gesegnet sind) nur eine sehr begrenzte Wirkung hat.</p>
<p>Mal abgesehen von "ich kenne das Produkt nicht" w&uuml;rde ich kaum Sinn sehen f&uuml;r teueres Geld IRGENDWO Werbung zu schalten.</p>
<p>Tatsache ist jedoch, dass Werbung eine riesige Industrie ist und sich viele Internetangebote sich komplett dar&uuml;ber finanzieren. Wenn also diese Einnahmen wegbrechen, wird ein Umdenken in diesem Bereich n&ouml;tig.</p>
</div>