+++
title = "T-Shirt-LIFO"
date = "2009-08-12T12:08:00"
author = "Dr. Azrael Tod"
issoid = "blog/1428"
aliases = "blog/1428"
+++

<p>Erst k&uuml;rzlich hat es sich ergeben, da habe ich mir mal wieder etwas Nachschub f&uuml;r meinen Auftritt als Nerd in der &Ouml;ffentlichkeit (Muhahahaha... als w&uuml;rden echte Nerds den Keller verlassen) besorgt. Diesmal handelt es sich um 3 T-Shirts und ein Schl&uuml;sselband.</p>
<p>[gallery]</p>
<p>Wenn wir gerade schon beim Thema T-Shirts sind, f&auml;llt mir nat&uuml;rlich sofort wieder der alte Spruch ein dass M&auml;nner ihre Kleidung nicht aussuchen sondern viel eher blinden Zufall entscheiden lassen.<!--more--><br/>Der Spruch ist in der Tat schon so alt, dass er sogar schon vor einiger Zeit bei einem <a href="http://www.ibash.de/" target="_blank">der</a> <a href="http://bash.pilgerer.org/cgi/bash.cgi" target="_blank">vielen</a> <a href="http://www.google.com/notebook/public/09857445268996748750/BDQMMQwoQy8_2kYci#NDRGDQwoQgPqv0b0j" target="_blank">deutschen </a>Nachbauten von <a href="http://qdb.us/" target="_blank">QDB.us</a> und <a href="http://bash.org/" target="_blank">bash.org</a><a href="http://www.german-bash.org/44888" target="_blank">  angekommen ist</a>:</p>
<p></p><blockquote>[nazrim] ich muss gleich los und wei&szlig; nicht was ich anziehen soll!<br/>[jok3r] bist dun typ?<br/>[nazrim] ^^jo<br/>[jok3r] dann versteh ich den problem net, stell dich vor den schrank und klick auf random!</blockquote>
<p>Das bringt mein krankes Hirn nat&uuml;rlich sofort dazu &uuml;ber diesen Bl&ouml;dsinn nachzudenken und nach kurzer Bedenkzeit habe ich <a href="http://home.g33ky.de/fact/4678.html" target="_blank">eine glaubhaftere Theorie entwickelt</a>:</p>
<p></p><blockquote>Es mag sein dass bestimmte Typen von M&auml;nnern Kleidung nach dem Zufallsprinzip entnehmen, doch der allgemeine Informatiker wird das wohl eher nach dem <a href="http://de.wikipedia.org/wiki/Last_In_%E2%80%93_First_Out" target="_blank">LIFO-Prinzip</a> organisieren... schon weil echter Zufall schwer zu erzeugen ist und wahrscheinlich immer Aufw&auml;ndiger ist als einfach einen Pointer auszulesen und zu verbiegen.</blockquote>
<p>Meine bessere H&auml;lfte hat sich &uuml;brigens bereits beschwert dass ich sie nichtmal gefragt habe, ob ich ihr auch ein G33KY.de-Schl&uuml;sselband mit bestellen soll, so dass ich jetzt &uuml;berlege daf&uuml;r nochmal eine Bestellung abzugeben. Vlt. sollte ich mir auch gleich einen kleinen Vorrat von den Dingern zulegen, allen Autoren eins geben und den Rest als Werbemittel verschenken...</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1322" onclick="set_comment_reference(1322)" title="auf diesen Kommentar antworten">#1322</a>:
    26.Aug.2009 09:08
    von
    
      <a href="/blog/author/kleinezuzi/">
        kleinezuzi
      </a>
</p>
<p>Gute Idee, mein aktuelles Schl&uuml;sselband ist n&auml;mlich kaputt. ;)</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1323">
<p class="infos">
<a href="#comment_1323" onclick="set_comment_reference(1323)" title="auf diesen Kommentar antworten">#1323</a>:
    26.Aug.2009 12:08
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>momentan scheitert es etwas am Preis... die meisten Anbieter verkaufen die Dinger allerfr&uuml;hestens erst ab 500-1000stk., wobei ich auch schon 1-2 gesehen habe die bereits ab 200 liefern.<br/>
Vlt. finde ich ja noch eine M&ouml;glichkeit die Aktion mal zu starten ohne gleich 100-200&euro; auf den Tisch legen zu m&uuml;ssen.</p>
<p>(naja, man k&ouml;nnte sie einzeln bestellen f&uuml;r 5-6&euro; das St&uuml;ck)</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1324" onclick="set_comment_reference(1324)" title="auf diesen Kommentar antworten">#1324</a>:
    26.Aug.2009 12:08
    von
    
      <a href="/blog/author/kleinezuzi/">
        kleinezuzi
      </a>
</p>
<p>Na dann l&auml;sst du eben mal 1000 St&uuml;ck herstellen und machst damit dann eine kleine Werbeaktion... :D</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1325">
<p class="infos">
<a href="#comment_1325" onclick="set_comment_reference(1325)" title="auf diesen Kommentar antworten">#1325</a>:
    26.Aug.2009 10:08
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Dann muss es nat&uuml;rlich erstmal etwas geben wof&uuml;r sich die Werbung lohnt... sprich alle Autoren m&uuml;ssen  mindestens 4 Beitr&auml;ge pro Person und Tag schreiben und ich muss mindestens 1/10 der Ausgaben im Monat als Werbung wieder einnehmen. (erstmal Werbung haben^^)</p>
</div>
</li>
</ul>
</div>