+++
title = "gajim nervt"
date = "2008-06-28T10:06:00"
author = "Dr. Azrael Tod"
issoid = "blog/428"
aliases = "blog/428"
+++

<p>Ich bin im Moment grade m&ouml;rderisch genervt von <a href="http://www.gajim.org/" target="_blank">Gajim</a>, eigentlich w&auml;re das Ding der ideale Jabber-Client f&uuml;r mich, GTK, relativ schlank, gute Unterst&uuml;tzung f&uuml;r MUC, GPG Verschl&uuml;sselung, man kann alle Gespr&auml;che in Tabs gliedern und das ganze in einem Bildschirmf&uuml;llendem Fenster sammeln (inkl. Kontaktliste) und demn&auml;chst soll ja auch noch<a href="http://de.wikipedia.org/wiki/Off-the-Record_Messaging" target="_blank"> OTR-Unterst&uuml;tzung </a>dazu kommen.</p>
<p>(Klar w&auml;re eine richtig gute Konsolen-Anwendung noch besser)</p>
<p>Aber in letzter Zeit nervt mich das Ding einfach nur noch. Nicht nur dass die Verbindung alles andere als stabil ist (5x Neuverbinden in 5 Minuten ist nicht tragbar) und bei jeder Status&auml;nderung nach meinem GPG-Passwort fragt. Das st&auml;ndige Eintippen erh&ouml;ht die Sicherheit der Sache bestimmt nicht merklich. Da w&auml;re es eher sinnvoll das Passwort w&auml;hrend der Sitzung mit Zugriffsrechten nur f&uuml;r den aktuellen Nutzer auf der Festplatte zu lagern.</p>
<p>Alternativ hab ich noch mit <a href="http://www.centerim.org" target="_blank">centerim</a> rumgespielt, zwar schien das Ding als recht gute Alternative zu <a href="mcabber.com" target="_blank">Mcabber</a> und hat auch von den Funktionen her einiges drauf, aber auch da f&auml;llt als Erstes wieder auf dass man aus irgend einem bl&ouml;den Grund wieder mal nur einen Jabber-Account gleichzeitig verwenden kann. (zumindest soweit mir bis jetzt bekannt)<br/>Au&szlig;erdem ist das Chatfenster mehr als seltsam implementiert, warum zum Henker kann ich mit den Tasten nicht einfach in der History nach oben scrollen? Warum muss ich dazu erst ctrl-O dr&uuml;cken und warum zum Henker sind die Nachrichten danach von unten nach oben geordnet und ich muss sie bei &Uuml;berl&auml;nge noch einzeln &ouml;ffnen?<br/>Versteht mich nicht falsch, der Client kann fast alles was ich brauch.. aber die Verwendung ist einfach untragbar und das nichtmal weil er auf Konsole beschr&auml;nkt ist, sondern einfach ohne jeglichen erkenntlichen Grund.</p>
<p>Alles in allem st&ouml;ren mich die Jabber-Clients auf meinen Rechnern noch immer. Mit keinem bin ich wirklich zufrieden und die Suche nach einem geeigneten (Konsolen-)Client geht weiter.</p>
<p>[Update]</p>
<p>Wie mir gerade per MUC mitgeteilt wurde liegt das Problem mit GPG und Gajim nicht an Gajim sondern an einer Fehlkonfiguration auf meinem Rechner betreffs Seahorse.<br/>Finde ich irgendwie schade, da ich alles auf Standard gelassen hab und irgendwie auch keine Lust habe mich durch Seitenweise Config-files zu w&uuml;hlen (auf die Idee die Men&uuml;s zu durchsuchen war ich in der Tat auch selbst gekommen...)<br/>Damit will ich sagen... wenn Ubuntu eine derartig kaputte config f&uuml;r ein Tool mitliefert das standardm&auml;&szlig;ig installiert wird, mach ich mir ernste Sorgen um Ubuntu.</p>
<p>Auf der anderen Seite wurde mir auch gesagt das Gajim im schlimmsten Fall auch nur einmal pro Login fragen sollte und dass die Frage bei jeder Statusmeldung unm&ouml;glich w&auml;re.. auch interessant, ist mir neu.. *Meldungen wegklick*.</p>
<p>Aber ich sollte mich eh nicht aufregen, immerhin steht auf dem SVN-Build mit Absicht "unstable" drauf, ich sollte wohl doch besser die offiziellen Versionen nutzen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_225" onclick="set_comment_reference(225)" title="auf diesen Kommentar antworten">#225</a>:
    29.Jun.2008 02:06
    von
    
      
        gohe
      
    
    
  </p>
<p>W&auml;re sch&ouml;n, wenn du die Erkenntnisse bez&uuml;glich Seahorse teilen k&ouml;nnte, falls andere ebenfalls auf ein solches Problem sto&szlig;en sollten.</p>

<p class="infos">
<a href="#comment_226" onclick="set_comment_reference(226)" title="auf diesen Kommentar antworten">#226</a>:
    29.Jun.2008 10:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Das werde ich tun, hab heute morgen nochmal ausgeschlafen die Einstellungen angesehen und das erste was mir aufgefallen ist, war der richtige Schalter (offensichtlicher gehts kaum noch) um die Probleme mit dem Passwort-Speichern zu l&ouml;sen.<br/>
Ich werde im laufe des Tages auch nochmal ne Art widerruf bringen (in Form eines neuen Posts) da ich einige ernsthaft mit diesem Beitrag gekr&auml;nkt zu haben scheine oder denen zumindest arg auf die F&uuml;&szlig;e getreten bin.</p>

<p class="infos">
<a href="#comment_227" onclick="set_comment_reference(227)" title="auf diesen Kommentar antworten">#227</a>:
    29.Jun.2008 11:06
    von
    
      
        <a href="/2008/06/29/gajim-nervt2/" target="_blank">
          Gajim nervt#2 &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...]  Wenn ich eine Sache aus dem letzten Post &uuml;ber Gajim gelernt habe, dann dass man nicht &uuml;ber ein Projekt &ouml;ffentlich l&auml;stern sollte, bei dem man jeden [...]</p>
</div>