+++
title = "Computerspielverfilmungen"
date = "2008-04-29T05:04:00"
author = "Dr. Azrael Tod"
issoid = "blog/365"
aliases = "blog/365"
+++

<p>Bei einigen Verfilmungen von Computerspielen wei&szlig; man genau warum diese Produziert wurden. Bei Tomb Raider war es wohl eindeutig die gro&szlig;e Oberweite von Lara Croft und die gro&szlig;e Fangemeinde. (Na sein wir doch mal ehrlich, an der tollen Geschichte hats ja auf Garantie nicht gelegen.)</p>
<p>Bei Wing Commander hat es sich aus dem Context heraus ergeben, immerhin war das Spiel selbst schon gr&ouml;&szlig;tenteils mehr Film als alles andere. (Nur was zum Henker sollte die Art der Durchf&uuml;hrung? Es muss doch wen besseres gegeben haben als <a href="http://en.wikipedia.org/wiki/Freddie_Prinze%2C_Jr." title="Freddie Prinze, Jr.">Freddie Prinze, Jr.</a> oder <a href="http://en.wikipedia.org/wiki/Matthew_Lillard" title="Matthew Lillard">Matthew Lillard</a>, mit  <a href="http://en.wikipedia.org/wiki/Malcolm_McDowell" title="Malcolm McDowell">Malcolm McDowell</a> oder  <a href="http://en.wikipedia.org/wiki/Mark_Hamill" title="Mark Hamill">Mark Hamill</a> w&auml;re wohl auch zu nahe am Original gewesen, au&szlig;erdem eignen sich beide eindeutig nicht dazu bekannte Filme zu drehen. Zu der Geschichte im Film sag ich mal lieber garnichts, die Spiele waren vlt. nicht wirklich Oscarreif aber DAS ist um mindestens 10 Klassen schlechter)</p>
<p>Der gro&szlig;en Fanszene haben wir sicher auch Ressident Evil und Final Fantasy zu verdanken, doch was hat uns sowas wie Blood Rayne eingebracht?</p>
<p>&Uuml;berhaupt k&ouml;nnte man manchmal denken dass die zust&auml;ndigen Leute f&uuml;r Videospielverfilmungen dauerhaft auf viel zu harten Drogen sind. Zumindest kann ich mir anders nicht mehr erkl&auml;ren warum einige Sachen verfilmt wurden und noch viel weniger WIE manche Sachen verfilmt wurden... Stichworte: Super Mario Brothers, Pokem&oacute;n, Dungeons&amp;Dragons (ok, letzteres nicht nach einem <em>Computer</em>spiel)</p>
<p>Wenn wir schon grade beim aufz&auml;hlen sind, k&ouml;nnen wir auch gleich noch Filme nennen, die es noch nicht gibt, die aber einfach mal dringend n&ouml;tig w&auml;ren.<br/></p><ul><br/> <li>The Legend of Kyrandia 3</li><br/> <li>Monkey Island</li><br/> <li>Dungeon Keeper</li><br/> <li>Fallout I&amp;II</li><br/> <li>Zelda</li><br/> <li>Strike Commander</li><br/> <li>Elder Scrolls</li><br/> <li>Magic Carpet</li><br/> <li>Genewars</li><br/> <li>The Dig</li><br/></ul><br/>In den Kommentaren ist &uuml;brigens jede Menge Platz um weitere Spiele zu nenne, die euch als Film gefallen w&uuml;rden... nur um mal zu versuchen eine Diskussion anzusto&szlig;en. ;-)
      
    
  <div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_77" onclick="set_comment_reference(77)" title="auf diesen Kommentar antworten">#77</a>:
    29.Apr.2008 11:04
    von
    
      
        <a href="http://www.karlimann.com" target="_blank">
          Karl
        </a>
</p>
<p>Uwe Boll ist da der Mann f&uuml;r alle F&auml;lle :D</p>

<p class="infos">
<a href="#comment_78" onclick="set_comment_reference(78)" title="auf diesen Kommentar antworten">#78</a>:
    30.Apr.2008 04:04
    von
    
      
        Tsukama
      
    
    
  </p>
<p>Shin Megami Tensei: Nocturne villeicht - w&auml;re zumindest ein interessanter Ansatz f&uuml;r die Story und das Setting (in der "Nach"-Welt).</p>
<p>Oder besser Devil May Cry. Da kann man auch storytechnisch nicht viel falsch machen: Wo nix ist, kann man auch nix verhunzen ;-)</p>
<p>Und damit nicht der falsche Eindruck ensteht. Ich liebe DMC</p>

<p class="infos">
<a href="#comment_79" onclick="set_comment_reference(79)" title="auf diesen Kommentar antworten">#79</a>:
    14.May.2008 09:05
    von
    
      
        <a href="http://unixhaus.de" target="_blank">
          Solarix
        </a>
</p>
<p>Strike Commander w&auml;re wirklich reizvoll. &Uuml;ber die Wing Commander Verfilmung sollte man wirklich ganz dezent den Mantel des Schweigens h&uuml;llen. Der Gestank ist n&auml;mlich unertr&auml;glich.</p>
<p>Ich w&uuml;rde mir eine Verfilmung von "Barbarian" w&uuml;nschen, inhaltlich und kulturtechnisch h&auml;tte das momentan absolut meine "Wellenl&auml;nge".</p>
<p>Auch eine Verfilmung von Tetris muss unbedingt her.</p>
<p>Unverzichtbar ist allerdings...... nein nicht pong...... nethack. <em>tusch</em></p>
<p>In der Hauptrolle Rose Mc Gowan und Steve Ballmer.. ;)</p>

<p class="infos">
<a href="#comment_80" onclick="set_comment_reference(80)" title="auf diesen Kommentar antworten">#80</a>:
    14.May.2008 10:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>bei Tetris fehlt einfach irgendwie eine Hauptfigur, ein B&ouml;sewicht und eine Geschichte w&auml;re wohl auch nicht schlecht. <em>g</em></p>
<p>Nethack w&auml;re allerdings wirklich etwas, dass man endlich mal verfilmen sollte, ich frage mich nur ob der Film in unsere Kinos kommen sollte... "You ate your Kitten"</p>

<p class="infos">
<a href="#comment_81" onclick="set_comment_reference(81)" title="auf diesen Kommentar antworten">#81</a>:
    15.May.2008 12:05
    von
    
      
        <a href="http://unixhaus.de" target="_blank">
          Solarix
        </a>
</p>
<p>er muss in die Kinos unbedingt! Ausserdem w&uuml;rde es beweisen das Steve Ballmer doch der haarlose Zwillingsbruder von Ozzy Osbourne sein muss, der zuf&auml;llig nach einem &uuml;blen Drogenrausch in der Softwarebranche gelandet ist. Insbesondere beim abbeisen des Katzenkopfs, es w&uuml;rde zumindest die These untermauern. ;)</p>

<p class="infos">
<a href="#comment_82" onclick="set_comment_reference(82)" title="auf diesen Kommentar antworten">#82</a>:
    11.Jun.2008 04:06
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Oder besser Devil May Cry. Da kann man auch storytechnisch nicht viel falsch machen: Wo nix ist, kann man auch nix verhunzen ;-)</p>
<p>Zu Devil May Cry gibt es einen Anime, der jetzt so langsam DVD f&uuml;r DVD erscheint (Aktuell Nummer 3)</p>
<p>Und Monkey Island geht jetzt ja mal gar nicht, sowas kann nur schlecht ausgehen.</p>

<p class="infos">
<a href="#comment_83" onclick="set_comment_reference(83)" title="auf diesen Kommentar antworten">#83</a>:
    11.Jun.2008 05:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Den Humor und Charm von Monkey Island kann man sicher in einem Film genauso schlecht einfangen wie wenn man ein Remake in 3D Coden w&uuml;rde.. oh halt.. das wurde ja versucht, ein toller Reinfall meiner Meinung nach -.-</p>

<p class="infos">
<a href="#comment_84" onclick="set_comment_reference(84)" title="auf diesen Kommentar antworten">#84</a>:
    31.Jul.2008 06:07
    von
    
      
        meoskind
      
    
    
  </p>
<p>Ich w&uuml;rde mich unheimlich &uuml;ber eine Verfilmung von Dungeon Keeper freuen. Am liebsten mit Heinz Strunk als Horny.</p>
<p>Zu Zelda: immerhin gab es mal eine Fernsehserie, in der kurze Einspieler mit realen Charakteren (eben Link und Zelda) gezeigt wurden (allerdings erinnere ich mich nicht an die Serie, war da noch zu klein).</p>
</div>