+++
title = "Wahnsinn Studium"
date = "2008-02-12T04:02:00"
author = "Dr. Azrael Tod"
issoid = "blog/316"
aliases = "blog/316"
+++

<p>Seitdem ich das erste Mal an einem Computer gesessen hab, bin ich von diesen Dingern fasziniert. Zuerst war es einfach nur der Spa&szlig; mit Computerspielen, doch schon bald wollte ich wissen, wie dieser Wunderkasten funktioniert und noch wichtiger: wie ich die Geister der alten Hacker-Hexenmeister dazu bekomme nach meinem Willen zu streben...<br/><br/>Nachdem erste Versuche mittels MS-Dos Batchfiles (schonmal eine 500-zeilige .bat geschrieben?) und dem Zusammenklicken von Oberfl&auml;chen unter Borland DBs (Ein Fenster habe ich, aber wie bekomme ich es dazu auch was zu tun?^^) schnell an Grenzen stie&szlig;en, suchte ich nach M&ouml;glichkeiten erstmal an das n&ouml;tige Grundwissen zu kommen.<br/><br/><br/>Erst mehrere Jahre sp&auml;ter (inzwischen war ich mit Delphi, Basic und HTML einigerma&szlig;en vertraut), dachte ich mich endlich am Ziel, als ich eine Ausbildung zum (lacht nicht!) Staatlich gepr&uuml;ftem Technischem Assistenten f&uuml;r Informatik mit Spezialisierung auf Netzwerktechnik (*keuch* LUUUFT! wasn' Titel -.-) ergatterte.<br/><br/>Dass mich diese Ausbildung nicht im Geringsten forderte h&auml;tte mir schon lange vorher klar sein sollen, aber wenigstens lernte ich ein paar Grundlagen in ASM, vertiefte meine Erfahrungen mit Delphi und lernte endlich Linux mal richtig kennen.<br/><br/><br/>Nachdem ich also ein frischgebackener "Diskettennachtr&auml;ger" war, stellte sich nat&uuml;rlich die Frage, was ich nun tun sollte... Zwar f&uuml;hlte ich mich auf Grund dieser erworbenen Grundlagen bereit f&uuml;r das Berufsleben (Ich kannte wirklich nur Grundlagen, aber die h&auml;tten gereicht um mich schnell in tiefergreifende Probleme einzuarbeiten.), sah jedoch auch dass meine gesch&auml;tzten Klassenkameraden zum Gro&szlig;teil kaum in der Lage waren auch nur ein Hello-World-Programm in Delphi zu schreiben, von Assembler ganz zu schweigen.<br/><br/>Was kann ein solcher Abschluss schon Wert sein?<br/><br/><br/>Also dr&uuml;ckte ich weiterhin die Schulbank, absolvierte ein einj&auml;hriges Fachabitur und schrieb mich an einer FH ein.<br/><br/>Nun endlich w&uuml;rde ich von qualifizierten Lehrkr&auml;ften alles &uuml;ber Informatik lernen...<br/><br/><br/>Und als ich alles gelernt hatte kamen ein paar ehrliche Politiker, in Begleitung des Osterhasen und begl&uuml;ckw&uuml;nschten mich... Klar Bl&ouml;dsinn, aber ich war halt naiv.<br/><br/><br/>Ich k&ouml;nnte jetzt sicher endlos viele Seiten &uuml;ber das Studium, die qualifizierten Leerkr&auml;ffte und die vermittelten Inhalte l&auml;stern, aber der Text ist eh schon viel zu lang, darum hier nur erstmal eine Zusammenfassung dessen, was mir am deutlichsten aufgefallen ist.<br/><br/><br/>Die vermittelten, (f&uuml;r mich) praktisch nutzbaren Inhalte sind recht &uuml;berschaubar, sicher habe ich mehr gelernt als in meiner Berufsausbildung, dies lag jedoch keinesfalls am Studium selbst, sondern vielmehr daran dass ich mich privat besser mit solchen Dingen besch&auml;ftigen konnte da z.b. Ein fehlendes Grundwissen mich nicht mehr aufhielt. Ansonsten lagen die Anforderungen auf diesen sinnvollen Gebieten im Verh&auml;ltnis zur Zeit, sogar noch unter denen der Berufsausbildung. Was hingegen erheblich Anspruchsvoller war, sind all jene Dinge in Richtung Mathematik oder obskures Wissen (Anders kann ich z.b. Datenbanken in COBOL nicht einordnen.) Sicher m&ouml;gen manche Absolventen sp&auml;ter noch einmal manche dieser F&auml;higkeit ben&ouml;tigen, ich glaube aber dass sich die Zahl derer, jeweils weit unter 5% bewegt und es sinnvollere F&auml;higkeiten gegeben h&auml;tte, die man uns in der gleichen Zeit h&auml;tte beibringen k&ouml;nnen. (Hat schonmal jemand was von dieser neuen Entwicklung namens Unix geh&ouml;rt? W&auml;re sicher praktisch, wenn ein Informatikstudent damit umgehen k&ouml;nnte.)<br/><br/><br/>Aus diesem Grund m&ouml;chte ich:<br/><br/>   1. dazu aufrufen, Informatik doch wenigstens ein bisschen mehr als Kunst zu sehen und weniger als hochmathematische Wissenschaft. (Wer nicht wei&szlig;, wie das gemeint ist, sollte sich mal den netten Blogeintrag von "Joel on Software" ansehen -&gt; <a href="http://www.joelonsoftware.com/items/2008/01/08.html">Undergraduate Programming</a>)<br/>   2. eine Serie von Blogeintr&auml;gen starten, in der ich mich etwas humoristischer mit meinen letzten 7 Semestern Studium auseinandersetze, dabei werde ich mich nat&uuml;rlich auf den mir am besten bekannten Fachbereich konzentrieren (Wenn z.B. ein Mathe-Prof. bei mir Statistik halten soll, kann es durchaus sein dass ich dieses Fach f&uuml;r unpassend halte, der Professor kann da jedoch wohl kaum was daf&uuml;r.).</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_40" onclick="set_comment_reference(40)" title="auf diesen Kommentar antworten">#40</a>:
    12.Feb.2008 05:02
    von
    
      
        Kernel
      
    
    
  </p>
<p>Nu ja- da freu ich mich mal auf die Reihe....Naja hab mir ehrlich gesagt auch mehr gew&uuml;nscht ein richtiger Hacker nach dem Studium hier zu sein und weniger ein Mathematikwunder... aber egal solange man den Abschluss in der Tasche hat, denken zumindest alle man w&auml;rs..</p>
</div>