+++
title = "wikileaks.de geloe^W im transit"
date = "2009-04-11T12:04:00"
author = "profmakx"
issoid = "blog/1367"
aliases = "blog/1367"
+++

<p>Ich verstehe es ja nicht. &Uuml;berall wird sich das Maul dar&uuml;ber zerrissen, dass die Domain wikileaks.de wom&ouml;glich wegzensiert wurde.</p>
<p>Ich denke der Hase l&auml;uft anders: Das denic-mitglied bei dem die Adresse registriert war hat einfach alle viere von sich geschmissen und die Domain in den Transit gekloppt, weil versto&szlig; gegen AGB (strafrechtlich relevantes Material z.B.).</p>
<p>Sicher ist das AUCH ein Zusammenhang mit der Durchsuchung, aber ein ganz anderer als die Zensur.</p>
<p>Spekulationen &uuml;ber die Ostertage, was kann man sich auch sonst mehr w&uuml;nschen!</p>
<p>Ich geh mir lieber die dicken Eier kraulen</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1242" onclick="set_comment_reference(1242)" title="auf diesen Kommentar antworten">#1242</a>:
    11.Apr.2009 12:04
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          SirSnookie
        </a>
</p>
<p>Genau so sehe ich das auch. Nach dem die Domain in den Transit gegeben wird - schreibt die DENIC einen Brief mit einer "Zeichenkombination" welche den KK an einen anderen Provider erm&ouml;glicht.</p>
<p>Dank dieser Osterfeiertage wird das ganze nun etwas dauern bis die DENIC den Brief per Schneckenpost zustellen kann.</p>
<p>Also nichts mit Zensur sondern einfach nur ein &uuml;bliches Vorgehen.</p>
<p>Zum nachlesen bei der DENIC: <a href="http://transit.denic.de/%3C/p%3E" rel="nofollow">http://transit.denic.d...</a>
</p>
<p class="infos">
<a href="#comment_1243" onclick="set_comment_reference(1243)" title="auf diesen Kommentar antworten">#1243</a>:
    12.Apr.2009 01:04
    von
    
      
        <a href="http://fellowpassenger.de" target="_blank">
          Fellow Passenger
        </a>
</p>
<p>Habe ich da einen Witz nicht verstanden, oder m&uuml;sste es in der &Uuml;berschrift wikileaks.de statt <a href="http://wikileaks.org" rel="nofollow">wikileaks.org</a> hei&szlig;en?</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1244">
<p class="infos">
<a href="#comment_1244" onclick="set_comment_reference(1244)" title="auf diesen Kommentar antworten">#1244</a>:
    12.Apr.2009 10:04
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ich bin mir ziemlich sicher dass profmakx das so gemeint hatte</p>
</div>
</li>
<li>
<div class="comment" id="comment_1245">
<p class="infos">
<a href="#comment_1245" onclick="set_comment_reference(1245)" title="auf diesen Kommentar antworten">#1245</a>:
    12.Apr.2009 11:04
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          SirSnookie
        </a>
</p>
<p>Denke ich auch - das es .de hei&szlig;en sollte</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1246" onclick="set_comment_reference(1246)" title="auf diesen Kommentar antworten">#1246</a>:
    12.Apr.2009 01:04
    von
    
      
        Willi
      
    
    
  </p>
<p>IRQ hostet auch Pirate Bay....hmmm... kann ich nicht so nachvollziehen, dass dieser alle viere von sich gestreckt haben soll.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1247">
<p class="infos">
<a href="#comment_1247" onclick="set_comment_reference(1247)" title="auf diesen Kommentar antworten">#1247</a>:
    12.Apr.2009 01:04
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Wobei der hoster nicht unbedingt was mit der Firma zu tun haben muss bei der die domain liegt.... aber lassen wir mal diese ganzen fakten beiseite ;-)</p>
</div>
</li>
<li>
<div class="comment" id="comment_1248">
<p class="infos">
<a href="#comment_1248" onclick="set_comment_reference(1248)" title="auf diesen Kommentar antworten">#1248</a>:
    12.Apr.2009 01:04
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          SirSnookie
        </a>
</p>
<p>IRQ ist glaub ich kein DENIC Mitglied - da k&ouml;nnte es sein das die Domain &uuml;ber ein anderes Mitglied geregt ist. Wie gesagt, dummer Zufall ....</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1249" onclick="set_comment_reference(1249)" title="auf diesen Kommentar antworten">#1249</a>:
    12.Apr.2009 01:04
    von
    
      
        Willi
      
    
    
  </p>
<p>und wer war der DNS-Verwalter dann? Gibt es ein WHOIS-Archiv? Dann mal her mit den Fakten...</p>

<p class="infos">
<a href="#comment_1250" onclick="set_comment_reference(1250)" title="auf diesen Kommentar antworten">#1250</a>:
    12.Apr.2009 02:04
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          SirSnookie
        </a>
</p>
<p>Den DNS Eintrag kannst du je nach belieben setzen. Sei es bei deinem Provider oder direkt eigene DNS Server nutzen wenn dein Provider diese Angeben bei der Registrierung unterst&uuml;tzt.</p>
<p>Nur wenn die Domain in den Transit ger&auml;t - wird halt auf die Standard-DENIC Seite gelenkt.</p>
<p>Es gibt kein Whois-Archiv.</p>
<p>Wie gesagt, die Infos zum Transit <a href="http://transit.denic.de/%3C/p%3E" rel="nofollow">http://transit.denic.d...</a>
</p><p>Die Domain geh&ouml;rt lt. Wohis auch immernoch dem Herrn Reppe.</p>

<p class="infos">
<a href="#comment_1251" onclick="set_comment_reference(1251)" title="auf diesen Kommentar antworten">#1251</a>:
    12.Apr.2009 02:04
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          SirSnookie
        </a>
</p>
<p>Achso - der Hoster muss nicht derjenige sein der die Domain regt. ;)</p>

<p class="infos">
<a href="#comment_1252" onclick="set_comment_reference(1252)" title="auf diesen Kommentar antworten">#1252</a>:
    12.Apr.2009 02:04
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>nach dem Hoster f&uuml;r Wikileaks zu gehen ist eh ziemlich d&auml;mlich, wenn bereits bei der Durchsuchung  &uuml;berall geschrieben wurde dass der betreffende nur die Domain Wikileaks.de besitzt (oder jetzt halt nicht mehr) und ansonsten halt nicht viel mit Wikileaks zu tun hat.</p>
<p>Nat&uuml;rlich kann es dennoch die selbe Firma sein, aber es gibt keine Hinweise darauf. ;-)</p>
<p>Genauere Hinweise als Denic zu finden wird auch etwas schwer wenn jetzt der Eintrag erstmal &uuml;berschrieben wurde. Der Eigent&uuml;mer kann dir da sicher weiterhelfen. Du kannst ja auch mal im Lawblog anfragen, Udo Vetter vertritt ihn glaube.... ich glaub nur nicht dass du eine Antwort bekommst.</p>

<p class="infos">
<a href="#comment_1253" onclick="set_comment_reference(1253)" title="auf diesen Kommentar antworten">#1253</a>:
    14.Apr.2009 10:04
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          SirSnookie
        </a>
</p>
<p>Ich habs doch gesagt - triffts so ziemlich gut :)</p>
</div>