+++
title = "follow Person vs. join Room"
date = "2009-02-17T01:02:00"
author = "Dr. Azrael Tod"
issoid = "blog/1250"
aliases = "blog/1250"
+++

<p>In letzter Zeit treffe ich immer wieder auf die Ansicht, dass wann immer es um Informationen und deren Aggregation geht, das neue System bei dem man einzelnen Personen folgt automatisch dem altbekannten System aus <a href="irc://chat.freenode.net/#zanzibar">IRC</a> und co., bei dem man einen Raum zu einem Thema beitritt &uuml;berlegen w&auml;re.</p>
<p>Um es kurz zu machen: Das ist generalisierter Bl&ouml;dsinn und kann nur von den typischen Web2.0 Fanatikern kommen, die es heute scheinbar &uuml;berall gibt.<!--more--><br/>Aber wir sollten das Thema wie immer etwas detailierter angehen. Meiner Meinung nach gibt es durchaus Platz f&uuml;r beide Systeme und jedes hat Vor- und Nachteile. Die Entscheidung welches System man w&auml;hlt ist durchaus eine der wichtigsten f&uuml;r eine neue Platform, doch sollte man sich imho davon nicht derartig nerv&ouml;s machen lassen, wie es offenbar viele tun. Auch wenn die Systeme unterschiedlich an das selbe Problem herangehen: Sie widersprechen sich keinesfalls!</p>
<p></p><h2>join</h2><br/>Das altbekannte Raumsystem wie man es von so ziemlich allen Chats oder Foren her kennt ist zwar alt, aber dadurch noch lang nicht schlecht. Wenn ich an einem Thema interessiert bin, bringt es doch keinen Sinn mich nach Personen umzusehen die sich mit diesem Thema besch&auml;fftigen. Die wenigsten Personen sind nur an einem Thema interessiert und es erzeugt nur unn&ouml;tiges Rauschen jeglichen Personen zu folgen die irgendwann mal was zu dem Thema gesagt haben.

<p></p><h2>follow</h2><br/>Bei dem "<a href="http://twitter.com" target="_blank">Twitter</a>-System" (als ob die das erfunden h&auml;tten... *kopfsch&uuml;ttel*) folgen wir einer einzelnen Quelle und bekommen jeglichen Mist mit, den diese so von sich gibt. Das bietet sich nat&uuml;rlich an wenn die Quelle themenspezifisch ist (z.B. Fachblog) oder wir ohne Thema auf dem laufenden zu dieser Person bleiben wollen (z.B. guter Freund).<br/>Wenn ich hingegen auf einer Platform nur wenig aktiv bin, zeigt dieser Ansatz auch schnell seine Schw&auml;chen: Es erzeugt sehr viel Aufwand aktiv Quellen auszuw&auml;hlen denen man folgt und Personen die viel uninteressantes posten auszusortieren.

<p></p><h2>sinnvoller Wechsel?</h2><br/>Beides Ans&auml;tze haben ihre festgefahrenen Einsatzgebiete. H&auml;ufig sollte man sich jedoch &uuml;berlegen ob diese Idee in ihrer Verwendungsform wirklich sinnvoll ist, oder ob man auf einem anderem Weg nicht doch viel besser kommen w&uuml;rde.<br/>So ist es f&uuml;r viele Personen die auf Blogs nur sporadisch unterwegs sind wohl einfacher auf gro&szlig;en Platformen wie Rivva, Technorati oder gar <a href="http://Wordpress.com" rel="nofollow">Wordpress.com</a> nach bestimmten Tags zu suchen oder eine Google-Blog-Suche nach Bestimmten begriffen zu verwenden um eher einen Raum-&auml;hnlichen Ansatz zu verwenden statt sich m&uuml;hsamm einzelne Quellen selbst suchen zu m&uuml;ssen.<br/>Bei <a href="http://google.com/reader" target="_blank">Google-Reader</a>, <a href="http://friendfeed.com/rooms/g33ky" target="_blank">Friendfeed</a> oder gar Twitter kann es hingegen f&uuml;r einige Personen sinnvoller sein bereits von anderen aggregierte Zusammenfassungen des Zeitgeschehens auszuwerten, statt Themenkan&auml;le selbst beschaffen zu m&uuml;ssen.

<p>Wenn wir uns jedoch die ganzen ausgereifteren Systeme da drau&szlig;en etwas genauer ansehen, so wird eins deutlich: die wenigsten Platformen verwenden strikt ein einziges System. Friendfeed-Nutzer k&ouml;nnen so z.B. sehr sch&ouml;n Themen-R&auml;ume verwenden und sich IRC-m&auml;&szlig;ig aufteilen wohin sie welche Informationen genau posten, gleichzeitig kann ich aber auch einfach alten Freunden folgen und so immer auf dem laufenden bleiben was sie gerade so tun.<br/>Das selbe gilt nat&uuml;rlich auch f&uuml;r soziale Netzwerke, Newsfeed-Systeme (Google Reader), <a href="http://drazraeltod.wordpress.com/2008/12/08/letzte-chance-icq-ausstieg/" target="_blank">IM-Protokolle</a> und Foren. Fast immer habe ich die Wahl zwischen einer pers&ouml;nlichen und einer Themenspezifischen Ebene.</p>
<p>Die einzigen, mir bekannten Ausnahmen aus dieser Regel stellen folgende Dinge dar:<br/></p><ul><br/> <li>kleine Dienste, wenn ich keinen aus der winzigen Community wirklich kenne und eigentlich auch nur sporadisch dort bin um eine bestimmte Informationsart zu suchen, brauche ich keine Spezifizierung mehr. Ich habe bereits eine thematische Spezifizierung gew&auml;hlt, warum sollte ich das in beide Richtungen einschr&auml;nken?</li><br/> <li>Twitter, es gibt durchaus die M&ouml;glichkeit via Hashtags oder &auml;hnlichen Erweiterungen nach Themen zu suchen (bereits die Suchfunktion ist gut genug versteckt dass sie die meisten Nutzer wohl nie verwenden werden), der typische Einsatzzweck von Twitter ist dies aber nicht. Diese Einstellung ist auch wieder einer der Gr&uuml;nde, warum ich Twitter als Platform einfach noch nicht ernst nehmen kann und warum sie f&uuml;r mich pers&ouml;nlich nicht genug Mehrwert bietet um den Aufwand zu rechtfertigen.</li><br/></ul>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1130" onclick="set_comment_reference(1130)" title="auf diesen Kommentar antworten">#1130</a>:
    17.Feb.2009 08:02
    von
    
      
        <a href="http://martin.ringehahn.de/blog/" target="_blank">
          Martin Ringehahn
        </a>
</p>
<p>Um auf die Hashtags bei Twitter noch etwas einzugehen: Sowas wird idealerweise &uuml;ber Bots wieder nach Twitter gef&uuml;ttert. Passables Beispiel hier: <a href="http://twitter.com/ttcu_community" rel="nofollow">http://twitter.com/ttc...</a> ver&ouml;ffentlicht automatisch alle Posts mit dem Hashtag #ttcu, wenn man diesen Nutzer abonniert, folgt man einem "Raum". In diesem Falle sind das Updates &uuml;ber den Status des &Ouml;ffentlichen Nahverkehrs im Raum Toronto, auf peer-to-peer Basis. Wenn die Ubahn mal wieder nicht kommt, erf&auml;hrt man hier, warum. Oder besser: Nimmt alternative Wege.</p>
<p>Da sind wir beim n&auml;chsten Thema, n&auml;mlich: Wie komme ich rechtzeitig an die Updates? Twitter hat in relativ kurzer Zeit eine bemerkenswerte Anzahl an clients getriggert. Sicher, man k&ouml;nnte das gleiche auch irgendwie offen, dezentral beispielsweise &uuml;ber XMPP (pubsub..) regeln. Macht aber keiner. Warum? Weil es kompliziert ist (XMPP..), weil es keine zentrale Anlaufstelle gibt etc pp. Ich verweise hier nur auf XMPP/Jabber und Google Talk. "Installier Google Talk" ist eben einfacher als "W&auml;hle einen Jabber Host, W&auml;hle einen Client". Genau das gleiche mit Twitter: Der Einstieg ist einfach - wobei die Website <a href="http://twitter.com" rel="nofollow">twitter.com</a> in dem Moment sowohl als Twitter Client als auch Server f&uuml;r die Plattform dient.<br/>
Durch die "unstrukturiertheit" von Twitter, mit der Beschr&auml;nkung der Textl&auml;nge, dem fehlen von Bildern und was-weis-ich ist es sehr einfach einen Client zu diesem "Netzwerk" zu schaffen. Mobile clients gibt es zuhauf, ebenso wie die drei Millionen anderen Dienste, die mit Twitter interagieren.</p>
<p>Twitter hat seine Berechtigung. Es bringt das Realtime-Internet zu den Menschen, die der technische Krimskrams nur wenig interessiert, &ouml;ffnet eine Welt, die auch von Firmen wie Google bisher vernachl&auml;ssigt wurde.</p>

<p class="infos">
<a href="#comment_1131" onclick="set_comment_reference(1131)" title="auf diesen Kommentar antworten">#1131</a>:
    17.Feb.2009 10:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>twitter und realtime? da haben wir wieder das permanente polling, wie wir es von newsfeeds her kennen. Ich bin mir auch ziemlich sicher dass die meisten Leute Twitter <em>nicht</em> per client verwenden sondern immer sch&ouml;n im Brauser auf F5 dr&uuml;cken.<br/>
Nat&uuml;rlich kenne ich die sch&ouml;nen Aussagen der Twitter-Macher dass sie viel mehr Traffic &uuml;ber die API erhalten als &uuml;ber die Webseite... aber Traffic ist nicht Nutzung und ein Client der alle 5min pollt verursacht mehr davon als 10 Personen die alle 2-3 Stunden mal kurz per Hand nachsehen.</p>
<p>Kurz: Twitter mag vlt. seine Daseinsberechtigung haben aber imho haben die Ottonormalnutzer eine Art Realtimeinternet viel eher durch Sachen wie ICQ oder irgendwelche Flash-Webchats realisiert.<br/>
Das ist sicher schlimmer als Twitter, wird sich aber auch sicher nicht so schnell &auml;ndern.</p>

<p class="infos">
<a href="#comment_1132" onclick="set_comment_reference(1132)" title="auf diesen Kommentar antworten">#1132</a>:
    19.Feb.2009 12:02
    von
    
      
        <a href="http://ag7.alltagsgrauen.info/" target="_blank">
          fwolf
        </a>
</p>
<p>oder, anders formuliert: Twitter bleibt uninteressant f&uuml;r mich, ICQ bleibt das meistgenutzte System (bei mir).</p>
<p>cu, w0lf.</p>

<p class="infos">
<a href="#comment_1133" onclick="set_comment_reference(1133)" title="auf diesen Kommentar antworten">#1133</a>:
    19.Feb.2009 12:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>nuja, es gibt durchaus web2.0-dienste die vergleichbare informationen liefern (friendfeed mal als sehr &auml;hnliches) aber erheblich flexibler sind...<br/>
und was icq betrifft: sagen wir mal wenn man das protokoll durch ein vern&uuml;nftiges wie jabber oder irc ersetzt, stimme ich dir was IM betrifft zu. :-)</p>

<p class="infos">
<a href="#comment_1134" onclick="set_comment_reference(1134)" title="auf diesen Kommentar antworten">#1134</a>:
    19.Feb.2009 10:02
    von
    
      
        <a href="http://codeschmie.de" target="_blank">
          fa
        </a>
</p>
<p>IRC und IM in einem Satz.. ne, ne, ne - zu viele Idler ;)</p>

<p class="infos">
<a href="#comment_1135" onclick="set_comment_reference(1135)" title="auf diesen Kommentar antworten">#1135</a>:
    19.Feb.2009 12:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Weil im irc viele nur anwesend sind und nur alle paar stunden mal nachsehen ob es etwas interessantes gab, &auml;ndert das doch nichts am Protokoll und seinem Nutzen.... abgesehen davon dass ich auch Jabber oder sonstige IM-Protokolle nicht anders verwende, ich kann ja nicht immer nur auf den Client starren.</p>

<p class="infos">
<a href="#comment_1136" onclick="set_comment_reference(1136)" title="auf diesen Kommentar antworten">#1136</a>:
    03.Mar.2009 02:03
    von
    
      
        <a href="http://martin.ringehahn.de/blog/" target="_blank">
          Martin Ringehahn
        </a>
</p>
<p>Nochmal zu der Sache mit "twitter und realtime", weil mir gerade was dazu eingefallen ist:</p>
<p>http://search.twitter.com/search?q=thepiratebay</p>
<p>Wenn man die &uuml;blichen Vergleiche mit mit Instant Messengern und IRC macht, wird man bemerken, dass Instant Messanging im allgemeinen nicht &ouml;ffentlich ist. IRC ist meisstenfalls &ouml;ffentlich, wird jedoch im allgemeinen nicht &ouml;ffentlich geloggt und ist somit nicht durchsuchbar. Was man auf seinem Blog schreibt ist offentlich und "geloggt", jedoch nicht immer z&uuml;gig indiziert. Twitter ist &ouml;ffentlich, geloggt und zeitnah indiziert - damit auch sofort durchsuchbar.</p>
<p>Man kann diesen Vorteil bei gr&ouml;sseren Ereignissen beobachten (<a href="http://search.twitter.com/search?q=%23schiphol" rel="nofollow">http://search.twitter....</a>) als auch bei kleineren Gruppen (etwa Hashtags #twdd f&uuml;r ein Dresdner Twitter meetup, #genyto f&uuml;r ein Torontoer). Mal sehen wie lang das nutzbar bleibt. Im Prinzip sind Hashtags und @replies ja &ouml;ffentliche R&auml;ume im IRC-Vergleich. Moderation wurde im IRC bestimmt nicht aus langeweile eingef&uuml;hrt.</p>
</div>