+++
title = "Anderthalb Millionen Flüchtlinge"
date = "2015-10-05T10:10:00"
author = "Dr. Azrael Tod"
tags = ["Politik", "Pseudoargumente", "SPON", "Sprache", "Säue durchs Dorf treiben"]
issoid = "blog/1627"
aliases = "blog/1627"
+++

<p>Die FAZ, ein zumindest Papierblatt von denen die meisten annehmen dass es einigerma&szlig;en vern&uuml;nftige Inhalte bringen k&ouml;nnte, <a href="http://www.faz.net/aktuell/politik/fluechtlingskrise/interne-prognose-behoerden-rechnen-offenbar-mit-1-5-millionen-fluechtlingen-13839115.html" target="_blank">vermeldet gerade folgende Schlagzeile</a>:</p>
<p></p><blockquote><b>Beh&ouml;rden rechnen offenbar mit 1,5 Millionen Fl&uuml;chtlingen</b>
<p>Sind alle Sch&auml;tzungen Makulatur? Bis Ende Dezember k&ouml;nnten noch mehr Asylbewerber dazusto&szlig;en als im gesamten Jahr bisher, hei&szlig;t es laut &bdquo;Bild&ldquo;-Zeitung in einem vertraulichen Bericht.</p></blockquote>
<p>EVERYBODY PANIC!</p>
<p>Blo&szlig;: die bisherigen Zahlen des BAMF unterst&uuml;tzen die These auch weiterhin nicht. Bis Ende August hatten wir 256.938 Asylantr&auml;ge (im August waren es auch weniger als im Juli), bedeutet wenn wir einen linearen Verlauf h&auml;tten, m&uuml;ssten wir mit 385.407 Antr&auml;gen f&uuml;r das Jahr rechnen.</p>
<p>Die alte Sch&auml;tzung nahm aber auch alle <em>gemeldeten</em> Personen als Grundlage (also z.B. Personen auf der Durchreise die keinen Asylantrag gestellt haben), damit k&auml;me man dann auf ca. 530K Personen (wieder: f&uuml;r 2015).</p>
<p>Dann hat das BAMF gesagt "Worst-Case ist 800K", warum gerade diese Zahl? <a href="http://www.wdr5.de/sendungen/politikum/kommentar/Aufnahme-Fluechtlinge-Hochrechnung100.html">Wissen die selbst nicht!</a>. Aber gut, lieber auf zu viel eingerichtet sein als dann &uuml;berrascht werden.</p>
<p>So wurde die Zahl nat&uuml;rlich nicht aufgenommen. Es gab die gleichen albernen Schlagzeilen wie auch diese jetzt.</p>
<p></p><blockquote> INTERNE PROGNOSE: 800K Fl&uuml;chtlinge f&uuml;r 2015 angenommen!!!!dr&ouml;lf PANIK!</blockquote>
<p>Dann kam Siggi. Siggi sagte "<a href="http://www.spiegel.de/politik/deutschland/sigmar-gabriel-geht-von-einer-million-fluechtlinge-2015-aus-a-1052809.html">Es werden sogar &uuml;ber eine Million!!11elf</a>". Nat&uuml;rlich wieder keine Angabe woher er die Zahl hat. Statistisch erfasste Daten haben sich bis zu dem Zeitpunkt zumindest keine neuen ergeben.</p>
<p>Und jetzt SCHON ANDERTHALB MILLIONEN. Quelle? Bild! -.-</p>
<p>Ich zittere! ...und warte mal lieber auf die gemessenen Werte f&uuml;r September die in den n&auml;chsten Tagen kommen sollten.</p>
<p>Aber mit abwarten und nennen von realistischen Zahlen verkauft sich nat&uuml;rlich keine Zeitung. Mit Schlagzeilen in denen sich absurde Sch&auml;tzungen jeweils &uuml;berbieten hingegen schon.</p>
<p>Oder um es mit einem <a href="http://www.harmbengen.de/Zeitungscartoons.html" target="_blank" title="Harm Bengens Comics">Harm Bengen</a>-Comic zu sagen: <a href="http://www.harmbengen.de/toonpool/2015%2010%2005%20mathematik-nobelpreis_2563535.jpg" target="_blank">fieser Direktlink, weil Nutzung ausdr&uuml;cklich als kostenpflichtig deklariert</a></p>
