+++
title = "Urheberschlecht"
date = "2008-04-30T03:04:00"
author = "Dr. Azrael Tod"
issoid = "blog/369"
aliases = "blog/369"
+++

<p>Inzwischen kennt wohl jeder die Problematik die sich aktuelle Urheberrechtsfragen und das Internet in den letzten Jahren ergeben hat. (Zumindest bei allen Leuten die meinen Blog finden, kann man wohl davon ausgehen.)</p>
<p>DonAlphonso hat jetzt mal wieder einen <a href="http://blogbar.de/archiv/2008/04/30/urheber-nutzer-und-grosszugigkeit/">Beitrag auf Blogbar</a> gebracht, der das ganze imho recht sch&ouml;n zusammenfasst. Auch beschr&auml;nkt er sich nicht, wie im Internet so oft gesehen, auf die reine Sicht der Kopierer, sondern betrachtet das ganze auch aus beiden Blickwinkeln.<br/>Was daran leider noch Fehlt, ist der 3. Blickwinkel.. n&auml;mlich der der Leute zwischen K&uuml;nstler und Fan.<br/>Nat&uuml;rlich wollen gro&szlig;e Labels weiterhin ihre 10^n CDs pro Jahr Verkaufen um ihren Bestand zu sichern und nat&uuml;rlich werden selbige dann auch weiterhin behaupten dass jeder Warez-Fan, der 1TB an MP3s zuhause hat, diese auch sonst runtergeladen h&auml;tte. Was ich nicht verstehe, ist warum unsere Gesetzgebung immer noch mehr diesem Argument zu folgen statt einfach mal der Wirtschaftlichen Grundlage zu folgen, dass Angebot, Nachfrage und Preis ein Dreieckssystem bilden, in dem sich die 3 Ecken gegenseitig beeinflussen. Das inhaltliche Angebot ist nat&uuml;rlich im Internet recht gro&szlig; und auch der Preis liegt mit 0 ziemlich auf dem Optimum (Speicherpreise und &auml;hnliches nicht mitgerechnet), nat&uuml;rlich wird da die Nachfrage gen Himmel schie&szlig;en. Jetzt davon aber auszugehen, dass wenn wir den Preis auf die Wunschwerte der Musikindustrie setzen der Rest des Dreieckssystem gleich bleibt ist nicht nur illusion&auml;r, das ist schlichtweg d&auml;mlich.</p>
<p>Kurz gesagt ist meiner Meinung nach das aktuelle Vertriebssystem von gro&szlig;en Teilen der Musikindustrie nicht mehr tragbar und wird zusammenbrechen. Die Frage ist halt nur wie lange das noch dauert. Hierbei spreche ich jedoch nicht wie sonst so oft von einem dringend n&ouml;tigem gewaltsamen Umbruch (ob n&ouml;tig oder nicht, der wird einfach nicht kommen), ich sehe eher die L&ouml;sung in alternativen Gesch&auml;ftsideen die sich auf Dauer einfach durchsetzen werden.</p>
<p>Beispiele f&uuml;r alternativen gibt es ja bereits genug, sei es die "Kulturflatrate", die jeder bezahlen muss, der sich dann aber auch 24h am Tag anh&ouml;ren darf was er will (Hier ist meiner Meinung nach die Verteilung des Geldes auf die K&uuml;nstler ein Problem.), oder sei es die reine Beschr&auml;nkung auf freie Verteilung der Musik und Einnahmen durch Mehrwerte wie Live-Auftritte oder Fanartikel. Auch ein v&ouml;llig neues System w&auml;re denkbar. Doch was auch immer kommt, K&uuml;nstler wollen auch Geld verdienen und es wird auch immer eine M&ouml;glichkeit geben m&uuml;ssen wie sie das k&ouml;nnen, ob der ganze Wasserkopf in den B&uuml;ros um einzelne K&uuml;nstler herum auf Dauer erhalten wird ist aber eine v&ouml;llig andere Frage.</p>
<p>Nachtrag: vlt. w&auml;re wirklich die Finanzierung durch Live-Auftritte und Fanartikel das Mittel der Wahl. W&uuml;rde auch dem sich immer weiter verbreitenden Gedanken von OpenSource und Wartungs-/Pflegekosten, welches sich ja mit dem Internet offensichtlich sehr gut vertr&auml;gt, am ehesten &auml;hneln.</p>
