+++
title = "Defekte Filme reparieren - After July"
date = "2013-02-06T09:02:00"
author = "Dr. Azrael Tod"
tags = ["Nerdig"]
issoid = "blog/1573"
aliases = "blog/1573"
+++

<p></p><p>Es gibt viele sehr schlechte Filme da drau&szlig;en. Einige <a href="/2008/10/29/Uwe-Boll,-oder-warum-wir-uns-sch&auml;men-m&uuml;ssen." title="Uwe B&ouml;ll, oder warum wir uns sch&auml;men m&uuml;ssen">sind so broken beyond repair dass wohl unrettbaren Bl&ouml;dsinn darstellen</a>, andere sind zwar fast genauso mies, <a href="http://www.imdb.com/name/nm0000386/?ref_=sr_1#maindetails_center_bottom" title="Roland Emmerich - Known For... (IMDB)">enthalten aber genug Explosionen, Resthumor und bekannte Schauspieler</a> um sie trotzdem f&uuml;r ein Restpublikum relevanter Gr&ouml;&szlig;e interessant zu machen.</p>
<p></p><p>Was w&auml;re wenn man solche Filme nehmen w&uuml;rde, die absurde Situation an deren Ende mal ernsthaft durchdenken w&uuml;rde und versucht da eine sinnvolle Geschichte f&uuml;r einen Anschluss zu bauen? (<a href="http://www.imdb.com/title/tt1628841/trivia?ref_=tt_trv_trv" title="Independance Day 2 geplant (IMDB)">Ich sagte doch sinnvoll!</a> Warum h&ouml;rt mir keiner zu?)</p>
<p></p><h3>Projekt: "After July"</h3>
<p></p><h4>Die <a href="http://www.imdb.com/title/tt0116629/" title="Independance Day (IMDB)">Ausgangssituation</a>:</h4>
<p></p><p>Aliens haben angegriffen. Ihr gro&szlig;es Mutterschiff mit 1/4 Mondvolumen konnten wir wider  erwarten,mit  absurden Tricks und mit einem mehrere Jahrzehnte altem Alien-Raumj&auml;ger infiltrieren (auch noch ohne dass sich irgendwer &uuml;ber unsere absolut veralteten Sicherheitscodes wunderte).<br/>Wir konnten Schadsoftware auf alle Alien-Schiffe verteilen (erneut ohne die Technologie zu verstehen mit der diese arbeiten und ohne dass Jahrzehnte alte Software irgendwo f&uuml;r Probleme sorgte), welche die Schilde f&uuml;r kurze Zeit deaktivierte und wir konnten anschlie&szlig;end das Mutterschiff zu gro&szlig;en Teilen, mit einer kleinen Atombombe, von Innen heraus sprengen und ein paar der Stadtgro&szlig;en Beiboote abschie&szlig;en (nat&uuml;rlich nur w&auml;hrend diese derartig schildlos ihre Hauptwaffe abfeuerten).</p>
<p></p><h3>Moment, was?</h3>
<p></p><h4>Status der Aliens</h4>
<p></p><p>Wenn wir sehr viel Gl&uuml;ck hatten, ist das Mutterschiff durch sekund&auml;re Explosionen vollst&auml;ndig zerst&ouml;rt, viel wahrscheinlicher ist aber eher dass die Aliens doch noch irgendwo einen nicht total unf&auml;higen Ingenieur bei der Konstruktion beteiligt hatten und das Schiff aufgrund seiner enormen Gr&ouml;&szlig;e und unserer um mehrere Gr&ouml;&szlig;enordnungen unterdimmensionierten Bombe nur leicht angeschlagen im Weltraum treibt.</p>
<p></p><p>Beachte: eine Atombombe auf 1/4 Mond, der Mond hat ca. 50x Volumen der Erde, wir haben weit mehr als ein paar Hundert Atombomben auf der Erde gez&uuml;ndet ohne alle gestorben zu sein. Wer mir jetzt erz&auml;hlen will dass die Bombe gereicht h&auml;tte um z.B. die Erde in St&uuml;cke zu sprengen, darf sich gerne mal durchlesen welche Gr&ouml;&szlig;e <a href="http://de.wikipedia.org/wiki/Tsar-Bomba" title="AN602 - Tsar-Bomba, die gr&ouml;&szlig;te bisher gez&uuml;ndete Atombombe (Wikipedia)">eine wirklich gro&szlig;e, bereits gez&uuml;ndete Atombombe</a> hatte. <br/>Die kann mal eben in 3-4km Radius ordentlich Schaden anrichten. Der Mond ist gr&ouml;&szlig;er.</p>
<p></p><p>Aber das ist eh gut&hellip; W&auml;re das Schiff zerst&ouml;rt, h&auml;tten wir genug andere Probleme als uns um ein paar angreifende Aliens zu k&uuml;mmern.<br/>Wir wollen lieber nicht dar&uuml;ber nachdenken was passiert wenn so ein Block aus der Umlaufbahn f&auml;llt und zur Erde treibt.</p>
<p></p><p>Von den dutzenden Beibooten konnten wir vlt. ein paar zerst&ouml;ren als sie ihre Hauptwaffen einsetzen wollten. Irgendwann m&uuml;sste auch das d&uuml;mmste Alien auf die Idee kommen lieber erst die angreifenden Flugzeuge zu vernichten, bevor man seine BFG3000 abfeuert.</p>
<p></p><p>Der Einfachkeit halber sagen wir halt, wir konnten tats&auml;chlich die H&auml;lfte der Angriffsstreitmacht dieser merkbefreiten Aliens erledigen bevor sie mitbekommen haben dass sie besser ihre lieblings-WMDs anders einsetzen sollten, bis in 1-2 Stunden/Tagen die Schilde wieder funktionieren. Ich glaube ja eh nicht dass es auf Dauer gesund sein kann, wenige hundert Meter &uuml;ber einer solchen Entladung zu schweben, ohne dass die Schilde funktionieren.</p>
<p></p><h4>Status der Menschen</h4>
<p></p><p>Ca. 100-200 der gr&ouml;&szlig;ten St&auml;dte der Erde sind inzwischen zerst&ouml;rt, unsere Armeen sind jedoch gr&ouml;&szlig;tenteils noch erhalten, da sie zu gut verteilt und au&szlig;erhalb der Gro&szlig;st&auml;dte lagerten und wir es eh nicht geschafft haben diese f&uuml;r ernsthafte Verteidigungsschl&auml;ge zu versammeln. (Wie lange hat die Bundeswehr das letzte Mal gebraucht um ein paar hundert Leute in ein bestimmtes Land zu bewegen?)</p>
<p></p><p>Die Schilde und Waffen der Aliens verstehen wir auch noch immer nicht, aber wir haben da die Wracks von ein paar gro&szlig;en Beibooten &uuml;berall rumliegen, in denen wahrscheinlich genug Technologie rumliegt um uns eine Chance zu geben.</p>
<p></p><h3>Und nun?</h3>
<p></p><p>Die sinnvolle Strategie f&uuml;r die Aliens ist eindeutig erst ihre Software wieder zum laufen zu bekommen (Ruft mal einer bei der IT an?), w&auml;hrenddessen zu verhindern dass wir Zugriff auf abgest&uuml;rzte Schiffe erhalten (und vlt. sogar &Uuml;berlebende zu bergen), um uns dann so schnell wie m&ouml;glich zu vernichten.</p>
<p></p><p>Die beste Strategie f&uuml;r uns hingegen ist so schnell wie m&ouml;glich zu verstehen wie man die Schilde umgehen kann und selber welche erzeugt. Dazu sollten wir dringend Alien-Schiffe bergen und Informationen verteilen. Diese Frage wird &uuml;ber die Zukunft der Menschheit entscheiden, da sollte man es schaffen alle Informationen so schnell wie m&ouml;glich an alle Forscher weltweit zu verteilen. Sicher wird irgendein Nerd da drau&szlig;en mal einen Teilaspekt der Physik dahinter verstanden haben.</p>
<p></p><p>Da die Aliens ihre Stralenwaffen nicht weiter einsetzen k&ouml;nnen, werden sie wohl auf ihre J&auml;ger setzen, die auch so unseren Flugzeugen wohl noch um l&auml;ngen &uuml;berlegen sind. sicherlich werden auch die Beiboote selbst irgendeine Art sekund&auml;rbewaffnung haben und Zwischengr&ouml;&szlig;en an Flugzeugen in irgendeinem Hangar rumstehen.<br/>Bodenangriffe sind m&ouml;glich, bringen aber momentan h&ouml;chstens f&uuml;r extrem gut in Bunkern versteckte Ziele einen Nutzen. Auch im Zweikampf sind uns aber die Angreifer &uuml;berlegen, da sie mit ihren Exoskeleten Menschliche Soldaten dutzendweise ausschalten k&ouml;nnen und wohl auch sicher irgendwelche &uuml;berlegenen Feuerwaffen rumliegen haben.</p>
<p></p><p>Obwohl technologisch deutlich unterlegen und schwer angeschlagen durch die Vernichtung der meisten unserer Metropolen, haben auch wir noch einige Vorteile. So sind wir bei weitem in der &Uuml;berzahl, unsere Stellungen sind erheblich besser ausgebaut, unsere Ortskentnisse sind hervorragend und im Schlimmsten Fall k&ouml;nnten wir uns auch darauf verlegen aus der Deckung heraus immer kurze Schl&auml;ge gegen den Gegner zu f&uuml;hren um sofort wieder in irgendwelchen H&ouml;hlen zu verschwinden oder so. Zur Zeit ist das gr&ouml;&szlig;te Problem aber noch immer unsere erhebliche Zivilbev&ouml;lkerung zu sichern.</p>
<p></p><h3>Nebenbei: Zu den Vorw&uuml;rfen dass ein Raumschiff mit 1/4 der Mondmasse f&uuml;r Gezeiten sorgen m&uuml;sste:</h3>
<p></p><p>Es war im Film selbst immer nur von 1/4 des Mondvolumens (nicht Masse) die Rede, also ca. 5492 E18 m&sup3; (das reicht locker aus um die ganze Erdbev&ouml;lkerung drin unter zu bringen).<br/>Wenn wir jetzt anhand der Masse eines unserer "Raumschiffe" mal sch&auml;tzen wollen (was schwierig ist, man findet kaum daten):</p>
<p></p><ul><br/><li>Die Masse eines Space-Shuttle (110,000 kg) haben wir</li><br/><li>die Au&szlig;enma&szlig;e (37,237m * 23,79m * 17,25m) bringen uns nicht deutlich weiter, da wir ja nicht wirklich Fl&uuml;gelspannweite mit maximaler H&ouml;he und L&auml;nge multiplizieren wollen</li><br/><li>Das Innenvolumen des Laderaumes betr&auml;gt aber 365m&sup3;</li><br/></ul>
<p></p><p>Ich sch&auml;tze also dass das Volumen eines Shuttle wohl so irgendwo zwischen 1000m&sup3;-2000m&sup3; liegen k&ouml;nnte. Was uns zu folgendem Vergleich bringt:</p>
<p></p><ul><br/><li>Der Mond hat eine mittlere Dichte von 3,341 g/cm&sup3;</li><br/><li>Das Shuttle also schlimmstenfalls so 0,06 g/cm&sup3;</li><br/></ul>
<p></p><p>Gehen wir jetzt davon aus dass die Aliens uns technologisch noch etwas vorraus sind und zus&auml;tzlich ziemlich gro&szlig;e Innenr&auml;ume haben (Quelle: Kino/TV), dann wird die Dichte wohl eher noch erheblich geringer sein. Die Masse liegt also DEUTLICH unter einem viertel des Mondes mit dem <a href="https://www.youtube.com/watch?v=rhXUkf8XBfg" title="Harald Lesch - Sci Xpert: 003 Mutterschiff aus Independence Day? (YouTube)">so Spezialexperten gerne rechnen</a> um sich &uuml;ber die Fehler des Filmes aufzuregen. Der Film hat mehr als genug Fehler, man braucht keine zu erfinden um sich aufzuregen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1616" onclick="set_comment_reference(1616)" title="auf diesen Kommentar antworten">#1616</a>:
    09.May.2013 03:05
    von
    
      
        <a href="http://linux-workers.posterous.com/" target="_blank">
          Ikem
        </a>
</p>
<blockquote>
<p>Da die Aliens ihre <em>Strahlenwaffen</em> nicht weiter einsetzen k&ouml;nnen</p>
</blockquote>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1625">
<p class="infos">
<a href="#comment_1625" onclick="set_comment_reference(1625)" title="auf diesen Kommentar antworten">#1625</a>:
    09.May.2013 10:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Hach.. fr&uuml;her war es mal Mode so kleine Signaturen wie: "Wer Rechtschreibfehler findet, darf sie behalten." &uuml;berall drunter zu werfen.</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1637" onclick="set_comment_reference(1637)" title="auf diesen Kommentar antworten">#1637</a>:
    10.Jun.2013 07:06
    von
    
      
        Ohi
      
    
    
  </p>
<p>Nachdem die Schilde sabotiert wurden und das erste Tr&auml;gerschiff abgeschossen wurde, wird die Nachricht dar&uuml;ber sehr schnell auf beiden Seiten verbreiten.<br/>
Die beste Reaktion der Menschheit w&auml;re es, sofort zuzuschlagen und die beste der Aliens w&auml;re es, dem ausweichen.<br/>
Am besten in einen gem&uuml;tlichen Orbit, von wo aus sie dann machen k&ouml;nnen, was sie schon von Anfang an h&auml;tten machen sollen, bombardieren.<br/>
Aber aus einer chancenlos unterlegenen Menschheit l&auml;sst sich kein Drehbuch spinnen.</p>
</div>