+++
title = "Bestechlichkeit/Wandtattoos#2"
date = "2008-11-17T10:11:00"
author = "Dr. Azrael Tod"
issoid = "blog/1056"
aliases = "blog/1056"
+++

<p>Was passiert wenn man sich einerseits <a href="http://drazraeltod.wordpress.com/2008/08/28/ich-bin-ja-kauflich-aber/" target="_blank">aufregt man w&uuml;rde nur unn&uuml;tzen Mist via Blog als Werbegeschenke bekommen</a> und auf der anderen Seite <a href="http://drazraeltod.wordpress.com/2008/10/19/wandtattoo/" target="_blank">Artikel &uuml;ber einen relativ neuen Begriff f&uuml;r eine Verkaufsidee wie "Wandtattoo"</a> auf dem Blog hat, der bei Google doch &ouml;fters mal gefunden wird?  Genau! Man bekommt Werbung zu diesem Thema.</p>
<p>Diesmal allerdings sind die Bestechungsversuche erheblich attraktiver, nicht nur dass es sich um etwas handelt das ich durchaus gerne h&auml;tte (Kunstst&uuml;ck, stand ja schon in den Kommentaren), nein die Seite die gerne eine Verlinkung h&auml;tte sieht sogar annehmbar aus und ich muss mir nicht den Rest meines Lebens Vorw&uuml;rfe machen, sollte ich sie mit "seri&ouml;s" beschreiben.<!--more-->Die erste Reaktion auf die Mail von Tim E. w&auml;re ja beinahe gewesen sie einfach in den Spam zu werfen und evtl. noch einen sarkastischen Kommentar dar&uuml;ber zu verfassen. Dann ist mir jedoch aufgefallen dass hier jemand genau das tut was ich beim letzten Vorfall geschrieben habe.<br/></p><blockquote>ES NIMMT MICH JEMAND BEIM WORT? o0</blockquote><br/>Tats&auml;chlich: Eine direkte Anfrage ob &uuml;berhaupt Interesse besteht, die direkte Bitte sich doch mal das Angebot anzusehen statt irgendwelche Manipulationsversuche und noch besser: Ein Lockgeschenk (Gutschein) mit dem ich auch etwas anfangen kann. (Was im Vergleich zu diversen USB-LED-Lampen ein gro&szlig;er Fortschritt ist)

<p>Da der Artikel jedoch nicht aus meiner Feder stammt sondern meine bessere H&auml;lfte die Loorbeeren ernten sollte, habe ich die endg&uuml;ltige Entscheidung das Angebot anzunehmen oder nicht ihr &uuml;berlassen. Auch einen Artikel in dem noch gekl&auml;rt wird was wir genau bestellt haben (das hat sie wieder mir &uuml;berlassen, es ist also ziemlich nerdig) wird Cindy noch nachliefern, zusammen mit einer Beschreibung des Ladens und des Bestellablaufes. Auch Bilder wird es nat&uuml;rlich wieder geben.</p>
<p>An die Adresse aller anderen Onlineh&auml;ndler die wie Tim oder der Lampensender gerne meine Aufmerksamkeit (oder eher die meiner Leser) h&auml;tten kann ich nur sagen: BITTE KEINE UNGEFRAGTEN M&Uuml;LLSENDUNGEN an mich verschicken!</p>
<p>Kleine Randbemerkungen:<br/></p><ul><br/> <li>Wandtattoo ist ein bescheuerter Name, ich will mal denjenigen sehen der wirklich mit der Nadel da steht und das <em>unter</em> die Wand bringt.</li><br/> <li>Bestellnummer knapp &uuml;ber 600! Den Shop gibts offenbar noch nicht wirklich lange.</li><br/></ul>
