+++
title = "kranke Kassen"
date = "2008-05-19T03:05:00"
author = "Dr. Azrael Tod"
issoid = "blog/374"
aliases = "blog/374"
+++

<p>Unser Medizinsystem ist im Eimer! Diese Feststellung ist ja jetzt in der Form nichts wirklich neues und wird wohl schon von jedem mal aufgestellt worden sein, der in der Notaufnahme nach 10&euro; gefragt wurde (auch wenn man per Krankenwagen eingeliefert wird) oder stundenlang von Arzt zu Arzt gerannt ist und immer abgelehnt wurde, weil alle Haus&auml;rzte &uuml;berlastet waren und keine neuen Patienten annahmen.</p>
<p>Jetzt dr&auml;ngt sich nat&uuml;rlich die Meinung auf dass die Krankenkassen kein Geld h&auml;tten (Ja, klar.. daher gibts auch in jeder Stadt soundsoviele Angestellte f&uuml;r jede EINZELNE Krankenkasse und moderne B&uuml;roausstattungen von denen andere Organisationen nur tr&auml;umen k&ouml;nnen. Vom Verwaltungsaufwand f&uuml;r die ganzen verschiedenen Krankenkassen fang ich garnicht erst an.) und an jeder M&ouml;glichen Ecke sparen m&uuml;ssen (zumindest soweit es um Leistungen f&uuml;r Patienten geht).<br/>Dem scheint aber nicht wirklich so zu sein. Wie sollte man sich sonst erkl&auml;ren, dass z.B. &Auml;rzte schon seit Jahren im Bereich der Antihistaminika (harmlose und einfache Heuschnupfenmittel) nur noch eine einzige Variante verschreiben d&uuml;rfen? Wenn man also zum Arzt geht, seine 10&euro; Praxisgeb&uuml;hr bezahlt (Das bekommen die Kassen, die &Auml;rzte d&uuml;rfen das Geld nur einsammeln und haben jede Menge &Auml;rger damit.), und sich Tabletten gegen Heuschnupfen verschreiben l&auml;sst, bekommt man "Xusal" von UCB. Dabei handelt es sich um ein Medikament auf Basis von Levocetirizindihydrochlorid, wem das zu lang ist der nennt den wirkstoff einfach <a href="http://de.wikipedia.org/wiki/Levocetirizin">Levocetirizin</a> bzw. noch einfacher Cetirizin.<br/>Jetzt hat man also ein Rezept, mit diesem Rezept geht man in die Apotheke und nach 5&euro; Zuzahlung bekommt man seine 20 Tabletten.</p>
<p>Das Bl&ouml;de an der Sache: Es gibt bei weitem mehr Hersteller an Medikamenten, alle m&ouml;glichen Varianten von Histamin-Rezeptorblockern und noch viel mehr Marken unter denen diese verkauft werden.<br/>So bezahlt man z.B. f&uuml;r Loran, ein Medikament auf Basis von <a href="http://de.wikipedia.org/wiki/Loratadin">Loratadin</a> (zugegeben es ist nicht ganz auf dem neuesten technischem Stand, daf&uuml;r ist dies das einzige Antihistaminikum, bei dem ich pers&ouml;nlich wenigstens eine kleine Wirkung feststellen konnte) statt der 21,60&euro; von Xusal nur knapp 5&euro;. F&uuml;r den Kranken bedeutet das dass man sich 10&euro; Praxisgeb&uuml;hr sparen kann und auch ohne Rezept noch ein paar Cent weniger bezahlt als wenn man sich das vom Arzt verschriebene Medikament mit Unterst&uuml;tzung durch die Krankenkasse kauft.</p>
<p>Doch welchen Grund sollten die kranken Kassen haben, solch ein wiedersinniges System zu f&ouml;rdern? Immerhin zahlen die Kassen selbst ca. 15&euro;, wann immer ein Patient Xusal vom Arzt verschrieben bekommt. Ich kann nat&uuml;rlich nicht behaupten ich verst&uuml;nde was f&uuml;r Wahnvorstellungen die Personen in den Leitungspositionen dort haben, wenn ich mir jedoch ansehe was der EINZIGE ernstere Effekt der Praxisgeb&uuml;hr war... (kranke Patienten gehen seltener zum Arzt) dann k&ouml;nnte man fast denken das alles w&auml;re Absicht und dahinter w&uuml;rde ein System stecken.</p>
<p>BTW: Ich bin nat&uuml;rlich nicht ausgebildet um irgendwelche Nebenwirkungen der genannten Medikamente einsch&auml;tzen zu k&ouml;nnen, oder gar Rezepte entsprechend bestimmter Symptome empfehlen zu k&ouml;nnen. Sollten sie also meinen eines der genannten Medikamente k&ouml;nnte ihnen helfen dann GEHEN SIE ZU EINEM ARZT ODER APOTHEKER!</p>
<p><strong>DIES HIER IST KEINE MEDIZINISCHE BERATUNG!</strong></p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_100" onclick="set_comment_reference(100)" title="auf diesen Kommentar antworten">#100</a>:
    21.May.2008 10:05
    von
    
      
        <a href="http://blog.b-o-f-h.net" target="_blank">
          Thorsten
        </a>
</p>
<p>Man k&ouml;nnte dahinter ein System vermuten: Hartz IV Empf&auml;nger sollen beispielsweise weniger zum Arzt gehen, oder es sich zumindest genau &uuml;berlegen bevor sie da hin gehen...</p>
<p>Getreu nach dem Motto: Bist du arm dran, sollst du gef&auml;lligst auch fr&uuml;her verrecken, am besten noch elendiglich.</p>

<p class="infos">
<a href="#comment_101" onclick="set_comment_reference(101)" title="auf diesen Kommentar antworten">#101</a>:
    23.May.2008 05:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>netter Beitrag bei Spreeblick zu diesem Thema:<br/>
<a href="http://www.spreeblick.com/2008/05/23/arzte-und-das-internet/%3C/p%3E" rel="nofollow">http://www.spreeblick....</a>
</p>
<p class="infos">
<a href="#comment_102" onclick="set_comment_reference(102)" title="auf diesen Kommentar antworten">#102</a>:
    24.May.2008 03:05
    von
    
      
        <a href="http://blog.b-o-f-h.net" target="_blank">
          Thorsten
        </a>
</p>
<p>Das Interesse ist aber auf keiner Seite wirklich da, bei &Auml;rzten wohl nicht, als auch nicht bei den Krankenkassen die lieber ihre kosten eind&auml;mmen wollen und um Kunden buhlen. Wenn man dann noch liest das der &Auml;rzte Kongress fordert die freie Arzt Wahl abzuschaffen weiss man was die Stunde geschlagen hat.</p>
<p>Vergleicht man fr&uuml;her mit heute, und das ist ja nun so lange nicht her, ich bin gerade mal Anfang 30: Blutuntersuchung allgemeines Blutbild. Da wurde wirklich alles durchleuchtet, heute muss der Arzt ankreuzen was sie untersuchen sollen. Hast du einen Arzt der dich in eine Ecke aufgrund irgendwelcher Verdachtsmomente dr&uuml;ckt, wird nie raus kommen was du wirklich hast.</p>
<p>Insgesamt wird es eher schlimmer als besser, gef&ouml;rdert durch die Symptom Therapien die bei &Auml;rzten so &uuml;blich sind, der Mensch als ganzes wird gar nicht, oder eher selten, als ganzes gesehen.</p>
<p>Vergleiche ich das mal mit meiner Arbeit als Netzwerkadmin, ich bekomme sehr oft die Meldung das Netz ist langsam. In der Regel hat das nichts mit dem Netz zu tun, ich k&ouml;nnte mich also hin stellen eine Performance Messung machen und sagen: Nein da ist alles in Ordnung. Oder aber ich gehe hin und schaue mir mal an was der so macht auf seiner M&uuml;hle, mit welchen Programmen er haupts&auml;chlich arbeitet, wie die Auslastung seines Rechners ist... In 98% der F&auml;llen haben die "Netz ist langsam" Meldungen nichts mit dem Netzwerk an sich zu tun.</p>
<p>&Auml;rzte sind in der einmaligen Situation das sie Entscheidungen treffen m&uuml;ssen, jeden Tag, und sehr viele sogar. Offensichtlich sorgt das zu diesem Schubladen denken.</p>

<p class="infos">
<a href="#comment_103" onclick="set_comment_reference(103)" title="auf diesen Kommentar antworten">#103</a>:
    27.May.2008 03:05
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>Ich empfehle Fexofenadin, zu bekommen unter dem namen Telfast. Gibt es in 120mg oder 180mg Tabletten.<br/>
Zumindest hilft dieses Antihistaminika der dritten Generation, ohne den Nebenwirkungen der zweiten Generation, mir pers&ouml;nlich sehr gut und ich hab nen ganzen haufen an Allergien ^^</p>

<p class="infos">
<a href="#comment_104" onclick="set_comment_reference(104)" title="auf diesen Kommentar antworten">#104</a>:
    27.May.2008 04:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Hmm.. ich meide die 3. Generation so ganz im Allgemeinen, da ich bisher bei keinem eine bessere Wirkung als bei der 2. Feststellen konnte, der Preis gleich mal um den Faktor 4 h&ouml;her ist und das eigentliche Argument, die Nebenwirkung, bei mir auch bei der 2. Generation noch nie aufgetreten ist.</p>

<p class="infos">
<a href="#comment_105" onclick="set_comment_reference(105)" title="auf diesen Kommentar antworten">#105</a>:
    28.May.2008 11:05
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>Das keine bessere Wirkung sich zeigt ist nat&uuml;rlich bl&ouml;d, aber von Proband zu Proband auch verschieden.<br/>
Bei der 3ten Generation gab es allerdings auch 3 Produkte von denen eben nur das oben genannte als Neuentwicklung betrachtet werden kann. Aber wenn Dir die 2te hilft, why not ^^<br/>
Mir hilft die leider nimmer.</p>
<p>Bl&ouml;den Allergien -.-</p>

<p class="infos">
<a href="#comment_106" onclick="set_comment_reference(106)" title="auf diesen Kommentar antworten">#106</a>:
    08.Aug.2008 09:08
    von
    
      
        <a href="http://www.cashregisterstore.de" target="_blank">
          Delo
        </a>
</p>
<p>Ich habe fr&uuml;her von Juli bis Oktober Cetrizin nehmen m&uuml;ssen. Dann habe ich eine Laserakupunktur machen lassen (etwa 12 Sitzungen), meine Allergie ist seit Jahren verschwunden. Unn&ouml;tig zu erw&auml;hnen, dass ich die Kosten daf&uuml;r selbst tragen musste. Die Tabeletten hingegen wurden bezahlt.</p>

<p class="infos">
<a href="#comment_107" onclick="set_comment_reference(107)" title="auf diesen Kommentar antworten">#107</a>:
    08.Aug.2008 10:08
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Naja.. aber wenn du wieder jedes Jahr zum Arzt rennst zahlst du wieder jedes Jahr deine 10&euro;, zahlst deine Zuzahlung zu den Tabletten und nimmst einen Arzt in Anspruch... Das ganze muss nat&uuml;rlich verwaltet werden (bzw. bei den 10&euro; einfach einkassiert) und schon hat die Kasse ihre Daseinsberechtigung mal wieder best&auml;tigt.</p>
<p>Ein Schelm wer b&ouml;ses dabei denkt...</p>
</div>