+++
title = "Suchtreffer auf G33KY^2"
date = "2008-10-04T01:10:00"
author = "Dr. Azrael Tod"
tags = ["G33KY.de", "Technik"]
issoid = "blog/848"
aliases = "blog/848"
+++

<p>Viele Leute kommen auf der Suche nach seltsamen Dingen von Google, Yahoo oder &auml;hnlichen Seiten zu uns. Dies soll mal ein Versuch sein ihnen die richtige Adresse zu nennen oder zumindest einen b&ouml;sartigen Kommentar dazu abzugeben. (Man tut ja alles um zu helfen.)<!--more--></p>
<p></p><table border="1"><tbody><tr><td>ascii-zeichen-figuren</td><td>Dieser Suchtreffer bezieht sich wohl auf meinen <a href="/2008/08/26/ascii-art/" target="_self">Artikel &uuml;ber ASCII-Art</a>. Um es mal kurz auf einen Link zu reduzieren: versuch mal <a href="http://www.jave.de" target="_blank">JavE</a></td></tr><tr><td>jabber client qt</td><td>Das ist einfach, da k&ouml;nnte ich z.B. <a href="http://psi-im.org" target="_blank" title="Psi-IM">Psi</a> empfehlen. Alternativ g&auml;be es da aber auch noch andere.</td></tr><tr><td>battletech atlas ii</td><td>Ein wirklich sch&ouml;ner Mech... ich h&auml;tte <a href="/2006/7/13/Atlas-(Battletech)" target="_self">ein Gedicht dazu</a> im Angebot.</td></tr><tr><td>rachermaad</td><td>Das ist <a href="http://de.wikipedia.org/wiki/Rauchemaad" target="_blank">sone Art Klitscher</a>... *g*<br/>ein sehr einfaches, erzgebirgisches Kartoffelgericht</td></tr><tr><td>jornada skype</td><td>Das wird etwas schwierig, <a href="http://www.skype.com/download/skype/windowsmobile/" target="_blank">Skype</a> gibt es zwar f&uuml;r PocketPC, aber leider nicht f&uuml;r Hitachi-SH3-CPUs compiliert. Das k&ouml;nnte daran liegen dass SH3 schon seit etlichen Jahren nicht mehr f&uuml;r PPCs unterst&uuml;tzt wird.</td></tr><tr><td>politische webcomics</td><td>Wirklich rein-politisch gibt es wohl nichts, aber z.B. bei <a href="http://www.phdcomics.com" target="_blank">PHD</a> gehts oft um Bildungspolitik, bei <a href="http://www.dabeavercomics.com" target="_blank">DaBeaver</a> gehts oft um Umweltpolitik, <a href="http://geekandpoke.typepad.com/" target="_blank">Geek And Poke</a>, <a href="http://www.joyoftech.com">Joy of Tech</a>,<a href="http://www.xkcd.com" target="_blank">XKCD</a>, <a href="http://www.leasticoulddo.com" target="_blank">LICD</a>, <a href="http://www.der-flix.de">Flix</a> und selbst <a href="http://blog.beetlebum.de" target="_blank">Jojo</a> k&ouml;nnen auch manchmal politisch werden (grob absteigend geordnet)<br/>Wem das nicht reicht, dem empfehle ich meinen <a href="http://feeds.feedburner.com/webcomix">Webcomic-Newsfeed</a> in dem ich diese und viele andere sortiere/sammel.</td></tr><tr><td>python schneller als java</td><td>Das ist ne bl&ouml;de Frage/Aussage/wasauchimmer... Man kann das wirklich nur sehr schlecht vergleichen und sollte es auch nicht tun. Aber mal von den Einsatzgebieten der Sprachen her betrachtet, vermute ich mal dass Python bei vielen kleinen Anwendungen die sich nicht oft wiederholen evtl. die Nase vorn haben k&ouml;nnte. Aber wie gesagt.. bitte keine &Auml;pfel und Orangen vergleichen.</td></tr><tr><td>rox-filer</td><td><a href="http://roscidus.com/desktop/" target="_blank">Rox</a> ist ein sehr sch&ouml;ner, schneller Filemanager/Desktop. Ich selbst <a href="http://drazraeltod.wordpress.com/2008/04/23/show-me-your-linux-desktop/">verwende ihn auf meinem Notebook</a> mit FVWM-Chrystal und erhalte so ein durchaus verwendbares System das selbst auf meinem Uraltger&auml;t noch sch&ouml;n schnell l&auml;uft.</td></tr><tr><td>mcabber jingle</td><td>MUHAHAHAHA! Der Witz war gut! <a href="http://www.lilotux.net/~mikael/mcabber/" target="_blank">mcabber</a> mag f&uuml;r einen Jabber-Client auf Konsolenbasis besser sein als die meisten vergleichbaren Projekte, aber ich w&uuml;sste nicht dass auch nur geplant w&auml;re <a href="http://googletalk.blogspot.com/2005/12/what-is-libjingle.htm" target="_blank">libjingle</a> f&uuml;r IRGENDEINE Funktion zu unterst&uuml;tzen. Wenn man also via Jabber einen Audiochat aufbauen will muss man wohl auch die n&auml;chsten paar Monate noch auf einen grafischen Client zur&uuml;ckgreifen. (Und selbst daf&uuml;r muss man erstmal einen finden der das kann.)</td></tr><tr><td>der immense usus exterritorialer vokabeln</td><td>Vollst&auml;ndig lautet der Text: "Der immense Usus exterritorialer Vokabeln in der germanistischen Linguistik ist mit dezidiertem Fanatismus auf das maximale Minimum zu reduzieren!" Jetzt fragt mich blo&szlig; nicht woher der im Original mal stammt!</td></tr><tr><td>cinemizer laptop arbeiten</td><td>Sch&ouml;n w&auml;rs ja.. aber erstens ist die Aufl&ouml;sung beim <a href="/2008/7/10/Test:-Zeiss-Cinemizer">Cinemizer</a> mit 640x480 nicht wirklich zum Arbeiten geeignet und zweitens kann man das seltsame Ding nur unter sehr gro&szlig;en Schmerzen mit etwas anderem verwenden als einem IPod.</td></tr></tbody></table><br/>Das soll dann auch erstmal f&uuml;r heute reichen, evtl. setze ich das bei Gelegenheit ja mal fort.
      
    
  <div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_706" onclick="set_comment_reference(706)" title="auf diesen Kommentar antworten">#706</a>:
    04.Oct.2008 10:10
    von
    
      
        <a href="http://ag7.alltagsgrauen.info" target="_blank">
          fwolf
        </a>
</p>
<p>zwecks ASCII: <em>r&auml;usper</em> Profis w&uuml;rden TheDraw oder ACiDDraw benutzen.</p>
<p>cu, w0lf.</p>

<p class="infos">
<a href="#comment_707" onclick="set_comment_reference(707)" title="auf diesen Kommentar antworten">#707</a>:
    04.Oct.2008 10:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>sicher.. aber Profis w&uuml;rden nicht danach suchen m&uuml;ssen <em>vermut</em><br/>
Und so rein von den Funktionen her w&uuml;rde ich JavE als das umfangreichere Programm ansehen. Daher denke ich mal dass jemand, dem der Ruf des Programmes egal ist eher JavE als TheDraw oder ACiDDraw verwenden will. ;-)</p>

<p class="infos">
<a href="#comment_708" onclick="set_comment_reference(708)" title="auf diesen Kommentar antworten">#708</a>:
    06.Oct.2008 12:10
    von
    
      
        waynebusdriver
      
    
    
  </p>
<p>Ich glaube, du meintest das Gedicht hier?<br/>
/2006/07/13/atlas-battletech/</p>
<p>Da ist ja ein moderner Goethe an dir(?) verloren gegangen :D</p>

<p class="infos">
<a href="#comment_709" onclick="set_comment_reference(709)" title="auf diesen Kommentar antworten">#709</a>:
    06.Oct.2008 12:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>whoops... da ist ein Link wohl etwas defekt.<br/>
Genau die Unterseite meinte ich, danke f&uuml;r den Hinweis.</p>

<p class="infos">
<a href="#comment_710" onclick="set_comment_reference(710)" title="auf diesen Kommentar antworten">#710</a>:
    07.Oct.2008 09:10
    von
    
      
        <a href="http://www.markuswalther.org" target="_blank">
          Markus
        </a>
</p>
<p>Jaaa, gelegentlich schmunzle ich auch wenn ich sehe, wie die leute auf meine homepage gefunden haben. manchmal entdecke ich da begriffe von deren existenz ich selbst noch nicht wusste :-)</p>
</div>