+++
title = "Distriflame"
date = "2008-03-03T04:03:00"
author = "Dr. Azrael Tod"
issoid = "blog/327"
aliases = "blog/327"
+++

<p>Ich sollte mir wirklich abgew&ouml;hnen auf <a href="http://www.fixmbr.de">F!xmbr</a> die Artikel zu lesen und dann anzufangen, elendig lange Antworten zu tippen.<br/><br/>Jedenfalls hat Oliver dort mal wieder das <a href="http://www.fixmbr.de/fanboys-das-netz-buntu-und-weiter/">allj&auml;hrliche Distrivergleichen losgetreten</a> und ich glaube es ist mal wieder an der Zeit auch meine Meinung dazu beizusteuern:<br/><br/>Ich (und das als eigentlich anerkannter Troll^^) versuche mal mich mit dem trollen ein wenig zur&uuml;ck zu halten. Die meisten Distris haben irgendwo ihre Zielgruppe und ich kann nur danach urteilen wie sehr ich in die jeweilige passe.<br/><br/>SuSE hat imho einige nette Funktionen und mit Yast ein ganz nettes zentrales System als Anlaufstelle f&uuml;r Konfiguration. Jedoch bin ich wie immer von .rpm nicht wirklich begeistert. (das ist schonmal der Grund warum ich auf andere Distris mit diesem System &uuml;berhaupt nicht eingehen werde.) Ich setze Susi also atm. h&ouml;chstens f&uuml;r Multimedia-Anwendungen, bei denen ich nicht ewig an v4l oder &auml;hnlichem rumbasteln will und mit denen auch Neulinge klarkommen sollen, ein.<br/>Der BuildService gef&auml;llt mir als Zentrale Anlaufstelle auch schonmal sehr gut, hat aber bei meinen Test noch etliche Schw&auml;chen gezeigt die einfach so noch nicht tragbar sind. Wenn da noch einiges geschraubt wird, kann man mal dr&uuml;ber reden.<br/>Ansonsten hat Susi auch einige voreinstellungen, die mir so einfach nicht gefallen, das ist aber geschmackssache.<br/><br/>Die anderen RPM-basierenden Distris sind alle nicht so ganz mein Geschmack, ich k&ouml;nnte sSie sicher gr&ouml;&szlig;tenteils f&uuml;r das gleiche einsetzen, wof&uuml;r ich Susi verwende, aber ich hab mich "halt dran gew&ouml;hnt" und ich sehe zwischen diesen ganzen 08/15 "Anwenderfreundlichen" Distris (Nach ihrem Ziel geurteilt, nicht danach wie gut sie es jeweils erreicht haben.) eh nicht so gro&szlig;e Unterschiede (soviel zum starten eines Flamewars...).<br/><br/>Debian ist noch immer mein alltime-fav. ich finde schon dpkg und dselect einfach nur genial und die von haus aus unterst&uuml;tzten repos sind Umfangreich genug um wirklich viel damit anfangen zu k&ouml;nnen.<br/>Auch die Voreinstellungen und &auml;hnliches finde ich bei  Debian fast immer brauchr und mit den verschiedenen Zweigen hat Debian meiner meinung f&uuml;r die meisten Einsatzgebiete irgendwo das passende Hilfsmittel. Leider ist Debian dank fehlendem, zentralen configurationstool eher weniger dazu geeignet von kompletten Neulingen verwendet zu werden, daher kann ich meinen Kunden nur sehr selten dazu raten. Es IST einfach, wenn man wei&szlig; was man macht, aber es sieht f&uuml;r windows-gewohnte user einfach nicht einladend aus.<br/><br/>*Buntu, naja, was soll ich dazu sagen? es ist halt debian mit vielen Aufs&auml;tzen... mir muss nicht gefallen wie sich die Firma dahinter verh&auml;llt oder dass teilweise schon .debs auftauchten, die nichtmehr auf Debian laufen (letzteres geht GARNICHT) aber es ist derzeit einfach meine "Weapon of choice", wenn ich irgendjemandem, der sich &uuml;berhaupt noch nicht mit Linux befasst hat, das Betriebssystem nahebringen will.<br/><br/>zu den BSDs kann ich atm nicht viel sagen, dazu hab ich einfach noch nicht die n&ouml;tige Erfahrung damit. (einzig einige Installationsversuche auf meinem altem Jornada 520, wenn wer das irgendwo mal geschafft hat, dann bitte melden!)</p>
