+++
title = "Flatrateklassifikation"
date = "2015-02-25T02:02:00"
author = "Dr. Azrael Tod"
tags = ["Politik", "Pseudoargumente", "Rant", "Sprache", "Telefon"]
issoid = "blog/1609"
aliases = "blog/1609"
+++

<p>Habe gerade eine sch&ouml;ne Anmerkung auf Twitter gelesen:</p><blockquote class="twitter-tweet" lang="en">So wie bei Milch der Literpreis genannt werden muss, sollte bei Mobilfunkvertr&auml;gen die Gesamtkosten von zwei Jahren aufgef&uuml;hrt werden.<br/>&mdash; Public (@publictorsten) <a href="https://twitter.com/publictorsten/status/570528607757582336">February 25, 2015</a></blockquote>
<p>Da hat er recht!<br/>Angebot und Nachfrage k&ouml;nnen nun mal nur dann den Preis bilden, wenn du dich &uuml;ber Angebot und Nachfrage m&ouml;glichst einfach informieren kannst.</p>
<p>Genau aus diesem Grund gibt es diese Vorschriften um dir bei Lebensmittel, Waschmittel und co. zu erm&ouml;glichen m&ouml;glichst leicht Preise vergleichen zu k&ouml;nnen.<br/>Niemand rechnet in der Praxis aus ob eine Familien-Packung mit 10+2 Artikeln &aacute; 120g zu 4,99 &euro; mit 3% Rabatt teuerer ist, oder eine Packung mit 8 St&uuml;ck &aacute; 200g f&uuml;r 5,20 &euro;.</p>
<p>(Aufl&ouml;sung: 3,36 &euro;/kg vs. 3,25 &euro;/kg)</p>
<p>Das selbe muss nat&uuml;rlich auch f&uuml;r langfristig laufende Vertr&auml;ge gelten, f&uuml;r die man im Zweifelsfall drastisch mehr Geld ausgibt.</p>
<p>Die Gesamtkosten f&uuml;r 2 Jahre sind sicherlich kaum trivial darstellbar. Aber man k&ouml;nnte den Minimalpreis verwenden und mit 2-3 zu definierenden Nutzungsszenarien gegen&uuml;berstellen.</p>
<p>Weiterhin muss endlich angegeben werden wie lange man eine <a href="/2013/4/26/Drosselkom">"Flatrate"</a> bei voller Geschwindigkeit verwenden kann. Was bringen mit Verbindungen mit 300MBit/s wenn ich diese nach 5 Minuten auf 56K-Modem-Geschwindigkeit gedrosselt bekomme?</p>
<p>300MBit/s sind ja sch&ouml;n. Aber eine "Flatrate mit bis zu 300MBit/s (eingeschr&auml;nkt nach 1GB)" zu bewerben, wenn es in Wirklichkeit nur ein Sondermodus in dem man das kurzzeitig nutzen kann, also ist das irref&uuml;hrend. Da ist es auch egal dass klein im Sternchen-Text steht dass die &Uuml;berschrift eigentlich nicht zutrifft.</p>
<p>Wenn man also f&uuml;r seine Flatrate eine Geschwindigkeit angibt, sollte sie mindestens 50% der Zeit durchg&auml;ngig nutzbar sein. Besser w&auml;re es die praktische Durchschnittsgeschwindigkeit anzugeben.</p>
<p></p><h3>Praktische Rechenbeispiele</h3>
<p>Simyo verkauft eine "1 GB Flat mit LTE und bis zu 42Mbit/s*"</p>
<p>Sternchen:</p><blockquote>All-On L mtl. 11,90 &euro; bei 24 Monaten Mindestvertragslaufzeit. Jetzt entf&auml;llt die monatliche Grundgeb&uuml;hr (11,90 &euro;) in den ersten 3 Vertragsmonaten und die Anschlussgeb&uuml;hr betr&auml;gt einmalig 19,90 &euro;. Gilt nur f&uuml;r Neubestellungen. Eine Barauszahlung sowie die Kombination mit anderen Aktionen oder Boni ist nicht m&ouml;glich. Tarif enth&auml;lt 200 Frei-Minuten/SMS. Nach Verbrauch nur 9 Cent pro Minute und SMS, aber dank Kostenstopp nie mehr als 39,00 &euro; pro Abrechnungsmonat. Enthalten sind nationale Standardgespr&auml;che in alle dt. Netze, Standard-SMS und monatlich bis 1 GB mit max. Geschwindigkeit von bis zu 7,2 MBit/s f&uuml;r nationale Datennutzung im dt. E-Plus Mobilfunknetz (gilt nicht f&uuml;r VoIP/Peer-to-Peer), danach GPRS-Geschwindigkeit (max. 56 kbit/s). Bis zum 31.12.2015 teilweise bis zu 42 MBit/s oder LTE.<br/></blockquote>
<p>Wenn man dies vollzeit mit perfektem Empfang verwenden will, ist das 1 GB nach 190 Sekunden (3min 10 sec) verbraucht.<br/>Ein Monat ist im Durchschnitt 43800 Minuten lang, man muss also 43797 Minuten davon mit der Drosselung leben.</p>
<p>...also nur 99,99% der Zeit.</p>
<p>Wenn man danach die versprochene Restgeschwindigkeit weiterverwendet, kann man den restlichen Monat noch weitere 18,4GB &uuml;bertragen.<br/>Jeder 20GB-Volumentarif, bei dem hinterher das Internet komplett abgedreht wird, w&auml;re also bereits sinnvoller.</p>
<p>Durchschnittsgeschwindigkeit &uuml;ber den ganzen Monat hinweg sind dann wahnsinnige 59KBit/s. Unser tolles Gigabyte hat uns also im Durchschnitt gerade mal 3KBit/s besser dastehen lassen.</p>
<p>Nat&uuml;rlich w&auml;ren 59KBit/s nicht halb so Werbewirksam wie diese sagenhaften 42MBit/s</p>
<p></p>
