+++
title = "Wahlvieh - die Bürgermeister-Edition"
date = "2015-06-08T12:06:00"
author = "Dr. Azrael Tod"
tags = ["Dresden", "Politik", "Pseudoargumente", "Rant", "Säue durchs Dorf treiben"]
issoid = "blog/1619"
aliases = "blog/1619"
+++

<p>Dresden hat mal wieder gew&auml;hlt. Dieses mal ging es um den Oberb&uuml;rgermeister. Hier meine Ansichten &uuml;ber die Kandidaten, das vorl&auml;ufige Ergebnis und die Resultate.</p>
<p><b><i>TL/DR:</i></b><br/></p><ul><li>15% Nazis (<a href="/2014/12/18/Pegida">ja, es sind Nazis</a>) sind definitiv 15% zu viel. Die Nazis haben ihre Botschaft vermittelt und ihre Ziele erreicht. Der Rufschaden den die Stadt (zu recht) durch die Duldung dieser Spinner und die Behandlung von "Ich hab' ja nichts gegen Ausl&auml;nder, aber..." als legitime Meinung, davon getragen hat, wird wohl noch kaum zu ermessen sein.</li><li>der Kandidat der CDU war vorhersehbar so irrelevant wie er farblos war</li><li>ein zweiter Wahlgang wird folgen, bei dem die Entscheidung zwischen Hilbert (FDP) und Stange (Linke/Gr&uuml;ne/SPD/Piraten). Recht knapp werden k&ouml;nnte</li><li>Ich finde man sollte Stange w&auml;hlen, schon weil Hilbert untragbar(er) ist</li><li>Die Wahlbeteiligung war leicht besser als erwartet (51%), aber das wird sich im zweiten Wahlgang definitiv &auml;ndern. Wenn man also gerne mehr Einfluss mit seiner Stimme haben will, w&auml;re dies der ideale Zeitpunkt.</li></ul>
<p></p><h3>Wer stand zur Wahl?</h3><br/><ul><li>eine fast ertr&auml;gliche Kandidatin von Linke/Gr&uuml;ne/SPD/Piraten, die sogar versehentlich teilweise Inhalte plakatierte (zum Gl&uuml;ck nur bei einem sehr geringen Bruchteil der Plakate), war bis jetzt ziemlich unauff&auml;llig als s&auml;chsische Ministerin f&uuml;r Wissenschaft und Kunst</li><li>ein Neocon-Lieberallalla FDP-Typ, der gew&auml;hlt werden will, eben weil er schon so lange im Amt ist (Baub&uuml;rgermeister), sich gut auskennt und gute Verbindungen hat (verspricht genau das zu erreichen was er schon vor 10 Jahren erreichen wollte und bisher nicht hat)</li><li>ein farbloser, ebenfalls inhaltsfreier CDU-Typ der eigentlich s&auml;chsischer Innenminister ist und dort auch nichts schafft</li><li>eine Transe von "Die Partei", der/die im Gegensatz zum Rest seiner/ihrer Partei nicht mal lustig ist</li><li>eine Nazispinnerin von PEGIDA</li><li>einen Nazispinner von der AfD</li></ul>
<p></p><h3>Wie l&auml;uft die Wahl ab?</h3><br/>Ein Punkt den ich in unseren Medien f&uuml;r v&ouml;llig untererkl&auml;rt halte, ist der Ablauf der Wahl. Die Landeszentrale f&uuml;r Politische Bildung fasst es <a href="http://www.infoseiten.slpb.de/politik/sachsen/sachsen-allgemein/kommunalwahlen/buergermeisterwahlen/" target="_blank"> folgenderma&szlig;en zusammen</a>:<br/><blockquote>Die s&auml;chsischen B&uuml;rgermeister werden direkt gew&auml;hlt. Die Amtszeit eines B&uuml;rgermeisters betr&auml;gt sieben Jahre. Es kann bei B&uuml;rgermeisterwahlen zwei Wahlg&auml;ng[e] geben. Im ersten Wahlgang entscheidet die absolute Mehrheit der abgegebenen g&uuml;ltigen Stimmen. Erreicht kein Kandidat diese Mehrheit, wird eine Neuwahl notwendig. Hierbei k&ouml;nnen alle Kandidaten, die beim ersten Wahlgang bereits dabei waren, wieder antreten, neue Kandidaten d&uuml;rfen allerdings nicht mehr hinzukommen. In diesem Punkt wurde das Wahlverfahren bei den B&uuml;rgermeisterwahlen im Jahr 2013 ge&auml;ndert. Bei der Neuwahl entscheidet die einfache Mehrheit der abgegebenen g&uuml;ltigen Stimmen (relative Mehrheit). Kommt es zu einer Stimmengleichheit entscheidet das Los.</blockquote>
<p></p><h3>Stumpfe Fakten: Ergebnisse</h3>
<p><img alt="Wahlergebnisse, erster Wahlgang" src="/static/images/blog/dd_stimmanteil_bm_2015.png"/></p>
<p></p><blockquote><table class="ui-table-content"><thead><tr><th scope="col" style="width: 25%;">Wahlvorschlag</th><th scope="col" style="width: 25%;">Kandidat(in)</th><th scope="col" style="width: 25%; width:9%; ">Stimmen</th><th scope="col" style="width: 25%; width:9%; ">Stimmenanteil in %</th></tr></thead><tbody><tr><td style="text-align:left"><span class="ui-icon-color" style="background-color:#000000;"></span> CDU </td><td style="text-align:left"> Ulbig, Markus </td><td style="text-align:right"> 33.931 </td><td style="text-align:right"> 15,4 </td></tr><tr><td style="text-align:left"><span class="ui-icon-color" style="background-color:#2ab8e8;"></span> AfD </td><td style="text-align:left"> Vogel, Stefan </td><td style="text-align:right"> 10.543 </td><td style="text-align:right"> 4,8 </td></tr><tr><td style="text-align:left"><span class="ui-icon-color" style="background-color:#805c5c;"></span> Festerling </td><td style="text-align:left"> Festerling, Tatjana </td><td style="text-align:right"> 21.306 </td><td style="text-align:right"> 9,6 </td></tr><tr><td style="text-align:left"><span class="ui-icon-color" style="background-color:#eb0e0e;"></span> Gemeinsam f&uuml;r Dresden </td><td style="text-align:left"> Dr. Stange, Eva-Maria </td><td style="text-align:right"> 79.579 </td><td style="text-align:right"> 36,0 </td></tr><tr><td style="text-align:left"><span class="ui-icon-color" style="background-color:#9136ad;"></span> Die PARTEI </td><td style="text-align:left"> Stosch, Lars </td><td style="text-align:right"> 5.444 </td><td style="text-align:right"> 2,5 </td></tr><tr><td style="text-align:left"><span class="ui-icon-color" style="background-color:#ebac23;"></span> Unabh&auml;ngige B&uuml;rger f&uuml;r Dresden e. V. </td><td style="text-align:left"> Hilbert, Dirk </td><td style="text-align:right"> 70.153 </td><td style="text-align:right"> 31,7 </td></tr><tr><td style="text-align:left"><span class="ui-icon-color" style="background-color:#cccccc;"></span> G&uuml;ltige </td><td style="text-align:left"></td><td style="text-align:right"> 220.956 </td><td style="text-align:right"> 99,1 </td></tr><tr><td style="text-align:left"><span class="ui-icon-color" style="background-color:#dddddd;"></span> Ung&uuml;ltige </td><td style="text-align:left"></td><td style="text-align:right"> 1.985 </td><td style="text-align:right"> 0,9 </td></tr></tbody></table> </blockquote>
<p></p><h3>Meine Interpretation</h3>
<p></p><ul><li>Dresden hat zu fast 15% die Nazis gew&auml;hlt</li><li>wir d&uuml;rfen n&auml;chsten Monat noch mal</li><li>der blasse CDU-Typ gibt auf und empfiehlt seinen W&auml;hlern doch lieber den FDP-Typen zu w&auml;hlen</li><li>FDP-Typ liegt knapp (reichlich 4%) hinter der rot-rot-gr&uuml;nen Kandidatin</li><li>CDU hat fast nur den gleichen Anteil erreicht wie die richtigen Nazis</li></ul>
<p>Die Nazis haben belegt dass Dresden halt weiterhin eine rechte Hochburg ist und haben damit ihr Ziel erreicht.</p>
<p>Der/Die/Das Kandidat(in) von "Die Partei" war dabei 4 teh lulz. Keine Ahnung ob es sein Ziel erreicht hat. Ich habe jedenfalls leider nicht gelacht.</p>
<p>Endresultat ist wie zu erwarten eine Entscheidung zwischen Eva-Maria Stange und Dirk Hilbert. Die Chancen liegen da imho ziemlich gleich verteilt, die Wahlfloskeln haben &auml;hnlich wenig Tiefgang (z.B. Hilbert: &bdquo;Dresden geht es gut, wenn es Dresdens Wirtschaft gut geht! Vollbesch&auml;ftigung bis 2022 hei&szlig;t mein Ziel.&ldquo; vs. &bdquo;Wissen schafft Wirtschaft&ldquo;/&bdquo;Bildung schafft Zukunft&ldquo;), zeigen aber bereits wohin es geht (gut, das h&auml;tte man auch gesehen wenn man sich Partei-Zugeh&ouml;rigkeit und Lebenslauf ansieht).</p>
<p><a href="http://www.menschen-in-dresden.de/2015/ob-wahl-in-dresden-hilbert-will-gemeinsamer-kandidat-der-konservativen-im-2-wahlgang-werden/" target="_blank">Der Versuch des CDU-Kandidaten die eigenen Stimmen auf Hilbert zu lenken</a>, k&ouml;nnte durchaus ausreichen um die Mehrheit zu erreichen, pers&ouml;nlich rechne ich aber auch damit dass CDU-W&auml;hler zu gro&szlig;en Teilen ihr Kreuz nur aus Gewohnheit machen und bei einem Wahlzettel auf dem weder CDU/SPD/Linke/Gr&uuml;ne/FDP steht, einfach nicht-w&auml;hlen oder wahllos Kreuzchen machen.</p>
<p>Dass ich pers&ouml;nlich eher f&uuml;r Bildungs-/Forschungsf&ouml;rderung statt f&uuml;r &ouml;min&ouml;ses "Wir brauchen mehr Wirtschaft" bin, wird wohl inzwischen bekannt sein.<br/>Auch dass ich sonst die Positionen von Stange weit verst&auml;ndlicher und besser halte als jenes seltsame Gehabe von Hilbert al&aacute; "Ich bin der gro&szlig;e Zampano, mit massig Erfahrung bei Wirtschaft und ich werde hier f&uuml;r Vollbesch&auml;ftigung sorgen.", wird inzwischen aufgefallen sein. Doch f&uuml;r die interessierten mal noch im Detail...</p>
<p></p><h3>Forderungen</h3>
<p>Ich habe mal versucht aus den jeweiligen Seiten eine m&ouml;glichst kurze zusammenfassung der Standpunkte zu extrahieren. Meine entsprechenden Meinungen dazu, habe ich als Title-Attribut hinterlegt (mit Mauszeiger &uuml;ber die unterstrichenen Textzeilen fahren um das zu lesen).</p>
<p>Zitat der Seite von/&uuml;ber Stange:</p><blockquote><b>Meine Forderungen:</b>
<p>1. F&uuml;r ein integratives und sozial gerechtes Bildungssystem von der Kita <u title="irrelevant, da keine Stadtpolitik -.-">bis zur Hochschule.</u><br/>Im Bereich der Bildungspolitik lautet mein Credo seit vielen Jahren: <u title="belanglose Floskel">Kein Kind zur&uuml;cklassen</u>. Folgende Mittel sehe ich daf&uuml;r als zielf&uuml;hrend an:</p><ul><li>gut ausgebaute Kindertagesst&auml;tten, die schrittweise ab dem dritten Lebensjahr kostenfrei sind;</li><li>eine Schule, <u title="erneut: Landespolitik, nicht Stadt">die Kinder nicht permanent aussortiert, sondern individuell f&ouml;rdert und sie l&auml;nger gemeinsam lernen l&auml;sst</u>;</li><li>qualitativ <u title="klingt gut, aber wie?">gute und ausreichende Ausbildungspl&auml;tze</u>;</li><li><u title="Landespolitik.. wieder">Studiengeb&uuml;hrenfreiheit und einen verbesserten Ausbildungsbeitrag (BAf&ouml;G) auch f&uuml;r Sch&uuml;ler ab Klasse 11 und &uuml;ber das 30. Lebensjahr hinaus</u>;</li><li>einen <u title="weil es so sch&ouml;n war... Landespolitik">leichteren Zugang zum Studium auch f&uuml;r Facharbeiter mit guter beruflicher Qualifikation</u>;</li><li><u title="erste GUTE und wichtige Forderung">freien Eintritt in Museen f&uuml;r Kinder und Jugendliche bis zum 16. Lebensjahr</u>.</li></ul>
<p>2. F&uuml;r ein weltoffenes und demokratisches Sachsen<br/>Au&szlig;erdem <u title="Politikerhauptbesch&auml;ftigung: Reden">werbe ich mit Nachdruck daf&uuml;r</u>, dass wir auch in Zukunft in einem freiheitlichen Land leben, <u title="klare Stellungnahme gegen Nazi-Spinner. Fehlt bei Hilbert komplett">in dem Menschen nicht aufgrund ihrer ethnischen und nationalen Herkunft diskriminiert und gebrandmarkt werden</u>. Jeder Einzelne kann dazu beitragen, dass Sachsen noch weltoffener wird. Zivilgesellschaftliches Handeln statt Fremdenfeindlichkeit m&uuml;ssen zu den Leitlinien unseres allt&auml;glichen Handelns werden.</p></blockquote>
<p>f&uuml;r Hilbert muss man schon deutlich l&auml;nger suchen wenn man etwas &auml;hnliches zusammenstoppeln will:<br/></p><ul><li><u title="Du warst lange im Amt, stimmt. Warum hast du nichts erreicht?">Ich wei&szlig;, wie es geht.</u> Denn ich kenne das Rathaus in- und auswendig.</li><li>W&auml;hrend meiner Zeit als Oberb&uuml;rgermeister <u title="Was soll dieser Bl&ouml;dsinn &uuml;berhaupt bedeuten? Alberner Schei&szlig;!">werden die B&uuml;rger immer eine Stimme haben!</u></li><li>Ich werde deshalb <u title="Lieber Reden als Dinge erreichen, denn Wiederwahl ist wichtiger als Ziele!">Sprechstunden des Oberb&uuml;rgermeisters im Rathaus und in den Orts&auml;mtern und Ortschaften einrichten</u>. Parallel werde ich das Internet f&uuml;r den Dialog nutzen. Wer mir schreibt, bekommt <u title="von dir? wirklich?">von mir eine Antwort</u>: f&uuml;r B&uuml;rgeranfragen und Anliegen <u title="Ach doch nur der Sekret&auml;r... wusst' ich's doch!">wird direkt mein B&uuml;ro zust&auml;ndig sein</u>.</li><li><u title="du hast also kein Konzept? wie lange warst du jetzt im Amt?">ein Konzept f&uuml;r ein Dresden der Zukunft zu schaffen</u>, das attraktiv ist</li><li>st&auml;dtische Zusch&uuml;sse <u title="&Uuml;bersetzt: wer genug Geld f&uuml;r ein Haus hat wird gef&ouml;rdert, wer kein Geld hat, bekommt auch keins">f&uuml;r Familien zum Erwerb von Wohneigentum.</u></li><li>Mein Ziel ist es, dass <u title="dazu weiter unten mehr und ausf&uuml;hrlicher">Dresden 2025 Kulturhauptstadt Europas wird</u>. Als Oberb&uuml;rgermeister werde ich die Bewerbung mit allen Kr&auml;ften unterst&uuml;tzen.</li><br/><li>Dresden braucht attraktiven und weiterhin bezahlbaren Wohnraum. <u title="Mehr Geld f&uuml;r Bauunternehmer? Kann ich!">Daher werde ich daf&uuml;r sorgen, dass wir k&uuml;nftig st&auml;rker Fl&auml;chen f&uuml;r neue Wohnungen ausweisen.</u> F&uuml;r Investoren werde ich parallel in der Verwaltung <u title="weniger H&uuml;rden f&uuml;r h&auml;ssliche oder sozial ung&uuml;nstige Baupl&auml;ne? Kann ich!">einen Service schaffen, der die Genehmigungsverfahren b&uuml;ndelt. Ziel ist es hier, Entscheidungen zu beschleunigen.</u></li><li>Als Oberb&uuml;rgermeister <u title="merke: nicht Individualsport wie Fahrradverkehr oder Schulsport">werde ich den Breitensport weiter f&ouml;rdern</u>. Im Spitzensport <u title="nur das was Geld bringt, bekommt auch welches">konzentrieren wir uns auf unsere St&auml;rken und bauen sie aus</u> &ndash; <u title="da muss man auch mal Gelder k&uuml;rzen">hier d&uuml;rfen wir uns nicht verzetteln</u>.</li><li>&bdquo;<u title="ARBEIT MACHT FREI!">Dresden geht es gut, wenn es Dresdens Wirtschaft gut geht</u>! <u title="alleine das sollte disqualifizierend genug sein...">Vollbesch&auml;ftigung bis 2022 hei&szlig;t mein Ziel.</u>&ldquo;</li><br/><li>Meine Formel lautet:<br/><a href="http://de.wikipedia.org/wiki/Trickle-down-Theorie" target="_blank" title="Trickle-Down? Funktioniert halt nicht, kann man aber weiter fordern.">Wachsende Wirtschaft = wachsende Stadt = Wohlstand f&uuml;r Dresden.</a></li><li><u title="mehr Geld f&uuml;r Werbung, statt f&uuml;r &Auml;nderung!">Marketing ist f&uuml;r mich eine Investition in unsere Zukunft.</u> Deshalb bin ich davon &uuml;berzeugt, dass wir hier <u title="Woher? Kredite aufnehmen oder wichtigeres k&uuml;rzen?">deutlich mehr Geld als bisher in die Hand nehmen m&uuml;ssen.</u></li><li>&bdquo;<u title="Gro&szlig;stadtfinanzen funktionieren genau so wie die Geldb&ouml;rse deiner Oma! Hint: Nein">Wir k&ouml;nnen nur das ausgeben, was wir erwirtschaften.</u>&ldquo; Deshalb wird es mit mir als Oberb&uuml;rgermeister <u title="also werden wichtige Dienste gestrichen, f&uuml;r mehr Werbung">keine Neuverschuldung geben.</u></li><li>Als Oberb&uuml;rgermeister werde ich <u title="&Uuml;bersetzt: lieber private Firmen f&uuml;r Nachhilfe statt Lernmaterialien in den Schulen!">das au&szlig;erschulische Angebot noch weiter ausbauen</u> &ndash; sowohl in der Breiten- als auch in der Begabtenf&ouml;rderung.</li></ul>
<p></p><h3>"Kulturhauptstadt Europas"</h3><br/>Eine der Forderungen von Hilbert die mir am deutlichsten ins Auge sticht (au&szlig;er denen die zu "mehr Geld f&uuml;r meine Freunde in der Privatwirtschaft" verk&uuml;rzt werden k&ouml;nnen), ist die Forderung dass Dresden 2025 Kulturhauptstadt werden soll.

<p>Was f&uuml;r ein Problem ich damit habe? "Kulturhauptstadt Europas" ist ein Titel der geschaffen wurde um Kultur in St&auml;dten zu verbessern. Es ist keine Auszeichnung f&uuml;r die tollste Stadt mit viel Kultur die man finden kann.<br/>Darum finden sich in den Preistr&auml;gern der letzten Jahre haupts&auml;chlich so St&auml;dte wie Liverpool (2008), Linz (2009), Essen (2010), Turku (2011), Guimar&atilde;es (2012), Marseille (2013), Ume&aring; (2014) und Mons (Bergen, 2015).</p>
<p>Das liegt nicht daran dass Portugal f&uuml;r 2012 keine kulturell interessantere Stadt als Guimar&atilde;es (50K Einwohner) gefunden h&auml;tte oder dass die ausgemachten Industriest&auml;dte Marseille, Essen oder Liverpool f&uuml;r ihre L&auml;nder die kulturell wichtigsten Gegenden w&auml;ren.</p>
<p>Hilbert fordert Dresden zur Kulturhauptstadt zu machen, weil er nicht verstanden hat was der Titel tun soll.</p>
<p>Ja, Dresden ist eine tolle Stadt. Dresden strotzt nur so vor Kultur. Ich w&uuml;rde sogar so weit gehen zu behaupten dass es in Deutschland nur ganz wenige St&auml;dte gibt die auch nur ann&auml;hernd auf diesem Gebiet mit Dresden mithalten k&ouml;nnen. (N&uuml;rnberg, Rostock, vlt. sogar Potsdam oder Weimar)</p>
<p>Trotzdem, oder eher gerade deshalb, ist Dresden eben nicht die Stadt die ich f&uuml;r sowas vorschlagen w&uuml;rde und ich bin mir ziemlich sicher dass <a href="http://www.kultur2010.de/basics.html">die "deutsche Expertenjury"</a>, welche dar&uuml;ber entscheiden soll, ebenfalls wei&szlig; was mit dem Preis erreicht werden soll und ein weniger offensichtliche Ziel w&auml;hlen wird.</p>
<p></p>
