+++
title = "Umweltbewusstseinssimulation"
date = "2008-06-23T01:06:00"
author = "profmakx"
issoid = "blog/421"
aliases = "blog/421"
+++

<p>Ist euch eigentlich mal aufgefallen, dass alle Politiker von einem gesteigerten Umweltbewusstsein sprechen? Egal ob es ums autofahren, heizen oder Gl&uuml;hbirnen geht, immer ist die Rede davon, dass man angesichts steigender Preise ein gr&ouml;sseres Umweltbewusstsein entdecken k&ouml;nne. Zudem verkaufen uns die Werten Damen und Herren Politiker ihre Energieverbrauchseind&auml;mmungsgesetze nat&uuml;rlich als Klimapaket.</p>
<p>Ich kann dem ja nicht so recht folgen. Ich denke nicht, dass sich irgendwer um die Umwelt schert. Der eigene Geldbeutel wird halt leerer, wenn man volltankt. Bei meinem Tank sind das 8 Euro. Ich bin kein Topverdiener, wirklich st&ouml;ren tun mich diese 8 Euro auch nicht. Autofahren war f&uuml;r mich schon immer ein Luxus den ich mir einfach geg&ouml;nnt habe.</p>
<p>Wenn morgen ein Treibstoff auf den Markt kommen w&uuml;rde, der ein vielfaches billiger als Benzin ist daf&uuml;r aber die Umwelt doppelt so stark belastet w&uuml;rde jeder, aber auch wirklich jeder diesen Treibstoff benutzen.</p>
<p>Was dazu mich sehr wundert ist, dass zwar jedermann (und frau) &uuml;ber &euro;1.50 oder &euro;1.60 f&uuml;r einen Liter Superbenzin heult, aber keinem aufzufallen scheint, dass sich der Preis f&uuml;r 500g Spaghetti (das ist ein Studentengrundnahrungsmittel) nahezu vervierfacht hat. &Auml;hnlich sieht es bei Reis und anderen Nahrungsmitteln aus. Wenn man beobachtet wie manche Menschen einkaufen wird einem da auch zus&auml;tzlich noch schlecht. Man kann Tomaten aus Chile (das ist nur einmal halb um die Welt) kaufen, die kosten &euro;0.99. Man kann aber auch Tomaten aus Belgien (das ist bei uns keine 10 km weit weg) kaufen, die kosten &euro;1.99. &Auml;hnlich verh&auml;lt es sich bei fast allen Lebensmitteln: Kartoffeln, Salate, you name it. Faszinierend dann das Einkaufsverhalten zu beobachten. Nat&uuml;rlich wird zuerst auf "Bio" geschielt (was ein Gesch&auml;ft! Aber etwas f&uuml;r einen anderen Post) aber dann wird eben doch das billigste genommen. Bei Lebensmitteln ist das wirklich widerlich!</p>
<p>Was soll die Politik tun? Die einzige Metrik, die die derzeitige globalisierte Welt versteht ist die Kostenmetrik. Die Politik muss daf&uuml;r sorgen, dass es einfach unbezahlbar teuer ist, die Umwelt zu verschmutzen, sollte dabei aber nicht aus dem Ged&auml;chtnis verlieren, dass wir uns alle an einen gewissen Lebensstandard gew&ouml;hnt haben, von dem wir nicht bereit sind viel abzugeben (und warum sollten wir das auch?). Subventionen wir zum Beispiel Steuersenkungen auf Energie (ganz besonders auf Benzin) sind Unsinn und ich hoffe dass da nicht irgendeine Bundestagswahl irgendwelche Wahlgeschenke baut.</p>
<p>Ich kann aufh&ouml;ren Auto zu fahren um mir was zu essen zu kaufen. Aber ich h&ouml;re bestimmt nicht auf zu essen um Auto zu fahren.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_206" onclick="set_comment_reference(206)" title="auf diesen Kommentar antworten">#206</a>:
    23.Jun.2008 01:06
    von
    
      
        <a href="http://www.drni.de/blog/" target="_blank">
          DrNI
        </a>
</p>
<p>War das nicht das Prinzip der sog. &Ouml;kosteuer? Wir machen das b&ouml;se teuer! Hat aber nicht funktioniert: Porsche bringt in Deutschland einen Gel&auml;ndewagen auf die deutschen Stra&szlig;en, der 60 Liter schluckt. Da h&auml;tte ich ja noch nichts dagegen, aber das Ding pustet auch f&uuml;r 60 Liter hinten raus - und das in die Luft, die allen geh&ouml;rt.</p>

<p class="infos">
<a href="#comment_207" onclick="set_comment_reference(207)" title="auf diesen Kommentar antworten">#207</a>:
    23.Jun.2008 01:06
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Nein, die Idee der &Ouml;kosteuer ist die Rente sicher zu machen. Um ein Umdenken herbeizuf&uuml;hren war diese Steuer, wie du so sch&ouml;n bemerktest nicht hoch genug.</p>

<p class="infos">
<a href="#comment_208" onclick="set_comment_reference(208)" title="auf diesen Kommentar antworten">#208</a>:
    23.Jun.2008 03:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Das Problem ist auch dass alles an Steuern in DE nur halbherzig durchgezogen wird... Wie war nochmal die Begr&uuml;ndung der Gesundheitsministerin warum die Tabaksteuer nur schrittweise erh&ouml;ht wurde? "Wir wollen versuchen ein Ausweichverhalten der Raucher zu vermeiden."<br/>
Der Sinn dieser belehrend gedachten Steuern ist also nicht wirklich eine &Auml;nderung im Verhalten herbei zu f&uuml;hren (dann w&uuml;rde man sie schlagartig erheben) sondern das Ziel ist eine Erh&ouml;hung der Einnahmen.</p>
</div>