+++
title = "Aussprechbare Koordinaten"
date = "2015-12-04T11:12:00"
author = "Dr. Azrael Tod"
tags = ["Maueralt", "Nerdig", "Technik"]
issoid = "blog/1633"
aliases = "blog/1633"
+++

<p>Die Idee ein Koordinatensystem &uuml;ber die ganze Erdoberfl&auml;che zu legen dessen Koordinaten man aussprechen kann ist nicht neu.</p>
<p>Bereits 1826 ver&ouml;ffentlichte z.B. ein Architekt namens Stedman Whitwell in der Zeitschrift "New Harmony, Ind., Gazette" ein Konzept, <a href="http://www.futilitycloset.com/2011/05/03/hearing-places/" target="_blank">wie man aus Geo-Koordinaten f&uuml;r jede Adresse einen aussprechbaren Ortsnamen erzeugt</a><!--more-->.<style type="text/css">.tg  {border-collapse:collapse;border-spacing:0;margin-left: auto; margin-right: auto; min-width: 370px; text-align: center; border: 1px solid grey;} .tg td{font-family:Arial, sans-serif;font-size:14px;padding:10px 5px;border-style:solid;border-width:1px;overflow:hidden;word-break:normal;} .tg th{font-family:Arial, sans-serif;font-size:14px;font-weight:normal;padding:10px 5px;border-style:solid;border-width:1px;overflow:hidden;word-break:normal;} .tg .tg-yw4l{vertical-align:top}  table.tg td { border: 1px solid grey;}</style></p><table class="tg"><tr><th class="tg-yw4l"></th><th class="tg-yw4l">1</th><th class="tg-yw4l">2</th><th class="tg-yw4l">3</th><th class="tg-yw4l">4</th><th class="tg-yw4l">5</th><th class="tg-yw4l">6</th><th class="tg-yw4l">7</th><th class="tg-yw4l">8</th><th class="tg-yw4l">9</th><th class="tg-yw4l">0</th></tr><tr><td class="tg-yw4l">Latitude</td><td class="tg-yw4l">a</td><td class="tg-yw4l">e</td><td class="tg-yw4l">i</td><td class="tg-yw4l">o</td><td class="tg-yw4l">u</td><td class="tg-yw4l">y</td><td class="tg-yw4l">ee</td><td class="tg-yw4l">ei</td><td class="tg-yw4l">ie</td><td class="tg-yw4l">ou</td></tr><tr><td class="tg-yw4l">Longitude</td><td class="tg-yw4l">b</td><td class="tg-yw4l">d</td><td class="tg-yw4l">f</td><td class="tg-yw4l">k</td><td class="tg-yw4l">l</td><td class="tg-yw4l">m</td><td class="tg-yw4l">n</td><td class="tg-yw4l">p</td><td class="tg-yw4l">r</td><td class="tg-yw4l">t</td></tr></table><blockquote>Insert an S to indicate south latitude and a V for west longitude; omit them for north and east. Thus New Harmony (38&deg;11&rsquo;N, 87&deg;55&rsquo;W) would be rechristened Ipba Veinul; New York would be Otke Notive, Washington D.C. Feili Neivul, and Pittsburgh Otfu Veitoup.</blockquote>
<p>Jetzt hat dieses System einige Schw&auml;chen.<br/></p><ol><li>Man muss sich unbedingt jeden Buchstaben merken, klar sind die darauf ausgelegt den Klang m&ouml;glichst stark zu ver&auml;ndern, aber der Unterschied zwischen "Ipba Veinul" und "Eepba Veinul" (was jetzt im englischen nicht sooo unterschiedlich klingt), ist der Unterschied zwischen den Koordinaten "38&deg;11&rsquo;N, 87&deg;55&rsquo;W" und 78&deg;11&rsquo;N, 87&deg;55&rsquo;W, also ca. 4500km Luftlinie.</li><li>Das Konzept ist auf englische Aussprache ausgelegt. Das kann man im deutschen (fast) unver&auml;ndert &uuml;bernehmen, aber in anderen Sprachen funktioniert es im Zweifelsfall gar nicht. (und wenn man zwischen den Sprachen Koordinaten austauscht kommt es zu Missverst&auml;ndnissen)</li><li>Die Koordinaten sind entweder sehr grob oder werden sehr lange, schwer merkbare W&ouml;rter</li></ol>
<p>Wenn es nur etwas leichter merkbare g&auml;be um komplexere Informationsschnipsel zu &uuml;bermitteln als einfache Buchstaben! Warte: gibt es! W&ouml;rter!</p>
<p><a href="https://xkcd.com/936/">Relevanter XKCD-Eintrag:<br/><img alt="Password Strength" src="https://imgs.xkcd.com/comics/password_strength.png" title="To anyone who understands information theory and security and is in an infuriating argument with someone who does not (possibly involving mixed case), I sincerely apologize."/></a></p>
<p>Die Funker wissen es schon lange, sinnvoll ausgew&auml;hlte W&ouml;rter sind akustisch besser erkennbar. Die Mathematik sagt uns dass wir mit 3-4 W&ouml;rtern genug Kombinationen f&uuml;r ziemlich viele Buchstaben/Zahlen &uuml;bermitteln und wenn man 5-10 solche Kombinationen zur Auswahl hat ist es praktisch &uuml;berhaupt kein Problem sich eine "passende" (also lustig, irgendwie sinnvoll, reimend, wasauchimmer...) zu suchen die man sich leicht merken kann.</p>
<p>Soweit die Theorie und das wor&uuml;ber sicher nicht nur ich bereits mehrmals nachgedacht hatte.</p>
<p>Jetzt hat das jemand auch schon praktisch umgesetzt! Sch&ouml;n mit Telefon-App, Lib zum Einbinden in eigene Software-Proejkte, &Uuml;bersetzungen in viele Sprachen und Webanwendung.</p>
<p></p><h3>what3words</h3>
<p><a href="https://what3words.com/">What3Words.com</a> ist ein solches Projekt wie ich es beschrieben habe. Die Erdoberfl&auml;che aufgeteilt in 3x3m-Quadrate, jeweils 3 Worte in der Zielsprache zugewiesen um jeden Punkt als Koordinaten ausdr&uuml;cken zu k&ouml;nnen. (Dabei werden jeweils 25 bis 40K W&ouml;rter, &auml;hnlich klingende/geschriebene entfernt und so sortiert dass l&auml;ngere W&ouml;rter f&uuml;r weniger bewohnte Gegenden verwendet werden).</p>
<p>Weil das Raster relativ klein ist (wann muss man schon mal etwas mit mehr als 3m Genauigkeit angeben?) kann man sich fast immer aus mehreren Bezeichnern etwas aussuchen. Wenn man sich mit jemandem treffen will, k&ouml;nnte man also z.B. folgendes sagen:</p>
<p></p><ul><li><a href="https://map.what3words.com/gewinne+wiege+begehbar">"Gewinne Wiege begehbar"</a> - Siegess&auml;ule</li><li><a href="https://map.what3words.com/raus+einem+feiern">"raus einem feiern"</a> - die Ecke Louisenstra&szlig;e/Alaunstra&szlig;e in der Dresdner Neustadt</li><li><a href="https://map.what3words.com/irgendwo+braun+weltbild">"Irgendwo braun Weltbild"</a> - die Mitte des Zwingers in Dresden</li><li><a href="https://map.what3words.com/sauber+sonst+strick">"Sauber, sonst Strick!"</a> - Keine Drohung um mich zum Aufr&auml;umen zu bringen, sondern ca. mein &uuml;blicher Arbeitsplatz (Nein, ich arbeite nicht f&uuml;r eine Reinigungsfirma)</li></ul>
<p>(und sicher g&auml;be es da noch weit bessere Beispiele, ich habe nur jeweils markante Punkte gew&auml;hlt und aus jeweils einem halben Dutzend Rasterpunkten das imho "passendste" ausgew&auml;hlt)</p>
<p>Und Fehlerkorrektur? Die Worte sind so verteilt dass man bei "leichten" Fehlern m&ouml;glichst weit entfernt vom Ausgangspunkt landet. Wenn ich mich also mit jemandem im Zwinger treffen will und derjenige versehentlich <a href="https://map.what3words.com/irgendwo+braunes+weltbild">"irgendwo braun<b>ES</b> Weltbild"</a> sucht, so wird derjenige das hoffentlich bemerken bevor er sich einen Flug nach Sydney bucht. (Das klappt nicht immer ganz so gut, "<a href="https://map.what3words.com/Zauber+sonst+Strick">Zauber sonst Strick</a>" liegt immerhin noch in Deutschland, wenn auch ein gutes St&uuml;ck n&ouml;rdlich von Hamburg)</p>
<p>Aber Sprache? Wenn ich Koordinaten in der falschen Sprache eingebe, so funktionieren die trotzdem. (Ob jetzt nat&uuml;rlich jemand der nur Russisch spricht, Koordinaten in Spanisch korrekt eingeben wird, ist eine andere Frage)</p>
