+++
title = "Zensur"
date = "2008-06-14T11:06:00"
author = "Dr. Azrael Tod"
issoid = "blog/413"
aliases = "blog/413"
+++

<p>Die Springer AG f&auml;ngt an <a href="http://www.bildblog.de/3021/die-aerzte-im-axel-springer-remix" target="_blank">Lieder zu zensieren</a> in denen die BLIND-Zeitung (oder wie auch immer der Name des&nbsp; Schundblattes nochmal lautete) kritisiert wird. F&uuml;r mich stellt sich da nat&uuml;rlich die Frage was die K&uuml;nstler davon halten.</p>
<p>Ich finde die Zensur durch den Springer-Verlag schon mehr als kritisch. Wenn jemand anf&auml;ngt Lieder von K&uuml;nstlern zu ver&auml;ndern die Kritik an eigenen Produkten &uuml;ben ist&nbsp; dies imho schon genauso schlimm wie zu DDR-Zeiten als die Politik dar&uuml;ber bestimmt hat welcher K&uuml;nstler was ver&ouml;ffentlichen darf.</p>
<p>Leider werden es viele der H&ouml;hrer dort garnicht mitbekommen und leider gibt es immer noch viele Leute die der Meinung sind sich ihre Meinung bilden zu LASSEN w&auml;re einfacher und besser als mal selber zu denken.</p>
<p>(via RobVinc / <a href="http://www.bildblog.de/3021/die-aerzte-im-axel-springer-remix" target="_blank">BildBlog</a>)</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_175" onclick="set_comment_reference(175)" title="auf diesen Kommentar antworten">#175</a>:
    16.Jun.2008 11:06
    von
    
      
        <a href="http://www.drni.de/blog/" target="_blank">
          DrNI
        </a>
</p>
<p>Bei einem "Remix" (was auch immer das genau ist) handelt es sich um eine Bearbeitung, wird dieser gesendet um eine Ver&ouml;ffentlichung einer Bearbeitung. So meine Ansicht. Man k&ouml;nnte auch eine Cover-Version machen und die Strophe weglassen. Der Ver&ouml;ffentlichung einer Bearbeitung muss theoretisch der Urheber zustimmen, insofern er noch nicht 70 Jahre tot ist. Die &Auml;rzte k&ouml;nnten hier also mindestens die Verbreitung der "falschen" Version untersagen lassen.</p>
<p>Nicht ohne Grund boykottiere ich Radio gr&ouml;&szlig;tenteils. Ausnahmen macht SWR1 (gelegentlich) und der lokale "Chaotensender" W&uuml;ste Welle, den ich &ouml;fter im Ohr habe. Da habe ich sogar schon Musik geh&ouml;rt, die ich hinterher gekauft habe. Was mir sonst bei keinem Sender mehr passieren kann.</p>

<p class="infos">
<a href="#comment_176" onclick="set_comment_reference(176)" title="auf diesen Kommentar antworten">#176</a>:
    16.Jun.2008 11:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>ich h&ouml;re auch schon seit Jahren eigentlich kein Radio mehr. Ab und zu noch ein paar nette Podcasts die von einem Sender produziert wurden (SWR1?) und alle paar Tage h&ouml;re ich noch Sunshine Live.<br/>
Ansonsten nervt mich eh schon lange die Werbung alle 5min und ich hab auch sonst keine Zeit st&auml;ndig Musik anzuh&ouml;ren. (CDs kaufe ich aus dem selben Grund eh auch schon seit Jahren nichtmehr, ich lade mir aber auch keine runter wie das viele andere tun)</p>
</div>