+++
title = "RAUBKOPIERER SIND VERBRECHER!?"
date = "2006-05-30T11:05:00"
author = "Dr. Azrael Tod"
issoid = "blog/290"
aliases = "blog/290"
+++

<p>Dies soll kein Aufruf zum Wahllosen kopieren sein. Alles was ich will ist ein paar Argumente zu nennen und evtl. jemanden zum nachdenken zu bringen, ob es denn nicht evtl. doch M&ouml;glichkeiten g&auml;be die Rechte anders zu regeln als einfach jedem alles zu verbieten und alle ein zu sperren<br/><br/></p><ol><li>man kann nicht mehr als 2/3 des Volkes zu Verbrechern erkl&auml;ren<br/>(andernfalls w&auml;re "grobe Dummheit" l&auml;ngst als Straftatbestand zugelassen)</li><li>"Raub" impliziert dass jemandem etwas weggenommen wird. Tatsache ist jedoch, die Rechteinhaber auch nach dem Kopieren weiterhin als Urheber gelten und keinerlei Rechte oder G&uuml;ter verloren haben.</li><li>mindestens 9/10 der kopierten Daten werden mehr aus reiner Neugier oder &auml;hnlichen Gr&uuml;nden kopiert als aus materiellen.<br/>H&auml;tten die kopierenden Personen nicht die M&ouml;glichkeit auf kostenlosem Weg an diese Dinge zu kommen w&uuml;rden sie einfach darauf verzichten.</li><li>Bessonders teuere Software (Autocad/Photoshop/Delphi/usw.) ist f&uuml;r Privatpersonen nur sehr begrenzt sinnvoll und w&uuml;rde normalerweise fast nie von selbigen gekauft werden.<br/>Dadurch, dass diese Software von diesen Personen aber in kopierten Versionen verwendet wird werden Kaufentscheidungen von Firmen positiv f&uuml;r diese Software beeinflusst. (Angestellte kennen sich ja bereits damit aus)</li><li>Die Verk&auml;ufe von Tontr&auml;gern und &auml;hnlichem sind trotz der M&ouml;glichkeiten analoger und sp&auml;ter digitaler Kopien kaum gesunken (Die von der Musikindustrie angeprangerten Milliardenverluste sind reinweg illusorisch, werden auf Grund der Anzahl der Kopierten Dateien berechnet und lassen andere Einfl&uuml;sse wie den erh&ouml;hten Absatz bei der Ersetzung der LP durch die CD v&ouml;llig au&szlig;er Acht)</li><li>Es ist derzeit verboten Kopien von "durch technische Ma&szlig;nahmen wirksam gesch&uuml;tzten" Datentr&auml;gern herzustellen. Wie kann ein Schutz wirksamm sein, wenn man ihn umgehen kann und dennoch eine Kopie herstellen kann? Diese Formulierung ist bestenfalls ein Gummiparagraph, eigentlich eher reiner Schwachsinn.</li><li>F&uuml;r Ger&auml;te und Medien, die das Kopieren von Musik erm&ouml;glichen, m&uuml;ssen pauschale Abgaben abgef&uuml;hrt werden, die bereits im Kaufpreis enthalten sind. Wenn das Kopieren illegal ist, warum verdienen die K&uuml;nstler dann an den Kopien? (oder andersrum)<br/> </li><li>Dank verwirrender Rechtslagen ist es f&uuml;r K&uuml;nstler die bei GEMA und co. eingetragen sind unm&ouml;glich gleichzeitig GEMA-gesch&uuml;tzte Werke und Werke unter einer anderen (z.B. freien) Lizens zu ver&ouml;ffentlichen. Die Vertragslaufzeit mit der GEMA betr&auml;gt dabei 6 Jahre und einmal gesch&uuml;tzte Werke k&ouml;nnen kaum wieder freigegeben werden. (Wie sollen K&uuml;nstler da ohne ernsthaft benachteiligt zu werden auch freiere Werke schaffen?)</li><li>Die Verteilungsgerechtigkeit und Transparenz der GEMA ist weit mehr als Fragw&uuml;rdig.</li><li>Seitens der Verbraucher stellt die GEMA-Vermutung  d.h. die Tatsache, dass bei beliebigen Musikst&uuml;cken die Rechtsprechung von einer GEMA-Registrierung ausgeht, solange nicht der Urheber dem Kunden die Nichtmitgliedschaft best&auml;tigt  eine umstrittene Umkehr der Beweislast dar.<br/>[Enzyklop&auml;die: Gesellschaft f&uuml;r musikalische Auff&uuml;hrungs- und mechanische Vervielf&auml;ltigungsrechte. DB Sonderband: Wikipedia 2005/2006, S. 305885]</li><li>M&ouml;chte ein Betreiber einer Internet-Seite gemapflichtige Musik auf seiner Internetseite anbieten (z.B. beim Betreiben einer Fan-Webseite oder auch bei weiteren nicht kommerziell ausgerichteten Seiten), so ist er verpflichtet, ebenfalls einen hohen GEMA-Beitrag j&auml;hrlich (100 EUR pro 5 Titel) zu leisten. Hierbei wird nicht unterschieden, ob Seiten kommerziell und gewerblich sind, oder wie oft die Musik tats&auml;chlichabgespielt wird. D.h. eine etablierte S&auml;ngerin, die auf Platz 1 der deutschen Charts steht, zahlt genauso viel wie eine kleine Band, die das Ganze nur als Hobby aus&uuml;bt.<br/>[Enzyklop&auml;die: Gesellschaft f&uuml;r musikalische Auff&uuml;hrungs- und mechanische Vervielf&auml;ltigungsrechte. DB Sonderband: Wikipedia 2005/2006, S. 305886]</li></ol>
