+++
title = "XOR(A,V)-Reciever: Samsung HW C700"
date = "2010-11-29T10:11:00"
author = "Dr. Azrael Tod"
tags = ["Gadget", "Hardware", "Technik"]
issoid = "blog/1539"
aliases = "blog/1539"
+++

<p>Letzte Woche (der Artikel liegt schon ne Woche unfertig rum, also vorletzte) habe ich mir einen AV-Reciever von Samsung bestellt, um mal endlich meinen ganzen Hardwarespa&szlig; im Wohnzimmer zusammen verwenden zu k&ouml;nnen und vlt. nebenbei sogar endlich wieder mal ne sinnvolle Anschlussm&ouml;glichkeit f&uuml;r das N64 zu haben das hier rumsteht.</p>
<p>Um es kurz zu machen: Die Kiste ist f&uuml;r mich vollst&auml;ndig nutzlos!</p>
<p></p><h3>Aber fangen wir am Anfang an und nennen erst einmal die Punkte mit denen ich eigentlich noch leben k&ouml;nnte:</h3><br/>Der erste eindruck: Es sieht annehmbar aus, ist aber gr&ouml;&szlig;tenteils ein leeres Geh&auml;use von viel zu hohem Volumen (fast leer und entsprechend leicht) und besteht aus Plastik (Geschmackssache). Da h&auml;tten wir dann auch gleich das erste "WTF?". Entweder ich hab wieder mal das Memo nicht bekommen, oder Samsung nimmt wirklich ganz seltsame Drogen. Es war mir jedenfalls bisher noch nicht klar dass jetzt neuerdings auch Aluminium unter die "teueren" Materialien f&auml;llt, so dass es sich lohnt ein Imitat als Front zu verbauen. Naja, kann ja jeder sein Zeugs so bauen wie er will, der Rest meiner Hardware ist ja auch gr&ouml;&szlig;tenteils Plaste, da f&auml;llt das auch nicht mehr extrem auf.

<p>Aber weiter: Das Display ist gut lesbar und gro&szlig;, kann aber nat&uuml;rlich nicht mit einer guten OSD-Anzeige mithalten. Die Men&uuml;strukturen sind gew&ouml;hnungsbed&uuml;rftig, die Radiobedienung unbrauchbar, die Toneffekte sollte man generell abschalten um brauchbaren Klang zu bekommen (geht nur &uuml;ber die Taste am Ger&auml;t selbst). </p>
<p>Die Fernbedienung hat zwar Zahlentasten und Floureszierende Play/Pause/usw-Kn&ouml;pfe, aber erstere sind nur zum Spa&szlig; mit Zahlen bedruckt (wenn man halt andere Ger&auml;te damit bedienen will), werden aber nirgendwo als Zahlen angesprochen (Nein, auch nicht um zu einem der durchnummerierten Radiosender zu springen...). Ansonsten ist sie wohl das brauchbarste Teil im ganzen Karton.</p>
<p>F&uuml;r Crapple-Fans gibt es eine iPott-Docking-Station dazu, die ich wohl auch verwendet h&auml;tte (um mit dem Geld das ich f&uuml;r sie bei Egay bekomme etwas sinnvolles zu kaufen). Da h&auml;tte man wohl mal lieber sinnvolle Funktionen implementiert oder auch nur IRGENDWAS brauchbar gestaltet.</p>
<p>Der Kundendienst ist ebenfalls unbrauchbar. Auf der Samsung-Seite gibt es ein E-Mail-Formular, in dem man jedoch die genaue Produktbezeichnung aus einer Liste w&auml;hlen muss, in der dann dieses Ger&auml;t nicht vorkommt. Telefonisch gibt es eine teuere 01805-Nummer (zu der ich mir erstmal via <a href="http://www.0180.info/suche.html?s=samsung" target="_blank">Teltarif.de</a> die dazu passende Festnetznummer rausgesucht hab), dort habe ich 4x anrufen m&uuml;ssen, weil immer wieder das Besetzt-Zeichen erklang, nachdem ich mich 2min durch die Men&uuml;strukturen gedr&uuml;ckt hatte. Der Mann bei dem ich dann rauskam, schien auch nicht sonderlich kompetent zu sein, brauchte ich nur noch ca. 10 Versuche um ihm zu erkl&auml;ren was ich mit dem Ger&auml;t tun will. "Geht nicht" war dann auch keine sooo tolle Antwort. </p>
<p></p><h3>...und dann war da noch das wirklich Schlimme:</h3><br/>Man kann kein HDMI-Bildsignal mit IRGENDEINER anderen Audioquelle kombinieren als das selbe HDMI-Kabel. Besonders bl&ouml;d wenn man einen PC hat der keinen Ton &uuml;ber die Grafikkarte ausgeben kann oder wenn man eine teuere Zusatzsoundkarte besitzt die etwas mehr leisten k&ouml;nnte. Laut Kundendienst (den ich nach dem 4. anruf dann doch noch irgendwann erreichen konnte), zieht sich dieses Problem auch komplett durch alle Ausgabem&ouml;glichkeiten durch. Man kann also z.B. SPDIF-Audio mit KEINER Version von Videoinput kombinieren und wenn man analoges Video eingibt (&uuml;ber Cinch), muss man auch das Tonsignal in Stereo als passende Cinch-Buchsen anstecken (und wohl das Videosignal auch wiede analog abnehmen... super).<br/>Die 7.1 Analogeing&auml;nge, 3 SPDIF-Eing&auml;nge und der Koax-Digitaleingang eignen sich also rein und komplett einzig dazu reine Audio-Ger&auml;te anzuschlie&szlig;en. (Zumindest soweit ich das ausprobieren konnte, aber der Kundendienst hat dies ja auch best&auml;tigt). 

<p>In meinem speziellen Fall war ich auch nicht in der Lage analoge Bildsignale irgendwie auf meinem PC-Bildschirm anzuzeigen. Ich konnte also nichtmal mein altes N64 oder einen alten DVB-T-Reciever &uuml;ber 3xCinch anschlie&szlig;en und das Bildsignal auf via HDMI auf meinen Bildschirm ausgeben. Dies k&ouml;nnte evtl. an meinem Bildschirm liegen, aber auch mit einem zweiten ging es nicht und der Bildschirm zeigte wirklich direkt "kein Signal" an und nicht etwa "nicht unterst&uuml;zte Aufl&ouml;sung", so dass ich, wie bereits angedeutet, stark vermuten w&uuml;rde dass auch hier analoge Signale nur wieder analog ausgegeben werden k&ouml;nnen. </p>
<p></p><h3>Hier noch ein paar Bilder ohne jegliche Relevanz von meinem aktuellem Medien-Schr&auml;nkchen</h3><br/>(Ja, die Qualit&auml;t ist grottig, aber ich spiel halt gerne mit den Kameras von Mobiltelefonen rum w&auml;hrend gerade Nacht und dementsprechend kaum Beleuchtung anliegt.)<br/>&lt;edit&gt;Achja: Bei wem das hier beschissen aussieht, der kann mal mit [ctrl]+[r] oder so das Stylesheet neu laden. Bei wem das auch nicht hilft: Die Seite sieht allgemein immer ziemlich mies aus, besser wirds wohl nicht mehr.&lt;/edit&gt;

<p></p><div class="imagebox"><a href="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/big/2010-11-24_07-51-16_91_Dresden.jpg" target="_blank"><img alt="Front des Samsung AV-Recievers" height="281" src="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/500x281/2010-11-24_07-51-16_91_Dresden.jpg" title="so sieht die Kiste von vorn aus" width="500"/></a><br/><a href="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/big/2010-11-24_07-52-23_963_Dresden.jpg" target="_blank"><img alt="Hinteransicht des Samsung HW C700" height="281" src="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/500x281/2010-11-24_07-52-23_963_Dresden.jpg" title="so viele Anschl&uuml;sse und nichts bringts weil die Elektronik/Software einfach nur schei&szlig;e ist..." width="500"/></a><br/><a href="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/big/2010-11-24_08-09-36_939.jpg" target="_blank"><img alt="Samsung-Fernbedienung" height="281" src="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/500x281/2010-11-24_08-09-36_939.jpg" title="Die selbstleuchtenden Tasten k&ouml;nnen vlt. als Positionslicht f&uuml;r meinen Wohnzimmertisch dienen..." width="500"/></a><br/><a href="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/big/2010-11-24_07-50-43_809.jpg" target="_blank"><img alt="oberhalb des Recievers in meinem Mediaschr&auml;nkchen" height="281" src="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/500x281/2010-11-24_07-50-43_809.jpg" title="da steht &uuml;brigens g33ky.de und das N64" width="500"/></a><br/><a href="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/big/2010-11-24_07-59-45_955.jpg" target="_blank"><img alt="weitere Ansicht mit Rechner und N64" height="281" src="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/500x281/2010-11-24_07-59-45_955.jpg" title="Nochmal fast das  selbe Bild" width="500"/></a><br/><a href="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/big/2010-11-24_07-51-01_304.jpg" target="_blank"><img alt="komplette H&ouml;he im Hochformat" height="296" src="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/166x296/2010-11-24_07-51-01_304.jpg" title="ihr habt 2x ertragen, dann geht auch 3x" width="166"/></a><a href="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/big/2010-11-24_07-51-40_338_Dresden.jpg" target="_blank"><img alt="Anschlussm&ouml;glichkeiten am Samsung HW C700 an der R&uuml;ckseite" height="296" src="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/166x296/2010-11-24_07-51-40_338_Dresden.jpg" title="und nochmal die R&uuml;ckseite in unerkennbar klein, aber vollst&auml;ndig" width="166"/></a><a href="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/big/2010-11-24_07-59-28_66.jpg" target="_blank"><img alt="weitere Ansicht der vollen H&ouml;he" height="296" src="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/166x296/2010-11-24_07-59-28_66.jpg" title="ein 4. mal geht nun auch noch, ja da hinten, hinterm N64 stehen Festplatten" width="166"/></a><br/><a href="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/big/2010-11-24_08-00-08_880_Dresden.jpg" target="_blank"><img alt="die obere Etage alleine" height="281" src="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/500x281/2010-11-24_08-00-08_880_Dresden.jpg" title="ich zeige g33ky.de einfach so gerne.... Beachtet den DVI-Stecker der rumliegt, weil der Samsung-AV so schei&szlig;e ist!" width="500"/></a><br/><a href="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/big/2010-11-24_08-00-34_536_Dresden.jpg" target="_blank"><img alt="offene Schublade unter dem reciever" height="281" src="http://dl.dropbox.com/u/11275679/Blog/samsung_xorav/500x281/2010-11-24_08-00-34_536_Dresden.jpg" title="weil ich wei&szlig; dass ihr Neugierig seid: da liegt der Rest der N64-Hardware" width="500"/></a><br/></div>
<p></p><h3>Fazit</h3><br/>Werde das Ger&auml;t jetzt zur&uuml;cksenden und nach brauchbaren Ger&auml;ten suchen. Irgendwas halt was man als AV-Reciever bezeichnen k&ouml;nnte und nicht eher als XOR(A,V)-Reciever. Vlt. tun ja die Onkyo-Ger&auml;te, zumindest klingen die Daten <a href="http://www.amazon.de/wir_hassen_unn&ouml;tig_lange_urls/dp/B003AXJ9ME" target="_blank">von dem 508er</a> ganz nett.
      
    
  