+++
title = "Gajim nervt#2"
date = "2008-06-29T11:06:00"
author = "Dr. Azrael Tod"
issoid = "blog/430"
aliases = "blog/430"
+++

<p>Wenn ich eine Sache aus dem letzten <a href="http://drazraeltod.wordpress.com/2008/06/28/gajim-nervt/" target="_self">Post &uuml;ber Gajim</a> gelernt habe, dann dass man nicht &uuml;ber ein Projekt &ouml;ffentlich l&auml;stern sollte, bei dem man jeden Tag im offiziellen <a href="mailto:href=" jabber="">MUC-Channel</a>href="jabber@conferenc...&gt; rumsitzt. Nach meinem Eintrag gab es beinahe sofort massenweise Reaktionen ich h&auml;tte das doch erstmal dort kl&auml;ren k&ouml;nnen bevor ich einen derartig b&ouml;sartigen Rant &uuml;ber Gajim schreibe und die Fehler l&auml;gen garnicht in Gajim sondern in meinen Einstellungen f&uuml;r meinen GPG-Agenten.</p>
<p>All das stimmt, heute morgen konnte ich die Probleme (wohl auch dank der Tatsache dass ich etwas ausgeschlafener war) mit ca. 3 Klicks l&ouml;sen. Die entsprechende Einstellung in Seahorse war ziemlich offensichtlich und ich hab keine Ahnung wie ich das mehrmals &uuml;bersehen konnte, aber das ist ja im Endeffekt auch egal, hauptsache es tut wieder.</p>
<p>Interessant fand ich dass bei den Leuten von Gajim jeder ver&auml;rgert war weil ich geschrieben habe dass Gajim nervt und kein einziger gelesen hat das ich Gajim so rein grunds&auml;tzlich f&uuml;r einen der besten Clients halte. (Ansonsten w&uuml;rde ich ihn ja auch nicht nutzen oder?)</p>
<p>Auch die ewiglangen Diskussionen dar&uuml;ber dass ich doch inhaltlichen Bl&ouml;dsinn erz&auml;hlen w&uuml;rde (danke, das hat mir an der Stelle wirklich geholfen) und dass es die schlechteste Variante &uuml;berhaupt w&auml;re das Passwort w&auml;hrend der Sitzung auf Festplatte zu speichern da die Daten nur sehr schwer wieder vollst&auml;ndig zu l&ouml;schen sind (Man muss Dateien &uuml;brigens nicht unbedingt l&ouml;schen, man k&ouml;nnte sie auch &uuml;berschreiben... nur so als Nebenbemerkung.) fand ich mehr als interessant. Ja die Passw&ouml;rter auf die Festplatte schreiben IST eine bescheuerte Idee. Ich wollte nur mit diesem Vergleich andeuten dass mir dies immer noch als eine bessere Idee erscheint als den Nutzer bei jedem Statuswechsel nach dem Passwort zu fragen.<br/>An meine Festplatte kommt kaum jemand ran, auf meinem Bildschirm mitlesen darf nahezu jeder. Auch ist die Technik schon lange nichtmehr Sicherheitsproblem Nr. 1 sondern ganz eindeutig der Nutzer (Irgendwann muss ich mal nen l&auml;ngeren Beitrag alleine dazu schreiben), es bringt nichts das perfekte, sichere Passwort zu haben, wenn man es irgendwann schon aus Gewohnheit &uuml;berall eintippt und irgendwann halt doch mal ins falsche Feld. (Selbst ich, der es eigentlich besser wissen m&uuml;sste, war schon in Versuchung das Passwort in die Zwischenablage zu nehmen um es nicht st&auml;ndig eintippen zu m&uuml;ssen... jemand anderes h&auml;tte das evtl. wirklich gemacht.)<br/>Auch der Hinweis dass das Problem entgegen meines Updates nicht in <a href="http://www.gnome.org/projects/seahorse/" target="_blank">Seahorse</a> liegt sondern in meinem GPG-Agenten, war wahnsinnig sinnvoll. Klar liegt das Problem beim GPG-Agenten, bl&ouml;d nur dass das in dem Fall Seahorse bei mir macht.</p>
<p>Um jedenfalls wieder zur&uuml;ck zum Thema zu kommen.. Gajim ist ein netter Client und liegt bei meinen Lieblings-Jabber-Clients mit ganz weit vorn (noch ein Beitrag den ich mal schreiben m&uuml;sste), ja er hat einige Macken (so werden unbest&auml;tigte Kontakte z.B. bei mir Permanent in der Liste angezeigt, w&auml;re sch&ouml;n wenn man das ausblenden k&ouml;nnte, auch w&auml;re es sch&ouml;n in den Eigenschafften eines Kontaktes lesen zu k&ouml;nnen, zu welchem Konto der Eintrag geh&ouml;rt)&nbsp; aber jeder andere von mir getestete Client hat die ebenfalls.<br/></p><p style="text-align:left;">Es gibt allerdings einen Grund aus dem ich niemals Gajim als einzigen Client verwenden werde (nein, nichtmal wenn er <a href="http://www.xmpp.org/extensions/xep-0167.html" target="_blank">Jingle-Audio</a>, <a href="http://de.wikipedia.org/wiki/Off-the-Record_Messaging" target="_blank">OTR</a> und eine M&ouml;glichkeit <a href="http://www.irssi.org/">Irssi</a> in einem Tab einzubinden unterst&uuml;tzt): Es ist ein grafisches Programm und l&auml;uft aus irgend einem Grund nicht in einer <a href="http://de.wikipedia.org/wiki/GNU_Screen" target="_blank">Screen</a>-Session. ;-)</p>
<p>Daher: Die unendliche Geschichte, der Suche nach einem idealem Jabber-Client geht weiter.</p>
