+++
title = "Top10: Jabber-Clients"
date = "2008-06-29T03:06:00"
author = "Dr. Azrael Tod"
issoid = "blog/431"
aliases = "blog/431"
+++

<p>Heute mal ein Vergleich aller m&ouml;glichen Jabber-Clients die ich in den letzten Jahren getestet hab. Die Wertung ist wie immer rein subjektiv und stellt keinen Anspruch auf vollst&auml;ndigkeit.<br/></p><ol><br/> <li><a href="http://www.gajim.org" target="_blank">Gajim</a> - GTK, Funktionsumfang hervorragend und auch von der Bedienung her recht gelungen, GPG wird unterst&uuml;tzt, OTR soll demn&auml;chst implementiert werden, Jingle-Audio fehlt noch immer daran wird aber ab und gearbeitet</li><br/> <li><a href="http://psi-im.org/" target="_blank">Psi</a> - Qt, kommt vom Funktionsumfang und der Bedienung Gajim nahe, f&auml;llt f&uuml;r mich pers&ouml;nlich jedoch aus dem Raster, da ich haupts&auml;chlich GTK-Programme verwende und nicht beides im Ram brauche</li><br/> <li><a href="http://www.centerim.org" target="_blank">centerim</a> - ncurses, Funktionsumfang gut, Grundaufbau auch ganz nett, die Verwaltung der History versaut das ganze Programm ohne den geringsten Grund, ebenfalls nervig ist dass der Cursor beim schreiben gerne an einer v&ouml;llig anderen Stelle angezeigt wird als er eigentlich steht (evtl. ein Zeichencodeproblem bei mir), die M&ouml;glichkeit mehrere Konten eines Protokolls zu verwenden w&auml;re evtl. auch nett</li><br/> <li><a href="http://miranda-im.de" target="_blank">Miranda</a> - Windows-Client, Funktionsumfang allgemein super, dem Jabber-Plugin selbst fehlt da allerdings noch einiges, Prima auch nebenbei als IRC-Client nutzbar (mein Client der Wahl unter Windows), Geschwindigkeit super</li><br/> <li><a href="http://mcabber.com" target="_blank">mcabber</a> - ncurses, Funktionsumfang etwas mager, Bedienung ist daf&uuml;r besser als bei centerim (zumindest nachdem ich einige Tasten umbelegt hatte)</li><br/> <li><a href="http://developer.pidgin.im/wiki/Using%20Finch" target="_blank">Finch</a> - ncurses, kleiner Bruder von Pidgin (libpurple-basierend), Funktionsumfang ziemlich gut, Bedienung grauenvoll (Bedienung eines grafischen Programmes 1:1 f&uuml;r ein Konsolenprogramm &uuml;bernehmen funktioniert nunmal nicht)</li><br/> <li><a href="http://www.pidgin.im" target="_blank">Pidgin</a> - GTK, guter Funktionsumfang, zeitweise etwas langsam (gef&uuml;hlt) und eher auf multiprotokoll eingeschossen (Transports und MUC werden nicht ideal unterst&uuml;zt)</li><br/> <li><a href="http://kopete.kde.org" target="_blank">Kopete</a> - Qt, um geringe Werte besser als Pidgin, allerdings ebenfalls und aus den selben Gr&uuml;nden wie Psi disqualifiziert</li><br/> <li><a href="http://www.google.com/talk" target="_blank">Google Talk</a> - Windows only, einzige, (mir bekannte,) nutzbare implementation von Jingle-Audio f&uuml;r Voice-Chat, sehr Google-spezifisch und entbehrt vieler wichtiger Funktionen</li><br/> <li><a href="http://www.igniterealtime.org/projects/spark/index.jsp" target="_blank">Spark</a> - Java-Client mit Jingle-Support, nicht grundschlecht und hat teilweise recht interessante Funktionen, aber wer will schon immer die Ladezeiten von Java ertragen?</li><br/></ol><br/>Ebenfalls getestet wurden: <a href="http://thecoccinella.org/" target="_blank">Coccinella</a>, <a href="http://www.trillian-messenger.net" target="_blank">Trillian</a> und <a href="http://www.bitlbee.org" target="_blank">Bitlbee</a><br/>Demn&auml;chst noch getestet werden: <a href="http://sourceforge.net/projects/jabbin" target="_blank">Jabbin</a> und <a href="http://tkabber.jabber.ru" target="_blank">Tkabber</a>, evtl. <a href="http://web.swissjabber.ch/index.php/Bombus_Jabber_Client_f%C3%BCr_das_Mobiltelefon" target="_blank">Bombus</a>
<p>Sollte jemand einen wirklich guten Client (idealerweise auf ncurses- oder wenigstens GTK-Basis) kennen freue ich mich wie immer &uuml;ber Vorschl&auml;ge.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_228" onclick="set_comment_reference(228)" title="auf diesen Kommentar antworten">#228</a>:
    29.Jun.2008 04:06
    von
    
      
        <a href="http://seufz.wordpress.com" target="_blank">
          seufz
        </a>
</p>
<p>Mit Jabber hab ich mich mal noch so garnicht befasst. Aber du hast mich neugierig gemacht ;)<br/>
&Uuml;brigens hab ich dich jetzt mal in die Blogroll eingetragen!</p>

<p class="infos">
<a href="#comment_229" onclick="set_comment_reference(229)" title="auf diesen Kommentar antworten">#229</a>:
    29.Jun.2008 05:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Danke :-)</p>

<p class="infos">
<a href="#comment_230" onclick="set_comment_reference(230)" title="auf diesen Kommentar antworten">#230</a>:
    30.Jun.2008 06:06
    von
    
      
        <a href="http://sprechblase.wordpress.com/" target="_blank">
          Cem Basman
        </a>
</p>
  p&gt;jwchat.org gesehen? Hat SSL-Verschl&uuml;sselung.
  
  

<p class="infos">
<a href="#comment_231" onclick="set_comment_reference(231)" title="auf diesen Kommentar antworten">#231</a>:
    30.Jun.2008 06:06
    von
    
      
        <a href="http://sprechblase.wordpress.com/2008/06/30/top10-jabber-clients-getestet/" target="_blank">
          Top10: Jabber-Clients getestet &amp;laquo; Sprechblase
        </a>
</p>
<p>[...] Jabber-Clients&nbsp;getestet 30. Juni 2008   TechieTalk: Dr. Azrael Tod hat Jabber-Clients getestet, welche haupts&auml;chlich f&uuml;r Instant Messaging verwendet werden. JWChat [...]</p>

<p class="infos">
<a href="#comment_232" onclick="set_comment_reference(232)" title="auf diesen Kommentar antworten">#232</a>:
    30.Jun.2008 09:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>@Cem<br/>
JWChat scheint garnicht mal so schlecht f&uuml;r ein Web-Interface, reagiert auch recht schnell und scheint f&uuml;rs reine Chatten durchaus ausreichende Funktionen zu bieten.<br/>
Kann aber meiner Meinung nach mit einem lokalen Client nicht mithalten, weder was den Umfang noch was die Verl&auml;sslichkeit betrifft.<br/>
Sicher eine sch&ouml;ne alternative zum Portable-Client auf nem USB-Stick aber imho nicht f&uuml;r den allt&auml;glichen Gebrauch geeignet</p>

<p class="infos">
<a href="#comment_233" onclick="set_comment_reference(233)" title="auf diesen Kommentar antworten">#233</a>:
    30.Jun.2008 02:06
    von
    
      
        <a href="http://zeank.in-berlin.de" target="_blank">
          zeank
        </a>
</p>
<p>Nat&uuml;rlich kann ein Webclient nie mit einem echten Desktop-Client mithalten. Vom Funktionsumfang her ist JWChat trotzdem den meisten Jabber-Desktop-Clients &uuml;berlegen (besonders was Groupchat/Chatrooms angeht).<br/>
Allerdings - muss man fairer Weise dazu sagen - liegt das einfach daran, dass die Mehrzahl der Desktop-Clients so schlecht ist, und nicht daran, dass der<br/>
JWChat so wahnsinnig gut w&auml;re ;)</p>

<p class="infos">
<a href="#comment_234" onclick="set_comment_reference(234)" title="auf diesen Kommentar antworten">#234</a>:
    30.Jun.2008 02:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Das war auch keinesfalls beleidigend gemeint, ich bin sogar eher erstaunt wie schnell das Ding reagiert und dass es sich ziemlich gut verwenden l&auml;sst.</p>
<p>Allerdings suche ich bei einem wirklich gutem Jabber-Client auch nach Funktionen wie OTR/GPG-Verschl&uuml;sselung (z.B. meine Privaten GPG-Schl&uuml;ssel w&uuml;rde ich aus offensichtlichen Gr&uuml;nden einem Webclient nicht anvertrauen) oder Jingle-Audio, dies sind Dinge die in einem Webclient im besten Fall sehr schwer zu implementieren sind.</p>

<p class="infos">
<a href="#comment_235" onclick="set_comment_reference(235)" title="auf diesen Kommentar antworten">#235</a>:
    30.Jun.2008 02:06
    von
    
      
        <a href="http://zeank.in-berlin.de" target="_blank">
          zeank
        </a>
</p>
<p>Hab ich auch nicht als Beleidigung verstanden. Und ja OTR/GPG ist w&uuml;nschenwert aber schwer (wenn &uuml;berhaupt m&ouml;glich) in einem Webclient.<br/>
Wirklich &auml;rgerlich ist aber, dass es bislang immer noch keinen Standard hierzu gibt und daher die meisten Clients inkompatibel zueinander sind.</p>

<p class="infos">
<a href="#comment_236" onclick="set_comment_reference(236)" title="auf diesen Kommentar antworten">#236</a>:
    01.Jul.2008 03:07
    von
    
      
        sirsnookie
      
    
    
  </p>
<p>Du hast YsmICQ (YSM-You sick me ICQ) vergessen (<a href="http://ysmv7.sourceforge.net/" rel="nofollow">http://ysmv7.sourcefor...</a>). Sowie imFish (<a href="http://imfish.sourceforge.net/)%3C/p%3E" rel="nofollow">http://imfish.sourcefo...</a>
</p>
<p class="infos">
<a href="#comment_237" onclick="set_comment_reference(237)" title="auf diesen Kommentar antworten">#237</a>:
    01.Jul.2008 08:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p><a href="http://ysmv7.sourceforge.net">YsmICQ</a> scheint nicht viel mit Jabber zu tun zu haben... ich zitiere mal deren Homepage:</p>
<blockquote>
<p>What is ysm ICQ?</p>
<p>A Free, open source (GPL license) console based ICQ client written in the C language. The project was born in the year 2001 when Mirabilis (now AOL) introduced a new version of the ICQ protocol. Full of humor and interesting features, ysm provides an easy to use command line interface which allows faster communication with your contacts and provides many OS dependent comfortable options.</p>
</blockquote>
<p>und <a href="http://imfish.sourceforge.net/">imFish</a> sieht zwar nach einer lustigen Idee aus, ob das ernsthaft sinnvoll zu verwenden ist muss ich aber irgendwie bezweifeln.</p>

<p class="infos">
<a href="#comment_238" onclick="set_comment_reference(238)" title="auf diesen Kommentar antworten">#238</a>:
    02.Jul.2008 09:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Bin gerade &uuml;ber eine weitere Pidgin-Variante, diesmal mit Verwendung der Gecko-Engine zur Darstellung, gestolpert: <a href="http://www.instantbird.com/">Instantbird</a></p>
<p>Inwiefern das Ding nutzbar oder performant ist konnte ich allerdings noch nicht testen.</p>

<p class="infos">
<a href="#comment_239" onclick="set_comment_reference(239)" title="auf diesen Kommentar antworten">#239</a>:
    02.Jul.2008 09:07
    von
    
      
        <a href="http://seufz.wordpress.com/2008/07/02/pidgin-und-icq/" target="_blank">
          Pidgin und ICQ &amp;laquo; *Seufz*&amp;#8230;
        </a>
</p>
<p>[...] <em>seufz</em> Flo ps: Wie war das noch gleich mit JABBER?! [...]</p>

<p class="infos">
<a href="#comment_240" onclick="set_comment_reference(240)" title="auf diesen Kommentar antworten">#240</a>:
    11.Sep.2008 06:09
    von
    
      
        <a href="http://www.tschlotfeldt.de/" target="_blank">
          Tim Schlotfeldt
        </a>
</p>
<p>Wo, was ist denn mit Tkabber? Schon Erfahrungen gesammelt? Das ist n&auml;mlich mittlerweile mein pers&ouml;nlicher Favorit. H&auml;sslich (Tk), aber wirklich gut.</p>

<p class="infos">
<a href="#comment_241" onclick="set_comment_reference(241)" title="auf diesen Kommentar antworten">#241</a>:
    12.Sep.2008 09:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>tkabber hab ich nur kurz ausprobiert, hat bisher meine Erwartungen nicht ganz erf&uuml;llt.<br/>
Das kann aber auch zum Teil mit daran liegen, dass ich eigentlich einen Konsolenclient suche, der alle Funktionen bietet.<br/>
Einen grafischen Client hab ich ja bereits mit Gajim, den in Bezug auf Funktionen zu &uuml;berbieten mag ein nettes Ziel sein, wird aber schwer erreichbar.</p>

<p class="infos">
<a href="#comment_242" onclick="set_comment_reference(242)" title="auf diesen Kommentar antworten">#242</a>:
    13.Jan.2009 12:01
    von
    
      
        <a href="http://wallaby.ath.cx/blog" target="_blank">
          Bernhard
        </a>
</p>
<p>irssi + bitlbee</p>
<p>perfekt :)</p>

<p class="infos">
<a href="#comment_243" onclick="set_comment_reference(243)" title="auf diesen Kommentar antworten">#243</a>:
    13.Jan.2009 12:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Bitlbee fehlen mir irgendwie zu viele Funktionen... au&szlig;erdem komm ich dann irgendwann mit den normalen IRC-Server-Kommandos, denen von IRSSI, den von pyChao und den von Bitlbee durcheinander. <em>g</em></p>
</div>