+++
title = "Trolle bei F!xmbr"
date = "2008-04-04T10:04:00"
author = "Dr. Azrael Tod"
issoid = "blog/339"
aliases = "blog/339"
+++

<p>Normalerweise m&uuml;sste ich mich grade vor Lachen auf dem Boden w&auml;lzen..<br/>F!xmbr hat grade ein <a href="http://www.fixmbr.de/wp-25/">nettes Statement zum Thema Wordpress 2.5</a> rausgegeben.<br/><br/></p><blockquote>Spam ist im &Uuml;brigen ein Problem, welches auf F!XMBR unbekannt ist, mal abgesehen von den Trollen.</blockquote><br/><br/>Ja wirklich, Trolle scheinen auf der seite ein gr&ouml;&szlig;eres Problem zu sein, ich mein die Autoren versuchen ja auch nicht grade den Trollen keine Angriffsfl&auml;che zu bieten... achwo..<br/>Jaja, trollig sind sie schon bissl unsere Freunde auf F!xmbr, wenn sie nicht auch noch ganz nebenbei ziemlich oft gute Artikel schreiben w&uuml;rden und recht aktuell auf Ereignisse reagieren w&uuml;rden w&auml;re das ganze einfach nur noch ne Lachnummer.<br/>Nicht dass ich auch nur einen Prozentpunkt weniger Troll w&auml;re, aber ich geb meine Fehler wenigstens zu. ;-)
      
    
  <div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_61" onclick="set_comment_reference(61)" title="auf diesen Kommentar antworten">#61</a>:
    05.Apr.2008 12:04
    von
    
      
        Anonymous
      
    
    
  </p>
<p>Ein guter Tipp, wenn man mal "3-4" Leute auf dem Blog hat wie hier wei&szlig; man doch noch gar nicht was ein Troll &uuml;berhaupt ist. Wenn du mal am Tag um die 6000-8000 Hits hast, an die 5000 Artikel und weit &uuml;ber 20.000 Kommentare dann reden wir mal weiter. Kann man unter Schwanzvergleich abhaken und weiter einen infantilen Rant von sich geben oder aber man nimmt es als Beispiel f&uuml;r die fehlende Verh&auml;ltnism&auml;&szlig;igkeit.Also werd erst einmal erwachsen, heirate, Job, Kinder etc. pp - dann verstehst du z.B. auch u.U. warum wir nicht auf einen derartig menschenverachtenden Schmarrn wie von dir bei uns ge&auml;ussert eingehen. Ich k&ouml;nnte es mir jetzt einfach machen und den ber&uuml;hmten Nuhr Spruch bem&uuml;hen, aber ich denke bei dir kommt doch irgendwann mehr positives. Die Hoffnung stirbt zuletzt.F!XMBR</p>

<p class="infos">
<a href="#comment_62" onclick="set_comment_reference(62)" title="auf diesen Kommentar antworten">#62</a>:
    05.Apr.2008 04:04
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Alles worauf ich mich bezogen hab, waren die Formulierungen in euren Artikeln. Ihr musstet selber zugeben, dass das ganze mit ziemlich viel "Pathos" geschrieben war, um nicht zu sagen ideal daf&uuml;r um Leute mit zu unterschiedlichen Meinungen zu provozieren. Dieses Verhalten wird im allgemeinen "herumtrollen" genannt.Meine &Auml;u&szlig;erungen sind ein v&ouml;llig anderes Thema, dar&uuml;ber k&ouml;nnen wir gerne bei gelegenheit nochmal diskutieren, das w&uuml;rde jedoch eh nicht viel bringen, da ihr offensichtlich nichtmal meinen Standpunkt verstehen wolltet. (Erl&auml;uternde Posts von mir, die das ganze etwas relativierten wurden ja auch gleich wieder gel&ouml;scht.)Ich gebe zu dass mein Standpunkt mehr als strittig und sehr provozierend wirkt, doch ich bin einfach der Meinung, dass wann immer ein Mensch von sich selbst behauptet 100%ig unegoistisch und Menschenfreundlich zu handeln, tut er dies nur aus eigentlich egoistischen Gr&uuml;nden. Sei es um selber besser da zu stehen oder auch nur um sein eigenes Gewissen zu beruhigen und sich besser zu f&uuml;hlen. Ihr habt es schon richtig ausgedr&uuml;ckt, ich habe mich selbst "demaskiert".Meine Frage ist jedoch: Was ist Schlimmer? Die ganze Zeit Egoist zu sein und mit einer "Maske" herumzulaufen, oder selbst zuzugeben dass man Egoist ist?</p>

<p class="infos">
<a href="#comment_63" onclick="set_comment_reference(63)" title="auf diesen Kommentar antworten">#63</a>:
    19.Jul.2008 06:07
    von
    
      
        <a href="/2008/07/19/klo-content-und-warum-deutsche-blogs-nicht-funktionieren/" target="_blank">
          Klo-Content und warum deutsche Blogs (nicht?) funktionieren &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] (F!xmbr trollt halt mal wieder, ist ja eigentlich nichts neues&hellip;) [...]</p>
</div>