+++
title = "Fernsehen2.0"
date = "2008-09-27T06:09:00"
author = "Dr. Azrael Tod"
issoid = "blog/817"
aliases = "blog/817"
+++

<p>Warum stellen diese ganzen deutschen Fernsehsender eigentlich nicht ihre Sendungen generell via Podcast zur Verf&uuml;gung? Ich rede jetzt nicht von irgendwelchen teuer aus den USA eingekauften Serien und Filmen, bei denen die Sender die entsprechenden Rechte erst zus&auml;tzlich kaufen m&uuml;ssten, eher von Eigenproduktionen wie Nachrichten, Dokumentationen, Comedy-Sendungen oder sogar Serien.<!--more--></p>
<p>Es ist ja nicht so als w&uuml;rde es das &uuml;berhaupt nicht geben, Pro7 bietet ja durchaus solche Sendungen wie QuatschComedyClub, Switch oder Galileo an. Auf der &Ouml;R-Seite haben wir Dinge wie Quarks&amp;Co, Polylux (wird ja bald nur noch online verf&uuml;gbar sein und im Fernsehen abgesetzt) oder Nachrichtenmagazine wie Tagesschau. Es bestehen also offensichtlich keine Probleme was die Umsetzung betrifft. Auch f&uuml;r den Punkt Finanzierung finden sich da drau&szlig;en schon ganz nette Ideen. Eine ist z.B. die Sendungen in k&uuml;rzere Beitr&auml;ge aufzuteilen um dann vor und nach jedem Beitrag einen Werbespot einzublenden. Eine andere w&uuml;rde Werbeeinblendungen im Bild selbst betreffen, ein System das mir selbst aber etwas arg nervig erscheint.</p>
<p>Nat&uuml;rlich kann man bei Videodateien zum Download leicht die Werbung &uuml;berspringen... wenn die Werbung aber nicht sonderlich lang ist (und ein einzelner Spot erf&uuml;llt meist diese Bedingung) lohnt es sich f&uuml;r den Nutzer nicht da erst lange nach dem Ende des Spots zu suchen.</p>
<p>Wenn also die rechtliche, die technische und auch die finanzielle Seite kein Problem darstellt... woran liegt es dann? Warum schafft es Pro7 die Angebote relativ &uuml;bersichtlich mit RSS-Adresse und Verlinkung auf volle Sendungen auf <a href="http://www.prosieben.de/service/rss/" target="_blank">einer Seite</a> zu sammeln w&auml;hrend RTL, Vox und zugeh&ouml;rige Sender gerade mal kleine Vorschau-Werbe-Filmchen auf ihrer Seite einbetten k&ouml;nnen?</p>
<p>Noch seltsamer wird es wenn man sich die &Ouml;R-Sender ansieht. Die meisten Radiosender bringen durchaus ihre interessantesten Sendungen (also alles was nicht nur aus Musik besteht) kurz zusammengeschnitten als Podcast. Auch ARD und ZDF bringen ihre 1-2 Nachrichtensendungen online. Warum nun nicht die restlichen Sendungen ver&ouml;ffentlichen? Es handelt sich ja weder um neu zu produzierende Inhalte noch um sonst irgendwelche Mehrwerte die erzeugt werden m&uuml;ssen noch um sonst irgendeinen erzeugten Mehrwert. Es werden nur bestehende Informationen &uuml;ber andere Wege neuen Zielgruppen (oder alten Zielgruppen auf angenehmeren Wegen) zug&auml;nglich gemacht.</p>
<p>Ich will mich nicht nur beschweren, die Angebote der &Ouml;Rs auf den verschiedenen <a href="http://www.ardmediathek.de" target="_blank">Mediathek</a>-Seiten sind durchaus ganz nett... Doch da sollte man nicht aufh&ouml;ren, wenn schon das ganze Volk via GEZ die Produktion dieser Sendungen bezahlt, warum werden diese Sendungen nicht unter einer CC-Lizenz denjenigen &uuml;berlassen die sie bezahlt haben? W&auml;re das nicht die einzige faire L&ouml;sung?</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_667" onclick="set_comment_reference(667)" title="auf diesen Kommentar antworten">#667</a>:
    27.Sep.2008 10:09
    von
    
      
        <a href="http://codecocktail.wordpress.com" target="_blank">
          charlysan
        </a>
</p>
<p>Genau dar&uuml;ber habe ich auch schon nachgedacht - generell finde ich die Angebote der Fernsehsender, was solche Sendungen angeht, eher mangelhaft. Ein ziemlich gutes und vorallem t&auml;glich aktuelles Angebot an Clips gibt es &uuml;brigens auf spiegel.de, das kann ich nur sehr empfehlen.<br/>
Gru&szlig;, charlysan</p>

<p class="infos">
<a href="#comment_668" onclick="set_comment_reference(668)" title="auf diesen Kommentar antworten">#668</a>:
    27.Sep.2008 10:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Naja, aber auch nicht gerade deutlich sichtbar und RSS-Feeds oder andere Syndication-Mechanismen kann ich garnicht finden.<br/>
SPON war eh noch nie so mein Fall, die bringen teilweise schon extrem niveaulose Sachen...</p>

<p class="infos">
<a href="#comment_669" onclick="set_comment_reference(669)" title="auf diesen Kommentar antworten">#669</a>:
    29.Sep.2008 08:09
    von
    
      
        <a href="http://www.markuswalther.org" target="_blank">
          Markus Walther
        </a>
</p>
<p>...und wenn man dann doch mal ne sendung haben m&ouml;chte (ich hatte das mit dem bayrischen rundfunk). dann kostet ein mitschnitt (z.b. auf dvd) ca. 30 euro. begr&uuml;ndet wird das mit dem aufwand zum heraussuchen der sendung, aufzeichnung und versand. nat&uuml;rlich sind die lizenzgeb&uuml;hren nicht zu vergessen (welch ironie f&uuml;r einen braven gez-zahler...).<br/>
und als podcast bekommt man nur winzige clips aus der sendung und die aufl&ouml;sung ist schlechter als die meines ersten kamerahandys vor 5 jahren...<br/>
sowas ist eine frechheit</p>

<p class="infos">
<a href="#comment_670" onclick="set_comment_reference(670)" title="auf diesen Kommentar antworten">#670</a>:
    29.Sep.2008 09:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>ein sehr guter Punkt...<br/>
F&uuml;r 30&euro; kann ich einige Sendungen aus dem Archiv suchen gehen, wenn ich dort gleich arbeite kann ich bestimmt auf die Art ein paar hundert Euro die Stunde machen... zumindest k&ouml;nnte ich das, wenn es jemand nutzt, was aber unwahrscheinlich ist, genau um das zu verhindern sind ja die Preise so hoch.</p>
</div>