+++
title = "Publicons"
date = "2008-09-27T01:09:00"
author = "Dr. Azrael Tod"
issoid = "blog/813"
aliases = "blog/813"
+++

<p></p><div style="float:right;"><a href="http://drazraeltod.wordpress.com/2008/09/27/publicons/"><img alt="POWERED BY PUBLICONS.DE" src="http://www.publicons.de/my/pub_!22Rofl+du+hast+LOL+gesagt!21!22+-+G33KY.de_466,5,120,89,91,92,921,248,163,270,437,556,555,464,130,260,719,865,827,942,785,482_3.png" style="border-width:0;"/></a></div><br/>Ich musste jetzt mal bei <a href="http://seufz.wordpress.com/2008/09/27/publicons/" target="_blank">Noqqe</a> einen Link klauen, den dieser wieder bei <a href="http://codecocktail.wordpress.com/" target="_blank">Codecocktail</a> gefunden hat.

<p>Bei <a href="http://publicons.de" target="_blank">Publicons</a> handelt es sich um eine M&ouml;glichkeit ein paar Bildchen zusammen zu stellen, die etwas &uuml;ber den Verwender aussagen sollen.<br/>Sicher eine sehr nette M&ouml;glichkeit in Forensignaturen oder &auml;hnlichem auf wenig Platz so viel wie m&ouml;glich &uuml;ber sich selbst auszusagen. (Leider bin ich jetzt seit einigen Jahren kaum noch in Foren unterwegs, aber das trifft ja nicht auf alle zu.)<br/>F&uuml;r eine ernste Anwendung fehlen leider noch viele Bildchen zur Auswahl, aber es ist schon ein netter Anfang.<br/>Man k&ouml;nnte es (sollte es irgendwann mal umfangreich genug sein) <a href="http://de.wikipedia.org/wiki/Geekcode" target="_blank">wohl</a> <a href="http://www.geekcode.com/geek.html" target="_blank">mit</a> <a href="http://www.joereiss.net/geek/geek.html" target="_blank">Geekcode</a> <a href="http://drazraeltod.wordpress.com/2006/04/26/am-i-geek-enough-1/">vergleichen</a> den man f&uuml;r Normalsterbliche lesbar gemacht hat.</p>
<p>An der Seite seht ihr &uuml;brigens meine Auswahl.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_660" onclick="set_comment_reference(660)" title="auf diesen Kommentar antworten">#660</a>:
    27.Sep.2008 03:09
    von
    
      
        <a href="http://macfidelity.de/2008/09/27/me-der-fidel-in-form-von-vielen-kleinen-bildern/" target="_blank">
          me | der fidel in form von vielen kleinen bildern | macfidelity
        </a>
</p>
<p>[...] gerade bei Dr. Azrael Tod dar&uuml;ber gesto&szlig;en, der es &uuml;ber Noqqe und der wiederum bei Codecocktail gefunden hat. Tolle [...]</p>

<p class="infos">
<a href="#comment_661" onclick="set_comment_reference(661)" title="auf diesen Kommentar antworten">#661</a>:
    28.Sep.2008 11:09
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Boah... hatte ich das nicht vor Jahren schonmal gemacht? &Auml;h... ah ja.</p>
<p>&Uuml;brigens Find ich Korn, In Extremo, Wolfsheim und Trance ja etwas seltsam (Diese Kombination, nicht alles f&uuml;r sich genommen), aber keine Angst, ich hab schon Leute getroffen, die noch viel querbeetiger h&ouml;ren.</p>

<p class="infos">
<a href="#comment_662" onclick="set_comment_reference(662)" title="auf diesen Kommentar antworten">#662</a>:
    29.Sep.2008 09:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Das ist durchaus nicht seltsam...<br/>
Ich h&ouml;r mir z.B. auch Wagner (ja, der Typ der schon lange tot ist), :Wumpscut:, Depeche Mode, Randy Katana, The Prodigy,  ...<br/>
Warum sollte ich mich auf einen Stil beschr&auml;nken?</p>

<p class="infos">
<a href="#comment_663" onclick="set_comment_reference(663)" title="auf diesen Kommentar antworten">#663</a>:
    29.Sep.2008 11:09
    von
    
      
        <a href="http://ag7.alltagsgrauen.info" target="_blank">
          fwolf
        </a>
</p>
<p>alles ... aber KoRn? o.O<br/>
au&szlig;erdem scheinen die grad serverprobs zu haben.</p>
<p>cu, w0lf.</p>
<p>NP: Spektr - Wizened Hand</p>

<p class="infos">
<a href="#comment_664" onclick="set_comment_reference(664)" title="auf diesen Kommentar antworten">#664</a>:
    29.Sep.2008 11:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>KoRn macht doch laune. <em>g</em> Wenn ich da an All in the Family, Did my Time, Freak on a Leash oder Make me bad denke...</p>
<p>Serverprobs scheinen sich schon wieder erledigt zu haben (nach nichmal 5min)... bei mir bemerke ich zumindest nichts</p>

<p class="infos">
<a href="#comment_665" onclick="set_comment_reference(665)" title="auf diesen Kommentar antworten">#665</a>:
    29.Sep.2008 11:09
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Versteh mich bitte nicht falsch, ich h&ouml;re auch viel verschiedene Musik, ich w&uuml;rde nur das meiste davon niemals so "anprangern" wie du hier (Ganz einfach weil ich seeehr stark unterscheide zwischen "Die Musik m&ouml;gen" und "Sich mit der Musik identifizieren"), aber deswegen werd ich wohl auch &ouml;fters Musiknazi genannt. Was wohl auch stimmt.</p>
<p>Und Wagner ist toll, Depeche Mode geht jetzt ja mal gar nicht und KoRn kann man mal, muss aber auch nicht ;)</p>
<p>Die Serverprobleme scheinen anzudauern, sonst w&uuml;rde ich meine mal auf den neuesten Stand bringen.</p>

<p class="infos">
<a href="#comment_666" onclick="set_comment_reference(666)" title="auf diesen Kommentar antworten">#666</a>:
    30.Sep.2008 08:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ich unterscheide ebenfalls stark zwischen anh&ouml;ren und mich damit zu identifizieren...<br/>
Angeh&ouml;rt wird fast alles was zur jeweiligen Laune passt. Beim identifizieren bin ich der Meinung dass dies die bl&ouml;deste Unsitte seit ziemlich langer Zeit ist.</p>
</div>