+++
title = "Westentaschenextremisten"
date = "2008-08-20T01:08:00"
author = "Dr. Azrael Tod"
issoid = "blog/576"
aliases = "blog/576"
+++

<p>Nachdem ich gerade mal wieder eine ewig lange Diskussion &uuml;ber Religion und meine Abneigung gegen&uuml;ber religi&ouml;ser Organisationen hinter mir habe, dachte ich mir es w&auml;re sicher eine gute Idee das Ganze in einem kurzem Blogpost mal zusammen zu fassen.<!--more--></p>
<p>Zugegeben meine einleitende Reaktion war etwas un&uuml;berlegt... Auf die Erw&auml;hnung des Namens "Jesus von Nazareth" mit "ach der Spinner" zu antworten war mal wieder der Inbegriff von Trolligkeit und polarisierte gleich zum Anfang mal wieder so richtig sch&ouml;n.<br/>Meine Erl&auml;uterung dass, wenn heute jemand ankommen w&uuml;rde und behauptet "Ich bin Gottes Sohn", ich ihm auch nicht glauben w&uuml;rde und dass von dieser Aussage und den darauf folgenden "Beweisen" nur 2000 Jahre alte &Uuml;berlieferungen und Sagen geblieben sind (was die Glaubw&uuml;rdigkeit imho nicht wirklich erh&ouml;ht), konnte den Anfang dann auch nicht mehr raus rei&szlig;en.</p>
<p>Es war auch zugegeben recht schwierig meine Meinung in Worte zu fassen, wenn alle 5 Minuten bei irgendeiner Aussage wie "selber denken ist besser als Wiederholen was man in der Sonntagsschule geh&ouml;rt hat", "Bei Versto&szlig; gegen die Gebote wird mit Gottes metaphorischer Keule gedroht... ewige H&ouml;llenqualen" oder auch nur einem vertippten Wort al&aacute; "Ich habe nur mit Kondom Sex weil der Papst das sagt!", gleich an den Kopf geworfen wird, mir w&uuml;rde Kompetenz fehlen, ich w&auml;re ein "selbsternannter Glaubenskritiker" und will jemandem erz&auml;hlen woran die betreffende Person glaubt.<br/>Sonntagsschule gibt es nicht mehr, der Himmel-H&ouml;lle-Dualismus wird nicht mehr gelehrt und es muss nat&uuml;rlich ohne Kondom lauten... das stimmt schon alles, geht aber auch argumentativ v&ouml;llig am Thema vorbei und das einzige was mit einem derartigen Stil zu diskutieren erreicht wird, ist den Gegner zu verwirren und von seinen Argumenten abzubringen.</p>
<p>Manchmal will man einfach nur mit einem Beispiel untermauern was man gerade sagen will, manchmal kann Sonntagsschule auch durch Eltern, den Religionslehrer oder den alten Onkel Klaus von Nebenan ersetzt werden und manchmal ist mit H&ouml;llenqualen als g&ouml;ttliche Keule auch einfach IRGENDEINE Bestrafung durch h&ouml;here M&auml;chte gemeint.<br/>Es ist ohnehin ein Fehler meinerseits gewesen alle Beispiele direkt auf das Christentum zu beziehen, wenn ich doch meine Argumente eher allgemeiner meinte.</p>
<p>Meiner Meinung nach sollte man privaten Glauben/Spiritualit&auml;t und religi&ouml;se Organisationen strikt unterscheiden.<br/>Gegen das Erstgenannte habe ich durchaus nichts, auch wenn es evtl. manchmal so klingt. Wenn jedoch der kleine Fritz sich meine Argumente anh&ouml;rt und sagt das er das Gef&uuml;hl h&auml;tte da w&auml;re ein Gott dann soll er nur an diesen Gott glauben, ich will der letzte sein der ihm dies ausredet. Von mir aus kann auch mein Nachbar Erwin vom Blitz getroffen werden und dann anfangen einen Kieselstein anzubeten.</p>
<p>Hingegen gegen den organisierten "Glauben", dagegen habe ich etwas. Wenn Kinder eingetrichtert bekommen sie sollen jeden Abend beten, sonst habe Gott sie nicht lieb oder mir jemand erz&auml;hlen will dass ich, sollte ich auf die Stra&szlig;e gehen und die n&auml;chstbesten 4-5 Personen erstechen, in der H&ouml;lle landen (oder halt nur noch permanent einen Mangel an Gl&uuml;ck versp&uuml;ren, f&uuml;r diejenigen denen das Bild einer H&ouml;lle zu direkt ist), dann frage ich mich wer das alles ernst nehmen soll.</p>
<p>Das Ganze mag vom heutigen Gesichtspunkt durchaus unkritisch klingen, wen interessiert es schon ob 10-20 Kinder mehr oder weniger behaupten an einen Gott zu glauben, ohne jemals dar&uuml;ber nachgedacht zu haben?<br/>Man sollte sich jedoch vor Augen f&uuml;hren dass unsere heutige Gesellschaft eher die Ausnahme denn die Regel darstellt. Nat&uuml;rlich kann ich heute auf die Stra&szlig;e gehen und jemandem erz&auml;hlen ich halte Gott f&uuml;r eine Illusion und in unserer Gesellschaft wird mir da auch keine gr&ouml;&szlig;ere Gefahr drohen als mal nicht zum Gottesdienst eingeladen zu werden.<br/>Bereits in kleineren D&ouml;rfern jedoch kann es auch in Deutschland noch vorkommen dass ich f&uuml;r einen derartigen Satz als Handwerker von der Dorfgemeinde erheblich weniger Auftr&auml;ge bekomme.<br/>In Bayern kann man sogar heute f&uuml;r Kritik am Papst noch <a href="http://www.mdr.de/fakt/5039319.html" target="_blank">RICHTIG &Auml;rger bekommen</a>.<br/>Das alles ist jedoch nichts im Vergleich zu L&auml;ndern in denen die Religion noch eine richtig starke Rolle spielt. Das vielzitierte Kondomverbot seitens des katholischen Papstes sorgt nicht umsonst seit langem f&uuml;r best&auml;ndigen &Auml;rger und mit Bushs Kreuzzug gegen muslimische L&auml;nder (das mag nur ein sehr geringer Teil von Bushs Motivation sein, auf der gegnerischen Seite kann das aber schon ganz anders wirken) oder dem in Entwicklungsl&auml;ndern wie den USA noch immer verp&ouml;hnten vorehelichem Sex finden sich noch ein paar weitere von sehr vielen Beispielen in denen organisierte Religion noch immer starken Einfluss auf das Weltgeschehen nimmt.</p>
<p>Daher bin ich gegen vorgeschriebene regeln einer Religion und f&uuml;r eigenst&auml;ndiges Denken!</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_447" onclick="set_comment_reference(447)" title="auf diesen Kommentar antworten">#447</a>:
    20.Aug.2008 08:08
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>...and all hail ERIS!</p>

<p class="infos">
<a href="#comment_448" onclick="set_comment_reference(448)" title="auf diesen Kommentar antworten">#448</a>:
    20.Aug.2008 08:08
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>ALL HAIL DISCORDIA!</p>

<p class="infos">
<a href="#comment_449" onclick="set_comment_reference(449)" title="auf diesen Kommentar antworten">#449</a>:
    25.Aug.2008 03:08
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Ich bin ja nicht so der Typ, der sich selbst in den Kommentaren verlinkt, aber naja, ich hab mich da vor kurzem schon genug dr&uuml;ber ausgelassen, und weil ich ja sowieso eine Attention Whore bin und zu viel rede, was niemand beachtet (so wie jetzt) klick mich.</p>
<p>(Sogar mit Bezug auf den Diskordianismus, jawoll!)</p>

<p class="infos">
<a href="#comment_450" onclick="set_comment_reference(450)" title="auf diesen Kommentar antworten">#450</a>:
    25.Aug.2008 03:08
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Diskordianismus is cool... endlich habe ich eine ultimative Wahrheit und muss nicht mehr st&auml;ndig &uuml;ber alles selbst nachdenken!<br/>
In diesem Sinne FNORD!</p>
<p>BTW: Netter Artikel @Friedenspanzer :-)</p>

<p class="infos">
<a href="#comment_451" onclick="set_comment_reference(451)" title="auf diesen Kommentar antworten">#451</a>:
    25.Aug.2008 06:08
    von
    
      
        <a href="/2008/08/25/kreationisten/" target="_blank">
          Kreationisten &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...]  Nach dem ganzen Religionsbashing (hier z.B. ein Post von mir &ldquo;Westentaschenextremisten&rdquo; oder ein Beitrag den ich heute erst versp&auml;tet gelesen habe von Friedenspanzer namens [...]</p>
</div>