+++
title = "Twitter ist tot!"
date = "2008-05-26T12:05:00"
author = "Dr. Azrael Tod"
issoid = "blog/378"
aliases = "blog/378"
+++

<p>...zumindest f&uuml;r mich. Der Hauptgrund warum ich Twitter verwendet habe, war um meine <a href="http://feeds.feedburner.com/SharedByDrAzraelTod" target="_blank" title="RSS-Items">RSS-Items</a> auch kommentiert unter die Leute bringen zu k&ouml;nnen. Das ganze "ich bin auf dem Klo"-generve diverser Alphablogger war noch nie etwas f&uuml;r mich und ich habe schon nach wenigen Tagen so ziemlich alle Leute rausgeworfen, denen ich gefolgt bin.</p>
<p>Ein <a href="http://userscripts.org/scripts/show/10169" target="_blank" title="Script">Script</a> f&uuml;r <a href="https://addons.mozilla.org/de/firefox/addon/748" target="_blank" title="Greasemonkey">Greasemonkey</a> hatte das ganze dann sogar noch erheblich verbessert, da es mir dadurch m&ouml;glich wurde, meine Tweets direkt aus <a href="http://google.com/reader" target="_blank" title="Reader">Reader</a> heraus zu schreiben und den Link direkt zu &uuml;bernehmen. Leider funktionierte dieses Script mit der deutschen Version von Reader nicht wirklich. (Nicht dass ich so scharf auf diese Version w&auml;re...)</p>
<p>Jedenfalls hat sich in letzter Zeit die neue Funktion in Google Reader, shares jetzt mit Kommentar ver&ouml;ffentlichen zu k&ouml;nnen, als erheblich sinnvoller erwiesen, als Twitter jemals war. Ich habe mein System also ab sofort eher darauf umgestellt.</p>
<p>F&uuml;r euch bedeutet das, dass ihr weiterhin unter der selben <a href="http://feeds.feedburner.com/SharedByDrAzraelTod" target="_blank" title="URL">URL</a> die aktuellsten Neuigkeiten erhaltet und euch nicht auf Twitter umstellen m&uuml;sst. Au&szlig;erdem ist in meiner Seitenleiste jetzt wieder mehr Platz f&uuml;r die Anzeige der letzten Items, ihr findet dort also jetzt die letzten 10 statt wie bisher die letzten 5 Neuigkeiten.</p>
<p>BTW: Irgendwie habe ich auch nicht das Gef&uuml;hl dass Twitter noch lange im Zentrum der Aufmerksamkeit bleibt... Es war ein netter Hype und sie h&auml;tten damit jede Menge Leute erreichen k&ouml;nnen, doch mit fehlenden Funktionen (der Jabber-Bot kann ja &uuml;berhaupt nichts sinnvolles -.-) und st&auml;ndigen Downzeiten werden die bald, au&szlig;er jeder Menge Karteileichen und ein paar Alpha-Twitterern die das ganze wie einen Chat verwenden, nicht mehr viele aktive Nutzer haben.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_123" onclick="set_comment_reference(123)" title="auf diesen Kommentar antworten">#123</a>:
    26.May.2008 08:05
    von
    
      
        <a href="http://www.hirner.at" target="_blank">
          helmeloh
        </a>
</p>
<p>Bei einem PR 8 kann ich mich der headline nicht unbedingt anschlie&szlig;en, aber den Sinn habe ich noch nicht ganz durchsschaut.<br/>
alpha-, beta-, gamma-twitterer vermag ich auch nicht zu untrscheiden. Aber ich wei&szlig;, dass die Startseite, obwohl quasi nichts drauf ist, 33 HTML-Fehler aufweist und dass man sich das Blog kaputt macht, wenn man den angebotenen source auf der eigenen Seite einbindet. LG, Helmut</p>

<p class="infos">
<a href="#comment_124" onclick="set_comment_reference(124)" title="auf diesen Kommentar antworten">#124</a>:
    26.May.2008 11:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ich nehme mal an, PR soll wohl Pagerank sein, das Wertungssystem f&uuml;r die Bekantheit einer Webseite, das von Larry Page entwickelt wurde.</p>
<p>Nat&uuml;rlich ist Twitter derzeit &uuml;berall verlinkt und sorgt f&uuml;r einen gro&szlig;en Hype. Jedoch beschr&auml;nkt sich diese Verlinkung derzeit auf einen ziemlich elit&auml;ren Kreis der wenigsten Geeks und Nerds. Ottonormalnutzer wissen meistens noch nichtmal von Blogs, die werden die Links von selbigen auf Twitter auch nicht sofort wahrnehmen. Bis sich die Nachricht von Twitter weiter verbreitet hat, wird der Dienst an sich bereits soviele F&uuml;rsprecher verloren haben, dass sich der Hype totl&auml;uft.<br/>
Twitter hatte durchaus das Zeug zum "Next big Thing", hat sich aber in den letzten Wochen eher zur&uuml;ck als nach vorn entwickelt und zeigt mit seinen vielen Abst&uuml;rzen eindeutig nicht genug Ausdauer um richtig gro&szlig; zu werden.<br/>
Kurz: HEY TWITTER-TYPEN! IHR HABTS VERBOCKT!</p>

<p class="infos">
<a href="#comment_125" onclick="set_comment_reference(125)" title="auf diesen Kommentar antworten">#125</a>:
    19.Jan.2009 01:01
    von
    
      
        <a href="/2009/01/19/friendfeedlastfm/" target="_blank">
          Friendfeed/Last.FM &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] Microblogging trifft man nat&uuml;rlich auch automatisch auf Twitter. Ich pers&ouml;nlich bin mit Twitter allerdings nie so wirklich warm geworden und habe auch nicht die geringste Anwendungsm&ouml;glichkeit f&uuml;r mich gefunden. Wenn man dort eine [...]</p>
</div>