+++
title = "Yaml"
date = "2008-10-17T03:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/960"
aliases = "blog/960"
+++

<p>Ich habe ja bereits mehrmals auf das Yaml-Format hingewiesen (<a href="http://www.yaml.org/" target="_blank">offizielle Homepage</a>, <a href="http://de.wikipedia.org/wiki/YAML" target="_blank">Wikipedia-Artikel</a>) und ich verwende es auch in diversen Projekten derzeit recht erfolgreich. In diesem Artikel m&ouml;chte ich kurz erl&auml;utern was Yaml eigentlich ist und wie es verwendet wird.<!--more--><br/></p><h2>Grunds&auml;tzliches</h2><br/>Bei Yaml handelt es sich um ein Format zur Darstellung von Datenstrukturen. Was Yaml nicht ist, ist ein Austauschformat wie XML bei dem so ziemlich jede Platform problemlos die kompliziertesten Systeme darstellen soll. Weiterhin sollte man niemals Tabs in Yaml-Dateien verwenden, schon garnicht mit Leerzeichen vermischt. Da der Parser dann nat&uuml;rlich nicht mehr genau wissen kann was wie lang ist, k&ouml;nnen die seltsamsten Effekte auftreten.<br/>Eine Yaml-Datei enth&auml;llt keinerlei Definitionen in welchem Zeichencode sie geschrieben ist, man kann f&uuml;r yaml kaum eine Definition aufstellen welcher Datentyp wo erwartet ist und Yaml kann auch stellenweise schwer dazu gebracht werden ALLE Sonderzeichen gleichzeitig in einem String zu akzeptieren.

<p>Das ist allerdings auch alles nicht n&ouml;tig, denn Yaml dient einem v&ouml;llig anderem Zweck und verfolgt daher auch andere Ziele.<br/>Yaml versucht sich auf ein Mindestma&szlig; an komplexit&auml;t zu beschr&auml;nken, ohne die darstellbaren Daten einzuschr&auml;nken. Daf&uuml;r bedient sich Yaml nur 3er Konzepte: assoziative Listen, Arrays und Einzelwerte.<br/>Ein weiteres Kernkonzept ist diese Konzepte m&ouml;glichst gut lesbar darzustellen.<br/><code><span><br/>Array:<br/>&nbsp;&nbsp;&nbsp;&nbsp;- eintrag1<br/>&nbsp;&nbsp;&nbsp;&nbsp;- eintrag2<br/>&nbsp;&nbsp;&nbsp;&nbsp;- eintrag3<br/></span></code><br/><code><span><br/>assoziative Liste:<br/>&nbsp;&nbsp;&nbsp;&nbsp;blah: Eintragstext 1<br/>&nbsp;&nbsp;&nbsp;&nbsp;blubb: 'Eintragstext mit diversen Sonderzeichen "&sect;!&sect;!"&sect;&amp;&sect;&amp;$&sect;@@**'<br/>&nbsp;&nbsp;&nbsp;&nbsp;foo:   "weitere sonderzeichen''''''"<br/></span></code><br/><code><span><br/>einzelwert: blubb<br/></span></code><br/><code><span><br/>Kombi-Typen:<br/>&nbsp;&nbsp;&nbsp;&nbsp;beispiel1: 'Ich bin ein Text'<br/>&nbsp;&nbsp;&nbsp;&nbsp;beispiel2:<br/>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- 'Ich bin auch Text'<br/>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- 'Ich bin erst recht Text'<br/>&nbsp;&nbsp;&nbsp;&nbsp;- 'Na und ich erst! Ich hab sogar Leerzeichen am Ende!&nbsp;&nbsp;&nbsp;&nbsp;'<br/></span></code><br/>Die Elemente kann man nat&uuml;rlich jeweils schachteln und so auch komplexere Datenstrukturen darstellen. Ein etwas komplexeres und realit&auml;tsnahes Beispiel findet ihr z.B. in der <a href="http://code.google.com/p/pychao/source/browse/trunk/config.main.yaml" target="_blank">Haupt-Config von pyChao</a>.<br/></p><h2>Verwendung</h2><br/>Hier mal ein Codebeispiel in Python damit ihr seht wie einfach die Verwendung von Yaml-Daten ist:<br/><code><span><br/>import yaml<br/>f =open('config.yml')<br/>config = yaml.load(f.read())<br/></span></code><br/>wenn wir also mal annehmen wir h&auml;tten mit config.yml das Beispiel von oben ausgew&auml;hlt, k&ouml;nnen wir jetzt z.B. mit config['Array'][2] dem Text 'eintrag3' erhalten und mit config['Kombi-Typen']['beispiel1'] den String 'Ich bin ein Text'.<br/>Alles funktioniert wunderbar so, wie wir es von Python gewohnt sind und wir k&ouml;nnen ohne gro&szlig;en Programmieraufwand viel erreichen.

<p>Andere Sprachen bringen andere Ans&auml;tze, <a href="http://www.symfony-project.org/book/1_0/05-Configuring-Symfony" target="_blank">so wandelt z.B. das PHP-Framework Symfony Yaml-Dateien automatisch in PHP-Quellcode</a> um und aktualisiert diesen nur wenn sich etwas an der Datei ge&auml;ndert hat. Das gibt nat&uuml;rlich einen gewissen Geschwindigkeitsvorteil, au&szlig;erdem erm&ouml;glicht es PHP-Code direkt im Yaml-Code zu verstecken. (Aber versucht blo&szlig; nicht solche Dateien dann unter Python, Ruby oder Javascript zu &ouml;ffnen!)</p>
<p>Weiterf&uuml;hrende Links:<br/></p><ul><br/> <li><a href="http://yaml.kwiki.org/?YamlInFiveMinutes" target="_blank">Yaml in 5min</a></li><br/> <li><a href="https://jvyaml.dev.java.net/" target="_blank">Yaml in Java</a></li><br/> <li><a href="http://www.yaml.org/spec/" target="_blank">Yaml-Spezifikation</a></li><br/> <li><a href="http://yaml4r.sourceforge.net/cookbook/" target="_blank">Ruby Yaml-Kochbuch</a></li><br/></ul>
