+++
title = "Das Suchen und Finden der... Zukunft."
date = "2009-06-06T02:06:00"
author = "kleine Zuzi"
issoid = "blog/1407"
aliases = "blog/1407"
+++

<p>"Was soll nur aus dem M&auml;del/Jungen werden... schon x Jahre alt und immer noch keine Ausbildung!" - Wie liebe&nbsp; ich solche S&auml;tze. Besonders von Menschen im Rentenalter, die der &Uuml;berzeugung sind, dass fr&uuml;her alles besser war.<!--more--> Am besten kommt sowas dann aber auch noch im Zusammenhang mit dem wunderbaren, aus der Feder eines durch seltsame Elefanten einschl&auml;gig bekannten deutschen Komikers stammenden Spitznamen "Susi Sorglos".</p>
<p>Mal ehrlich: Wie kann jemand ernsthaft glauben, dass man sich mit &uuml;ber 20 Jahren nicht dann doch die eine oder andere Stunde Kopfzerbrechen um den eigenen beruflichen Werdegang macht?&nbsp; Betrachten wir doch einmal die Fakten: Meine Familie ist durch den Studienabbruch meines Bruders mittlerweile desillusioniert, was den Traum von perfekten Kindern mit einer prima Laufbahn angeht. Ich werde demn&auml;chst 22 und kann bisher nicht viel mehr vorweisen als ein mittelm&auml;&szlig;iges Abitur und zwei Jahre eher sinnfreies Sprachstudium, das ich nun auch nicht abschlie&szlig;e. Gut, im Vergleich zu manch einem Hartz-IV-Empf&auml;nger&nbsp; mag das schon viel sein, aber Geld verdienen l&auml;sst sich damit trotzdem nicht, zumal ich auch in der Nebenjobsuche kein besonderer Gl&uuml;ckspilz bin. Und nun bin ich an dem Punkt angelangt, ab September ein Jahr FSJ zu machen, um mir &uuml;ber meinen Berufswunsch klar zu werden.</p>
<p>&Uuml;berraschenderweise bin ich mit dieser Entscheidungsunf&auml;higkeit im "hohen" Alter aber ganz und gar nicht die Einzige. Mir fallen spontan mindestens drei Freundinnen ein, denen es genauso geht, und die werden im Gegensatz zu mir sogar demn&auml;chst ihr Studium erfolgreich abschlie&szlig;en. Da stellt sich jetzt die Frage: Gibt es nun zu wenige oder zu viele M&ouml;glichkeiten der beruflichen Laufbahn?</p>
<p>In meinem Fall ist es irgendwie beides. <strong>Theoretisch </strong>gibt es wirklich viele. Immerhin habe ich Abitur! Und wem wurde nicht auf dem Gymnasium eingeredet, dass einem mit der allgemeinen Hochschulreife quasi alle T&uuml;ren offen stehen? <strong>Theoretisch</strong> k&ouml;nnte ich zum Beispiel Maschinenbau studieren. Oder Chemie. Oder Mathematik. All das w&auml;re problemlos m&ouml;glich, auch mit meinem mittelm&auml;&szlig;igen Abiturdurchschnitt. Das Dumme ist nur: All das interessiert mich nicht die Bohne. Mathe war mir immer egal, f&uuml;r den Lernstoff der naturwissenschaftlichen F&auml;cher war ich meist zu lernfaul und mit gro&szlig;en Maschinen habe ich auch eher wenig am Hut (wie mir jahrelange detaillierte Ausf&uuml;hrungen meines Vaters und heute auch meines Freundes immer wieder best&auml;tigen). Ich bin aber auch nicht talentfrei. Ich kann Gedichte schreiben, ich bin musikalisch, habe ein gutes Sprachgef&uuml;hl, ich bastle gern und ich liebe es, M&ouml;bel auf- und abzubauen und W&auml;nde zu streichen. Doch hier lauert die n&auml;chste dumme Kleinigkeit: All das sind "brotlose K&uuml;nste", wenn man ein kleines, zartes M&auml;dchen ist (denn mit Streichen oder M&ouml;belbauen kann man durchaus Geld verdienen, nur erfordert das im Normalfall eine gewisse Muskelkraft). Und die Berufe, die mich interessieren w&uuml;rden, scheitern an der Situation des Arbeitsmarktes oder am Numerus Clausus.</p>
<p>Und deswegen sitze ich nachts in meiner Wohnung und bin so gar nicht Susi Sorglos: Mein Plan, bis 25 das erste Kind zu haben, wird nicht aufgehen. Mein Kindheitstraum, Schriftstellerin zu werden, wird sich wohl auch kaum erf&uuml;llen. Und irgendwie fragt man sich, wieviele Pl&auml;ne und Tr&auml;ume man eigentlich platzen lassen muss, bis man endlich seinen Traumjob hat - Und ob nicht der sich auch irgendwann als Seifenblase herausstellen wird...</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1310" onclick="set_comment_reference(1310)" title="auf diesen Kommentar antworten">#1310</a>:
    06.Jun.2009 02:06
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          sirsnookie
        </a>
</p>
<p>Naja wissen kann man sowas nie, ich habe &auml;hnliche Probleme, ich studiere Medienproduktion wo ca. 98% der Leute nix mit anfangen k&ouml;nnen, geschweige denn die Betriebe. Ich bin im 4. Semester und hab noch 4 Sperrf&auml;cher vor mir.</p>
<p>Bei den M&ouml;beln w&uuml;rd mir noch Innenarchitektur einfallen, die n&auml;chste Tine im TV ;)</p>

<p class="infos">
<a href="#comment_1311" onclick="set_comment_reference(1311)" title="auf diesen Kommentar antworten">#1311</a>:
    06.Jun.2009 09:06
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Tr&ouml;ste Dich: Selbst mit Traumjob muss man nicht unbedingt gl&uuml;cklicher sein.</p>

<p class="infos">
<a href="#comment_1312" onclick="set_comment_reference(1312)" title="auf diesen Kommentar antworten">#1312</a>:
    06.Jun.2009 02:06
    von
    
      
        foo
      
    
    
  </p>
<p>Studier doch ne Mischung aus Informatik, Biologie, Kuenstliche Intelligenz, Psychologie, Mathe, Philosophie, Robotik und Linguistik. Nennt sich auch "Cognitive Science" und das gibts an der Uni Osnabrueck. Sind uebrigens nicht von ungefaehr mehrfacher Roboterfussballweltmeister (<em>bastel</em>)</p>
<p>Von allem ein bischen und einen NC hat das ganze auch nicht.</p>

<p class="infos">
<a href="#comment_1313" onclick="set_comment_reference(1313)" title="auf diesen Kommentar antworten">#1313</a>:
    06.Jun.2009 03:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Bei Eris... alleine die Vorstellung! Kinder von deiner Sorte... <em>duck und renn</em></p>
<p>Aber @topic: das Problem kennst  wohl bei weitem nicht nur du "Ich habe jetzt einen festen Job" - "Aber willst du nicht doch lieber weiterstudieren? Dann h&auml;ttest du sp&auml;ter bestimmt mal bessere Chancen auf einen Job" o0</p>

<p class="infos">
<a href="#comment_1314" onclick="set_comment_reference(1314)" title="auf diesen Kommentar antworten">#1314</a>:
    06.Jun.2009 05:06
    von
    
      
        foo
      
    
    
  </p>
<p>Naja, das ist ein studiengang, bei dem man selbst keine antwort auf die frage "und was macht man damit spaeter?" kennt. wer hier fertig mit dem studium ist bewirbt sich in der regel auf irgendeinen master, der dann das (inzwischen eingegrenzte) interessengebiet bedient. nennenswerte jobchancen hat man bei dem studiengang eh keine. hoechstens headhunter koennten lunte riechen, bei dem inhaerent interdisziplinaer angelegten studiengang. aber das geht den meisten hier am arsch vorbei... drei von meinen bekannten sind mittlerweile in boston am MIT, eine am CalTech. das liegt aber an der einstellung. was viele die uns nach den berufsperspektiven fragen nicht verstehen ist, dass hier jeder seine individuelle perspektive hat. man kann nicht pauschal fuer alle antworten. und das ist das hauptproblem denke ich. leute erwarten eine antwort von der stange, wenn sie nach der zukunft fragen. wenn sie die tatsaechliche antwort dann keiner der ueblichen kategorien zuordnen koennen fallen sie schnell zurueck auf den kleinsten gemeinsamen nenner sozusagen: "wie du bist 20 und hast nur abi und sonst nix?"</p>

<p class="infos">
<a href="#comment_1315" onclick="set_comment_reference(1315)" title="auf diesen Kommentar antworten">#1315</a>:
    06.Jun.2009 06:06
    von
    
      
        <a href="http://codeschmie.de" target="_blank">
          fa
        </a>
</p>
<p>Die "schon 20 und noch keine Laufbahn geplant"-Sager sind halt dann doch meistens die Leute, die mit 16 nach Mittlerer Reife (oder noch besser 14-15 nach der Hauptschule) ihre Lehre angefangen haben. Und ich hab eigentlich auch noch nie geh&ouml;rt, dass jemand in den 60ern-80ern monatelang nach einer Lehrstelle gesucht hat. Nicken und freundlich l&auml;cheln...</p>

<p class="infos">
<a href="#comment_1316" onclick="set_comment_reference(1316)" title="auf diesen Kommentar antworten">#1316</a>:
    08.Jun.2009 09:06
    von
    
      
        <a href="http://ag7.alltagsgrauen.info/" target="_blank">
          fwolf
        </a>
</p>
<p>M&ouml;beln .. ja ... Brotlose "Kunst". Als Tischler! Meine beste Freundin ist grad kurz vor Abschlu&szlig; ihres dritten Lehrjahrs, alle Pr&uuml;fungen schon abgeschlossen, Gesellenst&uuml;ck in B&auml;lde in Arbeit.</p>
<p>cu, w0lf.</p>

<p class="infos">
<a href="#comment_1317" onclick="set_comment_reference(1317)" title="auf diesen Kommentar antworten">#1317</a>:
    14.Jun.2009 12:06
    von
    
      
        lexar
      
    
    
  </p>
<p>ich glaube, da bist du wirklich nicht die Einzige!<br/>
Ich schlie&szlig;e zwar im Herbst mein Studium ab (BA) und hab keine Lust auf MA, sondern w&uuml;rde gerne arbeiten.<br/>
Was ich aber gerne arbeiten w&uuml;rde und was ich studiert habe, sind zwei v&ouml;llig andere Welten!<br/>
Ich hoffe einfach mal irgendwie quer einsteigen zu k&ouml;nnen... und wenn das alles nix wird, dann muss ich wohl oder &uuml;ber doch wieder an die Uni zur&uuml;ck :(</p>
<p>wuaah...</p>

<p class="infos">
<a href="#comment_1318" onclick="set_comment_reference(1318)" title="auf diesen Kommentar antworten">#1318</a>:
    30.Jul.2009 04:07
    von
    
      
        <a href="http://identi.ca/notice/7252942" target="_blank">
          Oliver Herold (olhe) 's status on Thursday, 30-Jul-09 14:40:35 UTC - Identi.ca
        </a>
</p>
<p>[...]  Das Suchen und Finden der&hellip; Zukunft. &laquo; G33KY^2 &ndash; The Nerd Strikes Back... [...]</p>
</div>