+++
title = "Shoot@Linux"
date = "2008-10-01T01:10:00"
author = "Dr. Azrael Tod"
tags = ["\"Freie\" Software", "Open Source", "PC", "Softwareschrott"]
issoid = "blog/839"
aliases = "blog/839"
+++

<p>Heute gehts mal um Egoshooter unter Linux, genauer um actionreichere Ballerspiele al&aacute; Quake3 (und weniger um "Taktik"-Shooter wie Counter Strike). Ich beschr&auml;nke mich mal rein auf Dinge die nativ unter Linux laufen, Wine-Emulation (ja: "Wine is no Emulator", es handelt sich nur um die Bereitstellung der Bibliotheken) mag durchaus ihren Sinn haben, aber eine andere Platform abzubilden ist nicht gerade das sinnvollste aller Vorhaben wenn es um Geschwindigkeit geht.</p>
<p><!--more-->Wenn wir schon von Quake3 geredet haben, ist es nur sinnvoll als erstes auch mit dem Spiel zu beginnen das diesem am n&auml;chsten kommt: <a href="http://de.wikipedia.org/wiki/OpenArena" target="_blank">OpenArena</a> dieser Shooter basiert direkt auf den Quellen von Quake 3 und erg&auml;nzt die Engine nur noch um s&auml;mtlichen Spielinhalt. Dies aber immer unter dem Vorsatz m&ouml;glichst nahe am Spielgef&uuml;hl des Stammvaters zu bleiben. Leider gibt es im Moment die aktuelle Version aus rechtlichen Gr&uuml;nden (einer der Beteiligten hat illegal kopierten Content in die Distribution eingeschleust) nicht <a href="http://openarena.ws/" target="_blank">auf dem Originalserver</a>, dies &auml;ndert sich aber mit dem n&auml;chsten Release, au&szlig;erdem gibt es ja auch f&uuml;r Leute die es nicht erwarten k&ouml;nnen genug alternative Quellen und f&uuml;r ganz experimentierfreudige auch noch einen <a href="http://openarena.ws/svn.html">SVN-Link</a>.</p>
<p>Ein weiteres Spiel auf der selben Q3-Basis ist <a href="http://en.wikipedia.org/wiki/CodeRED:_Alien_Arena" target="_blank">AlienArena</a> (<a href="http://red.planetarena.org/" target="_blank">Homepage</a>),  bei diesem wurde das Spiel doch ein ganzes St&uuml;ck ver&auml;ndert, das Spielverhalten selbst bleibt allerdings &auml;hnlich. Die Grafik ist ein St&uuml;ck besser als bei Q3/OpenArena, dies wirkt sich aber dann nat&uuml;rlich auch (auf aktuellen PCs unsp&uuml;rbar) auf die Performance aus.</p>
<p><a href="http://de.wikipedia.org/wiki/World_of_Padman" target="_blank">World of Padman</a> ist das dritte und letzte Spiel auf Q3-Basis das ich hier nennen will. Urspr&uuml;nglich handelte es sich dabei um einen Mod f&uuml;r Q3A, mit Ver&ouml;ffentlichung des Quellcodes wurde aber auf ein <a href="http://padworld.myexp.de/" target="_blank">eigenst&auml;ndiges Spiel</a> umgeschwenkt. Bei Padman rennt man als Comic-Minifig&uuml;rchen durch wahnsinnig kreativ gestaltete, normale Zimmer. Diese erscheinen aufgrund der eigenen Gr&ouml;&szlig;e v&ouml;llig als Ausreichend, auch f&uuml;r das gr&ouml;&szlig;te Gemetzel. Wer schon immer mal im Blumentopf oder auf der Herdplatte Gegner erledigen wollte, f&uuml;r den ist dieses Spiel ideal.</p>
<p><a href="http://de.wikipedia.org/wiki/Unreal_Tournament_2004" target="_blank">UT2004</a> wird wohl das einzige rein kommerzielle Spiel in dieser Liste bleiben, die Zielplatform ist zwar leider nicht gerade haupts&auml;chlich Linux aber mit ein paar <a href="http://www.holarse-linuxgaming.de/wiki/unreal_tournament_2004" target="_blank">Tricks und Patches vom Hersteller</a> l&auml;sst es sich ganz passabel unter Linux zum laufen bringen. Da es wohl mit Abstand das bekannteste Spiel ist werde ich wohl nicht viele Worte dazu verlieren m&uuml;ssen.</p>
<p>Auf einer v&ouml;llig anderen und eigenen <a href="http://cubeengine.com/" target="_blank">Engine</a> l&auml;uft <a href="http://de.wikipedia.org/wiki/Cube_2:_Sauerbraten" target="_blank">Cube2: Sauerbraten</a>. <a href="http://sauerbraten.org/" target="_blank">Dieses Spiel</a> ist wohl das anpassungsf&auml;higste und umfangreichste aller hier vorgestellten. Da die Cube-Engine derartig viele Sonderfunktionen bietet (die wichtigste: Karten-Editieren w&auml;hrend des Spieles, dies erm&ouml;glicht z.B. den einmaligen "Spielmodus" Coop-Edit, dies bewegte selbst mich bereits <a href="/2007/8/6/Sauerbraten-Map:-Industrial-Complex">zu kleineren Spielereien</a>.) dass es hier den Rahmen sprengen w&uuml;rde, werde ich es gleich lassen sie aufzuz&auml;hlen. Die verf&uuml;gbaren Spielmodies zeichnen sich ebenfalls durch eine enorme Vielfalt aus, ganz zu schweigen von den Karten. Die Engine brachte &uuml;brigens auch noch andere Projekte hervor, zu nennen w&auml;ren vor allem Cube (der Vorg&auml;nger von Sauerbraten), <a href="http://assault.cubers.net" target="_blank">AssaultCube</a> (liegt eher bei CS als bei Q3A, basiert auf Cube 1) und das erst angek&uuml;ndigte aber unfertige <a href="http://eisenstern.com">"Eisenstern"</a> (ein 3D Rollenspiel mit riesigen Welten)</p>
<p>Weitere Spiele, die ich hier nur kurz nenne m&ouml;chte w&auml;ren z.B. <a href="http://de.wikipedia.org/wiki/Wolfenstein:_Enemy_Territory" target="_blank">Wolfenstein: Enemy Territory</a>, <a href="http://www.warsow.net" target="_blank">War&sect;ow</a> und <a href="http://www.alientrap.org/nexuiz/" target="_blank">Nexuiz</a>.<br/>Ersteres ist einer dieser "Taktikshooter", der aber auf der Q3-Engine aufbaut und eigentlich auch einen ziemlichen Bekanntheitsgrad erreicht hat, das Mittlere ist ein sehr schneller Shooter mit <a href="http://en.wikipedia.org/wiki/Cel-shading" target="_blank">Cel-Shading</a>-Grafik, der sich mehr auf das Spielverhalten konzentriert als auf das ganze "Drumherum" und letzteres ein schnelles Spiel mit etwas anspruchsvollerer Grafik, das bereits mehr UT2K4 als Q3A &auml;hnelt.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_696" onclick="set_comment_reference(696)" title="auf diesen Kommentar antworten">#696</a>:
    01.Oct.2008 03:10
    von
    
      
        <a href="http://crackpod.bplaced.net/" target="_blank">
          CracKPod
        </a>
</p>
<p>"Urban Terror" hast du vergessen!<br/>
<a href="http://www.urbanterror.net/%3C/p%3E" rel="nofollow">http://www.urbanterror...</a>
</p>
<p class="infos">
<a href="#comment_697" onclick="set_comment_reference(697)" title="auf diesen Kommentar antworten">#697</a>:
    01.Oct.2008 04:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>&ouml;hm.. n&ouml;<br/>
Das kannte ich einfach noch nicht...<br/>
Also danke f&uuml;r den Link, werds mir mal ansehen. :-)</p>

<p class="infos">
<a href="#comment_698" onclick="set_comment_reference(698)" title="auf diesen Kommentar antworten">#698</a>:
    01.Oct.2008 07:10
    von
    
      
        zypral
      
    
    
  </p>
<p>Entweder du hast es vergessen, wolltest es nicht dazu schreiben oder kanntest es nur nicht:</p>
<p>Enemy Territory: Quake Wars</p>
<p>Ist ein kommerzielles Spiel, welches ich mir gekauft habe (und das hat schon was zu bedeuten, so als Nicht-Spieler) und, gerade auch weil es, nativ unter Linux l&auml;uft.</p>
<p>http://www.enemyterritory.com/<br/>
<a href="http://de.wikipedia.org/wiki/Enemy_Territory:_Quake_Wars%3C/p%3E" rel="nofollow">http://de.wikipedia.or...</a>
</p>
<p class="infos">
<a href="#comment_699" onclick="set_comment_reference(699)" title="auf diesen Kommentar antworten">#699</a>:
    01.Oct.2008 10:10
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Ui, Sauerbraten. W&auml;r das Spiel nicht wirklich gut w&uuml;rd ich es nur wegen des Namens spielen.</p>
<p>War&sect;ow sieht klasse aus, ich steh auf Cel-Shading, ich steh auf Q3:A... muss ich dringend mal antesten.</p>

<p class="infos">
<a href="#comment_700" onclick="set_comment_reference(700)" title="auf diesen Kommentar antworten">#700</a>:
    01.Oct.2008 10:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Quake Wars ist durchaus nennenswert... l&auml;uft jedoch einfach nicht auf meinem altersschwachem Notebook.<br/>
Von daher konnte ich mir noch keine wirkliche Meinung bilden und w&uuml;rde auch nicht das Geld ausgeben, nur um es ausf&uuml;hrlich zu testen.</p>

<p class="infos">
<a href="#comment_701" onclick="set_comment_reference(701)" title="auf diesen Kommentar antworten">#701</a>:
    03.Nov.2008 01:11
    von
    
      
        <a href="http://g33ky.de/2008/11/3/Verspieltes:-OpenArena" target="_blank">
          Verspieltes: OpenArena &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] PC-Spielen besch&auml;fftigt. Genauer gesagt mit einem: dem Q3A-Abk&ouml;mmling OpenArena &uuml;ber den ich ja bereits berichtet [...]</p>
</div>