+++
title = "Schubladendenken"
date = "2009-01-06T01:01:00"
author = "Dr. Azrael Tod"
issoid = "blog/1158"
aliases = "blog/1158"
+++

<p>&nbsp;</p>
<p>Immer wieder treffe ich auf Menschen die sich wunderbar in Schubladen einordnen lassen wollen und das automatisch auch von anderen annehmen.</p>
<p>Das nimmt teilweise recht absurde Z&uuml;ge an, wenn jemand sich wundert dass ich Gothrock oder Metal anh&ouml;re, obwohl ich mich nichtmal ann&auml;hernd so gekleidet habe, als w&uuml;rde ich zu der passenden Subkultur passen.<!--more--></p>
<p>Andere fragten mich z.B. wer in welche Gruppe einzuordnen sei und mussten gleich Mutma&szlig;ungen bez&uuml;glich aller m&ouml;glicher gemeinsamer Bekannten abgeben. ("Du bist doch sicher son Techno-Freak und deine Schwester h&ouml;rt doch bestimmt Emo oder so." oder "Du und Gothik? Du wei&szlig;t schon von welcher Musikrichtung ich rede oder?")</p>
<p>&nbsp;</p>
<p>Warum sollte meine Art mich zu kleiden auch nur im geringsten davon beeinflusst sein welche Musik ich anh&ouml;re? Ist es wirklich so unglaubw&uuml;rdig dass ich Kleidung danach ausw&auml;hle ob sie mir gef&auml;llt? Oder ist es unglaubw&uuml;rdig dass ich mich nicht selbst rein als zugeh&ouml;riger zu einer einzelnen, oberfl&auml;chlichen Subkultur sehen will?</p>
<p>&nbsp;</p>
<p>Wenn meine Stimmung passt h&ouml;re ich gerne JEGLICHE Art von Musik, ob es nun Klassik, Metal, Gothrock, Chiptune, Synthpop oder (was verdammt oft der Fall ist) irgendwas im weiten Feld zwischen Gabber, Acid und Trance ist. Die einzigen Musikrichtungen die ich wirklich davon ausnehmen w&uuml;rde, sind Dinge die ich ablehne weil sie mir zu eint&ouml;nig sind (z.B. "Volksmusik" wobei ich unter dem Begriff eh was anderes verstehen w&uuml;rde als dieser Musikantenstadtl-Bl&ouml;dsinn) und nat&uuml;rlich HipHop, weil ich doch gerne bei Musik bleiben m&ouml;chte. (Das oft als "Abiturientenhiphop" abgewertete Gebiet hingegen finde ich wieder ganz brauchbar... eine Musikrichtung die sich haupts&auml;chlich auf Texte reduziert kann sogar brauchbar sein wenn Texte vorhanden sind.)</p>
<p>&nbsp;</p>
<p>Nat&uuml;rlich bezieht sich diese Klassifizierung nicht alleine auf Musik. Jemand der Techno anh&ouml;rt muss scheinbar laut der Meinung einiger Leute automatisch permanent auf Drogen sein, seine Haare mit viel Gel wirr nach oben geklebt und bunt gef&auml;rbt haben und politisch v&ouml;llig desorientiert sein. Jemand aus der Gothik-Fraktion muss Nieten an allen Klamotten tragen, darf eigentlich nur Schwarz tragen (ok, farblich beinahe ein Treffer), den ganzen Tag im Dunkeln verbringen und st&auml;ndig aggressiv auf kleine Kinder und alte Leute losgehen (naja, manchmal k&ouml;nnte man fast..).</p>
<p>&nbsp;</p>
<p>Welche Drogen muss man einnehmen um derartig wirre Ideen zu entwickeln? Wie kann man ernsthaft vermuten dass die Menschen sich derartig Flach in vlt. 3-4 Kisten einteilen lassen? Und die wichtigste Frage von allen: Wie sehr muss jemand um Anerkennung aus einer derartigen Gruppe ringen, dass er sein ganzes Leben, von Kleidung, Musik, &uuml;ber politische Ansichten, bis hin zu seinem Tagesablauf komplett an einer Gruppe seiner 2-3 Kumpels ausrichtet?</p>
<p>&nbsp;</p>
<p>Wahrscheinlich hab ich schon immer zu sehr versucht mich eben NICHT in irgendwelche Kisten stecken zu lassen, um diesen Drang nach Konformit&auml;t noch zu verstehen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1042" onclick="set_comment_reference(1042)" title="auf diesen Kommentar antworten">#1042</a>:
    06.Jan.2009 01:01
    von
    
      
        stanzebla
      
    
    
  </p>
<p>Das liegt am Alter, bei vielen h&ouml;rt das irgendwann auf. Da das Interesse an Musik nicht wirklich Interesse an Musik war sondern "Jugend", h&ouml;ren sehr viele f&uuml;r immer die Musik aus jener Zeit, egal wie sie sich am Arbeitsplatz kleiden. Davon leben Bands wie die Rolling Stones.<br/>
Kinder von Leuten die Goth oder Hip Hop h&ouml;ren werden diese Musik meist auch eine Weile m&ouml;gen. Meine Eltern hatten James Last Kassetten, die H&ouml;lle. Heutzutage sagt meine Mutter sie sei sehr modern, denn sie h&ouml;rt die Flippers.</p>
<p>Das Schubladendings ist ein Ph&auml;nomen, das mit dem Erwachsenwerden zu tun hat. Hilfe wer bin ich? Es ist einfacher jemand zu sein, den es so schon gibt, weniger gruselig. Selbst wenn ein Jugendlicher rebellieren m&ouml;chte, ist es am einfachsten "Rebellionsmusik" zu h&ouml;ren und "Rebellionskleider" zu tragen anstatt sich komplett selbst zu definieren.</p>
<p>Ich war mal zweite Vorsitzende von einem Punkkulturverein, und konnte da ein paar Beobachtungen machen, die den P&auml;dagogik, Sozialkunde oder was auch immer das f&uuml;r ein Unterricht war, in dem sie mir das sowieso an der Schule beigebracht haben (bringen die euch denn gar nichts mehr bei? :P ), vertieften.</p>
<p>In echt ist das ungef&auml;hr so: alle Menschen sind gleich, es ist  immer m&ouml;glich eine Parallele zu jemandem andern zu finden, wenn die Begegnung in friedlichem Rahmen stattfindet und Kommunikation m&ouml;glich ist, aber es sind auch alle verschieden. Der Abgrund zwischen dem Ich und dem Du ist dermassen tief und weit, dass man selbst als Kommunikationsk&uuml;nstler nur eine Ann&auml;herung an das Wesen des anderen machen kann und keinen anderen ganz verstehen kann.</p>
<p>Wir sind gleich weil wir Menschen sind, aber verschieden weil wir andere Erfahrungen gemacht haben. Ich will auch nicht ausschliessen, dass es so etwas wie eine Seele gibt und bestimmte Eigenschaften daher r&uuml;hren.</p>
<p>Hier k&auml;me dann "m&ouml;gen" ins Spiel. Jemanden verstehen heisst nicht unbedingt ihn/sie/es auch zu m&ouml;gen, und jemanden nicht zu verstehen kann denjenigen gerade interessant machen. Der Mensch ist nicht nur des Menschen Wolf sondern auch noch selbst Schuld dran.</p>
<p>:)</p>

<p class="infos">
<a href="#comment_1043" onclick="set_comment_reference(1043)" title="auf diesen Kommentar antworten">#1043</a>:
    06.Jan.2009 02:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ich muss dich begl&uuml;ckw&uuml;nschen... du hast es geschafft eine Erkl&auml;rung f&uuml;r solches Verhalten zu finden, die fast genauso generalisierend wirkt wie das Verhalten selbst.</p>
<p>Ich kann selbst nur von mir pers&ouml;nlich ausgehen, der ich mich auch in meiner fr&uuml;hesten Jugend nicht wissentlich in einer solchen Phase befunden habe. Auch in meinem Umfeld ist mir sowas nur bei den wenigsten aufgefallen (vlt. auch nicht unbedingt bei den Personen die von Natur aus die tiefgr&uuml;ndigsten Pers&ouml;nlichkeiten haben, aber das ist schwer zu belegen).</p>
<p>Von daher kann ich deiner Argumentation nicht zustimmen.</p>

<p class="infos">
<a href="#comment_1044" onclick="set_comment_reference(1044)" title="auf diesen Kommentar antworten">#1044</a>:
    06.Jan.2009 03:01
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>Mhmmm ... (auch auf die Gefahr hin, das ich mir hier wiederhole XD)</p>
<p>Die Frage zum Schubladendenken ist wie der "Die Jugend von heute ..." Ausspruch.<br/>
Das sich diese Ansichten und Denkweisen weiterentwickeln M&Uuml;SSTEN w&auml;hre nur eine logische Folge des Fortschritts unserer Gesellschaft ... dummerweise entwickelt sich allerdings nur ein sehr kleiner Teil weiter.</p>
<p>Und, wie heisst es doch so sch&ouml;n ... die Dummen sterben eben nie aus ^^</p>

<p class="infos">
<a href="#comment_1045" onclick="set_comment_reference(1045)" title="auf diesen Kommentar antworten">#1045</a>:
    07.Jan.2009 01:01
    von
    
      <a href="/blog/author/kleinezuzi/">
        kleinezuzi
      </a>
</p>
<p>Ich h&ouml;re Emo?? OMFSM, wer kam nur auf die Idee...?</p>

<p class="infos">
<a href="#comment_1046" onclick="set_comment_reference(1046)" title="auf diesen Kommentar antworten">#1046</a>:
    07.Jan.2009 01:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>@zuzi Ein gemeinsamer bekannter, mit dem wir schon mehrmals ganze Wochen verbrachten, den wir beide am wenigsten leiden k&ouml;nnen und der sich selbst auch eindeutig in eine solche Schublade einordnen will. ;-)</p>

<p class="infos">
<a href="#comment_1047" onclick="set_comment_reference(1047)" title="auf diesen Kommentar antworten">#1047</a>:
    07.Jan.2009 01:01
    von
    
      <a href="/blog/author/kleinezuzi/">
        kleinezuzi
      </a>
</p>
<p>Aaaahhh... Der tr&auml;gt auch zu gro&szlig;e Hosen, oder? Na alles klar... :D</p>

<p class="infos">
<a href="#comment_1048" onclick="set_comment_reference(1048)" title="auf diesen Kommentar antworten">#1048</a>:
    07.Jan.2009 01:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Genau der.. vlt. hat das doch erstmal haupts&auml;chlich was mit dem eigenen geistigen Tiefgang zu tun... <em>G</em></p>

<p class="infos">
<a href="#comment_1049" onclick="set_comment_reference(1049)" title="auf diesen Kommentar antworten">#1049</a>:
    09.Jan.2009 12:01
    von
    
      
        <a href="http://ag7.alltagsgrauen.info/" target="_blank">
          fwolf
        </a>
</p>
<p>hm? ich glaube, du verbuchselst hier (Black) Metal mit Gothic ;)<br/>
Trinken doch alle Schweineblut und opfern Katzen des N&auml;chtens auf Friedh&ouml;fen dem Sata(a)n ;)</p>
<p><em>rofl</em></p>
<p>cu, w0lf.</p>
<p>ps: einziges Identifikationsmerkmal in Sachen Metal bei mir: Lange Haare - die 3-Loch-Undercover-Halbschuhe fallen nicht wirklich auf ^^</p>

<p class="infos">
<a href="#comment_1050" onclick="set_comment_reference(1050)" title="auf diesen Kommentar antworten">#1050</a>:
    09.Jan.2009 07:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Das k&ouml;nnte sein. Vlt. verwechsel ich auch gothic mit irgendwas zwischen DarkWave und Industrial. Ist aber eigentlich auch v&ouml;llig egal, wie gesagt habe ich mich nie sonderlich daf&uuml;r interessiert welche Stereotypen zu welcher Subkultur geh&ouml;ren.</p>
</div>