+++
title = "Der Wert eines Gegenstandes"
date = "2008-09-30T12:09:00"
author = "Dr. Azrael Tod"
issoid = "blog/832"
aliases = "blog/832"
+++

<p>Cem stellt auf seiner Sprechblase gerade wieder mal einige <a href="http://sprechblase.wordpress.com/2008/09/30/palaste-zu-sandburgen/" target="_blank">&Uuml;berlegungen zum Wert der Dinge</a> an:<!--more--><br/></p><blockquote>Ich wollte einfach unh&ouml;flich und direkt den Preis wissen. Er schaute mich wissend an und sagte: &ldquo;Was er dir Wert ist&rdquo;. Seit fast 50 Jahren klingt diese Antwort mir immer noch in den Ohren. Nat&uuml;rlich hatte er recht.

<p>Nichts Materielles hat einen Wert oder einen Preis f&uuml;r sich. Der Preis ergibt sich einfach aus dem Deal, den K&auml;ufer und Verk&auml;ufer schliessen. Er ist immer &ldquo;gerecht&rdquo; f&uuml;r beide. Sonst w&uuml;rde mindestens einer der Parteien den Abschluss nicht machen. So wie Fussballergebnisse auch immer gerecht sind, wie weiland <a href="http://de.wikipedia.org/wiki/Otto_Rehhagel" target="_blank">Otto Rehhagel</a> schon sagte. Sch&ouml;n spielen nutzt nichts. Tore z&auml;hlen.</p>
<p>So gesehen sind die Entwicklungen an den Finanzm&auml;rkten &ldquo;immer gerecht&rdquo;. Sie spiegeln immer die Realit&auml;t wieder. Gnadenlos.</p></blockquote><br/>Ich muss ihm soweit auch v&ouml;llig und ohne Einschr&auml;nkungen recht geben...

<p>Die Frage ist halt nur wie stabil dieser Wert ist... bei rein ideellen Werten ist dies sicher weniger der Fall als z.B. bei Dingen die zu jeder Zeit einen hohen Arbeits- und Materialaufwand zur Schaffung ben&ouml;tigten.<br/>Der Wert eines "Wertpapieres", dessen Preis auf absolut unrealistischen Sch&auml;tzungen beruht mag also durchaus im Moment enorm sein... er kann aber jeden Moment in sich zusammenbrechen.<br/>Dies ist ein Fakt der uns normalsterblichen B&uuml;rgern jederzeit bekannt ist, da wir unsere Werte eher nach dieser &Uuml;berlegung ausrichten (von einzelnen Dingen wie Markenkleidung oder anderen Statussymbolen mal abgesehen), diverse Banken scheinen dies jedoch str&auml;flich vernachl&auml;ssigt zu haben und bekommen im Moment die Quittung daf&uuml;r.</p>
<p>Da sie aber nicht selbst darunter leiden, da ein Staat nicht sein Finanzsystem ungesch&uuml;tzt in eine Kriese stolpern lassen kann, sehe ich auch nicht warum die Verantwortlichen daraus lernen sollten. Es ist vorher schon passiert und es wird wieder passieren.</p>
<p>BTW: <a href="http://www.phdcomics.com/comics.php?f=1077" target="_blank">ein netter Strip</a> von PHD-Comics (fast) zum Thema</p>
