+++
title = "Spielekonsole PC"
date = "2008-11-25T11:11:00"
author = "Dr. Azrael Tod"
issoid = "blog/1071"
aliases = "blog/1071"
+++

<p>Um mal die Schlussfolgerung an den Anfang zu setzen: Der PC als Spielekonsole ist f&uuml;r mich gestorben.</p>
<p>Dies l&auml;uft der Tatsache ziemlich entgegen dass ich mich immer f&uuml;r einen der gr&ouml;&szlig;eren Verfechter dieser Platform angesehen habe.<!--more-->Warum ist das jedoch so? Die alten Argumente wie z.B. dass eine Konsole NUR zum Spielen geeignet ist, w&auml;hrend ein PC sowieso vorhanden ist gelten ja noch immer. Ebenso hat es im Bereich der Konsolen keinerlei Entwicklungen gegeben die diese Kisten mit dem PC gleichziehen lassen k&ouml;nnten. Es handelt sich genau genommen noch immer um die selben, rein zum Spielen geeigneten Ger&auml;te (ok, man kann jetzt im Internet spielen und evtl. sogar mal nen Film drauf ansehen.) wie vor 10 Jahren.</p>
<p>Noch immer gibt es kaum eine Konsole die mit so wichtigen Eingabeger&auml;ten wie Maus oder RICHTIGEM Joystick (ja, es gab bereits f&uuml;r das SNES eine Maus) geliefert werden. Noch immer wird sich keiner eine XBox oder Wii kaufen um Texte zu schreiben.</p>
<p>Also was hat sich ge&auml;ndert? Kurz gesagt sind es zwei Dinge:<br/></p><ol><br/> <li>Meine pers&ouml;nliche Einstellung zu Spielen</li><br/> <li>Der PC hat sich weiterentwickelt</li><br/></ol><br/>Dass ich weniger spiele d&uuml;rfte sich ja normalerweise eher zugunsten des PCs auswirken... zumindest nach meiner bisherigen Argumentation. Allerdings hat sich auch sehr stark verschoben wann ich spiele und das ist nunmal eher die Situation bei der jemand das N64 in der Wohnstube sieht und wir erstmal zu viert anfangen uns via <a href="http://drazraeltod.wordpress.com/2008/10/28/pikachu-treten/" target="_blank">Smash Bros.</a> zu verpr&uuml;geln.

<p>Spr&uuml;che wie "Oh da steht ein Notebook... wir k&ouml;nnten ja nachher eine Runde spielen" wird man nunmal auf keiner (annehmbar guten) Fete mit Kumpels h&ouml;ren bei der diese nicht aus genau diesem Grund aufgeschlagen sind. Bei einer Konsole mit passenden Partyspielen wird dies eher auftreten.</p>
<p>Wenn ich mir dann meine heutigen Rechner ansehe, so muss ich feststellen dass der letzte noch zum Spielen geeignete PC (ein Notebook das auch bereits etwas zu schwachbr&uuml;stig daf&uuml;r war) vor 4-5 Jahren gekauft wurde.</p>
<p>Danach habe ich mir nur noch Hardware zugelegt die &uuml;ber Chipsatzgrafik verf&uuml;gt und deren CPU auch stark auf Stromverbrauch statt auf Leistung optimiert war. Sprich meinen <a href="http://drazraeltod.wordpress.com/?s=Homeserver" target="_blank">Mediaserver </a>(Serverdienste, Videoplayer, Fernseher, SSH-Schaltzentrale) und k&uuml;rzlich mein kleines <a href="http://drazraeltod.wordpress.com/2008/10/19/medion-akoya-mini-e1210/" target="_blank">Akoya E1210-Netbook</a>.</p>
<p>Der Punkt dass man also eh einen PC zuhause hat stimmt also schon noch.. nur ist der nichtmehr die hochgez&uuml;chtete Spielkiste die alle Probleme mit Leistung erschl&auml;gt, sondern eher ein kleines, unauff&auml;lliges K&auml;stchen das man irgendwo verstecken kann oder mit sich rumtr&auml;gt, das immer an ist und m&ouml;glich wenig Strom verbraucht und das vor allem immer verf&uuml;gbar sein soll.</p>
<p>Die Platform PC hat sich also f&uuml;r mich zum spielen etwas &uuml;berlebt... nicht weil Konsolen besser geworden oder der PC schlechter geworden w&auml;ren, sondern weil sich der PC weiterentwickelt hat und ich mehr von ernsteren zu "Causal-Games" gewechselt bin.</p>
<p>Eine Entwicklung die zumindest ich nicht wirklich habe kommen sehen...</p>
<p>PS: Ich bin dennoch froh dass <a href="http://openarena.ws/" target="_blank">OpenArena </a>auf meinem Akoya tut :D</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_908" onclick="set_comment_reference(908)" title="auf diesen Kommentar antworten">#908</a>:
    26.Nov.2008 04:11
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>Irgendwie kommt mir diese "Mutation" und deren Argumentation sehr bekannt vor. Denke du bist mit dieser Entwicklung bei weitem nicht alleine</p>

<p class="infos">
<a href="#comment_909" onclick="set_comment_reference(909)" title="auf diesen Kommentar antworten">#909</a>:
    27.Nov.2008 08:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Das habe ich auch nicht vermutet.. Die Frage die sich f&uuml;r mich stellt ist halt die nach der Ursache. Liegt es an einem Reifeprozess meiner Pers&ouml;nlichkeit oder eher an einem selbigen der PC-Technik?</p>
<p>Wahrscheinlich ist es eine Kombination, aber es w&auml;re wirklich mal interessant zu erfahren inwiefern sich die totale Sicht auf Spiele mehr von wochenlangem Spielspa&szlig; hin zu "Causal-Gaming" oder von gro&szlig;en Hardwareboliden als PC zu kleinen Konsolen (evtl. auch mal mit &auml;lterer Hardware) verschoben hat.</p>
<p>Ich denke den Trend als erstes Erkannt hat wohl Nintendo. Die Wii ist genau auf diese Verschiebung ausgelegt und schein sich nicht zuletzt aus diesem Grund verdammt gut zu verkaufen. (Auch wenn ich nicht vor habe mir in den n&auml;chsten 6-8 Monaten irgendeine Konsole zu kaufen... naja, SNES vlt. wenn ich eins in gutem Zustand finde.)</p>

<p class="infos">
<a href="#comment_910" onclick="set_comment_reference(910)" title="auf diesen Kommentar antworten">#910</a>:
    27.Nov.2008 01:11
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>Mhmmm,</p>
<p>f&uuml;r mich als online Spieler der Spielekategorie "MMORPG" hat sich da "leider" nicht viel ver&auml;ndert.</p>
<p>Partytechnisch ist klar ... Konsolen wie Wii und PS mit Nunchuck und Tanzmatte stellen den PC gnadenlos in den Schatten. Aber gerade dadurch das den Konsolen das Multitasking und eben auch Maus und Tastatur fehlt spiele ich immer noch mehr am PC.<br/>
Nebenbei kann man ja dank der Leistung viele weitere Dinge machen, was ich auch redlich nutze. An einer Konsole will ich so etwas gar nicht, dort m&ouml;chte ich ausnahmlos zocken ^^</p>
<p>Mhmm ... Wii und Tanzmatte ... ich glaub, ich muss ma grad was bestellen ^^</p>
<p>Mfg</p>
<p>madda</p>

<p class="infos">
<a href="#comment_911" onclick="set_comment_reference(911)" title="auf diesen Kommentar antworten">#911</a>:
    27.Nov.2008 01:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>f&uuml;r MMORPGs hab ich einfach noch nicht unendlich Zeit...^^<br/>
Selbst wenn ich mal wieder sehr viel Zeit haben sollte, werden mir wohl wie fr&uuml;her stinknormale Rollenspiele (Fallout 1/2, Zelda, Eldar Scrolls, ... \o/) v&ouml;llig ausreichen.</p>
<p>Ich will halt immer schnell speichern und 1-2 Tage sp&auml;ter weiterspielen k&ouml;nnen. Dieses System geht leider bei Onlinespielen nicht so wirklich. Egooshooter mit kurzen Runden und &auml;hnliches mal ausgeschlossen (UT1-2K4 !o!)</p>

<p class="infos">
<a href="#comment_912" onclick="set_comment_reference(912)" title="auf diesen Kommentar antworten">#912</a>:
    28.Nov.2008 03:11
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>Ist letzlich wohl wirklich zumindest f&uuml;r die Hardcore Gamer sehr Game-abh&auml;ngig. Manche Spiele gibts exclusiv f&uuml;r Platform Y manche f&uuml;r B.</p>
<p>Denke auch das dein Wandel sicherlich mit Alter &amp; Lebensphase zu tun hat</p>
</div>