+++
title = "Ein paar Wochen Milestone"
date = "2010-08-04T08:08:00"
author = "Dr. Azrael Tod"
tags = ["Android", "Gadget", "Milestone", "Technik", "Telefon"]
issoid = "blog/1530"
aliases = "blog/1530"
+++

<p>Jetzt hab ich <a href="/2010/7/12/These-aren't-the-Droids-you're-looking-for!/">seit ein paar Wochen mein neues "Telefon" rumliegen</a> und ich muss sagen dass Ding ist verdammt nett.<br/>"Telefon" deshalb weil ich damit vlt. insgesamt 10min telefonert hab und auch erstmal nach 2 Wochen gemerkt hab dass ich nur eine einzige Telefonnummer vom alten Adressbuch &uuml;bernommen habe (inzwischen sinds glaube 3). Auch sonst sieht es verdammt schlecht aus mit praktischen Anwendungsgebieten f&uuml;r das Ding. Als <a href="http://wiki.lspace.org/wiki/Dis-organiser" target="_blank">Dis-organiser</a> K&Ouml;NNTE man es verwenden, aber so viel hab ich dann doch nicht an Terminen. Bisher hab ich meine Einkaufslisten dar&uuml;ber notiert, aber wenn man ehrlich ist, geht das mindestens genauso gut auf Post-Its (eigentlich besser, im Laden das Telefon in der Hand zu halten ist manchmal recht unpraktisch).</p>
<p>Was h&auml;tten wir noch an Funktionen?<br/></p><ul><br/><li>Kamera - geht, die Qualit&auml;t ist ausreichend f&uuml;r alles was ich fotografieren will (Bilder landen eh meist im Internetz, der Sensor kommt wie immer mit wenig Licht nicht sonderlich gut zurecht, Blitz ist nur teilweise eine L&ouml;sung). Aber eigentlich mach ich daf&uuml;r viel zu wenig Fotos und die richtige Kamera <a href="/blog/author/cindy/">meiner besseren H&auml;lfte</a> h&auml;tte mit einem neuen Akku auch problemlos ausgereicht.</li><br/><li>Musik abspielen - zugegeben, ich kann endlich <a href="http://de.wikipedia.org/wiki/Vorbis" target="_blank">Ogg Vorbis</a> und &auml;hnliches anh&ouml;ren, aber das Telefon ist ziemlich grenzwertig gro&szlig; f&uuml;r die Hosentasche.</li><br/></ul>
<p>Was bleibt ist  dass das Ding ein Spa&szlig;-Gadget und Spielzeug ist. Das kann es dann aber auch gleich wieder verdammt gut. Spiele gibt es massig (auch teilweise in sehr guter Qualit&auml;t), Steuerung funktioniert super und man kann mit dem Ding sogar angeben. <br/>...weiterhin kein praktischer Nutzen, aber was solls.</p>
<p>Programme die ich bisher besonders toll finde:<br/></p><ol><br/> <li><a href="http://www.appbrain.com/app/com.google.code.apndroid" target="_blank">APNDroid</a> (Abschalten der UMTS/GPRS-Datenverbindungen, das erste Programm das ich dringend brauchte -&gt; WLAN rulez)</li><br/> <li><a href="http://www.appbrain.com/app/com.adao.android.afm" target="_blank">FileManager</a> (irgendsowas braucht man definitiv..)</li><br/> <li><a href="http://www.appbrain.com/app/org.woltage.irssiconnectbot" target="_blank">IRSSI ConnectBot</a> (eine minimal modifizierte Version des <a href="http://www.appbrain.com/app/org.connectbot" target="_blank">einzig brauchbaren SSH-Clients</a>, hinzu gekommen sind einige brauchbare Steuerungsoptionen die ich nicht nur f&uuml;r IRSSI benutze)</li><br/> <li><a href="http://www.appbrain.com/app/com.miracle.android.pe" target="_blank">Pocket Empires</a> (Suchterzeugendes MMO-Strategiespiel)</li><br/> <li><a href="http://www.appbrain.com/app/com.google.zxing.client.android" target="_blank">Barcode Scanner</a> (Braucht man einfach, schon weil es einfacher ist Links zum &ouml;ffnen vom PC-Bildschirm abzuscannen statt sie abzutippen, siehe dazu auch die <a href="http://code.google.com/intl/de-DE/apis/chart/docs/gallery/qr_codes.html">Google Chart API</a> um QR-Codes schnell mal <a href="http://chart.apis.google.com/chart?chs=150x150&amp;cht=qr&amp;chl=http://g33ky.de&amp;choe=UTF-8">zu generieren</a>)</li><br/> <li><a href="http://www.appbrain.com/app/org.dayup.gtask" target="_blank">GTasks</a> (Google Aufgabenlisten, brauch ich f&uuml;r meine Einkaufszettel und so)</li><br/> <li><a href="http://www.appbrain.com/app/de.hafas.android.db" target="_blank">Railnavigator</a> (Bahnfahrpl&auml;ne raussuchen, wenn man halt kein Auto hat...)</li><br/> <li><a href="http://www.appbrain.com/app/com.tni.TasKiller" target="_blank">TaskKiller</a> (schon alleine f&uuml;r die Anzeige der laufenden Programme und die Funktion zum wechseln zwischen diesen sehr n&uuml;tzlich)</li><br/> <li><a href="http://www.appbrain.com/app/com.tunewiki.lyricplayer.android" target="_blank">TuneWiki</a>(Mediaplayer, etwas besser als der mitgelieferte)</li><br/> <li><a href="http://www.appbrain.com/app/org.peterbaldwin.client.android.vlcremote" target="_blank">VLC Remote</a> (VLC auf anderen Rechnern fernsteuern, sehr praktisch)</li><br/> <li><a href="http://www.appbrain.com/app/com.polarbit.rthunder2lite" target="_blank">Raging Thunder 2</a> (Rennspiel, bisher die beste Grafik die ich auf meinem Telefon gesehen hab, leider in der Demo nur 1 Level spielbar, <a href="http://www.appbrain.com/app/com.polarbit.rthunder2" target="_blank">Vollversion</a> kostet $5)</li><br/> <li><a href="http://www.appbrain.com/app/com.deckeleven.windsofsteeldemo" target="_blank">Wings Of Steel</a> (Flugsimulator!!!111einself der auch schon in der kostenlosen Variante f&uuml;r jede Menge Spa&szlig; sorgt)</li><br/> <li><a href="http://www.appbrain.com/app/com.gianormousgames.towerraiders" target="_blank">Tower Raiders</a> (das imho beste von mehreren Tower Defense Spielchen, fast alle nur als Demo kostenlos)</li><br/> <li><a href="http://www.appbrain.com/app/com.aldiko.android" target="_blank">Alkido Book Reader</a> (Kostenlose E-Books und ein passendes Verwaltungs-/Leseprogramm)</li><br/> <li><a href="http://www.appbrain.com/app/com.ringdroid" target="_blank">Ringdroid</a>(Audiodateien zurechtschneiden um sie zu brauchbaren Klingelt&ouml;nen zu machen, einfacher als erst den PC anzuschlie&szlig;en)</li><br/> <li><a href="http://www.appbrain.com/app/com.nethackff" target="_blank">Nethack</a> (Hack&amp;Slay-Klassiker, einfach ein Muss)</li><br/> <li><a href="http://www.appbrain.com/app/com.fede.launcher" target="_blank">Launcher Pro</a> (Homescreen-Alternative, sieht etwas h&uuml;bscher aus, hat 1-2 sch&ouml;ne Zusatzfunktionen, ist aber manchmal noch etwas langsam)</li><br/> <li><a href="http://www.appbrain.com/app/com.twitter.android" target="_blank">Twitter-Client</a></li><br/> <li><a href="http://www.appbrain.com/app/com.bubblezapgames.supergnes_lite" target="_blank">SuperGNES</a> (SNES-Emulator, leider muss man f&uuml;r eine brauchbare Version Geld bezahlen, sonst Speichern nicht m&ouml;glich)</li><br/> <li><a href="http://www.appbrain.com/app/com.nix.game.pinball.free" target="_blank">Pinball</a>(ein nicht ganz 0815-Flipperspiel)</li><br/> <li><a href="http://www.appbrain.com/app/com.example.android.notepad" target="_blank">Notepad</a> einfacher, kleiner Notizblock, schlechter als GTasks, aber speichert die Daten nicht  bei Google)</li><br/> <li><a href="http://www.appbrain.com/app/com.appspot.swisscodemonkeys.apps" target="_blank">AppBrain</a> (Anwendungen ferngesteuert verwalten und neue Empfehlungen bekommen, via <a href="http://www.felixnagel.com/" target="_blank">Felix Nagel</a>)</li><br/></ol>
<p>Immer auf dem Bildschirm ist bei mir auch das Energiesteuerungs-Widget (hab gerade keinen Link), mit dem man WLAN/GPS/Bluetooth/Synchronisierung und Bildschirmhelligkeit sehr nett mit jeweils einem Klick (de-)aktivieren kann.<br/>Was mir aber leider noch immer fehlt, w&auml;re ein einfaches St&uuml;ck Saftware dass Jingle-Audio-Support f&uuml;r Jabber liefert. Idealerweise sollte das dann auch noch mit mehreren Konten funktionieren und sich wie Google Talk mit dem Adressbuch synchronisieren. Leider siehts da derzeit RICHTIG mies aus.<br/>Jingle-Support hab ich funktionierend noch garnicht gefunden (auch wenn ich schon so ziemlich jeden Jabber-Client im Market ausprobiert hab). Google Talk, kann entgegen seines Namens kein "Talk" und beherrscht nur Google-Accounts (und auch das nicht wirklich gleichzeitig). Andere Clients k&ouml;nnen meist nur einen Account f&uuml;r jedes Protokoll, (spa&szlig;igerweise meist einen "Talk" und einen "Jabber", so viel zu technischen Einschr&auml;nkungen), was auch f&uuml;r mich unbrauchbar ist. Ich br&auml;uchte nur Jabber-Accounts, davon hab ich aber gleich 3 die ich gerne verwenden w&uuml;rde (<a href="mailto:drazraeltod@jabber.ccc.de">drazraeltod@jabber.ccc.de</a>, eine GTalk-Account von @work und evtl. nochmal Google f&uuml;r @g33ky.de oder meinen alten alten Google-Account).<br/>Wenn irgendwer daf&uuml;r eine L&Ouml;SUNG kennt, dann bitte ich um entsprechende Kommentare!</p>
