+++
title = "Enterprise2.0 Blogs?"
date = "2008-11-20T02:11:00"
author = "Dr. Azrael Tod"
issoid = "blog/1066"
aliases = "blog/1066"
+++

<p>Achtung! Es folgt ein Beitrag dessen Zuordnung irgendwo zwischen Werbung, Spam und Hilfegesuchen einzuordnen ist.</p>
<p>Es schmerzt mich ein "2.0" ohne den geringsten Hauch von wenigstens Ironie oder besser noch Sarkasmus im Titel zu haben, doch ich muss an dieser Stelle mal die Frage an euch richten.<!--more--></p>
<p>Kennt ihr Web2.0-Enterprise-Blogs (Das sind sinnlose Buzzwords? <a href="http://www.buzzwordbingo.org/" target="_blank">BINGO</a>!) denen man Produkte aus diesem Bereich vorlegen k&ouml;nnte. Sprich: Kennt ihr jemanden der gerne &uuml;ber neue Produkte meines Br&ouml;tchengebers informiert werden m&ouml;chte, den man mal via Mail/Jabber/wasauchimmer ansprechen und fragen k&ouml;nnte ob er dar&uuml;ber berichten will.</p>
<p>Das Ganze soll weniger einen Spam-Charakter als vielmehr einen informativen haben. Blogs mit geringerer Reichweite sind also durchaus manchmal besser wenn sie sich genauer mit dem Thema besch&auml;fftigen.</p>
<p>Diese Aktion wurde ihnen Pr&auml;sentiert von "<a href="http://seto-gmbh.de/blog/" target="_blank">seto meint</a>", dem Blog <a href="http://www.seto-gmbh.de/" target="_blank">der Firma</a> die mir derzeit meine Br&ouml;tchen f&uuml;r etwas Arbeit finanziert.</p>
<p>Beispielprodukte w&auml;ren z.B.:</p>
<p>&nbsp;<br/></p><ul><br/> <li><a href="http://stream-tv.de/" target="_blank">Stream-TV</a>&nbsp;- Eine Platform auf der diverse Online-Sendungen der gro&szlig;en Sender wie ARD/Pro7/RTL7... gesammelt und als Newsfeed aggregiert werden</li><br/> <li><a href="http://m-pathy.com/" target="_blank">M-Pathy</a>&nbsp;- Ein Tracking tool f&uuml;r Webseiten, inkl. Mousetracking und allen m&ouml;glichen anderen Sp&auml;&szlig;en</li><br/> <li><a href="http://jiffr.com/" target="_blank">Jiffr</a>&nbsp;- Eine Dating-Platform auf Bild-Basis (wurde erst k&uuml;rzlich zu einem der <a href="http://www.dnxpert.com/2008/10/19/16-stupidest-web-20-domains/" target="_blank">d&auml;mlichsten Domain-Namen</a> gew&auml;hlt)</li><br/></ul>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_903" onclick="set_comment_reference(903)" title="auf diesen Kommentar antworten">#903</a>:
    21.Nov.2008 11:11
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Versuch es doch mal bei Trigami, wenn du das nicht sowieso schon gemacht hast. Ansonsten w&uuml;rd ich sagen du solltest mal bei Gizmodo.de fragen, die k&ouml;nnten sich f&uuml;r Streaming und Tracking interessieren. Alexander Endl schreibt auch ab und zu (bezahlte) Reviews, aber haupts&auml;chlich &uuml;ber Handys. Und ich bin gegen Bezahlung sowieso f&uuml;r alles zu haben ;)</p>
</div>