+++
title = "am i Geek enough?"
date = "2006-04-26T02:04:00"
author = "Dr. Azrael Tod"
issoid = "blog/279"
aliases = "blog/279"
+++

<p><tt>Du wei&szlig;t, dass du ein Geek bist wenn du...<br/></tt> </p><ul> <li>bei der Entscheidung welches Auto du kaufen solltest, als Argument anf&uuml;hrst, dass "Ford" fast wie "FNORD" klingt</li><li>mehr Filme mitsprechen kannst, als viele Leute angesehen haben</li><li>&uuml;berlegst, ob du in den Ring, den du deiner Freundin schenken willst statt name+name datum  nicht auch sowas wie "Wissen+3" eingravieren lassen <a href="http://xn--knntest%3C-n4a/li%3E%3Cli%3EGerman-Bash.org" rel="nofollow">k&ouml;nntest</a></li><li>Germa... komplett auswendig kennst (au&szlig;erdem weitere andere Seiten wie userfriendly)</li><li>seit einer Ewigkeit vergeblich versuchst ein Zitat auf Bash oder German-Bash zu bekommen</li><li>gern T-Shirts mit Computerspr&uuml;chen tr&auml;gst</li><li>aus langer Weile mal ausrechnest, wie viel Kaffee du trinken musst um den oralen LD50 zu erreichen </li><li>den Inhalt mindestens 2er Genres in der Bibliothek in deiner Heimatstadt fast komplett gelesen hast</li><li>dich gern an die gute alte Zeit mit wirklich guten Computerspielen errinerst (und diese Zeit mindestens 10 Jahre f&uuml;r dich vorbei ist)<br/> </li><li>dir &uuml;berlegst, ob du als n&auml;chste Fremdsprache die du lernen willst lieber Klingonisch oder Elbisch vornehmen solltest</li><li>gerne mit deinen privaten Computern m&ouml;glichst komplizierte Netzwerke aufbaust und dort Webseiten auf lokalen Servern hostest, die niemals jemand lesen KANN</li><li>schlimmer noch, dort sogar Mailserver und &auml;hnliches laufen l&auml;sst</li><li>dir die Namen von Kollegen/Klassenkammeraden/Freunden nie merken kannst, aber so unn&uuml;tze Dinge wie Cheats zu uralten Spielen, die du seit mindestens einem Jahrzehnt nichtmehr gespielt hast</li><li>&uuml;berall 42, 23, 5, ... auftauchen siehst... und &uuml;ber jede noch so irrsinnige Verschw&ouml;rungstheorie informiert bist (je verr&uuml;ckter desto besser)</li><li>bei Filmen, die in W&uuml;sten spielen darauf wartest, dass Muad'dib sein Chryss-Messer z&uuml;ckt</li><li>bewusst lange Abk&uuml;rzungen in Chats verwendest um Leute zu verwirren</li><li>bewusst Abk&uuml;rzungen wie lol, rofl oder &auml;hnliches im t&auml;glichem Sprachgebrauch verwendest</li><li>einen IRC-client dazu verwendest um einen Bot zu spielen</li><li>dir vor nimmst &ouml;fter raus in die Sonne zu gehen... es aber wieder sein l&auml;sst, weil die Helligkeit deines TFTs unausreichend ist oder der WLAN-Empfang zu schlecht ist</li><li>im Keller wohnst</li><li>mindestens 3 Orte kennst an denen du freiwillig &ouml;fter bist als an deinem Hauptwohnsitz und einer davon der Notebook-Raum (oder &auml;hnlich seltsammes) in einer FH/Schule/o.&auml;. ist</li><li>schon aus Prinzip alles hasst, was Mainstream ist oder von M$ und Konsorten stammt</li><li>im <a href="http://www.innergeek.us/">Geektest</a> mehr als 50% erh&auml;llst</li><li>zu sprechen wie Joda du dich &uuml;bst</li><li>schonmal versucht hast mit der Microsoft Text2Speech Engine Musik zu basteln (und das war bevor ich von solchen leuten wie MC Hawking h&ouml;rte)</li><li>ohne nachzusehen wei&szlig;t, wer MC Hawking ist<br/> </li><li>deine Freunde dich Geek nennen</li><li>diese Freunde auch bereits mit Recht als Geeks bezeichnet werden k&ouml;nnen</li><li>in nahezu jedem Film den du siehst massenweise logische Fehler findest</li><li>wei&szlig;t dass die Ringwelt instabil ist</li><li>an keinem Laden f&uuml;r Elektronik vorbei gehen kannst</li><li>auch gleich mal gegen 22:00 die erste Malzeit des Tages einnimmst (weil du den ganzen Tag an einer Standleitung gesessen hast und es ein Fu&szlig;weg von weniger als 10min. nach Hause w&auml;re)</li><li>die meisten Programme, die du verwendest mit so vielen Plugins wie m&ouml;glich erweiterst<br/> </li><li>einen Blog schreibst, den au&szlig;er dir wohl kaum jemand jemals lesen wird</li> </ul>  Ratet mal auf wen JEDER dieser Anstriche zutrifft!^^
      
    
  <div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_3" onclick="set_comment_reference(3)" title="auf diesen Kommentar antworten">#3</a>:
    27.Apr.2006 04:04
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>ok, laut einem bekannten von mir trifft der Letzte Anstrich doch nicht mehr zu...sollte wohl schreiben: "...weniger als 10 Personen lesen werden"oder irgendwas &auml;hnliches^^</p>

<p class="infos">
<a href="#comment_4" onclick="set_comment_reference(4)" title="auf diesen Kommentar antworten">#4</a>:
    12.Aug.2006 09:08
    von
    
      
        Anonymous
      
    
    
  </p>
<p>Will geek sein, aber kein geek-code zu finden, tztztz</p>

<p class="infos">
<a href="#comment_5" onclick="set_comment_reference(5)" title="auf diesen Kommentar antworten">#5</a>:
    14.Aug.2006 10:08
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Nun.. ich hab meinen geekcode...irgendwo.. wenn ich ihn finde stell ich ihn mal mit hin, is schon so lange her <em>gr&uuml;bel</em></p>

<p class="infos">
<a href="#comment_6" onclick="set_comment_reference(6)" title="auf diesen Kommentar antworten">#6</a>:
    14.Aug.2006 11:08
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>-----BEGIN GEEK CODE BLOCK-----Version: 3.12GCS d s+: a-- C++++ UL++ P+ L++ E W++ N o K- w++ O M- V-- PS+++ PE Y+ PGP t++ 5++ X R !tv b+++ DI+++ D++ G++ e h r% y ------END GEEK CODE BLOCK------</p>

<p class="infos">
<a href="#comment_7" onclick="set_comment_reference(7)" title="auf diesen Kommentar antworten">#7</a>:
    27.Sep.2008 01:09
    von
    
      
        <a href="/2008/09/27/publicons/" target="_blank">
          Publicons &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] netter Anfang. Man k&ouml;nnte es (sollte es irgendwann mal umfangreich genug sein) wohl mit Geekcode vergleichen den man f&uuml;r Normalsterbliche lesbar gemacht [...]</p>

<p class="infos">
<a href="#comment_8" onclick="set_comment_reference(8)" title="auf diesen Kommentar antworten">#8</a>:
    29.Sep.2008 11:09
    von
    
      
        <a href="http://" target="_blank">
          kopfschrott
        </a>
</p>
<p>mh ich h&auml;ng auch schon ganz tief drin Oo... ohje ^^</p>

<p class="infos">
<a href="#comment_9" onclick="set_comment_reference(9)" title="auf diesen Kommentar antworten">#9</a>:
    29.Sep.2008 11:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>naja.. einiges davon hat sich ja gebessert:</p>
<h1>einen Blog schreibst, den au&szlig;er dir wohl kaum jemand jemals lesen wird</h1>
<p>In den letzten 2 Jahren haben sich wohl doch einige Leser gefunden. Nat&uuml;rlich nicht die breite Masse, aber das war ja auch nie das Ziel.</p>
</div>