+++
title = "Miese Zeiten#2 - Wirtschaft"
date = "2010-01-28T11:01:00"
author = "Dr. Azrael Tod"
issoid = "blog/1501"
aliases = "blog/1501"
+++

<p>Achja.. unsere Gesellschaft... Ist doch sch&ouml;n wie das alles so l&auml;uft oder? Gut, es gibt da so einzelne, kleine, unwichtige Sachen die mich jeden Tag aufs neue auf die Palme bringen, aber man muss ja nicht p&auml;pstlicher sein als der Papst, oder?<br/>Es ist ja auch nicht so als w&auml;ren das wichtige Sachen. Es geht nur um so Kleinkram, nichts fundamentales.<br/>Zum Beispiel st&ouml;rt es mich etwas dass ich, wenn ich mittags im Laden stehe und irgendwas nur grob essbares kaufen will, ich nichts in einzelnen Portionen finde. Ich k&ouml;nnte mir "Schnitzelschnitten, Typ: Cordon Bleu" kaufen, die sind relativ geniesbar, aber nat&uuml;rlich gibt es die nur in 2er-Packungen. Na gut, kaufe ich halt das doppelte von dem was ich brauche... der Preis bringt mich schon nicht um.</p>
<p>Jetzt stehe ich also hier, kaue meinen Schnitzelverschnitt und &uuml;berlege mir warum ich das tu.<!--more--></p>
<p>Eigentlich ist ja die Firma schuld, die auf Krampf soviel wie m&ouml;glich Geld einnehmen will! Wenn die Spinner ein vern&uuml;nftiges Ziel, wie dem Kunden etwas essbares herzustellen, h&auml;tten, dann w&uuml;rde ich sicher das bekommen was ich brauche. Wobei.. eigentlich kann die Firma ja auch nichts daf&uuml;r, immerhin tut sie nichts anderes als alle anderen und die wiederrum tun genau das was sie dank freier Marktwirtschaft tun m&uuml;ssen um zu &uuml;berleben.</p>
<p>Wir haben nunmal eine Evolution mit unserem Marktsystem geschaffen und eine solche bringt nicht das sinnvollste Ergebnis sondern eben irgendwelche Ergebnisse die genug an die aktuellen Parameter angepasst sind um zu &uuml;berleben (noch etwas das keiner zu verstehen scheint).</p>
<p>Leider sagen unsere Parameter grob folgendes aus:<br/></p><ul><br/> <li>Nehme mehr Geld ein als du ausgibst.</li><br/> <li>Versuche in Zukunft noch mehr Ertrag (im Verh&auml;ltnis zum eingesetzten Kapital) zu bekommen als bisher.</li><br/></ul><br/>Zu kurz? Das wars aber! Wer pro investiertem Euro mehr Euro gewinn macht, wird belohnt (sprich: er brauch seinen Gewinn mit weniger Teilhabern zu teilen und kann mehr selbst einstecken).<br/><strong>DAS</strong> ist alles was Firmen ab einer gewissen gr&ouml;&szlig;e interessiert, alles andere ist nur Image um dieses Ziel zu erreichen. Macht euch nichts vor! Wenn eine Firma irgendwas von "Wir wollen die Umwelt schonen", "Wir produzieren interessante Produkte", "don't be evil!" oder auch nur "Wir wollen dass sich jeder unserer Angestellten unsere Produkte leisten kann!" faselt, dann ist das genau das wonach es klingt: <strong>BULLSHIT</strong>!

<p>Egal welche Firma, egal welche Branche... es wird nur so lange versucht einen guten Ruf zu erhalten, wie man damit mehr Geld einnehmen kann als ohne ihn. Demzufolge ist es auch Bl&ouml;dsinn wenn sich irgendwer hinstellt und sagt "Ich vertraue Amazon mehr als Google, weil Google mehr Daten von mir hat." oder "Micro$oft ist p&ouml;ser als Crapple".<br/>Was hingegen einen Unterschied macht, ist das Risiko dass eine "b&ouml;se" Handlung entdeckt wird oder die Wahrscheinlichkeit dass sich jemand mit genug Reichweite ernsthaft dr&uuml;ber aufregt.<br/>Demzufolge hat Google als eine Firma mit "Datenkrake"-Ruf eher Anreiz irgendwelche Kundendaten NICHT zu verkaufen als z.B. Apple. Wenn Google dabei erwischt wird seinen GMail-Kunden irgendwelche Werbem&uuml;lls zuzusenden, wird das sicher eher bemerkt werden als wenn Oracle das tut. Besser noch: Bei Oracle w&uuml;rde es kaum jemanden st&ouml;ren, es w&auml;ren vlt. 1-2 Wochen ein paar Berichte in irgendwelchen Insidermedien, dann wars das aber auch.<br/>Bei Google w&uuml;rde man noch Jahre sp&auml;ter h&ouml;ren "Gib den deine Adresse nicht, dann bekommst du Spam!".</p>
<p>Versteht mich jetzt nicht falsch. Google ist keine Firma der ich vertrauen m&ouml;chte, solch eine gibt es einfach nicht. Wenn Google demn&auml;chst kurz vorm Bankrott steht, verkauft werden sollte oder sonst aus irgend einem Grund der Ruf nicht mehr so wichtig ist, wird es nat&uuml;rlich passieren dass da aus versehen mal ein paar private Daten zugunsten von kurzfristigem Profit geopfert werden.</p>
<p>&Uuml;berhaupt sollte man Firmen wohl in 2 Klassen aufteilen: &ouml;ffentliche und nicht-&ouml;ffentlich t&auml;tige. Google oder Adidas w&auml;ren zum Beispiel gute Beispiele f&uuml;r sehr &ouml;ffentlich agierende Firmen, diese verf&uuml;gen &uuml;ber einen bekannten Markennamen und sind auf ihr Image bedacht damit dieser Name nicht seinen Wert verliert.<br/>Blackwater, <a href="http://feedproxy.google.com/~r/boingboing/iBag/~3/xYITs4mqwQA/how-monsanto-owns-an.html" target="_blank">Monsanto</a> oder Gazprom hingegen brauchen keinen Markennamen. Deren Ruf ist nahezu nichts wert, also brauch man auch nichts unternehmen um ihn zu erhalten.</p>
<p>Genau genommen sind diese Unternehmen eher die Regel als die Ausnahme, das ist ja auch verst&auml;ndlich: Wenn man einen unbekannten Namen hat, kann man ja auch einfach einen bekannten einkaufen und den als Tochterunternehmen laufen lassen.Der Endkunde assoziiert solche Dinge eh nicht, also kann Metro einen miesen Ruf haben wie es will... die Leute kaufen dennoch weiter bei Media Markt, Saturn, Kaufhof oder Real ein.</p>
<p>Ab einer gewissen Gr&ouml;&szlig;e wird so ein Unternehmen zum Selbstl&auml;ufer. Der Ruf ist egal, gesetzliche Regelungen kann man sich mit verdammt wenig Geld kaufen (Was denkt ihr wieviel Schmiergeld geflossen ist <a href="http://blog.fefe.de/?q=Gazprom" target="_blank">damit Gazprom seine aktuellen Vertr&auml;ge mit diversen EU-L&auml;ndern erh&auml;llt</a>? Ich Garantiere dass das im Verh&auml;ltnis zu Gazproms Reingewinn nichtmal auff&auml;llt.) Nat&uuml;rlich kann man die k&auml;uflichen Politiker verstehen... ich mein: dann dr&uuml;ckt dir halt jemand genug Geld in die Hand dass du in deinem Leben nie wieder Sorgen haben wirst. Daf&uuml;r setzt man doch gerne mal seinen Willi unter einen Vertrag der irgendwen anders gro&szlig;e Mengen Geld kostet. Was willst du auch verlieren? Deinen Ruf? - brauchst du eh nur um Geld zu verdienen, das hat sich ja damit erledigt. Deinen Job? - same here: Genug Geld -&gt; kein Bedarf f&uuml;r Job.</p>
<p>Auf die Art kann man eigentlich unbegrenzt Geld aus dem Staat ziehen. Bl&ouml;derweise bedeutet Geld immer einen Gegenwert von materiellen G&uuml;tern, der praktische Gesammtwert alles vorhandenen Geldes kann ja schlecht h&ouml;her sein als der aller G&uuml;ter zusammen. Wenn man jedoch Geld aus dem Staat zieht (also praktisch gleichverteilt aus allen Leuten), dann verteilt man quasi nur G&uuml;ter um. Von vielen die etwas besitzen, zu einem der viel besitzt.<br/>Das f&auml;llt nat&uuml;rlich nicht auf.. immerhin kann der Staat ja Geld drucken, also haben alle hinterher noch genauso viel Geld wie vorher...</p>
<p><strong>HALT!</strong> Der Staat druckt ja kein Geld mehr gro&szlig;artig. Dieses Privileg haben wir ja <a href="http://www.dailymotion.com/video/xaa4n9_die-geschichte-vom-goldschmied-fabi_tech" target="_blank">an die Banken abgegeben</a> um den Werteverfall zu minimieren. Eine Bl&ouml;dere Idee hat man eigentlich auch selten geh&ouml;rt. Nat&uuml;rlich werden die besser auf das Eigentum der Allgemeinheit achten und weniger zum eigenen Vorteil arbeiten, als Staatliche Organisationen.</p>
<p>Der Staat an sich kann ja zum Gl&uuml;ck nicht pleite gehen. Bzw. selbst wenn keinerlei Geld mehr im Staat vorhanden ist, bleiben die G&uuml;ter ja noch immer bei den Menschen. Ich hab keine Ahnung von wem die Schuldner dann ihre Milliarden haben wollen, kann mir aber vorstellen dass die B&uuml;rger eines solchen Staates h&ouml;chstens Lachen wenn 100 oder 1000 Personen durchs Land gehen und allen Menschen sagen "Alles bei euch im Haus geh&ouml;rt jetzt uns, das nehmen wir jetzt mit!".</p>
<p>Die Wirtschaft ist halt doch nur ein Haufen von Phantasiegebilden, was zwar Menschen zu einem gewissen Grad steuern kann, aber halt nur solange wie diese sich an diese Imagin&auml;ren Regeln halten. Vlt.sollten wir anfangen diese Regeln als genauso bescheuert zu betrachten wie die jeder andere Religion. Selber Denken ist Trumpf!</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1371" onclick="set_comment_reference(1371)" title="auf diesen Kommentar antworten">#1371</a>:
    01.Feb.2010 08:02
    von
    
      
        <a href="http://www.freemusicwiki.net/weblog/" target="_blank">
          Torsten
        </a>
</p>
<p>"Egal welche Firma, egal welche Branche&hellip; es wird nur so lange versucht einen guten Ruf zu erhalten, wie man damit mehr Geld einnehmen kann als ohne ihn." - Yeah that's Kapitalismus. der Ruf z&auml;hlt halt nur solange er einen vermuteten Einfluss auf den Gewinn macht.</p>
<p>"Der Staat an sich kann ja zum Gl&uuml;ck nicht pleite gehen." - H&auml;h&auml;, das haben sich die Isl&auml;nder auch 'ne Weile lang gedacht. Klar sind die &ouml;ffentlichen G&uuml;ter dort noch immer bei den Menschen, allerdings werden sie soweit das noch nicht der Fall ist, privatisiert und ins Ausland verkauft um die Staatsschulden wenigstens andeutungsweise zu verkleinern. Wie die Isl&auml;nder damit umgeht bleibt spannend.</p>
<p>"Vlt.sollten wir anfangen diese Regeln als genauso bescheuert zu betrachten wie die jeder andere Religion. Selber Denken ist Trumpf!" - Leicht gesagt, schwer gemacht. Man m&uuml;sste im Denken und Handeln etwa 250 Jahre zur&uuml;ckgehen in eine Zeit in der die Wirtschaft noch nicht so eng mit politischem Denken und Handeln verkn&uuml;pft war wie heute.</p>

<p class="infos">
<a href="#comment_1617" onclick="set_comment_reference(1617)" title="auf diesen Kommentar antworten">#1617</a>:
    09.May.2013 05:05
    von
    
      
        <a href="http://linux-workers.posterous.com/" target="_blank">
          Ikem
        </a>
</p>
<blockquote>
<p>der praktische <em>Gesamtwert</em> alles vorhandenen Geldes</p>
</blockquote>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1622">
<p class="infos">
<a href="#comment_1622" onclick="set_comment_reference(1622)" title="auf diesen Kommentar antworten">#1622</a>:
    09.May.2013 10:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>eigentlich auch "allen"</p>
</div>
</li>
</ul>
</div>