+++
title = "Wahnsinn Studium"
date = "2008-02-15T10:02:00"
author = "Dr. Azrael Tod"
issoid = "blog/319"
aliases = "blog/319"
+++

<p><span style="font-weight:bold;font-style:italic;">Datenbanken und Objektorientierte Systeme</span><br/><br/><br/>Sicherlich kann man &uuml;ber die Auswahl bestimmter Werkzeuge um bestimmte Ziele zu erreichen immer geteilter Meinung sein. Die Auswahl von Smalltalk als Lehrsprache f&uuml;r Objektorientierte Systeme ist da nat&uuml;rlich keine Ausnahme. Nat&uuml;rlich gibt es andere Sprachen, die ebenfalls diesem Paradigma folgen und zus&auml;tzlich andere Vorteile haben, z.B. dass man sie wahrscheinlicher auch nach dem Studium noch einmal einsetzen kann, aber im Endeffekt ist das wohl egal, die Hauptsache ist doch dass sich die Sprache daf&uuml;r eignet und das Ziel somit erreicht werden kann.<br/><br/>Schwieriger wird es hingegen, wenn man versucht Cobol (Ihr kennt Cobol nicht? Das ist eine Sprache, deren Entwicklung um das Ende des 2. Weltkrieges begann und die auch noch Heute nicht wirklich Jahr-2000-kompatibel ist.) als Lernsprache f&uuml;r Datenbanken zu verteidigen. Sicherlich eignet sich auch eine der &auml;ltesten Programmiersprachen noch dazu, per SQL einfache Abfragen auszuf&uuml;hren, wenn die Studenten dann aber erheblich mehr Probleme mit der Sprache zum darstellen der Ergebnisse haben, als damit die Ergebnisse zu erreichen (Das k&ouml;nnte z.B. daran liegen, dass sich Cobol noch an Lochkarten orientiert und man aufpassen muss, welche Zeile wie weit genau einger&uuml;ckt ist.), wird die Argumentation schon etwas schwierig.<br/><br/><br/>Wenn dann der Professor, der die beiden Sprachen f&uuml;r besagte F&auml;cher ausgew&auml;hlt hat etwas... Wie dr&uuml;cke ich es am besten aus? Die Worte Verwirrt, Schrullig und Zerstreut treffen es alle noch nicht so ganz...<br/><br/>Aber ich glaube ihr wisst auch so alle ganz gut was ich meine.<br/><br/><br/>Wenn nun also noch ein Professor dazu kommt, der auf so Fragen wie: "Haben wir im Anschluss an diese Vorlesung, diese Woche Praktikum?" so verwirrend antwortet (sinngem&auml;&szlig; ca. "Nun, da sehe ich mal hier auf meinem Zettel nach, da hab ich mir das alles ganz genau notiert... [Professor h&auml;lt einen seiner typischen Schmierzettel hoch] Haben wir? Haben wir nicht? Haben wir? Haben wir nicht? Was meinen Sie Herr D.?"), dass die Studenten nach dem 3. Mal Nachfrage dann doch gr&ouml;&szlig;tenteils lieber einfach hingehen und abwarten ob der Prof auch kommt, so kann sich jeder denken, dass der Lernerfolg in der Vorlesung selbst eher gering ist.<br/><br/>Nat&uuml;rlich ist klar, dass man sich im Studium vieles auch selbst aneignen muss, doch Vorlesungen bei denen einfach nur Anwesenheitspflicht gilt, deren Inhalte man sich jedoch besser kurz vor der Pr&uuml;fung komplett noch einmal selbst aneignen muss erscheinen mir mehr als in-effektiv.<br/><br/><br/>Ganz am Rande ist es auch schade dass dann relativ interessante Dinge wie stored procedures (in diesem Fach &uuml;brigens unter Nutzung der mitgelieferten Tools der neuesten MS SQL und Cach&eacute;-Versionen) in einem Wahlpflichtfach (Schon der Name dieser Klassifizierung ist wieder ein Witz f&uuml;r sich.) im letzten Semester untergebracht werden, bei dem aber keiner etwas lernt, da keine Pr&uuml;fung folgt, der Prof die Praktika damit verbringt mit Studenten &uuml;ber v&ouml;llig Fachfremdes zu debattieren und somit sowohl Studenten als auch Professor einfach nur Zeit absitzen. (Einzige zu erbringende Leistung war Anwesenheit. Diese wurde vom Professor auf einem weiterem Schmierzettel verwaltet, in dessen hingeschmierter Tabelle auch gerne mehrere Anwesenheiten ein und des selben Studenten f&uuml;r das selbe Praktikum auftauchen konnten. Es w&auml;hre sicher interessant zu erfahren, wie dieses Kunstst&uuml;ck m&ouml;glich war... also ohne Zeitreisen und alternative Kalendersysteme.)</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_45" onclick="set_comment_reference(45)" title="auf diesen Kommentar antworten">#45</a>:
    06.Aug.2008 05:08
    von
    
      
        <a href="/2008/08/06/cobol/" target="_blank">
          Cobol &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] ist auch die Sprache, die mein Prof an der FH Zwickau f&uuml;r geeignet empfand um uns Studenten die Verwendung von Datenbanken n&auml;her zu [...]</p>
</div>