+++
title = "Miese Zeiten"
date = "2009-12-15T11:12:00"
author = "Dr. Azrael Tod"
issoid = "blog/1489"
aliases = "blog/1489"
+++

<p>Ohja, uns geht es schlecht! Wirtschaftskriese, Schweinegrippe, Klimakatastrophe, Peak-Oil, steigende Preise auf jedem Sektor und sowas wie Wirtschaftswachstum kennen wir eigentlich fast nur noch aus M&auml;rchen.<br/>Wenn wir den Winter (der sicher kaum sichtbar ist wegen der Klimaerw&auml;rmung UND GLEICHZEITIG permanent die tiefsten Temperaturen seit Menschengedenken verursacht) tats&auml;chlich &uuml;berleben sollten, steht uns bestimmt gleich wieder ein neues Jahrhundert-  - was sag ich - Jahrtausendhochwasser bevor, die Zugv&ouml;gel werden aus Afrika einen neuen Stamm der chinesischen Rinderpockenbeulenpest mitbringen und die Banken/KFZ-Hersteller werden endg&uuml;ltig ihren Betrieb einstellen, woran die amoklaufenden Computerspieler schuld sind und selbst die Milch wird nichts mehr wert sein, weswegen unsere Bauern pleite gehen. Dadurch wieder wird der gestiegene Milchbedarf in Asien daf&uuml;r sorgen dass uns auch dieses allerletzte Grundnahrungsmittel ausgeht.<br/><a href="http://de.wikipedia.org/wiki/Datei:Laktoseintoleranz-1.svg" target="_blank">DIESE VERDAMMTEN CHINESEN UND IHRE LACTOSESUCHT!</a></p>
<p>Eigentlich k&ouml;nnen wir froh sein <a href="http://www.scienceblogs.de/astrodicticum-simplex/weltuntergang-2012-fragen-und-antworten.php" target="_blank">dass im Dezember 2012 endlich alles vorbei ist</a> und wir von unserer Quahl erl&ouml;st werden.</p>
<p>Jaja.. eine Menge Probleme und man will sich eigentlich garnicht damit besch&auml;fftigen, aber ich tu es mal trotzdem und starte mit dem heutigen Artikel eine neue Serie (naja, mal sehen...) von sinnlos-Rants &uuml;ber Themen die euch eh schon allen zum Hals raus h&auml;ngen.</p>
<p><!--more--><br/></p><h2>Todesgefahren oder "Statistik ist dein Freund"</h2><br/>Fangen wir mal beim schlimmsten an: denn was k&ouml;nnte schlimmer sein als das eigene Leben oder geliebte Personen zu verlieren?<br/>Bei diesem Bereich beweisen die Menschen noch immer wieder wie gut sie sich vom Springer Verlag irgendwelche Statistiken vorlesen lassen k&ouml;nnen. Da isst du - nichts b&ouml;ses ahnend - einfach dein Honigbr&ouml;tchen und Peng bist du tot weil dich ein b&ouml;ser Killerspielspieler erschossen hat... mit einer Counterstrike-CD.<br/>OK, in den USA w&auml;re die Todesursache beim Honigbr&ouml;tchen-essen wohl eher ein Schwarm von "Killerbienen" die aus Mexico schon seit vielen Jahren auf dem Vormarsch sind, sie breiten sich schon so lange, so schnell aus dass sie heute eigentlich schon gef&uuml;hlt im ganzen Sonnensystem sind (statt realistisch betrachtet in einem kleinem Teil der USA).

<p>Leider haben wir ja heutzutage garnichts mehr und w&auml;hrend in den USA die Bienen wahre Killer sind, sterben die Mistfiecher bei uns langsam aus! Einfach so! Alles muss man selber machen! Na gut, stellen wir uns halt selber als "Killer" hin!<br/>Das Wort Killer ist ja schonmal der Witz an sich, "T&ouml;ter" w&uuml;rde wohl nicht so gut klingen, vlt. w&uuml;rde dann auch jemand auf die Idee kommen mal zu fragen wie viele Menschen von "Killerspielspieler" in Deutschland schon get&ouml;tet wurden. Ich hab jetzt zwar irgendwie keine richtige Lust da nachzuforschen, aber f&uuml;r 100 tote Menschen muss so ein Spieler schon ganzsch&ouml;n lange stricken... Gehen wir also einfach mal aus dass es weniger als 50 im Jahr sind, das f&auml;llt in der deutschen Bev&ouml;lkerung ja garnicht auf, da kommen ja mehr durch Blutvergiftung dank N&auml;hnadelstiche um. (<a href="http://de.wikipedia.org/wiki/Todesursache#Statistiken" target="_blank">ca. 11.000 Menschen</a> t&ouml;ten sich in Deutschland scheinbar schon selbst, wie will man da &uuml;berhaupt noch irgendwie auffallen?)</p>
<p>Nat&uuml;rlich m&uuml;ssen wir diese Typen als Gefahr eind&auml;mmen, also bezahlen wir halt ein paar mehr/bessere P&auml;dagogen und passen auf die Kinder auf. Alternativ k&ouml;nnten wir die Kinder auch mit einem vertretbaren Freizeitangebot ablenken oder Psychologen beauftragen Problemkinder auch zu behandeln statt sie nur zu diagnostizieren.<br/>Wie jetzt? Daf&uuml;r ist kein Geld da? Na ok, dann outsourcen wir das halt! Die Freizeitgestaltung kann ja ein guter, deutscher Sch&uuml;tzenverein &uuml;bernehmen, Zukunftsaussichten haben die Problemkinder beim Bund (echte Waffen machen nunmal mehr Spa&szlig; als simulierte) und f&uuml;r die psychologische Beratung findet sich sicher die eine oder andere Gruppe von Sch&uuml;lern die das gerne &uuml;bernimmt und auch gleich Baseballschlager als typisch deutsches Sportzubeh&ouml;r mitbringt.</p>
<p>Zum Gl&uuml;ck gibt es ja noch andere t&ouml;dliche Gefahren!<br/>Krankheiten z.B.: Die Schweinegrippe soll ja 3x so gef&auml;hrlich sein wie die normale Grippe. Und in der Tat sterben nur ca. 0.1% aller an Grippe erkrankten Personen, w&auml;hrend es bei Schweine-Horror-Multikill-Grippe ganze 0.3% sind.<br/>In Worten: DREI PROMILLE! Damit kommste durch keine Verkehrskontrolle (die meisten kommen damit nichtmal mehr ZUR Verkehrskontrolle).<br/>Was dabei nat&uuml;rlich nicht eingerechnet ist: es erkranken in Deutschland nat&uuml;rlich auch viel weniger Personen an Schweinegrippe als an "normaler". Au&szlig;erdem sind die Nebenwirkungen einer Impfung zeitweise so extrem (das f&auml;llt nat&uuml;rlich unter "sehr seltenes Auftreten", nichtmal bei jedem tausendsten Impf-Opfer) dass in manchen nordischen (z.B. D&auml;nemark) L&auml;ndern wohl mehr Personen ernsthaft unter der Impfung litten als an der Krankheit jemals h&auml;tten erkranken k&ouml;nnen.<br/>Aber hey! Wir haben eine Impfung! WIR SIND SICHER! (denkste)</p>
<p>Wenn man so sieht wieviel Wirbel die Presse so um diese Gefahren macht, kann man eigentlich nur froh sein dass &uuml;ber die wirklichen Gefahren nicht berichtet wird. Sonst w&auml;re im Programm aller Sender einfach kein Platz mehr f&uuml;r Unterschichten-TV, Castingshows, Serien oder gar "Blockbuster".</p>
<p>Eine Ziemlich gro&szlig;e Gefahr scheinen wohl die Raucher zu sein. Die Typen erledigen mal eben &gt;&gt;1500 deutsche Bundesb&uuml;rger pro Jahr. Nat&uuml;rlich k&ouml;nnte man das rein theoretisch eind&auml;mmen, aber es w&auml;re ja wohl gegen die Gesetze einer Marktwirtschaft wenn der Staat da noch st&auml;rker eingreifen w&uuml;rde.<br/>Eine andere Gefahr ist des deutschen liebstes Kind: das Auto. Wieviele Leute in den letzten Jahren schon auf der Stra&szlig;e gut verteilt wurden, z&auml;hlt wohl inzwischen schon lange keiner mehr. Sicherere Verkehrsmittel (Bahn, Flugzeug, Bus, ...) w&auml;ren eine M&ouml;glichkeit, Tempolimits eine andere. Tempolimits, so hat aber der ADAC bereits wiederholt argumentiert, bringen aber  leider garnichts da eh kaum jemand schneller f&auml;hrt. Au&szlig;erdem handelt es sich ja wieder um eine Einschr&auml;nkung der pers&ouml;nlichen Freiheit und um pure "Schikane" den armen Autofahrern gegen&uuml;ber.</p>
<p>Da sind wir wieder an einer Stelle, die man eigentlich mal so stehen lassen k&ouml;nnte, allein die Bemerkung, dass es doch sch&ouml;n w&auml;re wenn bei Grundrechtsabw&auml;gungen durch den Gesetzgeber und Berichterstattung durch die Medien auch mal tats&auml;chlich die Relationen des tats&auml;chlichen Schadens betrachtet werden w&uuml;rden, m&ouml;chte ich mir g&ouml;nnen.<br/>Auch m&ouml;chte ich an dieser Stelle erneut fordern dass &ouml;ffentliche Gelder gef&auml;lligst nach tats&auml;chlicher Menge an Opfern (oder zumindest der realistisch zu erwartenden Anzahl) vergeben werden. Danach ist selbst f&uuml;r die Abwehr von Badeunf&auml;llen (2006 starben dabei 606 Personen) weit mehr Geld auszugeben als f&uuml;r die "Terror"abwehr (&lt;10 Opfer pro Jahr und auch die fast ausschlie&szlig;lich im Ausland).<br/>Denn <a href="http://de.wikipedia.org/wiki/Terror" target="_blank">Terror (lateinisch terror, von terror, terroris, &bdquo;Schrecken&ldquo;)</a>, meine lieben Leser, verursacht f&uuml;r mich nicht gerade der Gedanke dass ich grob eine Chance von 10 : 81.882.342 habe n&auml;chstes Jahr durch einen Anschlag zu sterben, allerh&ouml;chstens die Einschnitte in meine t&auml;gliches Leben, die zur Abwehr dieser Gefahr vorgenommen werden, diese Einschnitte k&ouml;nnten vlt. "Schrecken" verbreiten.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1365" onclick="set_comment_reference(1365)" title="auf diesen Kommentar antworten">#1365</a>:
    18.Dec.2009 02:12
    von
    
      
        wayne
      
    
    
  </p>
<p>genialer Post &lt;3<br/>
thx daf&uuml;r</p>
<p>erinnert mich irgendwie hieran: <a href="http://2012forum.com/forum/viewtopic.php?f=10&amp;t=15211%3C/p%3E" rel="nofollow">http://2012forum.com/f...</a>
</p><p>einfach facepalm</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1366">
<p class="infos">
<a href="#comment_1366" onclick="set_comment_reference(1366)" title="auf diesen Kommentar antworten">#1366</a>:
    18.Dec.2009 02:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>ich sach mal "nat&uuml;rliche Auslese" (^.^)</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1367" onclick="set_comment_reference(1367)" title="auf diesen Kommentar antworten">#1367</a>:
    20.Dec.2009 12:12
    von
    
      
        <a href="http://malison.org/2009/allgemein/und-da-war-da-noch-2009-12-19/" target="_blank">
          Und da war da noch&amp;#8230; 2009-12-19 &amp;laquo; h t t p : / / m a l i s o n . o r g
        </a>
</p>
<p>[...] ist dein Freund -&gt; /2009/12/15/miese-zeiten-1-achtung-gefahr/ [...]</p>

<p class="infos">
<a href="#comment_1368" onclick="set_comment_reference(1368)" title="auf diesen Kommentar antworten">#1368</a>:
    07.Jan.2010 11:01
    von
    
      
        vogelgrippe
      
    
    
  </p>
<p>So wahr!<br/>
In Videoform gabs etwas &auml;hnliches auch schon mal:<br/>
<a href="http://www.youtube.com/watch?v=yvPZFGbrPuM%3C/p%3E" rel="nofollow">http://www.youtube.com...</a>
</p></div>