+++
title = "Homeservergehäuse"
date = "2008-11-16T04:11:00"
author = "Dr. Azrael Tod"
tags = ["Dresden", "Gadget", "Hardware", "Nerdig", "PC", "Technik", "Homeservergehäuse"]
issoid = "blog/1052"
aliases = "blog/1052"
+++

<p>Die n&auml;chste Revision meines Homeservergeh&auml;uses V4 - "Tinfoilhat" (<a href="/tags/homeservergehäuse/" target="_self">alle Teile</a>, <a href="/2008/9/5/Homeservergeh%C3%A4use/" target="_blank">0</a> <a href="/2008/9/19/Homeservergeh%C3%A4use1/" target="_blank">1</a> <a href="/2008/9/22/Homeservergeh%C3%A4use2/" target="_blank">2</a> <a href="/2008/9/22/Homeservergeh%C3%A4use3/" target="_blank">3</a> <a href="/2008/10/3/Homeservergeh%C3%A4use4/" target="_blank">4</a> <a href="/2008/10/14/Homeservergeh%C3%A4use5/" target="_self">5</a>) ist fertig!</p>
<p>Hier gibts erstmal Bilder dazu, danach noch eine kurze Zusammenfassung:<!--more--><br/></p><table border="0" style="width:194px;"><br/><tbody><br/><tr><br/><td align="center" style="background:transparent url('http://picasaweb.google.com/f/img/transparent_album_background.gif') no-repeat scroll left center;height:194px;"><a href="http://picasaweb.google.de/drazraeltod/HomeserverV4#"><img alt="" height="160" src="http://lh6.ggpht.com/_sREE3IlYns8/SSAvBSNhqyE/AAAAAAAAARA/bUmYJ0PSqZY/s160-c/HomeserverV4.jpg" style="margin:1px 0 0 4px;" width="160"/></a></td><br/></tr><br/><tr><br/><td style="text-align:center;font-family:arial,sans-serif;font-size:11px;"><a href="http://picasaweb.google.de/drazraeltod/HomeserverV4#">Homeserver V4</a></td><br/></tr><br/></tbody></table><br/>Nach etlichen Wochen gingen mir jetzt die Ausreden aus um mich vor der Weiterf&uuml;hrung meines Geh&auml;usebaus zu dr&uuml;cken.

<p>Leider lief nicht alles so wie ich es mir urspr&uuml;nglich mal vorgstellt hatte (was auch der Grund f&uuml;r die Suche nach Ausreden war). Schneiden lassen sich die reinen Alufolieplatten (naja, eher s&auml;gen) mehr schlecht als recht, die Kunstharzplatten (sehen dank Alufolieh&uuml;lle fast genauso aus) noch viel weniger. Daher habe ich im letzten Moment dann doch umgeplant und die R&uuml;ckseite komplett offen gelassen. Einzig das Netzteil, der L&uuml;fter und ein St&uuml;ck Pappecke von V3 bedecken einen Gro&szlig;teil der R&uuml;ckwand.</p>
<p>Das einzige nachtr&auml;glich eingef&uuml;gte Loch im Geh&auml;use ist der Schlitz f&uuml;r das DVD-Laufwerk, gl&uuml;cklicherweise besteht die Frontplatte neben der Oberseite als einzige wirklich verbaute Platte rein aus gekn&uuml;llter Alufolie.</p>
<p>Die ausgefransten R&auml;nder am Laufwerk habe ich mit Hei&szlig;kleber fixiert. Das Zeug wurde von mir &uuml;brigens generell recht exzessiv eingesetzt, von der ganzen Packung an 7mm-St&auml;bchen sind nur ca. 1,5cm des letzten St&auml;bchens &uuml;brig geblieben.</p>
<p>Das Motherboard mit PCI-Erweiterungskarte wurde &uuml;brigens mit Hilfe der Ecke des V3-Geh&auml;uses befestigt an der es hing (mit Kabelbindern befestigt). Die Ecke habe ich einfach ausgeschnitten und angeklebt um mir das Bohren neuer L&ouml;cher zu ersparen.</p>
<p>Grunds&auml;tzlich l&auml;uft der Server (es fehlt atm. noch eine Anbindung ans LAN) und ich konnte schon wieder N64 &uuml;ber die Fernsehkarte spielen. Das Geh&auml;use ist sicher auch stabiler und besser gek&uuml;hlt als V3, es sieht daf&uuml;r aber mindestens genauso beschissen aus und ist immer noch zu gro&szlig; und auff&auml;llig.</p>
<p>Ich bin mir atm. nicht sicher ob ich mich an die Planung f&uuml;r V5 machen sollte, ein fertiges Geh&auml;use kaufen sollte oder erstmal "Tinfoilhat" eine Weile laufen lassen soll. Wahrscheinlich bleibt es rein aus Faulheit erstmal bei letzterer Variante.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_892" onclick="set_comment_reference(892)" title="auf diesen Kommentar antworten">#892</a>:
    16.Nov.2008 08:11
    von
    
      <a href="/blog/author/kleinezuzi/">
        kleinezuzi
      </a>
</p>
<p>Einfach ein anderes Geh&auml;use kaufen w&auml;re vermutlich einfacher gewesen...^^</p>

<p class="infos">
<a href="#comment_893" onclick="set_comment_reference(893)" title="auf diesen Kommentar antworten">#893</a>:
    16.Nov.2008 08:11
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>VIEL zu einfach! wo bleibt denn da der Spass?</p>

<p class="infos">
<a href="#comment_894" onclick="set_comment_reference(894)" title="auf diesen Kommentar antworten">#894</a>:
    16.Nov.2008 08:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>...und preislich w&auml;re ich auch nicht viel schlechter gekommen...<br/>
ABER KOMM MIR NICHT MIT LOGISCHEN ARGUMENTEN!</p>

<p class="infos">
<a href="#comment_895" onclick="set_comment_reference(895)" title="auf diesen Kommentar antworten">#895</a>:
    17.Nov.2008 01:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Hassen wir nicht alle Spa&szlig;?</p>

<p class="infos">
<a href="#comment_896" onclick="set_comment_reference(896)" title="auf diesen Kommentar antworten">#896</a>:
    17.Nov.2008 01:11
    von
    
      
        RobVinc
      
    
    
  </p>
<p>cannot access spass: No such file or directory</p>

<p class="infos">
<a href="#comment_897" onclick="set_comment_reference(897)" title="auf diesen Kommentar antworten">#897</a>:
    23.Nov.2008 10:11
    von
    
      
        <a href="http://www.markuswalther.org" target="_blank">
          Markus
        </a>
</p>
<p>das ist ja geil ^^</p>
<p>so kann man seine Langeweile auch kompensieren ^^</p>

<p class="infos">
<a href="#comment_898" onclick="set_comment_reference(898)" title="auf diesen Kommentar antworten">#898</a>:
    23.Nov.2008 10:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Klar.. jeden Monat ein neues Geh&auml;use oder so...</p>
<p>Randbemerkung ich hab gerade noch mal nachgesehen, V4 ist nicht viel kleiner geworden als das alte, regul&auml;re ATX-Geh&auml;use das noch im Keller steht... nur halt etwas erheblich unflexibler.<br/>
Schlag ins Wasser oder so -.-</p>

<p class="infos">
<a href="#comment_899" onclick="set_comment_reference(899)" title="auf diesen Kommentar antworten">#899</a>:
    24.Nov.2008 03:11
    von
    
      
        <a href="http://ag7.alltagsgrauen.info/" target="_blank">
          fwolf
        </a>
</p>
<p>tja, und wenns richtig sch&ouml;n sein soll .. bau dir eins aus holz!</p>
<p>cu, w0lf.</p>

<p class="infos">
<a href="#comment_900" onclick="set_comment_reference(900)" title="auf diesen Kommentar antworten">#900</a>:
    24.Nov.2008 07:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Holz ist aber erstens nicht gerade billig, l&auml;sst sich zweitens nur schlecht spanlos/leise verarbeiten (f&uuml;r Herstellung im Wohnzimmer) und sorgt auch nicht gerade f&uuml;r die ideale thermikabf&uuml;hrung.</p>
<p>Auf der positiven seite w&uuml;rde dunkles Holz prima hinter den Schrank passen und die Kiste w&uuml;rde sinnvoller aussehen als jetzt.<br/>
Vlt. f&uuml;r die &uuml;bern&auml;chste Version... <em>g</em></p>
</div>
