+++
title = "TeleColumbus bei anderen"
date = "2008-09-15T09:09:00"
author = "Dr. Azrael Tod"
tags = ["Technik", "Telefon", "Zwickau"]
issoid = "blog/728"
aliases = "blog/728"
+++

<p>Unsere WG war offensichtlich kein Einzelfall, andere (mehr oder weniger freiwillige) "Kunden" von TC/EWT hatten mindestens genauso interessante Erfahrungen mit diesem Ausbund an Unseri&ouml;sit&auml;t.</p>
<p><a href="http://www.markuswalther.org/" target="_blank">Markus</a> hat mich gerade per <a href="/2008/07/17/hande-weg-von-telecolumbus/#comment-622" target="_self">Kommentar</a> auf <a href="http://www.markuswalther.org/blog/?p=11" target="_blank">einen sehr sch&ouml;nen Artikel</a> (etwas l&auml;nger) von sich selbst hingewiesen, der seine Leidensgeschichte haarklein erz&auml;hlt. Das ganze ist dringend lesenswert und wer auch immer die wahnwitzige Idee hat bei diesem Unternehmen etwas zu kaufen dem sei hier <a href="/2008/7/17/H&auml;nde-weg-von-TeleColumbus/" target="_self">noch einmal</a> davon abgeraten.</p>
<p>F&uuml;r mich selbst hoffe ich dass meine providerm&auml;&szlig;ige Irrfahrt bald vorbei ist. Nach den Problemen mit TeleColumbus und Alice hat Freenet jetzt angek&uuml;ndigt dass wir am 26. wieder Internet haben werden.</p>
<p>Dann l&auml;uft hoffentlich auch mein lokaler Server wieder.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_581" onclick="set_comment_reference(581)" title="auf diesen Kommentar antworten">#581</a>:
    23.Sep.2008 12:09
    von
    
      
        <a href="http://www.markuswalther.org" target="_blank">
          Markus Walther
        </a>
</p>
<p>vielen dank f&uuml;r die verlinkung und viel erfolg mit dem neuen provider. ich selbst bin versatel-kunde und hatte (au&szlig;er anfangs ^^) noch keine probleme.</p>
<p>Markus</p>

<p class="infos">
<a href="#comment_582" onclick="set_comment_reference(582)" title="auf diesen Kommentar antworten">#582</a>:
    23.Sep.2008 01:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>gern geschehen... :-)<br/>
Mal sehen ob ich wirklich ab Freitag wieder Internet habe.. es tut auf jeden Fall langsam not.</p>

<p class="infos">
<a href="#comment_583" onclick="set_comment_reference(583)" title="auf diesen Kommentar antworten">#583</a>:
    23.Sep.2008 01:09
    von
    
      
        <a href="http://www.markuswalther.org" target="_blank">
          Markus Walther
        </a>
</p>
<p>Nachtrag zur professionalit&auml;t von TC (habe gerade auch als kommentar in meinem blog geschrieben):<br/>
Traurigerweise scheint Telecolumbus gerade alle lokalen Kabelanbieter Deutschlands zu fressen, zumindest sehe ich in immer mehr St&auml;dten TeleColumbus-Logos.</p>
<p>&Uuml;brigens stand vor ein paar Wochen ein Telecolumbus-Vertreter vor meinem Haus (an der Aufschrift am Pullover erkannt) und erweckte ehr den Eindruck eines Obdachlosen denn eines Digital-TV-Klinkenputzers (lange ungeplegte Haare, &gt;10-Tage-Bart,  alte Jeans, insgesamt ingepflegtes &Auml;u&szlig;eres). In Anbetracht solcher Vertreter kann man nur hoffen, dass weniger Leute Auf soetwas hereinfallen...</p>
<p>ABER: Er f&uuml;llte VOR DEM HAUS auf einer Holzbank einen Vertrag mit einem Kunden aus UND rauchte nebenbei noch zufrieden eine Zigarette... Was sind denn das f&uuml;r Zust&auml;nde?</p>

<p class="infos">
<a href="#comment_584" onclick="set_comment_reference(584)" title="auf diesen Kommentar antworten">#584</a>:
    23.Sep.2008 01:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Alle eher weniger...<br/>
Es scheint sich ein Bipolares System aus Telecolumbus und KabelDeutschland zu bilden. Das macht nat&uuml;rlich Preisabsprachen und &auml;hnliches viel einfacher, man muss nichmehr so viele Gruppen koordinieren. <em>g</em></p>
<p>Egal ob das dann wirklich stattfindet... f&uuml;r den Kunden ist diese Reduktion auf wenige gro&szlig;e Anbieter SICHER nicht positiv.</p>

<p class="infos">
<a href="#comment_585" onclick="set_comment_reference(585)" title="auf diesen Kommentar antworten">#585</a>:
    23.Sep.2008 01:09
    von
    
      
        <a href="http://www.markuswalther.org" target="_blank">
          Markus Walther
        </a>
</p>
<p>simmt. bei meiner mutter wurden die preise schon angehoben (im zuge der anbieterumstellung auf telecolumbus).</p>
<p>immerhin hat sie mehr sender als ich was ich auch recht frech finde... sie bekommt z.b. einen dritten musiksender und dmax und ich nicht -.-</p>
</div>