+++
title = "E.T.-Software"
date = "2010-02-07T01:02:00"
author = "Dr. Azrael Tod"
issoid = "blog/1507"
aliases = "blog/1507"
+++

<p>Gerade hab ich bei <a href="http://torrentfreak.com/game-developers-skeptical-abou-ubisofts-new-drm-100206/" target="_blank">TorrentFreak</a> gelesen dass <a href="http://uk.pc.gamespy.com/pc/the-settlers-7-paths-to-a-kingdom/1063391p1.html">Ubisoft in Zukunft Spiele mit einer neuen Version ihres DRM (Digital Restrictions Management) ausliefern will</a>. Neuestes Feature: Spieler m&uuml;ssen mit dem Internet verbunden sein um ihre gekaufte Saft-ware nutzen zu k&ouml;nnen.<!--more--></p>
<p>Das wars dann.. auch wenn ich <strong>fast</strong> immer Internetzugang habe, aber fast ist halt doch nicht immer. Au&szlig;erdem will ich einfach keine E.T.-Software die permanent nach hause telefonieren muss.</p>
<p>Solchen Mist h&auml;tte man vor wenigen Jahren noch mit gro&szlig;fl&auml;chiger Entr&uuml;stung in allen Medien gelesen. Erinnert sich noch jemand an <a href="http://de.wikipedia.org/wiki/Microsoft_Windows_XP#Produktaktivierung" target="_blank">die Onlineaktivierung von Windows XP</a>, die Microsoft nur mit gro&szlig;en Auflagen durchsetzen konnte?<br/>Microsoft wurde damals nicht nur dazu verdonnert hohe Anforderungen einzuhalten, um sicherzustellen dass der Onlineservice auch permanent erreichbar ist, man sich auch per Modem direkt bei Microsoft einw&auml;hlen kann (und so keine Zusatzkosten anfallen f&uuml;r Internetverbindung o.&auml;.) sie mussten sich auch verpflichten einen Alternativen Weg einzubauen (Aktivierung &uuml;ber eine kostenlose Telefonhotline).</p>
<p>Heutzutage muss man bereits jedes zweite Spiel &uuml;ber eine Internetverbindung aktivieren, in 3-4 Jahren wird es v&ouml;llig normal sein wenn ich mein teuer gekauftes spiel nur noch online spielen kann und keiner wird sich mehr beschweren.</p>
<p>Bei TorrentFreak wird nat&uuml;rlich der offensichtliche Punkt angesprochen: Warum sollte ich mir ein Spiel f&uuml;r &gt;50&euro; kaufen, wenn ich es f&uuml;r 0&euro; runterladen kann, dann eine Version habe die ich NICHT aktivieren muss, ich das Spiel jederzeit und &uuml;berall spielen kann (auch ohne Internetverbindung) und dass ich einem interessiertem Freund auch mal einfach so in die Hand dr&uuml;cken kann.</p>
<p>Doch sehen wir einmal weiter: was mach in 10 Jahren? Bereits jetzt habe ich Probleme Fallout 2 durchzuspielen, auch wenn ich die Originalversion sogar doppelt besitze. Auf meiner CD sind leider nicht die passenden Patches drauf und ohne die, ist das Spiel an mehreren Stellen nicht durchspielbar. Zum Gl&uuml;ck gibt es daf&uuml;r Drittanbieter, da BlackIsle oder Interplay es nicht f&uuml;r n&ouml;tig halten den Patch deutlich findbar zum Dowload anzubieten (zumindest war das vor der Ver&ouml;ffentlichung neuerer Kombo-Packs mit dem relativ aktuellen Fallout3 der Fall).<br/>Was wenn ich Fallout 2 online aktivieren m&uuml;sste? Vlt. h&auml;tte ich Gl&uuml;ck, da es die Hersteller noch gibt.. was wenn dem aber nicht so w&auml;re? Ich kann Software nicht mehr verwenden f&uuml;r die ich Geld bezahlt hab?</p>
<p>Nat&uuml;rlich ist nicht alles was hinkt ein Vergleich, aber was w&auml;re wenn Opel verkauft wird und danach schlagartig kein Opel mehr gestartet werden kann? W&uuml;rde das den Opel-Kunden gefallen?</p>
<p>Vlt. wird es ja besser wenn es 3 Jahre dauert zwischen dem Verkauf und der Stillegung aller Autos? Nein? Dann vlt. wenn Opel sich verpflichtet, vor dem Pleitegehen noch einen "Patch" zu ver&ouml;ffentlichen, den man nur in der n&auml;chsten Werkstadt einbauen lassen muss (nachdem man ihn irgendwie bekommen hat, der Ansprechpartner ist ja seltsamerweise weg) und schon kann man wieder fahren.</p>
<p>Die Idee gef&auml;llt euch immer noch nicht? Das ist aber seltsam, bei Software scheint so ein Vorgehen ja auch keinen zu st&ouml;ren, irgendwie reagieren die Leute halt bei "virtuellen G&uuml;tern" doch noch anders als bei physikalischen Gegenst&auml;nden.</p>
<p>Die Frage w&auml;re halt nur: Existiert wirklich so ein Unterschied oder haben die Kunden einfach noch immer nicht verstanden wie sehr sie eigentlich verarscht werden.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1372" onclick="set_comment_reference(1372)" title="auf diesen Kommentar antworten">#1372</a>:
    07.Feb.2010 02:02
    von
    
      
        <a href="http://vogti.wordpress.com/" target="_blank">
          Christoph Voigt
        </a>
</p>
<p>Das ist eine Entwicklung, die ich ebenfalls immer &ouml;fter beobachte. Das erste mal wirklich negativ aufgefallen ist es mir damals kurz nach dem Release von Half Life 2. War ja ewig lang auch nur mit Internetverbindung spiel- und installierbar.</p>
<p>Auch habe ich das gef&uuml;hl, dass es mittlerweile Standard ist halb fertige Spiele auszuliefern und eventuelle L&uuml;cken im code notd&uuml;rftig per Patch nachzubessern.</p>
<p>Aber nunja... Wenn die Spieler es mit sich machen lassen... :/</p>

<p class="infos">
<a href="#comment_1373" onclick="set_comment_reference(1373)" title="auf diesen Kommentar antworten">#1373</a>:
    07.Feb.2010 03:02
    von
    
      
        <a href="http://www.felixnagel.com" target="_blank">
          Felix Nagel
        </a>
</p>
<p>Amen! und wir reden hier nicht nur von Games:<br/>
<a href="http://www.ravn.de/blog/tante-emma-runterladen%3C/p%3E" rel="nofollow">http://www.ravn.de/blo...</a>
</p></div>