+++
title = "Jabber-Howto"
date = "2008-07-02T10:07:00"
author = "Dr. Azrael Tod"
issoid = "blog/437"
aliases = "blog/437"
+++

<p>Da viele ICQ-Nutzer <a href="http://drazraeltod.wordpress.com/2008/07/01/tausende-schreien-auf/">gerade mal wieder am heulen sind</a>, weil AOL mal wieder das Protokoll ge&auml;ndert hat (Was habt ihr erwartet? Das war weder das erste Mal, noch wird es die letzte derartige Aktion sein.), hab ich mir gedacht dies w&auml;re der ideale Zeitpunkt um den Leuten mal eine kurze Einleitung zu geben wie man Jabber verwendet. (wie auch auf<a href="http://seufz.wordpress.com/2008/07/02/pidgin-und-icq/#comment-80" target="_blank"> *Seufz*</a> versprochen)</p>
<p>Nicht nur dass Jabber als offenes Protokoll<a href="http://web.swissjabber.ch/index.php/Protokoll_Jabber_vs._ICQ" target="_blank"> viele Vorteile gegen&uuml;ber ICQ</a> hat, die meisten von euch werden, zu gro&szlig;en Teilen ohne es zu wissen, bereits einen Jabber-Account haben. Die bekanntesten Freemail-Anbieter sind schon seit langem dazu &uuml;bergegangen mit ihrem Mail-Account auch einen Jabber Account auszuliefern (so gesehen bei GMail, GMX, 1&amp;1, Web.de, Tiscali und einigen Anderen).</p>
<p>Was wenn ich keine von diesen Emailadressen habe und auch nicht registrieren m&ouml;chte? Dann kann ich ziemlich einfach auch auf irgendeinem offenem Jabber-Server (ich verwende z.B. <a href="http://web.jabber.ccc.de/" target="_blank">jabber.ccc.de</a>) ein neues Konto anlegen (das geht &uuml;ber den Client selbst, man braucht nicht erst auf der, manchmal nichtmal vorhandenen, Seite zum Server rumsuchen). Eine von vielen Serverlisten gibt es z.B. <a href="http://www.jabberes.org/servers/" target="_blank">dort</a>.<br/></p><p style="text-align:left;">Kommen wir nun also zu der Clientsoftware:<br/>Unter Windows (es soll ja noch immer Leute geben die das einsetzen) w&uuml;rde ich zu <a href="http://miranda-im.de/mediawiki/index.php?title=Jabber" target="_blank">Miranda-IM</a> raten, der ist klein, schnell und kann so ziemlich alles. Auch kann der sich selbst &uuml;ber ICQ oder MSN einw&auml;hlen, sollte man Probleme mit den <a href="http://web.swissjabber.ch/index.php/Transports" target="_blank">Transports</a> haben oder sie schlicht nicht nutzen wollen.<br/>Leute die einen der genannten Mailaccounts haben k&ouml;nnen meistens auch bei dem entsprechenden Anbieter einen eigenen Client beziehen (das macht die Konfiguration noch einfacher). Google Talk unterst&uuml;tzt z.B. neben den Standardfunktionen noch Jingle-Audio (damit k&ouml;nnt ihr dann auch gleich Skype in die Tonne werfen). Bei <a href="https://www2.produkte.web.de/messenger/" target="_blank">Web.de</a> und <a href="http://service.gmx.net/de/cgi/g.fcgi/products/messenger?cc=subnav_multimessenger&amp;from=products_overview&amp;srcArea=product_navi&amp;did=2&amp;sid=babhdeb.1214987579.28236.r0mmuvqirm.75.sql" target="_blank">GMX</a> gibt es ein Programm namens MultiMessenger, dieses hab ich aber noch nicht getestet.</p>
<p>Unter Linux wird in den meisten F&auml;llen bereits ein guter Jabber-Client mitgeliefert, am verbreitetsten sind wohl <a href="http://www.pidgin.im" target="_blank">Pidgin</a> (multiprotokoll, GTK), <a href="http://www.gajim.org" target="_blank">Gajim</a> (auf Jabber spezialisiert, GTK), <a href="http://kopete.kde.org/" target="_blank">Kopete</a> (multiprotokoll, Qt) und <a href="http://psi-im.org/" target="_blank">Psi</a> (spezialisiert, Qt).<br/>Grunds&auml;tzlich kann man dazu sagen dass ein spezialisierter Client wohl die bessere Wahl f&uuml;r jemanden ist der nur Jabber einsetzt und seine restlichen Kontakte &uuml;ber Transports verwalten will. Wer unbedingt auch lokal noch bei ICQ, MSN oder irgendeinem exotischem Protokoll wie GadduGaddu angemeldet sein will kann aber jederzeit auf einen Multiprotokoll-Client zur&uuml;ckgreifen. (Dinge wie Transports sind bei den Entwicklern dieser Clients aus logischen Gr&uuml;nden nat&uuml;rlich nicht ganz so hoch in ihrer Priorit&auml;t eingestuft und daher etwas schlechter zu verwenden.)</p>
<p>Mehr Clients habe ich &uuml;brigens <a href="http://drazraeltod.wordpress.com/2008/06/29/top10-jabber-clients/">dort</a> aufgelistet.</p>
<p>Jetzt sind alle Jabber-Kontakte &uuml;ber die verschiedenen Server verteilt, dies f&uuml;hrt bei vielen zu der Frage ob man denn auch von GoogleTalk aus mit jemandem von Web.de schreiben kann..<br/>Nat&uuml;rlich kann man das, aber es kommt noch viel besser! Ihr k&ouml;nnt auch noch weiterhin mit den unverbesserlichen und ewiggestrigen schreiben die sich immer noch an ICQ oder MSN klammern, auch wenn euer Client nur Jabber unterst&uuml;tzt. Dazu k&ouml;nnt ihr euch bei Transports (eine Art Weiterleitungsserver f&uuml;r jeweils ein bestimmtes Netz) registrieren und dann z.B. mit jemandem von der ICQ-Nummer 1234567 &uuml;ber eine Adresse wie <a href="mailto:1234567@icq.jabber.blah.org">1234567@icq.jabber.bla...</a> schreiben als h&auml;tte derjenige Jabber.</p>
<p>So, Onkel Tod hat f&uuml;r heute erstmal genug erkl&auml;rt aber wenn ihr noch Fragen habt, freue ich mich auf eure Kommentare. F&uuml;r die meisten F&auml;lle sollte ich auch noch jede Menge guter Links zum weiterlesen rumliegen haben ;-)</p>
<p>[Nachtrag]</p>
<p>Anleitungen zu einzelnen Clients folgen sp&auml;ter und bekommen einen Pingback hierher</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_250" onclick="set_comment_reference(250)" title="auf diesen Kommentar antworten">#250</a>:
    02.Jul.2008 11:07
    von
    
      
        <a href="http://seufz.wordpress.com" target="_blank">
          seufz
        </a>
</p>
<p>Bin begeistert!<br/>
Gajim ich komme :P<br/>
Super geschrieben, total verst&auml;ndlich... Sch&ouml;n verlinkt. Klasse Artikel</p>

<p class="infos">
<a href="#comment_251" onclick="set_comment_reference(251)" title="auf diesen Kommentar antworten">#251</a>:
    03.Jul.2008 12:07
    von
    
      
        <a href="/2008/07/03/jabber-ist-mir-zu-kompliziert/" target="_blank">
          Jabber ist mir zu kompliziert&amp;#8230; &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] ist mir zu&nbsp;kompliziert&hellip;  Wie versprochen werde ich jetzt anhand eines Beispieles mal zeigen wie einfach es ist einen neuen Jabber-Account zu [...]</p>

<p class="infos">
<a href="#comment_252" onclick="set_comment_reference(252)" title="auf diesen Kommentar antworten">#252</a>:
    07.Sep.2008 06:09
    von
    
      
        <a href="/2008/09/07/31122008-ende-meiner-icq-nutzung/" target="_blank">
          31.12.2008 - Ende meiner ICQ-Nutzung &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] Informationen erhaltet ihr z.B. auch in meinem Jabber-Howto, bei den Anbietern der Clients oder, wie bereits gesagt, wenn ihr mich direkt per [...]</p>

<p class="infos">
<a href="#comment_253" onclick="set_comment_reference(253)" title="auf diesen Kommentar antworten">#253</a>:
    06.Feb.2010 10:02
    von
    
      
        <a href="http://senderx.de/?p=80" target="_blank">
          Sender X &amp;raquo; Blog Archiv &amp;raquo; jabber und sonst nix
        </a>
</p>
<p>[...] The Nerd Strikes Back.., aufgefallen.Aber lest einfach selber:Jabber ist mir zu kompliziert&hellip;Jabber-Howtotausende schreien auf&hellip;Top10: Jabber-Clientsviel Spa&szlig; beim lesen und jabbern, DXUNachtrag:Against [...]</p>
</div>