+++
title = "Idee um Bildschirme per WLAN zu steuern"
date = "2013-10-06T03:10:00"
author = "Dr. Azrael Tod"
tags = ["Gadget", "Hardware", "Open Source", "Technik"]
issoid = "blog/1576"
aliases = "blog/1576"
+++

<p>Hier mal meine Gedanken zu Video-Streaming, die ich schon ein paar Wochen sammel. Das soll momentan weniger ein vollst&auml;ndig ausgereiftes Konzept sein, als vielmehr ein alternativer Ansatz als Diskussionsgrundlage. Vlt. &uuml;bersehe ich ja auch was v&ouml;llig grundlegendes und das alles ist &uuml;berhaupt nicht machbar. Wenn ja, kann man mich nat&uuml;rlich wie immer in den Kommentaren oder <a href="irc://irc.freenode.net/zanzibar" title="z.B. in Channel #zanzibar auf Freenode oder #linux auf EuIRC">via IRC</a> darauf hinweisen.</p>
<p>Seit Jahren basteln Leute vergeblich daran irgendwie <a href="https://de.wikipedia.org/wiki/D%C3%BCmmster_anzunehmender_User" title="D&uuml;mmster anzunehmender User - Wikipedia-Link">DAU</a>-Tauglich kleine Media-Quellen wie Telefone, Spielekonsolen oder &auml;hnliches mit Bildschirmen zu verbinden ohne gro&szlig;en Kabelsalat zu ben&ouml;tigen.</p>
<p></p><h3>Aktueller Stand</h3><br/>Da gibt es die abenteuerlichsten Konstruktionen, so z.B.:

<p></p><ul><br/><li><a href="https://de.wikipedia.org/wiki/DLNA" title="Digital Living Network Alliance - Wikipedia-Link">DLNA</a> mit seinem <a href="https://de.wikipedia.org/wiki/UPnP" title="Universal Plug and Play - Wikipedia-Link">UPnP</a>-Unterbau</li><br/><li><a href="https://de.wikipedia.org/wiki/Chromecast" title="Googles HDMI-Streaming-Adapter - Wikipedia-Link">Chromecast</a> was das selbe tut, aber nicht einmal Video-Daten &uuml;bertr&auml;gt sondern nur URLs zu selbigen</li><br/><li><a href="https://de.wikipedia.org/wiki/Miracast" title="Wikipedia-Link zu Miracast">Miracast</a></li><br/><li><a href="https://de.wikipedia.org/wiki/AirPlay" title="Wikipedia-Link zu Apples AirPlay">AirPlay</a> (das selbe wie Miracast, aber nat&uuml;rlich Apple-Only)</li><br/><li>oder <a href="https://de.wikipedia.org/wiki/Intel_Wireless_Display" title="Intel Wireless Display (WiDi) bei Wikipedia">WiDi</a> (funktioniert nat&uuml;rlich nur mit Intel "Arrandale"-CPU, Intel-WLAN-Modul und Windows 7, wurde zu recht von Intel zugunsten Miracasts aufgegeben)</li><br/></ul>
<p></p><h3>Probleme</h3><br/>Jetzt gibt es da einen rie&szlig;engro&szlig;en Haufen Probleme die dabei auftreten.<br/>Alle dieser Ans&auml;tze bauen z.B. auf <a href="https://de.wikipedia.org/wiki/Simple_Service_Discovery_Protocol" title="Simple Service Discovery Protocol (SSDP) - Wikipedia">Auto-Discovery-Mechanismen al&aacute; UPnP</a> auf, die Zielger&auml;te schreien also alle paar Minuten per Multicast ins Netz dass sie verf&uuml;gbar sind und wenn man es ganz eilig hat, kann man auch ins Netzwerk fragen ob solche Ger&auml;te vorhanden sind und die Ger&auml;te melden sich.<br/>Das bedeutet einerseits dass man st&auml;ndig Multicast-Traffic nach 239.255.255.250:1900 (oder bei v6 [FF0?::C], wo ? je nach Scope 2,5,8 oder E ist) wirft, andernseits aber auch dass man immer ein Paket abwarten muss oder ein paar dutzend Antworten verarbeiten muss wenn man h&auml;ndisch nachfragt.<br/>Schlimmstenfalls landet man in einer Situation f&uuml;r die man eine Liste von 100 Ger&auml;ten mit &auml;hnlichem Namen bekommt, ohne jeglichen Hinweis welches das gerade gesuchte ist oder auch nur welches der Ger&auml;te &uuml;berhaupt im gleichen Geb&auml;ude steht. Man stelle sich nur mal eine gr&ouml;&szlig;ere Firma vor in welcher 100 Fernseher einer Firma auf 100 R&auml;ume verteilt wurden!

<p>Wenn man dann jedenfalls endlich das richtige Ger&auml;t gefunden hat, steht man noch immer vor dem Problem wie denn die Videodaten &uuml;bertragen werden sollten.<br/>Bei Miracast, AirPlay und WiDi wurden Codecs definiert (meist nat&uuml;rlich nur die schlimmstm&ouml;glichen, sprich die sowohl propriet&auml;ren UND minderqualitativen, als Pflicht vorrausgesetzt und wenn man ganz viel Gl&uuml;ck hat, kann das Endger&auml;t noch eingeschr&auml;nkte Subsets eines teueren, propriet&auml;ren Codecs, welcher nicht ganz so &uuml;ble Qualit&auml;t liefert).  Wenn man sich dann also auf einen Codec geeinigt hat, f&auml;ngt man an alle Ausgaben in diesen umzuwandeln (was meist auch noch zu mehr verwendeter Bandbreite, sinkender Qualit&auml;t und eigentlich immer zu deutlicher Laststeigerung auf sendender Seite f&uuml;hrt).</p>
<p>Das klingt total &uuml;bel, aber bei DLNA wird das sogar fast noch schlimmer&hellip; da gibt es eigentlich nur MPEG2/JPEG/MP3 als verpflichtende Codecs und wenn man irgendwas anderes an das Zielger&auml;t senden will, muss man davon ausgehen dass dieses den Codec einfach nicht kann. Da steht man dann vor der Wahl das doch alles umzuwandeln oder die H&auml;nde &uuml;ber den Kopf zu werfen und aufzugeben.</p>
<p>Bei Chromecast hingegen darf man sich &uuml;berlegen wie man aus dem aktuellen Inhalt eine URL baut. Klarer Zielfall ist in Google-Sichtweise wohl sicherlich die einfache YouTube-URL, f&uuml;r welche das keinerlei Problem darstellt. Schon bei Webseiten wird das aber kritisch, da die Zielger&auml;te nicht gerade sonderlich viel Leistung und RAM bieten. Wenn ich ein lokales Video auf diese Art teilen will, endet das ganze auf &auml;u&szlig;erst entt&auml;uschende Art und Weise (wobei es Leute gibt die da an einer Notl&ouml;sung der Marke "Server starten und URL zu selbigem senden" bauen).<br/>Kurz: Hauptprobleme ist an dieser L&ouml;sung sind schlicht dass man immer einen ziemlich umfangreichen R&uuml;ckkanal braucht und sehr stark von den F&auml;higkeiten des Zielger&auml;tes abh&auml;ngig ist.</p>
<p></p><h3>Alternativer Ansatz 1: NFC</h3><br/>Die "einfache" (oder eher "moderne") Art das zu verbessern w&auml;re sicherlich sowohl in Ziel als auch Quelle jeweils einen kleine NFC-Antenne einzubauen und z.B. das Telefon kurz an den Bildschirm zu halten um eine Verbindung herzustellen.<br/><ul><li>Nat&uuml;rlich w&auml;re das zus&auml;tzliche Hardware</li><li>an welche Stelle eines gr&ouml;&szlig;eren Bildschirms man das Telefon halten soll muss man dem Nutzer auch noch irgendwie begreiflich machen</li><li>dass das mit einer angesteckten Spielekonsole als Quelle nicht tun will sollte auch klar sein</li></ul>
<p>Trotzdem: es w&auml;re zumindest f&uuml;r die erkennung des Zieles in bestimmten F&auml;llen eine brauchbare <b>Erg&auml;nzung</b> zu UPnP.</p>
<p>Neuerdings gibt es ja auch schon einige Bluetooth-A2DP-Ger&auml;te, welche auf diese Art ein Pairing durchf&uuml;hren und nat&uuml;rlich k&ouml;nnte man f&uuml;r diesen Zweck auch relativ problemlos NFC durch andere, lokal eingeschr&auml;nkte Kommunikationsformen ersetzen. Z.B. einen Strichcode auf dem Zielger&auml;t (Problem: auf der Vorderseite st&ouml;rend, auf der R&uuml;ckseite nicht lesbar?) oder das langsam mit BT4.0 aufkommende Low-Energy-Profile von Bluetooth selbst (Wenn Bluetooth jetzt noch schnell genug f&uuml;r ernsthafte Video&uuml;bertragung w&auml;re&hellip;).</p>
<p></p><h3>Alternativer Ansatz 2: IR</h3>
<p>Ja ich wei&szlig;&hellip; Infrarot-Daten&uuml;bertragung ist eine mindestens 20 Jahre lang veraltete Technologie. Darum bekommt man die passenden Bauteile ja auch so billig. Also zumindest Teilweise&hellip;<br/>Als Empf&auml;nger w&uuml;rde ich aber (<a href="http://wiibrew.org/wiki/Wiimote#IR_Camera" title="Wii Kamera-Modul in den Steuer-Ger&auml;ten">wie ja jetzt schon h&auml;ufiger gesehen</a>) einen Kamera-Chip verwenden (das d&uuml;rfte wohl der teuere/aufw&auml;ndige Teil sein, evtl. k&ouml;nnte man aber auch bereits in Telefonen eingebaute Kameras dazu verwenden).</p>
<p>Dann bauen wir 4 IR-LEDs in die Ecken des Bildschirmes. <br/>Zur Unterscheidung verhalten diese sich leicht unterschiedlich, z.B. so:<br/></p><ul><br/><li>rechts unten ist konstant an</li><br/><li>links oben gibt Taktsignal</li><br/><li>eine dritte sendet Steuer-URL in Endlosschleife</li><br/><li>die verbleibende kann man sich als m&ouml;glichen R&uuml;ckkanal in sp&auml;teren Versionen erstmal vorhalten und auch nur im Takt irgendein "keine Daten"-Signal senden lassen</li><br/></ul><br/>Das Telefon erkennt mittels IR-Kamera die Position und Ziel-URL des Bildschirms, kann von dort die ben&ouml;tigten Codecs abrufen und Steuerdetails aushandeln.<br/>Die eigentliche Steuerung des Bildschirms erfolgt dann via WLAN oder Ethernet, die URL &uuml;ber welche das geschehen soll kennt man ja jetzt.

<p><b>Vorteile:</b><br/></p><ul><br/><li>mit dem Telefon drauf zeigen identifiziert das Ziel (keine lange Liste mit gleichen Namen)</li><br/><li>UPnP oder &auml;hnlicher Dreck ist nicht l&auml;nger n&ouml;tig, aber man kann es nat&uuml;rlich trotzdem parallel verwenden (z.B. f&uuml;r fest installierte Quell-Ger&auml;te ohne IR-Sensor, zu hohe entfernung oder )</li><br/><li>ein Telefon kann als ziemlich gute Air-Mouse fungieren (IR-Position und meist eh vorhandener Gyro-Sensor sollten ausreichen, Steuer-Informationen braucht man nicht &uuml;bertragen, da die Video-Daten eh vom Telefon kommen)</li><br/></ul>
<p></p><h3>Und dann&hellip;?</h3><br/>Dann streamen wir! Leider haben wir das Problem ob nun Bildschirminhalt encoden und als Stream senden vs. Videodateien einfach nur &uuml;bers Netzwerk schicken und das decoding vom Empf&auml;nger erledigen lassen noch nicht gel&ouml;st.

<p>Nat&uuml;rlich will man auch nicht immer nur Videos im Vollbild-Modus &uuml;bertragen, also braucht man einen einfachen Codec der auf leichtes packen optimiert ist. Bandbreite ist in den meisten F&auml;llen eh eher von geringerem Interesse. Trotzdem sollte es kein totaler Bl&ouml;dsinn sein, welcher abgesehen von diesem speziellem Anwendungsfall nie irgendwo verwendet wird (Ich sehe dich an "Bluetooth A2DP").<br/>Und: Wof&uuml;r gibt es freie Codecs?</p>
<p>Damit aber aufzuh&ouml;ren ist dann genauso albern.<br/>Mindestens 3-4 der h&auml;ufigsten Videocodecs sollten auch unterst&uuml;tz werden oder zumindest unterst&uuml;tzbar sein, man kann ja Ger&auml;teklassen oder gar einen vern&uuml;nftigen Aushandlungs-Vorgang einbauen (Wer nichts au&szlig;er minimal-n&ouml;tiges unterst&uuml;tzt, kann sich dann halt einen alternativen Aufkleber aufs Ger&auml;t pappen al&aacute; "Mediasharing-Foo Base-Profile" vs. "Mediasharing-Foo Extended-Profile")</p>
<p>Wenn der Bildschirm dann z.B. sagt dass er kein 1080p WebM kann, kann man noch immer auf den Basis-Modus zur&uuml;ckschalten und die Inhalte neu codieren, aber wenn er es kann spart man sich Rechenleistung/Netzwerktraffic/Qualit&auml;tsverlust und nicht zu letzt Akkulaufzeit.</p>
<p>Wenn man dann noch GANZ vorbildlich sein will, implementiert man einen "Fenster-Modus", bei welchem man einen prim&auml;ren Stream (Desktop-Inhalt) darstellt,  an bestimmten Koordinaten aber einen sekund&auml;ren Stream &uuml;berlagert (z.B. Videoplayer-Fenster mit WebM-Film)</p>
