+++
title = "Klo-Content und warum deutsche Blogs (nicht?) funktionieren"
date = "2008-07-19T06:07:00"
author = "Dr. Azrael Tod"
issoid = "blog/486"
aliases = "blog/486"
+++

<p>Ren&eacute; auf Nerdcore regt sich gerade in einem wirklich lesenswerten Beitrag <a href="http://www.nerdcore.de/wp/2008/07/19/warum-blogs-in-deutschland-funktionieren/" target="_blank">"warum Blogs in Deutschland funktionieren"</a> &uuml;ber Beitr&auml;ge bei <a href="http://www.fixmbr.de/warum-blogs-in-deutschland-nicht-funktionieren/">Fixmbr</a> und <a href="http://don.antville.org/stories/1816384/" target="_blank">Don Dahlman</a> auf. Dazu muss ich einfach auch mal meinen Senf abgeben...</p>
<p><!--more--></p>
<p>(F!xmbr trollt halt mal wieder, ist ja eigentlich <a href="http://drazraeltod.wordpress.com/2008/04/15/twitter-bashing/" target="_self">nichts</a> <a href="http://drazraeltod.wordpress.com/2008/04/04/trolle-bei-fxmbr/" target="_self">neues</a>...)</p>
<p>Ren&eacute; stellt fest dass die deutschen Blogs sehr wohl funktionieren und dass f&uuml;r ihn pers&ouml;nlich das Problem eher darin liegt dass viele Content liefern der keinen interessiert.</p>
<p>Ich werde mir mal ansehen wie man auf die Idee kommt das Blogs in DE nicht funktionieren..</p>
<p>Der Normalfall ist hier nunmal scheinbar der Ausflugsblogger der &uuml;ber seine neueste Reise berichten will, nebenbei etwas von seiner Wordpress-Optimierung erz&auml;hlt (weil er sich damit besch&auml;fftigt hat) und gr&uuml;&szlig;e an alle anderen bekannten Alpha-Blogger rausschickt. Klo-Content al&aacute; "Mein Stuhl sieht komisch aus" ist nunmal nicht jedermanns geschmack (&uuml;brigens genau der selbe Grund warum ich <a href="http://drazraeltod.wordpress.com/2008/05/26/twitter-ist-tot/" target="_blank">aufgeh&ouml;rt habe Twitter zu nutzen</a>...) und Otto-Normal-Surfer wollen nicht wissen welches Wordpress-Plugin wieviele Vorteile f&uuml;r den Blogger bringt denn Otto-Normal-Surfer SIND KEINE BLOGGER!</p>
<p>Wer also solche Inhalte vermitteln will erreicht genau die Leute die sich f&uuml;r das selbe interessieren: andere Alpha-Blogger die ebenfalls Klo-Content posten und dringend die neuesten Wordpress-Plugins ausprobieren wollen, damit hat man dann auch gleich ein paar nette Verlinkungen und eine sch&ouml;ne Diskussion</p>
<p>Doch jetzt stellt sich also ein Teil dieser Leute hin und beschwert sich dass die Presse und die breite &Ouml;ffentlichkeit sich nicht f&uuml;r genau den selben Mist interessieren? Was habt ihr erwartet? Ihr seid gut verlinkt aber ihr bringt keine Inhalte, welche Inhalte sollte die Presse denn aufgreifen?</p>
<p>Wer Links verteilen, neue Anwendungen demonstrieren, Code-Tuts posten oder jegliche andere Art f&uuml;r "die Allgemeinheit" interessanten Content liefern will, der kann das tun und im allgemeinen funktioniert das auch... der einzige Abstrich den man machen muss ist die Verlinkung von Seitens der Alpha-Blogger, denn die verlachen solche Blogs nur und wundern sich wer das lesen sollte.</p>
<p>Ren&eacute; zeigt auch daf&uuml;r einen netten Kommentar:<br/></p><blockquote>Ich mag das und mir macht diese Art zu bloggen jede Menge Spa&szlig; und im Gegensatz zu Dons Behauptung, Agenturen w&uuml;rden sich nicht f&uuml;r Blogs interessieren, kriege ich praktisch t&auml;glich mehrere Mails aus PR-Agenturen mit irgendwelchen Angeboten, von denen ich 99% nicht annehme (soviel &uuml;brigens zu Chris&rsquo; Bl&ouml;dsinn von wegen: &bdquo;Der Nerdcore-Rene schaltet mittlerweile fast f&uuml;r den Hans und Franz Werbung und macht fast bei jedem Werbemist mit&ldquo;. Er hat ja nichtmal die Eier, einen Trackback zu setzen, damit man auch mitbekommt, dass &uuml;ber einen geschrieben wird, aber so isser eben, unser Chris).</blockquote><br/>Evtl. sollte man darin ja mal den Grund suchen warum die Presse hierzulande kaum Themen aus deutschen Blogs aufgreift?

<p>Es gibt nat&uuml;rlich auch in deutschland gute Blogs die hochwertige Inhalte posten, auch wenn ich an dieser Stelle weniger Nerdcore (Sorry Ren&eacute; aber Youtube-Inhalte und Geek-Toys sind f&uuml;r mich interessant, f&uuml;r meine Leser und Kumpels evtl. auch noch, aber nichts was die Presse aufgreifen w&uuml;rde) sondern eher Blogs wie <a href="http://blog.fefe.de/" target="_blank">der von Fefe</a> die sich auch mal mit Politik und Wirtschaft auseinander setzen und kurze Pr&auml;gnante Aussagen kombiniert mit Links und Schlussfolgerungen zusammenstellen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_373" onclick="set_comment_reference(373)" title="auf diesen Kommentar antworten">#373</a>:
    19.Jul.2008 07:07
    von
    
      
        <a href="http://www.from-hades.de" target="_blank">
          Oliver
        </a>
</p>
<p>Was soll denn jedes mal der Schei&szlig; mit dem Getrolle, wenn man a) etwas nicht verstehen will oder b) die Erfahrung fehlt? Wieviel Hits bringst du denn pro Tag zusammen und wie oft wurdest du schon in Bl&auml;ttern wie Handelsblatt, Frankfurter Rundschau etc. erw&auml;hnt? Es ist kein Problem Erw&auml;hnung zu finden, insbesondere wenn man eine gewisse Gr&ouml;&szlig;e besitzt. Das passiert auch uns h&auml;ufiger, nur wollen wir nichts verkaufen und es ist somit ein netter Nebeneffekt.</p>
<p>Das Getrolle &uuml;berlassen wir also gerne jenen die auf irgendeine Weise versuchen Anschlu&szlig; an die "gro&szlig;e Welt" der gr&ouml;&szlig;eren Blogs zu finden. Auf gut Deutsch wir k&ouml;nnen uns mit diesen Gr&ouml;&szlig;en messen ohne Linkgeficke, wie es einmal ein guter Bekannter treffend umschrieb.</p>
<p>Das Problem des Berliner Netzwerks, Achtung keine Verschw&ouml;rungstheorie sondern real existierend, ist die Vermarktungsmaschinerie die diesen vorschwebt und welche deren Tun und Handeln dominiert. Und bitte, wenn man es nicht wei&szlig; sollte man sich auch nicht von der Oberfl&auml;chlichkeit blenden lassen, Profis sind diejenigen aus Berlin schon, denn sie wissen wie man au&szlig;en hui und innen pfui daherkommt. Sprich Austeilen hinter der Kulissen, aber so das es fetzt und das bedeutet keineswegs mal ein wenig flameware wie du ihn hier a la Ponyhof-Romantik eines "Klein-Bloggers" vermutest.</p>
<p>Anderes Problem, die Presse in Deutschland ist konservativ und sieht die Blogs bzw. einen Teil davon als existenzbedrohende Konkurrenz an, andere wie FR oder Handelsblatt erkennen die viralen M&ouml;glichkeiten. Ergo zieht man auch die News heraus, vermeidet jedoch die Nennung der Quelle, wohlwissend welchen Dienst man denjenigen leisten w&uuml;rde. Aber das w&auml;re kontrakproduktiv f&uuml;r das eigene Gesch&auml;ft.</p>
<p>Gegenfrage hast du schon einmal in einer Redaktion gearbeitet, den Alltag erlebt, dort auch u.a. deine Br&ouml;tchen verdient?</p>
<p>&gt;Doch jetzt stellt sich also ein Teil dieser Leute hin und beschwert sich dass die Presse und die breite &Ouml;ffentlichkeit sich nicht f&uuml;r genau den selben Mist interessieren? Was habt ihr erwartet? Ihr seid gut verlinkt aber ihr bringt keine Inhalte, welche Inhalte sollte die Presse denn aufgreifen?</p>
<p>Insofern ist das eine Null-Aussage, da das Thema mangels Kenntnis komplett verfehlt wurde.</p>
<p>&gt;Klo-Content al&aacute; &ldquo;Mein Stuhl sieht komisch aus&rdquo; ist nunmal nicht jedermanns geschmack</p>
<p>Das Problem ist, das man Kultur/Gesellschaft nicht im Ansatz begreift, wenn man denn derartig gewichtet. Und ich werde Rene definitiv nicht &uuml;ber den gr&uuml;nen Klee loben, aber sein Kontent ist ebenso ad&auml;quat wie derjenige von Spon oder FAZ, den man mangels Niveau als h&ouml;herwertig einstuft. Ob er sich allerdings lukrativ vermarkten l&auml;&szlig;t ist eine v&ouml;llig andere Sache.</p>
<p>Und was die Masse eben lesen m&ouml;chte, interessiert eigentlich nur diejenigen die ihre Inhalte verkaufen m&ouml;chten.</p>
<p>Du mu&szlig;t dich schon entscheiden, m&ouml;chtest du erfolgreich sein in puncto des schn&ouml;den Mammons, dann hei&szlig;t das auch f&uuml;r dich das Niveau zu senken, so das es Mainstream-kompatibel wird. M&ouml;chtest du das Niveau heben oder blogst zum Spa&szlig;, dann darfst du gerne das Niveau anheben, mu&szlig;t dich jedoch nicht &uuml;ber mangelnde Leser wundern.</p>
<p>Falls du schon mal in Fachverlagen ver&ouml;ffentlicht hast, sprich Texte in einer wissenschaftlichen Reihe, so wird dir das Dilemma bekannt vorkommen. Niveau l&auml;&szlig;t nicht die Kasse klingeln.</p>
<p>Also trenne bei der n&auml;chsten Betrachtung erst einmal jene die erreichen wollen ob einer Sache und jene die auf Gewinnmaximierung aus sind.</p>
<p>&gt;der einzige Abstrich den man machen muss ist die Verlinkung von Seitens der Alpha-Blogger, denn die verlachen solche Blogs nur und wundern sich wer das lesen sollte.</p>
<p>Wir machen es nicht und werden doch schon lange zu dieser elenden Riege dazugez&auml;hlt. So ist das eben mit der Realit&auml;t des Bloggens, der Presse und einigen Kommerzaposteln.</p>
<p>&Uuml;brigens ein gutes Beispiel &uuml;brigens was geht zeigt Robert Basic, der von seinem Blog lebt, ein breites Spektrum abdeckt und vor allen anderen kommt. Und per Definition deinerseits w&auml;re dort auch gen&uuml;gend Klo-Kontent drunter, das Spektrum macht es eben und die Art wie man sich "verkauft", wenn man das denn m&ouml;chte.</p>

<p class="infos">
<a href="#comment_374" onclick="set_comment_reference(374)" title="auf diesen Kommentar antworten">#374</a>:
    19.Jul.2008 07:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Robert Basic ist auch nicht umsonst ein sehr gutes Beispiel daf&uuml;r was ich mit Klo-Content schleudernden Alpha-Bloggern meine, klar lebt der von seinem Blog und man kann wohl auch nicht bestreiten dass er Erfolg im Sinne von Hits hat... aber den Erfolg als Tats&auml;chliche Informationsquelle zu dienen (was imho der Sinn eines Mediums ist) m&ouml;chte ich hier bestreiten.<br/>
Ich kann mich nicht erinnern wann ich das letzte mal neue Informationen bei Basic bekommen habe, von Niggermaier oder &auml;hnlichem ganz zu schweigen.</p>
<p>Ich will das auch nicht falsch verstanden wissen, Blogs wie der von Basic oder erst recht F!xmbr liefern durchaus derartige Inhalte und interessante Artikel, f&uuml;r mich stellt sich als Leser jedoch immer die Kosten/Nutzen-Frage und da f&auml;llt Basic raus weil ich mich einfach durch zuviel unm&ouml;glichen Mist mit nichtssagenden &Uuml;berschrifften und ewiglangem Text w&uuml;hlen muss. (F!xmbr hat diesbez&uuml;glich bei mir eine Sonderstellung, euere Inhalte sind meist ziemlich interessant aber aus Trolligkeitsgr&uuml;nden seid ihr ebenfalls aus meiner Leseliste entfernt worden, dies ist jedoch pers&ouml;nliche Geschmackssache.)</p>
<p>Ich finde es &uuml;brigens interessant dass ich keine Ahnung habe weil ich so wenig Besucher mit G33ky.de anziehe. (da haben wir sie wieder, die F!xmbr Trollerranz)<br/>
Wer keinen erfolgreichen Blog betreibt, kann also auf keinen Fall einsch&auml;tzen was er gerne lesen w&uuml;rde?<br/>
Dann sollte ich auf keinen Fall selbstst&auml;ndig ausw&auml;hlen welche Tageszeitung ich lese, da ich ja selber keines der Top-Bl&auml;tter in Deutschland betreibe. (Vlt. sollte Bild das f&uuml;r mich entscheiden und meine Meinung bilden?)</p>
</div>