+++
title = "Wie gläsern wir wirklich sind, Teil^W ich hab aufgehört zu zählen"
date = "2008-07-29T10:07:00"
author = "profmakx"
issoid = "blog/511"
aliases = "blog/511"
+++

<p>Gestern trug es sich zu, dass ich Bargeld an einem Automaten auf mein Konto einzahlen wollte, es war keine riesige Summe, aber ich f&uuml;hle mich nicht wohl, wenn ich zu viel Geld mit mir rumtrage, auch wenn ich es bevorzuge meine Eink&auml;ufe mit Bargeld zu t&auml;tigen ob der abstrusen AGB die man so auf den Kassenzetteln findet wenn man sie mal liest.</p>
<p>Einen Schein nahm der Automat zun&auml;chst nicht an. Er war geknickt an einer Seite und deswegen b&uuml;gelte ich ihn ein bischen aus und steckte ihn noch einmal in den Automaten. Dann wollte ich eine Quittung &uuml;ber die Einzahlung haben. Darauf stand<br/></p><blockquote>"x EUR werden gebucht. Darin enthaltenes f&auml;lschungsverd&auml;chtiges Geld in H&ouml;he von y EUR wird ihrem Konto nur unter Vorbehalt gutgeschrieben"</blockquote>
<p>Nungut. Also ging ich heute mal zur Bank um zu fragen was das letztendlich f&uuml;r mich bedeutet, wenn diese y EUR wirklich falschgeld sind, schliesslich ist es strafbar Falschgeld in Umlauf zu bringen.</p>
<p>Alles halb so wild! Ich zitiere einmal frei aus meinem Ged&auml;chtnis:</p>
<p></p><blockquote><br/>Das ist erstmal nicht so wild. Sollte sich wirklich rausstellen, dass das Falschgeld ist wird die Kripo sie Kontaktieren. <strong>Man kann ja feststellen wo der Geldschein &uuml;berall langegangen ist</strong> und sie sind halt da ein L&uuml;cke, die man dann f&uuml;llen kann.<br/></blockquote>
<p>Die k&ouml;nnen Zur&uuml;ckverfolgen wo jeder einzelne Geldschein langgegangen ist? Wenn jemand mehr dazu weiss, nurzu!</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_407" onclick="set_comment_reference(407)" title="auf diesen Kommentar antworten">#407</a>:
    29.Jul.2008 10:07
    von
    
      
        <a href="http://www.klonblog.com" target="_blank">
          Kloni
        </a>
</p>
<p>Das kann doch gar nicht gehen...! du m&uuml;sstest denen wohl schon erz&auml;hlen, von wem du den schein hast, aber wer weiss das schon! Man kann wohl den Schein verfolgen, in welchen Banken und Atomaten er rein und raus gegangen ist, aber doch nicht in welchen L&auml;den usw. er Bargeld war! komische Sahche!</p>

<p class="infos">
<a href="#comment_408" onclick="set_comment_reference(408)" title="auf diesen Kommentar antworten">#408</a>:
    29.Jul.2008 01:07
    von
    
      
        Tsukama
      
    
    
  </p>
<p>Mehr dazu wei&szlig; ich zwar nicht, aber die Antwort von der Bankerin zeigt mir, dass es ziemlich bums ist, ob ich mit Karte oder Bargeld zahle. Gl&auml;sern ist gl&auml;sern, bleibt gl&auml;sern....</p>
<p>Hoofe jedenfalls f&uuml;r Dich, dass es kein falsche Schein war! W&auml;re schade um den Betrag, der evtl. dann auf dem Konto fehlte.</p>

<p class="infos">
<a href="#comment_409" onclick="set_comment_reference(409)" title="auf diesen Kommentar antworten">#409</a>:
    29.Jul.2008 02:07
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Naja, was sie nicht feststellen k&ouml;nnen is, wieviele H&auml;nde das Geld zwischen Auszahlung und einzahlung gesehen hat. M&uuml;nzen sind ja ebenfalls nicht verfolgbar mangels Seriennummer.</p>
<p>Ich fand nur die Selbstvert&auml;ndlichkeit der &Auml;usserung erschreckend.</p>

<p class="infos">
<a href="#comment_410" onclick="set_comment_reference(410)" title="auf diesen Kommentar antworten">#410</a>:
    29.Jul.2008 04:07
    von
    
      
        <a href="http://www.zu-brot.de/?p=234" target="_blank">
          Das gro&szlig;e Blog der kleinen Momente &amp;raquo; Blog Archive &amp;raquo; Umz&uuml;gig
        </a>
</p>
<p>[...] uns R&uuml;ckschl&uuml;sse &uuml;ber euer Verhalten erm&ouml;glicht. Unheimlich, nicht wahr? Ja, das ist er, der gl&auml;serne Mensch. Da wir das hier aber nur zum &ldquo;Guten&rdquo; zu nutzen gedenken, k&ouml;nnnt ihr euch aber [...]</p>

<p class="infos">
<a href="#comment_411" onclick="set_comment_reference(411)" title="auf diesen Kommentar antworten">#411</a>:
    29.Jul.2008 04:07
    von
    
      
        hanneshh
      
    
    
  </p>
<p>Falschgeld in Verkehr zu bringen ist strafbar nach &sect; 147 StGB. Voraussetzung ist aber nat&uuml;rlich, dass du wusstest, dass es Falschgeld ist und es wenigstens recht war, dass es in den Verkehr kommt. Au&szlig;erdem war es ja schon "im Umlauf". Strafrechtlich kann es da f&uuml;r dich sicherlich &uuml;berhaupt keine Konsequenzen geben. Nur den Betrag, den bekommst du dann nicht gutgeschrieben.</p>
<p>Ob man aus der Aussage der Kassiererin jetzt R&uuml;ckschl&uuml;sse auf "den gl&auml;sernen Menschen" ziehen kann, wage ich mal zu bezweifeln. F&uuml;r mich klingt es nicht so, als w&uuml;sste sie &uuml;ber das gesagte hinaus irgendwie bescheid. Im Zweifel wird sie sich noch nie direkt mit den Folgen besch&auml;ftigt haben. Nachverfolgen, wo der Schein herkommt, kann die Polizei gewiss auch nur, indem sie dich fragen, wo du ihn her hast. Sind ja keine Zauberer ;)</p>

<p class="infos">
<a href="#comment_412" onclick="set_comment_reference(412)" title="auf diesen Kommentar antworten">#412</a>:
    29.Jul.2008 07:07
    von
    
      
        <a href="http://fidel.vido.info/wordpress" target="_blank">
          fidel
        </a>
</p>
<p>mh, kommt mir auch spanisch vor, aber im ansatz w&auml;re dies schon m&ouml;glich</p>
<p>beispiel:<br/>
ich kaufe bar Artikel XY bei Gravis, die scannen Geldscheine beim bezahlen (prim&auml;r wg. Pr&uuml;fung auf Bl&uuml;ten nehme ich an)</p>
<p>Fehlt nur das Gravis die Daten an eine zentrale Stelle weiterleitet und schwups habe ich schon eine minimale nachvollziehbarkeit.</p>
<p>In den jeweiligen Automaten der Banken sollte das auslesen der seriennummer auch kein problem sein ... und schon ist das netz engmaschiger.</p>
<p>wobei man eigentlich schon davon geh&ouml;rt h&auml;tte, w&uuml;rde es sowas Ketten-&uuml;bergreifend geben.</p>

<p class="infos">
<a href="#comment_413" onclick="set_comment_reference(413)" title="auf diesen Kommentar antworten">#413</a>:
    30.Jul.2008 12:07
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Das ja auch ein scharfes Szenario ist: Angenommen das Ding ist Falschgeld. Da sind ja meine Fingerabdr&uuml;cke druff, die m&uuml;sste die Kripo nehmen um meine auszuschliessen. Und schon habe ich meine Fingerabdr&uuml;cke in einer Datenbank in der ich sie lieber garnicht erst gehabt h&auml;tte. Und zwar nur, weil mir ein falscher Schein &uuml;ber den Weg gelaufen ist.</p>
</div>