+++
title = "Telekom und Glasfasern"
date = "2012-08-31T12:08:00"
author = "Dr. Azrael Tod"
tags = ["Dresden", "Rant", "Sprache", "Technik"]
issoid = "blog/1568"
aliases = "blog/1568"
+++

<p></p><p><a href="http://www.heise.de/ix/meldung/VDSL-Vectoring-Telekom-erwaegt-neue-Breitbandtechnik-im-Festnetz-1695763.html">Heise meldet gerade</a> dass die Telekom jetzt doch lieber erstmal auf Kupfer statt auf Glasfaser setzen will.<br/>Die verwendete Technologie nennt sich "VDSL-Vectoring".<br/>Ich denke mal ich werde den Artikel einfach mal auf Endkunde &uuml;bersetzen&hellip;</p>
<p></p><blockquote><br/> <p>Vor einigen Tagen empfahlen Analysten von J.P. Morgan der Deutschen Telekom, statt des teuren Glasfaserausbaus als Alternativtechnologie lieber VDSL in Verbindung mit dem sogenannten Vectoring voranzutreiben. Das Unternehmen k&ouml;nnte so auf den vorhandenen Kupferanschlussleitungen den Kunden nahezu fl&auml;chendeckend hochbitratiges VDSL anbieten und seine Position auf dem Breitbandmarkt gegen&uuml;ber den Kabelnetzbetreibern st&auml;rken, dies aber zu einem Bruchteil der auf etwa 40 Milliarden Euro gesch&auml;tzten Kosten f&uuml;r ein Fiber-to-the-Home-Netz (FTTH). Den Preis f&uuml;r das Upgrade des Kupfernetzes bezifferten die J.P. Morgan-Analysten demgegen&uuml;ber auf 5 bis 6 Milliarden Euro.</p><br/></blockquote>
<p></p><p>Weiter VDSL als Kr&uuml;cke auf Kupferkabeln zu betreiben ist f&uuml;r Telekom erst mal um den Faktor 6-8 billiger als Glasfaser auszubauen. Man kann damit ohne ernsthaft in Infrastruktur zu investieren weiterhin Kunden in den Innenst&auml;dten (au&szlig;er nat&uuml;rlich Gegenden wie z.B. Dresden <a href="http://de.wikipedia.org/wiki/Striesen">Striesen</a>/<a href="http://de.wikipedia.org/wiki/Blasewitz_(Ortsamtsbereich)">Blasewitz</a>, da k&ouml;nnte man <a href="http://de.wikipedia.org/wiki/GPON#Verbreitung_in_Deutschland">noch eine Weile warten m&uuml;ssen</a>) bei Laune halten</p>
<p></p><blockquote><br/> <p>Heute best&auml;tigte Vorstandsmitglied Niek Jan van Damme, dass die Deutsche Telekom diese Alternative in Erw&auml;gung zieht. "Das Vectoring ist absolut eine interessante Technologie", erkl&auml;rte er auf der Pressekonferenz des Unternehmens am Vortag der IFA-Er&ouml;ffnung. "Wir &uuml;berpr&uuml;fen im Moment die M&ouml;glichkeiten, die es gibt."</p><br/></blockquote>
<p></p><p>"Hey, Geil! Geld sparen!"</p>
<p></p><blockquote><br/> <p>Die Telekom habe im letzten Jahr 160.000 Haushalte mit der Glasfaser erschlossen, erl&auml;uterte der Sprecher der Gesch&auml;ftsf&uuml;hrung von Telekom Deutschland; in diesem Jahr sollen weitere 170.000 hinzukommen. "Ich glaube grunds&auml;tzlich daran, dass letztendlich nur <a href="http://de.wikipedia.org/wiki/FTTH#Fibre_To_The_Home">FTTH</a> die L&ouml;sung sein wird", bekr&auml;ftigte van Damme. "Irgendwann wird man Glasfaser brauchen &ndash; und nicht nur in Ballungsgebieten oder St&auml;dten, sondern auch im l&auml;ndlichen Raum." Aber der Weg dahin sei ein lang. "Da brauchen wir, glaube ich, 20 bis 30 Jahre, bis wir ganz Deutschland versorgt haben." Wo der Glasfaserausbau wirtschaftlich vertretbar sei, werde er erfolgen, f&uuml;gte er hinzu. "Parallel schauen wir uns nat&uuml;rlich Alternativen an."</p><br/></blockquote>
<p></p><p>Wir haben da mal lustlos angefangen, aber das dauert noch so 20-30 Jahre bis wir fl&auml;chendeckend vern&uuml;nftiges Internet verkaufen k&ouml;nnen. Wir machen das also nur wenn es genug Profit bringt (sprich: nicht auf dem Land oder in Einfamilienh&auml;usern oder so).</p>
<p></p><blockquote><br/> <p>Das von der ITU-T als <a href="http://www.broadband-forum.org/marketing/download/mktgdocs/MR-257.pdf">G.993.5 alias G.vector</a> vor zwei Jahren <a href="http://www.itu.int/ITU-T/workprog/wp_item.aspx?isn=6623">standardisierte Verfahren</a> nutzt dank schneller digitaler Signalverarbeitung die durch das &Uuml;bersprechen auf benachbarten Leitungen im Kabelb&uuml;ndel &uuml;bermittelten Signalanteile aus, die bisher immer als Verluste bzw. St&ouml;rung angesehen wurden. Die Gesamtheit der Kupferdoppeladern im Kabelb&uuml;ndel werden dabei zu einem von den Teilnehmern gemeinsam genutzten Medium. Auf diese Weise erm&ouml;glicht G.vector VDSL2-Geschwindigkeiten von 100 Mbit/s &uuml;ber Entfernungen von mehr als 500 Metern. Weil in Deutschland Verzweigungskabel typischerweise 100 Kupferdoppeladern enthalten und 90 % aller Verzweigungsleitungen eine L&auml;nge von weniger als 500 m haben, lie&szlig;e sich mit dieser Technik, die in Belgien, England und &Ouml;sterreich bereits getestet wird, nahezu eine hochbitratige Fl&auml;chendeckung im Festnetz erreichen.</p><br/></blockquote>
<p></p><p>Bestenfalls erreichen wir 90% aller Haushalte (Was sind schon 8mio Menschen? Wir wollen die lukrativen Kunden und nicht irgendwen mit Internet versorgen!). Das passiert nat&uuml;rlich nur wenn wir diesen Hack auf einem Hack auf einem Hack so fl&auml;chendeckend ausbauen wie m&ouml;glich, die Kabel &uuml;berall so verlegt sind wie in den Specs steht und die Leute sich mit 100MBit Down und vlt. 1-2MBit Up begn&uuml;gen. Achja: hab ich erw&auml;hnt dass dann alle Nachbarn ein shared-medium haben, also wenn dein Nachbar gerade ordentlich Torrents am Laufen hat, bei dir nichts mehr geht?</p>
<p></p><blockquote><br/> <p>Der Haken dabei ist allerdings, dass immer nur ein Netzbetreiber das VDSL-Vectoring in einem Leitungsb&uuml;ndel einsetzen kann und das Entb&uuml;ndeln der Teilnehmeranschlussleitung (TAL) am Kabelverzweiger nicht mehr m&ouml;glich w&auml;re. Weil dann Wettbewerbern der Endkundenzugang &uuml;ber den Zugriff auf die einzelne TAL verwehrt bliebe, steht das Telekommunikationsrecht dem Einsatz der Technik bislang im Wege. Die Deutsche Telekom m&uuml;sste erst aus der Verpflichtung entlassen werden, den Konkurrenten am Kabelverzweiger die einzelne TAL entb&uuml;ndelt zur Verf&uuml;gung zu stellen. Van Damme hofft aber auf die Aufgeschlossenheit der Politik, "sonst funktioniert Vectoring nicht". Man wolle nun mit der Bundesnetzagentur ins Gespr&auml;ch kommen, "um zu sehen, welche M&ouml;glichkeiten es da gibt".</p><br/></blockquote>
<p></p><p>Vlt. k&ouml;nnte man sogar Synergieeffekte nutzen und auf dem Weg wieder sch&ouml;n durchdr&uuml;cken dass die Telekom ihr Leitungsmonopol zumindest teilweise wieder bekommt. Es geht hier doch nur um den Vorteil f&uuml;r die Kunden!<br/>Andere Anbieter k&ouml;nnen dann ja anfangen Glasfasern zu verlegen, wenn sie unbedingt Internet verkaufen wollen&hellip;</p><br/>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1596" onclick="set_comment_reference(1596)" title="auf diesen Kommentar antworten">#1596</a>:
    22.Oct.2012 10:10
    von
    
      
        <a href="http://doktorsblog.de/" target="_blank">
          Chris
        </a>
</p>
<p>Schon etwas l&auml;cherlich, diese Ausbaupl&auml;ne. naja, ich teste sp&auml;ter mal LTE ;) </p>

<p class="infos">
<a href="#comment_1618" onclick="set_comment_reference(1618)" title="auf diesen Kommentar antworten">#1618</a>:
    09.May.2013 05:05
    von
    
      
        <a href="http://linux-workers.posterous.com/" target="_blank">
          Ikem
        </a>
</p>
<p>Das Problem ist, das die Telekom Geld erhalten hat, um den Glasfaserausbau voranzutreiben.</p>
<p>Nun bauen sie das Glasfasernetz aber nicht aus. Das nennt man mal Beschiss!</p>

<p class="infos">
<a href="#comment_1660" onclick="set_comment_reference(1660)" title="auf diesen Kommentar antworten">#1660</a>:
    07.Jul.2013 06:07
    von
    
      
        snowlyjam
      
    
    
  </p>
<p>hello</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1661">
<p class="infos">
<a href="#comment_1661" onclick="set_comment_reference(1661)" title="auf diesen Kommentar antworten">#1661</a>:
    08.Jul.2013 12:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>goodbye</p>
</div>
</li>
</ul>
</div>