+++
title = "Twitter-Bashing"
date = "2008-04-15T10:04:00"
author = "Dr. Azrael Tod"
issoid = "blog/344"
aliases = "blog/344"
+++

<p>Die Jungs von <a href="fixmbr.de">F!xmbr</a> sind mal wieder am rumtrollen und ich muss nat&uuml;rlich drauf anspringen...<br/>Diesmal <a href="http://www.fixmbr.de/twitter-der-grte-bldsinn-aller-zeiten/">l&auml;stern sie  &uuml;ber Twitter</a> und kommen zu dem Schluss es w&auml;re der gr&ouml;&szlig;te Bl&ouml;dsinn aller Zeiten.<br/>Und auch wenn ich flei&szlig;ig mitzwitscher, kann ich mich dieser Meinung nicht ganz entziehen. Auf der anderen Seite, hat aber auch einer ihrer Leser (<a href="http://www.peterkroener.de/">Peter</a>) einen ganz netten Kommentar gebracht:<br/><br/></p><blockquote>Wenn das raushauen von Links, die keinen eigenen Blogpost rechtfertigen, Seelenstriptease ist, will ich nicht angezogen bleiben.</blockquote><br/><br/>Ich gebe zu, dass Twitter bl&ouml;dsinn ist und man viel zu viel Zeit damit vertr&ouml;delt irgendwelchen Bl&ouml;dsinn von irgendwelchen Spinnern zu lesen und darauf zu antworten. (100x "Guten Morgen, bin grade aufgestanden" zu lesen enth&auml;llt nicht wirklich viel Information)<br/>Aber Twitter ist eben nur ein Werkzeug und was man damit macht ist eben jeweils immer die Sache der betreffenden Person. Ich finde Twitter ganz praktisch, wenn es darum geht einfach nur Links ins Web2.* zu pusten. Einfach weil es Zeitn&auml;her ist als RSS-Streams. Man kann imho den Unterschied zwischen Twitter (per Jabber) und Post&uuml;berschrifften per RSS ungef&auml;hr mit dem Unterschied zwischen einem Email-Push-Dienst f&uuml;rs Blackberry und dem h&auml;ndigen abholen der Emails vergleichen.<br/><br/>Was ich f&uuml;r v&ouml;lligen Bl&ouml;dsinn halte sind all diejenigen Argumente von der F!xmbr-Crew, die in die Richtung "Twitter stellt das Aus f&uuml;r die Privatsph&auml;re dar" laufen.<br/>Das gleiche k&ouml;nnte man &uuml;ber Blogs, die Statusmeldung im InstantMessenger (oder /away bei IRC) oder jegliches andere Protokoll schreiben, auf dem die Leute angeben was sie grade tun. Sicher gew&auml;hrt man Einblicke in die Privatsph&auml;re.. aber nur soweit man WILL. Das meine lieben Herren von F!xmbr ist die Freihet &uuml;ber seine eigenen Informationen zu bestimmen und das ist auch der Fakt, den ihr wohl nie verstehen werdet. Verschl&uuml;sselung ist sch&ouml;n und gut, aber sie ist nicht alles was im Internet wichtig ist. Im Internet geht es nunmal auch ganz nebenbei ein wenig um Informationsaustausch... nicht nur um das verstecken von Informationen.
      
    
  <div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_71" onclick="set_comment_reference(71)" title="auf diesen Kommentar antworten">#71</a>:
    15.Apr.2008 01:04
    von
    
      
        F!XMBR
      
    
    
  </p>
<blockquote>
<p>Was ich f&uuml;r v&ouml;lligen Bl&ouml;dsinn halte sind all diejenigen Argumente von der F!xmbr-CrewNur als Info f&uuml;r dich (kann also gel&ouml;scht werden), hier agieren zwei Personen. Ich selbst hatte Twitter eine Weile gar genutzt und es auch wieder eingestellt. Wenn du also m&ouml;chtest das dich jemand ernst nimmt (damit k&ouml;nnte man dem vorausgeschickten Troll-Charakter ein wenig entkr&auml;ften), w&uuml;rde ich derlei Kleinigkeiten einmal in Betracht ziehen.Dann zum Punkt Privatssph&auml;re, ich nenne ein Stichwort: Verh&auml;ltnism&auml;&szlig;igkeit. Wenn ich Twitter betrachte und die Natur dieses Systems, wird der Bruch der Privatssph&auml;re tagt&auml;glich, ja gar min&uuml;tlich willentlich in Kauf genommen. Blogs sind einfach nur eine Online-Publikation, Inhalt egal, alles ist m&ouml;glich. Twitter jedoch bietet nur "SMS-Kommunikation" und auch in einem ebensolchen Zeitfenster, "was man gerade tut" ist also an der Tagesordnung. Der Vergleich Blogs VS Twitter ist nat&uuml;rlich der ber&uuml;hmt, ber&uuml;chtigte "&Auml;pfel-Birnen-Vergleich".Diesem Umstand der fehlenden Privatssph&auml;re wurden sich auch einige Twitterer gewahr und stellten just auf privat um - sprich nur f&uuml;r Freunde einzusehen.Sprich die Absurdit&auml;t die du der Argumentation mit Privatssph&auml;re unterstellst, ist unl&auml;ngst belegt durch Twitter selbst und mittels zahlloser anderer Publikationen, die das Gefahrenpotential in Twitter erkannten. Man kann nat&uuml;rlich auch Twittern, das man gerade auf dem Klo sitzt. Dann wiederum w&uuml;rde das "RTL"-Argument passen.Kurzum bei dir ist es noch ein weiter weg zwischen sch&auml;rferer Argumentation und Getrolle. Und merke, nicht alles was  man nicht versteht ist Getrolle, es kann auch schlicht fehlendes Niveau sein.So und nun bitte l&ouml;schen, gleiches Recht f&uuml;r alle. Die Info ist nur f&uuml;r dich bestimmt.</p>
</blockquote>

<p class="infos">
<a href="#comment_72" onclick="set_comment_reference(72)" title="auf diesen Kommentar antworten">#72</a>:
    15.Apr.2008 01:04
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Zu welchem "Bruch der Privatsph&auml;re" werden die Nutzer von Twitter denn gezwungen? Nur weil da viele irgendwelchen Bl&ouml;dsinn schreiben, der normalerweise keinen etwas angehen w&uuml;rde (und wahrscheinlich auch fast nie jemanden interessiert), bedeutet das noch lange nicht, dass man das machen MUSS.Wie gesagt ich sehe Twitter als Werkzeug, man kann sinnvolle Sachen damit machen (interessante Links suchen und verteilen) oder aber absoluten Schwachsinn posten ("ich bade grade").Warum das ganze jetzt f&uuml;r die Privatsph&auml;re schlimmer sein soll, nur weil die Nachrichten auf 140 Zeichen begrenzt ist, hat noch immer keiner von euch beiden gesagt. Dieses Verhalten, einfach Thesen in den Raum zu stellen f&uuml;r die man keine ernsten Argumente hat, k&ouml;nnte man schon als ziemlich trollig bezeichnen. (Ohja, halt.. es stellen Leute auf "nur f&uuml;r Freunde sichtbar" um, das ist nat&uuml;rlich das Ende jeder Privatsph&auml;re, wenn man bewusst ausw&auml;hlen kann wer was lesen darf. o0)Was das l&ouml;schen deines Beitrages betrifft... Ich bin der Meinung, jeder darf Argumente bringen oder sich l&auml;cherlich machen wie er will. Wenn du die besseren Argumente als ich hast, kannst du sie hier gerne notieren und ich werde evtl. sogar meine Meinung &uuml;ber dich &auml;ndern. Solange deine Beitr&auml;ge in einem ertr&auml;glichen Rahmen bleiben werde ich sicher nicht anfangen Kommentare zu l&ouml;schen, nur weil jemand eine andere Meinung vertritt.</p>

<p class="infos">
<a href="#comment_73" onclick="set_comment_reference(73)" title="auf diesen Kommentar antworten">#73</a>:
    19.Jul.2008 06:07
    von
    
      
        <a href="/2008/07/19/klo-content-und-warum-deutsche-blogs-nicht-funktionieren/" target="_blank">
          Klo-Content und warum deutsche Blogs (nicht?) funktionieren &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] trollt halt mal wieder, ist ja eigentlich nichts [...]</p>
</div>