+++
title = "Lest mal wieder!"
date = "2008-08-02T05:08:00"
author = "Dr. Azrael Tod"
issoid = "blog/523"
aliases = "blog/523"
+++

<p>Ich bin gerade mal wieder &uuml;ber meine Ummeldung nach Dresden &uuml;ber die Vorteile der Bibliotheken gestolpert. Jedem ist nat&uuml;rlich klar dass man in einer Bibliothek billiger an B&uuml;cher kommt als diese im Laden zu kaufen, doch manchmal habe ich das Gef&uuml;hl dass viele sich einfach sagen sie w&uuml;rden eh nicht so gerne lesen und daher derartige Geb&auml;ude garnicht erst betreten.</p>
<p><!--more--></p>
<p>Das ist durchaus zu unrecht, ein Bibliotheksausweis kann durchaus von Vorteil sein, auch wenn man nicht so gerne seine Zeit mit Belletristik verbringt.</p>
<p>In Dresden bekommt man z.B. in allen m&ouml;glichen Museen Eintrittserm&auml;&szlig;igungen wenn man seinen Bibliotheksausweis (nat&uuml;rlich den der Dresdner Stadtbibliotheken) vorweisen kann. Wenn man mal durchrechnet dass die Mitgliedschaft in DD nur 12&euro; im Jahr (mit dem Gutschein den man bei einer Ummeldung nach DD bekommt nur 6&euro;, im Abo 10&euro; und f&uuml;r Kinder oder &auml;hnliche Bev&ouml;lkerungsgruppen 0&euro;) kostet und man nur 1-2x im Jahr in eines der 50-60 Museen in Dresden geht merkt man schnell dass die ganze Sache verdammt billig ist.</p>
<p>Des weiteren gibt es auch in normalen &ouml;ffentlichen Bibliotheken immer einen gro&szlig;en Anteil Fachliteratur, es kann durchaus praktisch sein wenn man sich nicht jedes Nachschlagewerk oder Lehrbuch, nur um mal reinzusehen, f&uuml;r 80&euro; kaufen muss. Es kann sich ja auch bei B&uuml;chern die man permanent zur Hand haben will bereits lohnen sie erstmal auszuleihen um dann festzustellen ob es &uuml;berhaupt das ist was man braucht oder ob man nicht lieber zu einer Alternative greifen sollte.</p>
<p>Und selbst f&uuml;r die Unverbesserlichen, die nie ein Buch in die Hand nehmen w&uuml;rden und kein Museum besuchen wollen, selbst f&uuml;r die gibt es noch Vorteile. In Dresden kann man kostenlos viele DVDs, Video-Kasetten, Computerspiele und Musik-CDs ausleihen. Eine Woche einen guten Film zuhause zu haben kann nat&uuml;rlich auch &uuml;ber eine Videothek realisiert werden, auch haben die evtl. doch die gr&ouml;&szlig;ere Auswahl an Neuigkeiten... aber mit einem Preis von: KOSTENLOS! k&ouml;nnen die wohl kaum mithalten.</p>
<p>Also Leute.. geht mal wieder in die Bibliothek und lest mal wieder!</p>
<p>BTW: Schade dass heute Wochenende ist, sonst k&ouml;nnte ich in der Bibliothek um die Ecke kostenlos surfen... *g*</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_418" onclick="set_comment_reference(418)" title="auf diesen Kommentar antworten">#418</a>:
    21.Aug.2008 08:08
    von
    
      
        <a href="http://blog.matthiaspopp.com" target="_blank">
          matthias
        </a>
</p>
<p>Ich glaube ich muss mich mal wieder anmelden. ;-)</p>

<p class="infos">
<a href="#comment_419" onclick="set_comment_reference(419)" title="auf diesen Kommentar antworten">#419</a>:
    21.Aug.2008 08:08
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ziel erreicht! <em>g</em></p>

<p class="infos">
<a href="#comment_420" onclick="set_comment_reference(420)" title="auf diesen Kommentar antworten">#420</a>:
    05.Sep.2008 09:09
    von
    
      
        <a href="/2008/09/05/filesharing-und-bucher-beletristik/" target="_blank">
          Filesharing und B&uuml;cher (Beletristik) &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] teueren aus dem Weindepot (Will sagen, er leiht sich das Buch aus, daf&uuml;r sind ja, unter anderem, Bibliotheken da!). Einfach weil die Leseerfahrung eine grunds&auml;tzlich andere [...]</p>
</div>