+++
title = "Softwarepost mit ohne Inhalt"
date = "2009-01-27T01:01:00"
author = "Dr. Azrael Tod"
issoid = "blog/1208"
aliases = "blog/1208"
+++

<p>Hier mal eine Zusammenfassung was ich die letzten Tage so getrieben habe: Firefox gehasst, pyChao erweitert und Google-Software via Paketverwaltung installiert. Es soll etwas ausf&uuml;hrlicher sein? Bitte sehr..<!--more--><br/></p><h2>Firefox</h2><br/>Die letzten Tage bin ich ja nun leider gezwungen auf Akoya wieder Firefox zu verwenden... so sch&ouml;n es auch ist ein sinnvolles OS statt Windoof verwenden zu k&ouml;nnen, so nervig ist es dass es scheinbar keinen wirklich sinnvollen Browser gibt.<br/>Ich habe es einfach satt alle 3-4 Stunden den Browser neustarten zu m&uuml;ssen weil irgendeine Seite schon wieder die CPU auf 100% Auslastung treibt.<br/>Bei einem Betriebssystem w&uuml;rde man das heutzutage nie hinnehmen, warum dann beim Webbrowser der heute doch fast mehr Anwendungen betreibt als das System selbst?

<p>Zu meinem Gl&uuml;ck hat ja bereits Google angek&uuml;ndigt gegen Ende Februar Chrome auch f&uuml;r Linux zu ver&ouml;ffentlichen.</p>
<p></p><h2>pyChao</h2><br/>Mein kleiner <a href="http://code.google.com/p/pychao" target="_blank">Python-IRC-Bot</a> kann jetzt endlich auch wieder was sein Vorg&auml;nger in PHP schon lange brachte: RSS-Feeds ausgeben. Die Ausgabe war bisher nicht so sehr das Problem, als vielmehr die Frage wo ich das hosten soll und wie ich die Daten synchron halte. Gel&ouml;st habe ich das erstmal indem ich den Feed auf home.g33ky.de abgelegt habe, ihr solltet jetzt auch schon lange wieder oben rechts in der Sidebar das letzte Fact sehen.

<p>Zus&auml;tzlich zu diesem Newsstream gibt es jetzt auch eine M&ouml;glichkeit die Facts statisch zu verlinken (<a href="http://home.g33ky.de/fact/1234.html" target="_blank">home.g33ky.de/fact/1234.html</a>) und einen <a href="http://friendfeed.com/rooms/g33ky" target="_blank">Raum auf Friendfeed</a> wo so Daten wie die Facts, Blogposts von G33KY^2 und <a href="http://www.wangoo.de/" target="_blank">Wangoo</a> landen. Es w&uuml;rde mich freuen wenn dort ein paar mehr Leute anwesend sind, aber eigentlich gibts dort auch keine Informationen die es in Freenode/#Zanzibar nicht direkter gibt.</p>
<p>Nur die Ping-Funktion hab ich noch immer nicht eingef&uuml;gt... Es ist ja nichtmal so als w&auml;re das kompliziert, die Behandlung von Pings ist ja komplett drin, auch eine Funktion die auf Antworten wartet ist dabei. Alles was noch fehlt w&auml;re ein einfacher Timer und ein Neustart des Bots. Ich m&uuml;sste mich halt nur nochmal ransetzen und das endlich tun.</p>
<p></p><h2>Google</h2><br/>Da stell ich gerade fest dass Google tats&auml;chlich f&uuml;r alle m&ouml;glichen Distributionen <a href="http://www.google.com/linuxrepositories/" target="_blank">Repositories</a> anbietet und es so viel einfacher wird um beliebige Google-Software direkt nativ in die verwendete Distri einzubinden...

<p>Klingt doch erstmal ideal oder? Nat&uuml;rlich bietet Google derzeit noch nicht sooo viel Software f&uuml;r Linux an, aber wenn man die alle in ein Repository wirft kann sich die Sache schon lohnen. Sehen wir uns mal an was im Repository liegt: Picasa, Google Desktop und... nix und! Das wars!</p>
<p>Earth gibt es weiterhin nur so als eigenst&auml;ndigen Download oder als "build-deb-Script" in anderen Quellen, genauso wie diverse Firefox-Plugins die sicher auch alle f&uuml;r Google interessant w&auml;ren.<br/>Also Google: WENN ihr es endlich mal schafft eure Software einheitlich zu vertreiben, will ich mir das gerne nochmal ansehen... ideal w&auml;re es wenn dann auch Google Talk, Chrome und was sonst noch so von euch rumoxidiert f&uuml;r Debian im Repo liegt. Schlimmstenfalls integriert ihr einfach nur jegliche Software die im Google Pack f&uuml;r Windows zu haben ist und bereits auf Linux portiert wurde.</p>
<p>Aber solange ich ein extra Repo eintragen soll, nur um Picasa zu installieren (GDesktop ist ja unter Linux noch unsinniger als unter Windows... es gibt genug Zeugs unter GPL das besser in Linux integriert ist), dann lass ich das lieber.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1094" onclick="set_comment_reference(1094)" title="auf diesen Kommentar antworten">#1094</a>:
    28.Jan.2009 11:01
    von
    
      
        <a href="http://ag7.alltagsgrauen.info/" target="_blank">
          fwolf
        </a>
</p>
<p>wie stehts mit Opera? Der m&uuml;sste doch eigentlich recht gut passen, oder?<br/>
zumindest hier aufm EeePC tut das anstandslos!</p>
<p>cu, w0lf.</p>

<p class="infos">
<a href="#comment_1095" onclick="set_comment_reference(1095)" title="auf diesen Kommentar antworten">#1095</a>:
    29.Jan.2009 12:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>es tut.. ist auch ein kleines st&uuml;ck schneller (subjektiv) als Firefox und h&auml;ngt sich nicht ganz so oft auf.<br/>
Aber Opera hat z.b. nichtmal einen vern&uuml;nftigen Browser f&uuml;r den <em>aktuellen</em> HTML-Kot (gut, bei firefox muss ich den auch erst nachr&uuml;sten und der von Chrome ist etwas buggy).</p>
<p>Im Endeffekt erkaufe ich mir bei Opera einen kleinen Geschwindigkeitsvorteil und etwas mehr stabilit&auml;t mit dem Verzicht auf so ziemlich alle Funktionen abseits von einfachem Seitenaufruf, die ich so lieb gewonnen habe.</p>
<p>Vlt. in der n&auml;chsten Version, aber bisher bin ich nicht begeistert davon. (werde aber dennoch jetzt mal wieder testen gehen <em>G</em>)</p>
</div>