+++
title = "Service 2.0"
date = "2009-03-12T01:03:00"
author = "Dr. Azrael Tod"
issoid = "blog/1323"
aliases = "blog/1323"
+++

<p>Jaja.. der Kunde ist K&ouml;nig in unserer tollen Marktwirtschaft. Bl&ouml;d ist daran halt nur dass der K&ouml;nig von ziemlich Zwielichtigen Gestalten umgeben ist, die ihm mit so fiesen Tricks wie m&ouml;glich das Geld aus der <del datetime="2009-03-12T11:43:28+00:00">Tasche</del>^WSchatzkammer zu ziehen versuchen, ohne ihm daf&uuml;r etwas zu bieten.</p>
<p>Ein Beispiel gef&auml;lligst? Wie w&auml;re es mit einem einfachen Einkauf von Lebensmittel beim &ouml;rtlichen Discounter?<!--more--><br/>Noch bevor man richtig durch die Ladent&uuml;r gegangen ist, geht es ja schon los... Wer einen Einkaufswagen will, der darf erstmal eine Eurom&uuml;nze als Pfand  aufbringen. Das w&auml;re jetzt normalerweise kein Problem, aber leider hat man oft einfach keine Einstecken. Aber das Problem l&auml;sst sich nat&uuml;rlich leicht l&ouml;sen, immerhin gibt es ja im Laden genug Kassen die genug Eurost&uuml;cke rumliegen haben... also schnell zur Kasse gelaufen und sich dort erstmal anblaffen lassen: "Is' nich! 'kann die Kasse nur aufmachen wennse was kaufen. "</p>
<p>Also steht man da... ohne Wagen... aber zum Gl&uuml;ck gibts ja noch einen Infostand, an dem man auch f&uuml;r umsonst einen ganz klassischen Tragkorb bekommt. So umgeht man nat&uuml;rlich auch gleich den ersten Marketingtrick: Wer einen gro&szlig;en Wagen hat packt erstmal mehr ein, es sieht ja noch so leer darin aus. Jedenfalls ist der Infostand nat&uuml;rlich auch erstmal nicht besetzt, aber wenn man ein/zwei St&uuml;ndchen wartet l&ouml;st sich dieses Problem nat&uuml;rlich auch.</p>
<p>Nun endlich im Laden angekommen, sucht man nach dem ersten Artikel auf dem Einkaufszettel. Tats&auml;chlich findet man sogar etwas passendes.. in 50 Ausf&uuml;hrungen, mit einer einzigen Ausnahme jede f&uuml;r einen absurd hohen Preis. Diese Ausnahme liegt nat&uuml;rlich dort wo man sie m&ouml;glichst schlecht sieht, frei nach dem Motto "Wir sind ja billig, aber wir k&ouml;nnen auch nichts daf&uuml;r wenn die Kunden immer das teuerste kaufen".</p>
<p>Beim zweiten Artikel geht das Suchen dann weiter... nicht nach der billigsten Variante, sondern einfach danach wo derartiges jetzt generell gelagert werden k&ouml;nnte, da die Regale alle 1-2 Tage umger&auml;umt werden. Die Idee dahinter ist nat&uuml;rlich auch wieder einfach: Wenn der Kunde lange<br/>genug sucht, findet er evtl. auch noch andere Sachen die ihn interessieren k&ouml;nnten.</p>
<p>F&uuml;r die Dinge die man jeden Tag braucht, muss man nat&uuml;rlich einmal quer durch den ganzen Laden laufen... Nein, halt das trifft es nicht ganz... Man kann nat&uuml;rlich nicht Quer zum Laden laufen, sondern wird durch die sorgf&auml;ltig geplanten Regale im Zickzackkurs durch den Laden gef&uuml;hrt. Auf die Art muss man auch f&uuml;r das kleinste St&uuml;ck Butter mindestens erstmal eine Viertelstunde im Laden sein.. super oder?</p>
<p>Haben wir nun endlich alle Dinge zusammen und wollen uns zur Kasse aufmachen f&auml;llt uns nat&uuml;rlich auf dass es den allerersten Artikel hier noch einmal an einer v&ouml;llig anderen und unlogischen Stelle noch einmal als ganz deutlich ausgezeichnetes Sonderangebot gibt. Ich will garnicht wissen wie viele Kunden daraufhin nochmal zur&uuml;ckrennen, Artikel 1 zur&uuml;ckschaffen und das Sonderangebot mitnehmen. Man ist ja ordentlich und sortiert alles sch&ouml;n ins Regal zur&uuml;ck.</p>
<p>Wenn man nun also nach all diesen H&uuml;rden irgendwann doch mal bei der Kasse angekommen ist, so stellt man fest dass a) nat&uuml;rlich nur 10% der Kassen besetzt sind b) an den besetzten Kassen schlangen bis zur&uuml;ck zum Regal mit der Butter stehen. Nat&uuml;rlich konnte keiner Vorraussehen dass in dieser Sto&szlig;zeit pl&ouml;tzlich mehr Leute auftauchen als sonst!</p>
<p>Nun stehen wir an der Kasse und d&uuml;rfen noch die sch&ouml;n strategisch aufgestellten Kleinartikel bewundern.. Schokoriegel, Kaugummi, Kondome, Schnaps, Zigaretten, ... halt alles was die lieben Kleinen der Mama gerne noch in einem unbeobachteten Moment in den Wagen packen... zum doppelten Preis wie die Gro&szlig;packung am anderen Ende des Ladens nat&uuml;rlich.</p>
<p>Sollte man es dann tats&auml;chlich geschafft haben auch &uuml;ber die erneute "freundliche" Bedienung hinwegzusehen und die Fragen nach Kundenkarte, Postleitzahl, Gewinnspielteilnahme, Vorname der Gro&szlig;mutter und E-Mail-Passwort &uuml;ber sich ergehen zu lassen, darf man zusehen wie die etwas gestresste Kassiererin die eigenen Waren &uuml;ber den Scanner zieht. Kaum ist sie damit fertig, muss man nat&uuml;rlich sofort bezahlen und sollte sich eigentlich in Luft aufl&ouml;sen. Immerhin wollen auch andere Kunden noch bezahlen, da kann man nicht warten bis man das ganze Zeugs wieder zur&uuml;ck in den Wagen gepackt hat (Was zeitnah ziemlich unm&ouml;glich ist, es sei denn man bringt mindestens 2 Personen Verst&auml;rkung mit). Wenn man als Fu&szlig;g&auml;nger da ist, wird man an dieser Stelle feststellen dass die gekauften Waren nat&uuml;rlich auch nicht in die mitgebrachten Taschen passen.. aber das macht nichts, die nette Dame an der Kasse gibt einem bestimmt noch einen Beutel, f&uuml;r ein kleines Endgeld versteht sich.</p>
<p>Aber was solls? Wir haben alles was wir wollten (Naja, fast.. &uuml;ber dem Herumirren im Laden haben wir nat&uuml;rlich 2 Artikel vergessen... dann m&uuml;ssen wir halt morgen nochmal wiederkommen) und sind endlich auf dem Heimweg. Der Zettel vom Pfandautomaten, bei dem wir unser Leergut am Anfang des Einkaufes abgegeben haben wird uns zwar beim n&auml;chsten Waschvorgang in der Hose zerfallen und das Geld bekommen wir auch nie weil wir daran nie denken werden aber immerhin: Wir haben &uuml;berlebt! Dieses Mal.</p>
