+++
title = "Arbeitslosigkeits-Endlösung"
date = "2011-03-04T10:03:00"
author = "Dr. Azrael Tod"
tags = ["Politik", "Rant", "Säue durchs Dorf treiben"]
issoid = "blog/1545"
aliases = "blog/1545"
+++

<p>Ich hab endlich die Patentl&ouml;sung<a href="#remark1" style="text-decoration: none">*</a> f&uuml;r jegliche Probleme durch Arbeitslosigkeit gefunden. Alles was wir brauchen sind 1-2 kleinere Gesetzes&auml;nderungen und schon l&ouml;st sich alles von selbst. In k&uuml;rze h&auml;tten wir Vollbesch&auml;ftigung, billige (Fach-)Arbeitskr&auml;fte und ganz oben drauf vlt. noch einiges an (gemessen an dem <a href="http://de.wikipedia.org/wiki/Reality-TV#Pseudo-Reality-TV" target="_blank">was heutige Medien daf&uuml;r halten</a>) Unterhaltung!</p>
<p>Die Gesetzes&auml;nderungen betreffen haupts&auml;chlich erstmal das Straf- und Erbrecht (evtl. m&uuml;sste man noch das Grundgesetz oder so anpassen, aber das ist ja eh kein Tabuthema mehr in heutigen Tagen). Zum einen m&uuml;sste die T&ouml;tung eines Arbeitslosen (evtl. mit Einschr&auml;nkung: "durch einen anderen solchen") legalisiert werden und zum anderen gehen jegliche Besitzt&uuml;mer per Erbschaft an den Initiator dieses Ereignisses. (<a href="/fid/5009/">"So halten es die Necromonger!"</a>)</p>
<p>Wenn nun also eine Gruppe Arbeitsloser aufeinander losgeht, haben wir hinterher eine geschickte Umverteilung der Besitzt&uuml;mer (damit ist auch Armut kein Problem mehr) und wenn Fernsehsender darauf reagieren, gibt es bestimmt auch neue Formate die der guten Tradition r&ouml;mischer Arenen und &auml;hnlichem folgen.</p>
<p>Jetzt h&ouml;re ich nat&uuml;rlich schon viele Aufsschreien "Aber ich will nicht hinterr&uuml;cks umgebracht werden!", doch das ist in der Praxis auch kein Problem. Man muss halt nur daf&uuml;r sorgen nicht Arbeitslos zu werden. Sicherlich w&uuml;rden sich auch bald ein paar nette Gesch&auml;ftsm&auml;nner finden, die gegen ein kleines Entgeld daf&uuml;r bereit w&auml;ren Personen in ihren Firmen arbeiten zu lassen. In unserer Marktwirtschaft regelt halt Angebot und Nachfrage jeden Preis, warum sollte das nicht auch auf diesem Gebiet funktionieren?</p>
<p>Damit erhalten wir dann wie bereits erw&auml;hnt auch endlich die dringend ben&ouml;tigten Fachkr&auml;fte in billig.</p>
<p><b id="remark1">*</b>Ich sollte mir das wohl wirklich patentieren lassen, schon um zu verhindern dass demn&auml;chst nochmal jemand auf die Idee kommt und das wirklich durchf&uuml;hren will.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1542" onclick="set_comment_reference(1542)" title="auf diesen Kommentar antworten">#1542</a>:
    30.May.2011 01:05
    von
    
      
        <a href="http://fellowpassenger.de/" target="_blank">
          fellow passenger
        </a>
</p>
<p>Mein Vorschlag w&auml;re, alle Arbeitslosen bei der Arbeitsagentur anzustellen. Weil dann keine Arbeitslosen mehr verwaltet werden m&uuml;ssten, br&auml;uchte dort niemand mehr zu arbeiten, weshalb man die B&uuml;ros ohne weiteres vermieten k&ouml;nnte. </p>
<p>Das bislang f&uuml;r Strom, Heizung, B&uuml;romaterial, F&auml;lschen der Arbeitslosenstatistik und Transferleistungen aufgewendete Geld lie&szlig;e sich zusammen mit den Mieteinahmen verwenden, um die Geh&auml;lter der neuen Mitarbeiter zu bezahlen.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1543">
<p class="infos">
<a href="#comment_1543" onclick="set_comment_reference(1543)" title="auf diesen Kommentar antworten">#1543</a>:
    01.Jun.2011 11:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>die Idee hatte Pispers schonmal &auml;hnlich... nur besser: <a href="http://www.youtube.com/watch?v=6cwZrI9kFwM%3C/p%3E" rel="nofollow">http://www.youtube.com...</a>
</p></div>
</li>
</ul>
</div>