+++
title = "Bahnfahrt mit Diskussion"
date = "2009-01-18T01:01:00"
author = "Dr. Azrael Tod"
issoid = "blog/1184"
aliases = "blog/1184"
+++

<p>Gestern Abend hatten wir das Vergn&uuml;gen, dass sich in Chemnitz eine relativ gro&szlig;e Gruppe Neonazis zu uns ins Abteil setzte. Da ein anderer Fahrgast dieses Vergn&uuml;gen bereits in der letzten Bahn teilte und die Polizei wegen dem doch etwas st&ouml;rendem Gesang verfassungsfeindlicher Lieder gerufen hatte, sa&szlig; die Polizei mit im Wagon, hinter 2 Glast&uuml;ren und konnte sch&ouml;n dem ganzen Treiben aus der Ferne zusehen.<!--more--><br/>Mit uns im Abteil sa&szlig;en also, zwischen den&nbsp; 10-15 glatzk&ouml;pfigen, angetrunkenen und leider tragisch missverstandenen Jugendlichen und 3-4 Polizisten, der Fahrgast aus dem letzten Zug (ihm ist die Gruppe in dieses Abteil gefolgt) und ein &auml;lterer Herr mit seiner (zumindest dachte ich das urspr&uuml;nglich) Frau.</p>
<p>Bei jenem &auml;lterem Herren handelte es sich, wie sich sp&auml;ter rausstellte, um einen Professor, der auf dem Gebiet der "Geschichte, Gesellschaft, Politik, Kultur und Wirtschaft" der franz&ouml;sischsprachigen Welt und hervorgehoben auch bei Dingen die deutsch-franz&ouml;sische Beziehungen betrifft, aktiv ist und dies unterrichtet. Jemandem der also Romanistik, Geschichte, Politikwissenschaft und Germanistik studiert hat, laut der Zusammenfassung seines Lebenslaufes (die ich gerade &uuml;berflogen hab) mehr Titel und Ehrungen erhalten hat als wohl alle Professoren des Fachbereiches Informatik in Zwickau zusammen und dem man unzweifelhaft eine gewisse Kenntnis der Geschichte nicht absprechen kann.</p>
<p>Wenn nun eine Horde ungebildeter Jugendlicher anf&auml;ngt mit allen anwesenden diskutieren zu wollen und sie argumentativ wahrscheinlich nichtmal gegen mich allein ankommen w&uuml;rden...&nbsp; dort aber wirklich jemand sitzt der sich mit Sprache an sich und dem Thema um das es geht etwas auskennt, dann hat das zumindest einen gewissen Unterhaltungswert.</p>
<p>Hier mal ein paar Spr&uuml;che bei denen wir uns wirklich nicht zur&uuml;ckhalten konnten zu lachen (grob aus dem Ged&auml;chtnis zitiert):<br/></p><ul><br/> <li>Seht ihr? Wir k&ouml;nnen uns durchaus auf geistiger Ebene mit so einem Professor treffen</li><br/> <li>Studenten haben eh immer so seltsame Einstellungen, die verstehen uns nicht</li><br/> <li>Die Vergangenheit hat Angst vor uns! - Wie soll die Vergangenheit Angst haben? - Aber die Zukunft hat Angst vor uns!</li><br/> <li>Sind sie nicht stolz auf Deutschland? - Definieren sie mal Deutschland.. beziehen sie sich aufs Heilige R&ouml;mische Reich deutscher Nation, den Deutschen Bund, die BRD, die Weimarer Republik... ? - Na Deutschland halt</li><br/></ul>
<p>Ich hatte wirklich lange nicht mehr mit diesem Schlag Menschen zu tun... doch man merkt sofort wieder mit wem man es zu tun hat. Typen die sich eine politische Einstellung zuschreiben wollen, denen aber jeder politische Standpunkt fremd ist. Als Einzelperson w&uuml;rden sie ruhig im Zug sitzen und unauff&auml;llig bleiben, als Gruppe von 5-20 Personen fangen sie an rumzup&ouml;beln und Leute zu nerven und sollten sie eine gewisse kritische Masse erreichen werden sie gewaltt&auml;tig.<br/>Gleichzeitig gefallen sie sich aber derartig in der Rolle der Unterdr&uuml;ckten dass sie permanent erw&auml;hnen m&uuml;ssen wie sehr sie sich in ihrer Meinungsfreiheit eingeschr&auml;nkt f&uuml;hlen, dass man sie f&uuml;r das einfache Singen von "deutschem Liedgut" bzw. ihre politische Meinung einsperren w&uuml;rde und dass die "b&ouml;sen Linken" immer mit Steinen werfen w&uuml;rden. Gleichzeitig scheuen sie sich nicht zu beteuern wie viel Angst "das System" (oder irgendwelche anderen Dinge/Personen) vor ihnen h&auml;tte.</p>
<p>Da haben wir auch schon Probleme: Das "deutsche Liedgut" sind Dinge die aus Gr&uuml;nden des Verfassungsschutzes verboten sind. Dinge die dabei nur von Nazionalsozialisten gebraucht wurden und nie st&auml;rker zur deutschen Kultur geh&ouml;rt haben als jegliche anderen Erkennungslieder irgendwelcher politischer Gruppen. Wenn sie also z.B. das <a href="http://de.wikipedia.org/wiki/Horst-Wessel-Lied">Horst-Wessel-Lied</a> als deutsches Liedgut anerkennen und singen wollen, m&uuml;ssen sie das gleiche wohl auch f&uuml;r die Hymne der DDR oder Erkennungszeichen von verbotenen, kommunistischen Parteien tun. Irgendwie f&auml;llt es mir schwer, mir sowas vorzustellen.</p>
<p>Ihre Politische Meinung kann auch kaum das Problem sein.. immerhin besitzen diese Typen keine. Alles was sie haben ist die politische Grundausrichtung der Leute um sie herum, die sie f&uuml;r ihre eigene halten. Aus der Aussage dass man "rechts" ist, kann man ungef&auml;hr soviel politische Meinung ableiten wie aus der Aussage dass man ungern &Auml;pfel isst.<br/>Auch hat kaum jemand wirklich vor diesen Typen Angst... warum auch? Was k&ouml;nnen diese kleinen Gruppen von herump&ouml;belnden Jugendlichen tun? Ein paar Leute verpr&uuml;geln? F&uuml;r derartige Zwischenf&auml;lle gibt es die Polizei und sowas bekommt man auch recht gut unter Kontrolle.</p>
<p>Nein, vor was man Angst haben muss sind nicht diese Typen in Springerstiefeln, deren IQ gerade mal reicht um selbige anzuziehen ohne Fitz im Schn&uuml;rsenkel zu verursachen, sondern eher die Leute die solche Leute auszunutzen wissen. Glaubt im Ernst jemand dass die Leute an der Spitze der NPD oder verwandter Parteien anfangen wollen Ausl&auml;nder auszuweisen oder die Zust&auml;nde vom dritten Reich wieder zu etablieren? Derartige Ideen sind f&uuml;r diese Leute nur ein Mittel zum Zweck. Wenn man den rechten Horden sagt dass man so etwas vor hat, wird es f&uuml;r diese pl&ouml;tzlich "cool" die Partei zu w&auml;hlen. Da fragt niemand nach ernsthaften Inhalten, der Meinung zu &Ouml;ko-Steuer oder zum Bundestrojaner, da kann man noch richtig sch&ouml;n seine eigene Politik machen und wird egal ob man irgendwelche Ziele erreicht weiter von den W&auml;hlern geliebt. Ist doch toll oder?</p>
<p>Doch kommen wir doch mal zu der Idee Menschen zu sortieren, wie es aus diesem Lager immer mal wieder als Forderung kommt. Nat&uuml;rlich m&uuml;ssen laut diesen Typen die Juden entfernt werden und die meisten "Ausl&auml;nder" nat&uuml;rlich auch.<br/>Wenn die sowas also fordern d&uuml;rfen, will ich das auch! Nur w&uuml;rde ich halt meine eigenen Kriterien anwenden, imho w&auml;re es auch viel sinnvoller nach dem Niveau der Menschen zu gehen, statt nach ihrer Herkunft (Letzteres ist eh schon seit Jahrhunderten nicht mehr wirklich zu trennen, die V&ouml;lker leben nunmal nicht voneinander isoliert und der reine Arier ist ein Hirngespinst sonder gleichen.).</p>
<p>Wenn ich also alle Menschen die mir zu bl&ouml;d sind abschieben will und damit nat&uuml;rlich auch unsere lieben Singerknaben aussortiere, habe ich interessanterweise sogar noch mehr Erfolgschancen als diese mit ihrem Vorhaben. Nicht nur dass mein Vorhaben geschichtlich nicht so vorbelastet ist, ich bin dazu auch noch in der Lage mir Ziele zu stecken die mal &uuml;ber den n&auml;chsten Kasten Bier oder die n&auml;chste Schl&auml;gerei hinaus reichen.<br/>(Man sollte halt vorsichtig sein mit dem was man sich w&uuml;nscht.)</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1077" onclick="set_comment_reference(1077)" title="auf diesen Kommentar antworten">#1077</a>:
    01.Feb.2009 06:02
    von
    
      
        <a href="http://codecocktail.wordpress.com" target="_blank">
          charlysan
        </a>
</p>
<p>Solche Menschen sind einfaches "Fu&szlig;volk" mit dem Horizont einer Erbse. Dass sie sich zu gerne einbilden, sie w&uuml;rden eine ernstzunehmende politische Meinung vertreten, musste ich leider auch schon &ouml;fters feststellen. Wovor die Menschen die sich aber wirklich mit dem Thema auseinandersetzen Angst haben, ist dass die Mittelschaft wieder f&uuml;r rechtes Gedankengut zu mobilisieren ist. Und wenn in Deutschland weiter flei&szlig;ig Schulden gemacht werden, dann soll sich auch keiner Wundern wenn ein niedrigerer Lebensstandard zu einer ver&auml;nderten Landschaft an "politischen" Meinungen f&uuml;hrt.</p>

<p class="infos">
<a href="#comment_1078" onclick="set_comment_reference(1078)" title="auf diesen Kommentar antworten">#1078</a>:
    01.Feb.2009 06:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>leider.. die tolle Bildungspolitk und die sozialen Unterschiede tun dann den Rest. :-/</p>
<p>Problematisch ist imho dass nicht wirklich jemand was gegen derartige Probleme unternimmt und derartig einfach zu beeinflussende Leute so immer leichter in die Arme dieser Meinungsmacher getrieben werden.</p>
</div>