+++
title = "Jabber-Clients"
date = "2008-06-05T01:06:00"
author = "Dr. Azrael Tod"
issoid = "blog/398"
aliases = "blog/398"
+++

<p>Eines meiner Lieblings-Software-Spielzeuge ist ganz eindeutig Jabber, nicht nur dass das Protokoll ein offener Standard ist und massig Vorteile gegen&uuml;ber ICQ, MSN und &auml;hnlichem hat (ihr kennt sie alle, es gibt keinen Grund warum ich die auch noch aufz&auml;hlen sollte, au&szlig;erdem kann das <a href="http://web.swissjabber.ch/index.php/Protokoll_Jabber_vs._ICQ" target="_blank">Swissjabber</a> eh viel besser), nein eine Jabber-Adresse erh&ouml;ht auch gleich das Ansehen als Geek und mit keinem anderem Messenger kann man so sch&ouml;n rumspielen.</p>
<p>Egal um welche Erweiterung es geht oder ob man nur mal wieder versucht einen Transport unter Kontrolle zu bringen, mit Jabber wird es nie langweilig.</p>
<p>Es gibt allerdings einige Dinge die ich noch immer vermisse und bei denen ich um eure Mithilfe bitten muss.</p>
<p>So suche ich derzeit einen Jabber-Client f&uuml;r die Konsole. Nat&uuml;rlich sind mir einige bekannt, wir h&auml;tten da z.B:<br/></p><ol><br/> <li><br/><p style="margin-bottom:0;"><a href="http://developer.pidgin.im/wiki/Using%20Finch" target="_blank">Finch</a> (grauenvolle Bedienung, da 1zu1 von Pidgin &uuml;bernommen und 	wahnsinnig &uuml;berladen da die ganze Libpurple mitgeschleppt wird)</p><br/></li><br/> <li><br/><p style="margin-bottom:0;"><a href="http://www.lilotux.net/%7Emikael/mcabber/" target="_blank">Mcabber</a> (ganz netter Ansatz aber es fehlen halt einfach wichtige Funktionen, 	z.B. kann man Transports nicht steuern und MUC l&auml;sst sich auch 	nicht wirklich gut verwenden, von Dateitransfers fange ich lieber 	gar nicht erst an)</p><br/></li><br/> <li><br/><p style="margin-bottom:0;"><a href="http://www.bitlbee.org/main.php/news.r.html" target="_blank">Bitlbee</a> als IRC-Umleitung von Jabber (geniales Konzept, aber es fehlen noch 	viel mehr Funktionen als bei Mcabber)</p><br/></li><br/> <li>Jabber-Plugins f&uuml;r irssi, z.B. <a href="http://cybione.org/%7Eirssi-xmpp/" target="_blank">irssi-xmpp</a> (wahrscheinlich w&auml;re das noch besser als Bitlbee f&uuml;r meine Zwecke, 	Funktionen lassen aber noch zu w&uuml;nschen &uuml;brig und das Ganze ist 	ziemlich instabil)</li><br/></ol><br/>Ein weiteres Feature dass ich bei meinen Jabber-Clients gerne h&auml;tte w&auml;re Jingle-Support f&uuml;r VoIP. Ich habe schon vor Monaten allen m&ouml;glichen Verwandten GMail und damit Google Talk aufgeschwatzt um meinen Gebrauch von ICQ-Transports zu minimieren, es w&auml;re nur logisch wenn ich jetzt dar&uuml;ber mit ihnen telefonieren k&ouml;nnte ohne ihnen neue Software andrehen zu m&uuml;ssen.<br/>Nat&uuml;rlich versuchen in letzter Zeit alle m&ouml;glichen Clients (bei Gajim, Pidgin, Psi und Kopete ist mir dies zumindest bekannt) dies zu integrieren und in einigen seltenen Abzweigungen von der Entwicklerversion soll das bei einigen auch schon funktionieren, aber so richtig als nutzbare Version hab ich noch nichts gefunden. (Ja es gibt unbekanntere Clients wie Spark oder Coccinella die das k&ouml;nnen sollen, doch ich will nicht st&auml;ndig Java im Hintergrund laufen haben und wirklich zu funktionieren scheinen die wenigsten)<br/>Jingle-Support muss nat&uuml;rlich nicht unbedingt in meinem gesuchtem Textmode-Client laufen (ok, es w&auml;re schon sch&ouml;n) f&uuml;r die 1-2 Telefonate die Woche kann man dann doch auch mal X hochfahren. (Da ich immer noch keine funktionierende Version von Mozilla habe, die ohne X direkt gegen FrameBuffer-libs gelinkt ist l&auml;uft das ja leider eh immer noch auf meinem Notebook)
      
    
  <div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_159" onclick="set_comment_reference(159)" title="auf diesen Kommentar antworten">#159</a>:
    05.Jun.2008 03:06
    von
    
      
        <a href="http://taramboraswelt.de" target="_blank">
          Tarambora
        </a>
</p>
<p>Wie gern w&uuml;rde ich Jabber mal ausprobieren, aber ich hab keine Ahnung, was ich dazu tun mu&szlig;!</p>

<p class="infos">
<a href="#comment_160" onclick="set_comment_reference(160)" title="auf diesen Kommentar antworten">#160</a>:
    05.Jun.2008 03:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ganz einfach<br/>
1. einen Client installieren (unter Linux w&uuml;rde ich dir wohl Gajim oder Psi empfehlen, wenn ICQ oder &auml;hnliches ebenfalls direkt &uuml;ber den PC und nicht &uuml;ber einen Transport laufen soll eher Pidgin oder Kopete, unter Windows w&uuml;rde ich Pidgin, Miranda oder vlt. Trillian empfehlen)<br/>
2. einen Server ausw&auml;hlen (wenn es ganz einfach sein soll kann man sich nat&uuml;rlich auch einfach ein Google-Mail-Konto anlegen, Google Talk herunterladen und das wars schon), ich w&uuml;rde normalerweise jabber.ccc.de empfehlen<br/>
3. den Client starten<br/>
4. Ein Konto hinzuf&uuml;gen (gibt es meist so oder zumindest &auml;hnlich als Men&uuml;eintrag), den Server eintragen und ausw&auml;hlen dass man ein neues Konto anmelden m&ouml;chte<br/>
5. alle weiteren Fragen ausf&uuml;llen, online gehen und dann anfangen Personen hinzuzuf&uuml;gen (ich stelle mich auch als Testperson zur Verf&uuml;gung)</p>

<p class="infos">
<a href="#comment_161" onclick="set_comment_reference(161)" title="auf diesen Kommentar antworten">#161</a>:
    05.Jun.2008 05:06
    von
    
      
        <a href="http://tarambora.wordpress.com/" target="_blank">
          tarambora
        </a>
</p>
<p>Ich habe einen Google-Talk-Account. Ist das Jabber? (ich kapier's einfach nicht <em>g</em>)</p>

<p class="infos">
<a href="#comment_162" onclick="set_comment_reference(162)" title="auf diesen Kommentar antworten">#162</a>:
    05.Jun.2008 05:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>ja das ist auch Jabber, es steht halt nur nicht direkt drauf.<br/>
Jabber ist ein offenes Protokoll (das in seiner Entwicklung &uuml;brigens stark von Google gef&ouml;rdert wird) dass es jedem erm&ouml;glicht einen eigenen Server zu betreiben. Im Gegensatz zu geschlossenen Protokollen wie Oscar (AIM/ICQ) oder MSN ist es nat&uuml;rlich jederzeit M&ouml;glich zwischen den verschiedenen Servern Nachrichten auszutauschen.<br/>
Wenn jetzt also jemand bei Google mit jemandem bei jabber.ccc.de schreiben will, braucht er eigentlich nichts weiter zu beachten au&szlig;er dass er die volle jabberadresse zu seiner Kontaktliste hinzuf&uuml;gt. (z.B. in meinem Fall <a drazraeltod="" href="mailto:">"drazraeltod@jabber.cc...</a> oder bei dir @.com)</p>
<p>Es gibt &uuml;brigens noch erheblich mehr Firmen die gro&szlig;e Jabber-Server f&uuml;r ihre Kunden betreiben, ich glaube mich an GMX und Lycos zu erinnern.</p>

<p class="infos">
<a href="#comment_163" onclick="set_comment_reference(163)" title="auf diesen Kommentar antworten">#163</a>:
    05.Jun.2008 05:06
    von
    
      
        <a href="http://tarambora.wordpress.com/" target="_blank">
          tarambora
        </a>
</p>
<p>Ich hab das gerade mal ausprobiert und Dich Kontakt hinzugef&uuml;gt bzw. Dir ne Einladung geschickt. Eine andere Option habe ich nicht gefunden.</p>

<p class="infos">
<a href="#comment_164" onclick="set_comment_reference(164)" title="auf diesen Kommentar antworten">#164</a>:
    05.Jun.2008 05:06
    von
    
      
        <a href="http://tarambora.wordpress.com/" target="_blank">
          tarambora
        </a>
</p>
<p>oh, es ging doch nicht. Folgende Meldung hab ich bekommen:</p>
<p>Technical details of permanent failure:<br/>
PERM_FAILURE: Google tried to deliver your message, but it was rejected by the recipient domain. We recommend contacting the other email provider for further information about the cause of this error. The error that the other server returned was: 550 550 5.7.1 : Recipient address rejected: these are jabber accounts, not email addresses (state 14).</p>

<p class="infos">
<a href="#comment_165" onclick="set_comment_reference(165)" title="auf diesen Kommentar antworten">#165</a>:
    05.Jun.2008 05:06
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Es funktionierte schon.. Google sendet halt nur immer eine Email an die Adresse (was bei jabber.ccc.de Bl&ouml;dsinn ist, da es keinen Emailserver unter dieser Adresse gibt, ganz zu schweigen von einem Nutzer DrAzraelTod)<br/>
&Uuml;berhaupt ist das Interface von Google in diesem Punkt etwas undurchsichtig und wirr, Google-Intern wird glaube ich jeder aufgenommen mit dem man Emails ausgetauscht hat.</p>
</div>
