+++
title = "Bring in the Trolls!"
date = "2009-03-31T01:03:00"
author = "Dr. Azrael Tod"
issoid = "blog/1350"
aliases = "blog/1350"
+++

<p>Also ich trolle ja ganz gerne mal in der Gegend rum, stelle unhaltbare Behauptungen auf, erz&auml;hle Mist der sich beim leichtesten Nachdenken als solcher entpuppen muss oder beleidige Leute einfach nur so aus Spa&szlig;. Ich w&uuml;rde mal die ganzen Aktionen in der Richtung sch&ouml;n geordnet unter Fnord abheften.</p>
<p>Was ich jedenfalls immer wieder interessant finde, ist wie leicht sich die ganzen Sheeple da drau&szlig;en dazu verleiten lassen einen ausgewachsenen Flamewar zu starten. Aktuelles Beispiel w&auml;re wohl derzeit das neue Werbevideo von Microsoft, dessen Kernaussage sich auf "Macs sind zu teuer" zusammenfassen l&auml;sst.<!--more--><br/>[youtube=http://www.youtube.com/watch?v=621NMj9_SR4&amp;color1=0xb1b1b1&amp;color2=0xcfcfcf&amp;feature=player_embedded&amp;fs=1]<br/>Und Schwups kommen sie schlagartig alle aus ihren L&ouml;chern... da wird behauptet dass das alles Bl&ouml;dsinn ist, dass Apple eigentlich schon sehr billige Ger&auml;te anbietet und Microsoft das nur nicht zeigt. Noch nicht ganz so schlimm unter Realit&auml;tsverlust leidende behaupten dann dass man halt bei Apple auch mehr f&uuml;rs Geld bekommt und dass normale PCs halt auch einfach aus billigster Hardware bestehen um so billig verkauft werden zu k&ouml;nnen.<br/>Wieder andere verweisen auf das ganze teuere Virenscanner-Zeugs (Snakeoil! Heute billiger!) das man bei Windows-Ger&auml;ten braucht und dass das doch den Preis wieder ausgleichen w&uuml;rde, das man sicherlich sogar teuerer kommen w&uuml;rde, wenn man die ganze Arbeitszeit einrechnet die das schlechte Betriebssystem kostet.</p>
<p>Auf der anderen Seite stehen dann nat&uuml;rlich die Windows-J&uuml;nger und versuchen mit &auml;hnlich sinnvollen Argumenten zu "beweisen" dass ihre Platform viel besser als OSX ist, dass Windows die &uuml;berlegene Platform ist und &uuml;berhaupt dass Steve Jobs sicher schwul sein muss wenn er permanent in solchen Pullis rumrennt.<br/>Achja.. beinahe h&auml;tte ich es vergessen: Zwischendurch melden sich nat&uuml;rlich auch immer noch ein paar sch&uuml;chterne Linuxnutzer, die einen Spruch in die Richtung "Hey, uns gibts auch noch! Kauft doch einen billigen PC und spielt gute Software auf!" ablassen m&uuml;ssen.</p>
<p>Was den ganzen Leuten scheinbar v&ouml;llig entgeht: Es ist ein Werbevideo! Es interessiert keinen wer da recht hat oder nicht und beim n&auml;chsten Video von Apple ("Hi, I'm a Mac!") sieht die Sache wieder genau umgedreht aus. Alles was an diesem Video interessiert, ist wie teuer die Produktion und verteilung war und wie viele Leute man damit dazu bekommt sich einen PC mit Windows zu kaufen.</p>
<p>Aber leider denken die Leute nichtmehr. Es handelt sich um wirklich schlimme F&auml;lle von Religion! Ich vermute ja noch immer dass sowas ansteckend ist und versuche mich in den meisten F&auml;llen davon fern zu halten. Das k&ouml;nnte wohl auch der Grund sein, warum ich weder bei den vi vs. Emacs-Kriegen noch bei diversesten OS-Kriegen als Fu&szlig;soldat unterwegs war und auch nie den leisesten Gedanken daran verschwendet habe welcher Fussballverein, Pops&auml;nger oder Autohersteller wohl der beste sein k&ouml;nnte...</p>
<p>Vlt. liegt es aber auch einfach darin dass ich irgendwie keine Lust habe Aufwand in die Argumentation f&uuml;r oder gegen irgendwas davon zu stecken, denn.. mal ehrlich... egal was besser ist und wie gute Argumente ich finde: Die anderen haben eh ihre festgefahrene Meinung, keiner h&ouml;rt mir zu und selbst wenn ich wirklich _ALLE_ &uuml;berzeuge, bekomme ich noch immer nichtmal ein Promille der Mehreinnahmen die Microsoft/Apple/der Vatikan durch mich erh&auml;llt.</p>
<p>So verbleibe ich wie immer: als Au&szlig;enstehender, der selber zu denken versucht und sich in aller Ruhe &uuml;ber diese Horden an Idioten kaputt lachen k&ouml;nnte. Vlt. sollte ich mich irgendwo ganz weit oben auf eine Kanzel setzen und dem Sieger dann mit dem Daumen Anweisungen geben ob er den anderen &uuml;berleben lassen soll oder nicht.</p>
<p>BTW: Wenn wir schon bei Videos von Microsoft sind, hier h&auml;tte ich mal ein etwas &auml;lteres Werbevideo, mit William Gates Jr. selbst in der Hauptrolle. <a href="http://video.google.com/videoplay?docid=475134353431221995&amp;hl=de" target="_blank">"UNTERBRICH MICH NICHT!"</a> \o/</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1218" onclick="set_comment_reference(1218)" title="auf diesen Kommentar antworten">#1218</a>:
    31.Mar.2009 02:03
    von
    
      
        Alex
      
    
    
  </p>
<p>Hrhrhr, Daumen hoch!</p>
<p>Wobei ich pers&ouml;nlich ja dem Irrwitz aufsitze, dass des Menschen Wunsch sein Himmelreich ist. Von daher: soll jeder machen wie er will, solange er mir damit nicht (mit zwanghafter Beharrlichkeit) auf den Zeiger geht...</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1219">
<p class="infos">
<a href="#comment_1219" onclick="set_comment_reference(1219)" title="auf diesen Kommentar antworten">#1219</a>:
    31.Mar.2009 02:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Naja, aus dem Alter in dem mir meine Trollkameraden noch auf die Nerven gingen, bin ich wohl lange raus... zumindest w&auml;re ich es, wenn ich je in einem derartigem Alter gewesen w&auml;re.</p>
<p>Wenn man bedenkt wie egal es ist was irgendwer im Internetz meint (eigentlich interessiert mich ja nichtmal der Meinung der meisten Leute die ich im RL so treffe), dann f&auml;llt es irgendwie schwer sowas nicht gleich unter "jaja.... du hast sicher recht <em>g&auml;hn</em>" einzuordnen.</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1220" onclick="set_comment_reference(1220)" title="auf diesen Kommentar antworten">#1220</a>:
    31.Mar.2009 02:03
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>ich habe manchmal das Gef&uuml;hlt, das man als einigerma&szlig;en denkender Mensch etwas &uuml;bersehen hat ... und das schon seit Jahrtausenden ... irgendwas ...<br/>
Die Horden von dummen und labernden.<br/>
So lange man sich mit seiner eigenen gehaltvollen Thematik besch&auml;ftigt und ein paar wenige, aber inhaltlich gute Gespr&auml;che dazu f&uuml;hren kann, ist alles im Lot. Aber kommt nur einer dieser Spinner dazu, denkt man sich nur wtf?</p>
<p>Doch dabei ist die Realit&auml;t viel grausamer. Eigentlich rennt viel mehr WTF? da draussen rum als man annehmen sollte, nur scheint man es noch einigerma&szlig;en gut verdr&auml;ngen zu k&ouml;nnen.</p>
<p>Mhmmm ...</p>

<p class="infos">
<a href="#comment_1221" onclick="set_comment_reference(1221)" title="auf diesen Kommentar antworten">#1221</a>:
    01.Apr.2009 07:04
    von
    
      
        <a href="http://bunix.de" target="_blank">
          reaper
        </a>
</p>
<p><em>rumtroll</em> Pinguinalaaaaarm!!! Linux ist eh besser, da kann man jedes Notebook kaufen und das mitgelieferte Betriebsystem dann als Grillanz&uuml;nder verwenden <em>rumtroll</em></p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1222">
<p class="infos">
<a href="#comment_1222" onclick="set_comment_reference(1222)" title="auf diesen Kommentar antworten">#1222</a>:
    01.Apr.2009 07:04
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>das auf jeden Fall<br/>
OSX ist ja eh nichts anderes als ein buntes BSD und Windows arbeitet seit Jahren daran sich Schrittweise eine Unix-&auml;hnliche Dateisystemstruktur zuzulegen.. die wollen alle nur so cool sein wie Linux!!!!!!11111einseinself</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1223" onclick="set_comment_reference(1223)" title="auf diesen Kommentar antworten">#1223</a>:
    05.Apr.2009 11:04
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          SirSnookie
        </a>
</p>
<p>Ich mag meinen angebissenen Apfel :)</p>

<p class="infos">
<a href="#comment_1224" onclick="set_comment_reference(1224)" title="auf diesen Kommentar antworten">#1224</a>:
    07.Apr.2009 03:04
    von
    
      
        <a href="http://martin.ringehahn.de/blog/" target="_blank">
          Martin Ringehahn
        </a>
</p>
<p>Nicht zu vergessen, dass die Leute, denen man m&uuml;hsam irgendwas aufgeschwatzt hat (hey, nimm' lieber X als Y) dann regelm&auml;&szlig;ig bei einem an der T&uuml;r klopfen und Support f&uuml;r X haben wollen (oder gar brauchen!).</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1225">
<p class="infos">
<a href="#comment_1225" onclick="set_comment_reference(1225)" title="auf diesen Kommentar antworten">#1225</a>:
    07.Apr.2009 07:04
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Auch wenn diese These erstmal grunds&auml;tzlich ziemlich logisch klingt, muss ich sagen dass ich in den meisten F&auml;llen da ich irgendwem etwas aufgeschwatzt habe, ich dies tat weil selbige Person ohnehin regelm&auml;&szlig;ig an meine T&uuml;r klopfte und Support wollte.</p>
<p>Ich versuchte also eher Systeme zu verteilen unter denen ich weniger Support-bedarf gesehen habe.</p>
</div>
</li>
</ul>
</div>