+++
title = "These aren't the Droids you're looking for!"
date = "2010-07-12T09:07:00"
author = "Dr. Azrael Tod"
tags = ["Android", "Hardware", "Telefon"]
issoid = "blog/1529"
aliases = "blog/1529"
+++

<p>Ich hab mir jetzt auch mal so eins von diesen modernen Telefonen ohne W&auml;hlscheibe zugelegt (ja, den Spruch hab ich jetzt wohl einmal zu oft gebracht). Mir kribbelte es ja schon seit Monaten in den Fingern, aber irgendwie fehlte einfach noch eine endg&uuml;ltige Ausrede, warum ich sowas brauchen sollte.</p>
<p>Mein altes Nokia 6020 funktionierte ja auch noch richtig gut. Telefonieren kann ich, manchmal ne Kurznachricht schicken k&ouml;nnte ich auch und den Rest an Schnullizeugs nutzt eh keine Sau. Naja, jedenfalls hab ich dem Spielzeug-Sammel-Drang des Nerds in mir jetzt halt doch mal nachgegeben (Wenn ich schon in einer Firma angefangen hab, die viel mit solchem Zeugs macht, dann sollte ich mich doch wenigstens damit auskennen oder? ODER? - Ne, eigentlich muss nich.. egal!)</p>
<p>Meine Wahl fiel auf das Motorola Milestone (oder wie es in englischsprachigen Gegenden genannt wird: Motorola Droid, wirklich eine tolle &Uuml;bersetzung mal wieder).  Das hat die ganzen typischen Features wie die meisten aktuellen Android-Telefone (gro&szlig;er Touchscreen, WLAN, BT, GPS, Speicherkartenslot, ...) <a href="http://www.google.de/images?rlz=1C1GGLS_deDE367&amp;q=motorola%20droid&amp;um=1&amp;ie=UTF-8&amp;source=og&amp;sa=N&amp;hl=de&amp;tab=wi" target="_blank">sieht nett aus</a> (son Bonbon-rundes Glitzer-Ding sollte schon ein ganzes St&uuml;ck besser sein damit ich das Aussehen ertrage.) und so ganz nebenbei hat das auch eine ziemlich brauchbare Tastatur.</p>
<p>&Uuml;brigens sollte man Motorola Droid nicht mit der Droid-Serie von HTC verwechseln, wobei so <a href="http://www.google.de/images?rlz=1C1GGLS_deDE367&amp;q=droid%20eris&amp;um=1&amp;ie=UTF-8&amp;source=og&amp;sa=N&amp;hl=de&amp;tab=wi" target="_blank">ein Droid Eris</a> schon alleine wegen der genannten Namensverwirrungen und des Namens der einzig wahren G&ouml;ttin beinahe eine Alternative w&auml;re... Wenn es eine Tastaur h&auml;tte.</p>
<p>Eine weitere Alternative w&auml;re das <a href="http://www.motorola.com/Consumers/US-EN/Consumer-Product-and-Services/Mobile-Phones/Motorola-DROID-X-US-EN" target="_blank">Droid X</a> gewesen (der &uuml;bern&auml;chste Nachfolger vom Milestone), das halt noch ein St&uuml;ck gr&ouml;&szlig;er ist (Wobei das dann schon etwas grenzwertig wird), eine Kamera mit noch mehr Petapixel (Wen interessiert schon Rauschen?) und einem Feature welches ich wirklich gerne gehabt h&auml;tte: HDMI-Ausgang.<br/>Leider gibts das Ger&auml;t wohl erstmal nur bei Verizon in den USA, in Deutschland ist es noch nichtmal angek&uuml;ndigt. Au&szlig;erdem fehlt hier auch wieder die Tastatur, keine Ahnung wer sich den Bl&ouml;dsinn wieder ausgedacht hat.</p>
<p>Nachdem ich jetzt einen halben Tag mit dem Ding rumgespielt hab, muss ich auch wirklich sagen dass es richtig Spa&szlig; macht damit rumzuspielen. Woran man halt unbedingt denken sollte, ist sich ein Tool wie "APNDroid" zu installieren, um GPRS/UMTS-Empfang schnell mal deaktivieren zu k&ouml;nnen (Einer der gr&ouml;&szlig;ten Nachteile: man ist st&auml;ndig in Versuchung sowas zu nutzen, auch wenn man eigentlich &uuml;berall WLAN-Empfang hat).</p>
<p>Dann noch schnell Jabber- und SSH-Clients drauf, diverse E-Mail-Konten eingestellt und Musik auf die mitgelieferte 8GB-Speicherkarte geschoben und schon kanns losgehen.</p>
<p>Was mir bisher noch ganz dringend an Software fehlt (vlt. bin ich nur zu bl&ouml;d zum Suchen):<br/></p><ul><br/> <li>einen Jabber-Client mit Jingle-Audio-Unterst&uuml;tzung (wenn wenigstens alternativ Skype g&auml;nge... aber nat&uuml;rlich nicht)</li><br/> <li>gute Emulatoren f&uuml;r SNES, GB, SMS, .. (ich bin noch nicht dazu gekommen zu suchen)</li><br/> <li>Software zum lesen aller m&ouml;glichen E-Book-Formate (auch noch nicht gesucht)</li><br/> <li>Update auf Android 2.2 (ja, ich wei&szlig;.. das gibt es und bald solls auch automagisch von Motorola kommen. Wir werden sehen.)</li><br/></ul>
<p>Sachen die mir bisher negativ aufgefallen sind:<br/></p><ul><br/> <li>Ich habs noch nicht hinbekommen @home via Bluetooth und &uuml;ber meinen Mediaserver online zu gehen... muss noch etwas rumprobieren</li><br/> <li>Der SSH-Client sieht wirklich klasse aus, aber das Keyboard eignet sich nicht um mit SSH zu arbeiten (keine CTRL-Taste um die Screen-Bildschirme zu wechseln, ESC gibts auch nicht)</li><br/></ul>
<p>[Edit]<br/>Das war wohl seit einigen Jahren der am schlechtesten formulierte Beitrag von mir... -.-</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1418" onclick="set_comment_reference(1418)" title="auf diesen Kommentar antworten">#1418</a>:
    12.Jul.2010 11:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>chrono trigger ruckelfrei auf meinem Telefon! Alleine daf&uuml;r hat es sich schon gelohnt</p>
<p>http://de.wikipedia.org/wiki/Chrono_Trigger</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1419">
<p class="infos">
<a href="#comment_1419" onclick="set_comment_reference(1419)" title="auf diesen Kommentar antworten">#1419</a>:
    12.Jul.2010 11:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>KNARF!<br/>
aber mit "Super GNES" kann man keinen Spielstand speichern.. ganz gro&szlig;es Kino -.-</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1420" onclick="set_comment_reference(1420)" title="auf diesen Kommentar antworten">#1420</a>:
    13.Jul.2010 05:07
    von
    
      
        <a href="http://www.geekatwork.de/" target="_blank">
          G33KatWork
        </a>
</p>
<p>Solltest du als SSH-Client ConnectBot nutzen, kannst du CTRL und ESC mit dem "Ball" dr&uuml;cken: <a href="http://code.google.com/p/connectbot/wiki/UsageWithSoftKeyboard%3Cbr" rel="nofollow">http://code.google.com...</a> /&gt;
Mein G2 hat son Ding, das Milestone hat hoffentlich nen Button in der Mitte des Steuerkreuzes, was den selben Effekt hat.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1421">
<p class="infos">
<a href="#comment_1421" onclick="set_comment_reference(1421)" title="auf diesen Kommentar antworten">#1421</a>:
    14.Jul.2010 11:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ich hab die Einstellung inzwischen (dank eines Tipps aus dem IRC) gefunden, bl&ouml;derweise l&auml;sst sich bei mir immer nur eine Taste zus&auml;tzlich festlegen, was halt jetzt CTRL+A auf die Photo-Taste gelegt hat.<br/>
ESC w&auml;re trotzdem noch irgendwie sinnvoll, zumindest um so Tasten wie F1-F9 simulieren zu k&ouml;nnen<br/>
&Auml;hnliches gilt f&uuml;r ALT.</p>
<p>Eigentlich sollte es doch kein Problem sein bei einem Druck aufs Display eine zus&auml;tzliche Bildschirmtastatur mit Sondertasten zu &ouml;ffnen... ConnectBot ist ziemlich nett, aber das fehlt halt noch um es wirklich brauchbar zu machen.</p>
<p>Inzwischen hab ich auch 1-2 Tools gefunden die behaupten Jingle-Audio oder &auml;hnliches zu k&ouml;nnen. Ich bin gespannt wie das sich so benutzen l&auml;sst. (Schade dass Google seinem eigenen Talk-Client keine Talk-Funktion mitgegeben hat)</p>
<p>Ich werd mal noch ein paar Tage rumprobieren und dann wohl mal noch nen Post &uuml;ber diverse Software f&uuml;r Android schreiben. Es gibt da ja zumindest genug wor&uuml;ber man sich aufregen kann.^^</p>
</div>
</li>
<li>
<div class="comment" id="comment_1422">
<p class="infos">
<a href="#comment_1422" onclick="set_comment_reference(1422)" title="auf diesen Kommentar antworten">#1422</a>:
    14.Jul.2010 12:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>http://code.google.com/p/connectbot/wiki/DroidKeyboardSymbols<br/>
ist wohl auch hilfreich.. muss ich mal ausw&auml;ndig lernen^^</p>
<p>im ConnectBot-Chan auf Freenode steht &uuml;brigens sowas im topic: "Check out Full Keyboard from Market for use with CB!"</p>
<p>Also es gibt L&ouml;sungen.. man muss sie nur erstmal finden.</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1433" onclick="set_comment_reference(1433)" title="auf diesen Kommentar antworten">#1433</a>:
    30.Jul.2010 04:07
    von
    
      
        <a href="http://www.felixnagel.com/" target="_blank">
          Felix Nagel
        </a>
</p>
<p>Tipp: Teste Qucik Settings --  danach kannst du alle anderen APN / Shortcut Digens in den Ruhestand schicken.</p>

<p class="infos">
<a href="#comment_1434" onclick="set_comment_reference(1434)" title="auf diesen Kommentar antworten">#1434</a>:
    30.Jul.2010 04:07
    von
    
      
        <a href="http://www.felixnagel.com/" target="_blank">
          Felix Nagel
        </a>
</p>
<p><em>r&auml;usper</em><br/>
Quick Settings (<a href="http://www.appbrain.com/app/com.bwx.bequick)%3C/p%3E" rel="nofollow">http://www.appbrain.co...</a>
</p><p>ps: AppBrain is &uuml;brigens gro&szlig;e Klasse: sozusagen ein Webinterface zum installieren von Apps.</p>

<p class="infos">
<a href="#comment_1435" onclick="set_comment_reference(1435)" title="auf diesen Kommentar antworten">#1435</a>:
    04.Aug.2010 08:08
    von
    
      
        <a href="http://www.g33ky.de/2010/8/4/Ein-paar-Wochen-Milestone/" target="_blank">
          G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>Ein paar Wochen Milestone - von Dr. Azrael Tod<br/>
<a href="http://www.g33ky.de/2010/8/4/Ein-paar-Wochen-Milestone/%3C/p%3E" rel="nofollow">http://www.g33ky.de/20...</a>
</p></div>