+++
title = "Nie wieder Ikea"
date = "2009-01-31T07:01:00"
author = "Dr. Azrael Tod"
issoid = "blog/1222"
aliases = "blog/1222"
+++

<p>Heute haben wir unseren letzten Gro&szlig;einkauf bei Ikea get&auml;tigt. Ein PAX/Malm-Schranksystem. Grund war dass wir gerne ein zu unseren Bett/Nachtschr&auml;nkchen/Komode passenden Schlafzimmerschrank wollten. (OK, die T&uuml;ren vom Schrank passen eigentlich nicht wirklich zum Design der Schubladen, man h&auml;tte auch irgendwas anderes kaufen k&ouml;nnen...)<br/><!--more--><br/>Jedenfalls war es mal wieder ein sch&ouml;nes Erlebnis... Man glaubt ja garnicht was einem an Idiotie in einem gro&szlig;em Laden so begegnen kann. Damit dass ich &uuml;berall erstmal eine Weile warten muss, sei es in der Schrankabteilung zum zusammenstellen (also abtippen, zusammengestellt war bereits alles), an der Kasse zum bezahlen, an der Warenausgabe oder am Lieferservice, damit haben wir ja schon gerechnet.</p>
<p>Auch dass die ganze Sache nicht billig wird war uns nat&uuml;rlich klar.. die Verteilung der Kosten ist da schon eher seltsam. Mir ist ja durchaus klar dass eine wei&szlig; furnierte T&uuml;r billiger herstellbar ist als eine Spiegelt&uuml;r. <a href="http://g33ky.de/2008/12/31/entdecke-unmoglichkeiten/">Aber den Grund warum auch alle anderen T&uuml;ren, also auch einfaches Furnier "Birke, Nachbildung" den gleichen, erheblich teuerern Preis als bei wei&szlig;em Furnier, wie die Spiegelt&uuml;ren haben, werde ich wohl nie verstehen.</a></p>
<p>Aber wie gesagt... derartige Dinge sind im Vorraus bereits klar, immerhin ist Ikea ein ziemlich &uuml;berlaufener Laden, es war Samstag und der Laden will seinen Kunden m&ouml;glichst geschickt das Geld aus der Tasche ziehen. Soweit also noch nichts wirklich schlimmeres als allgemein &uuml;blich.</p>
<p>Interessant wurde es, als wir unsere Bestellung in der Abteilung f&uuml;r Schr&auml;nke abgegeben hatten. Wir bekamen sofort 2 Zettel ausgedruckt, mit dem Kommentar dass wir die Dinge auf Zettel A an der Warenausgabe abholen k&ouml;nnen und "den ganzen Kleinkram" im Lager selbst zusammensuchen und zum Lieferservice bringen k&ouml;nnen.</p>
<p>Die Dinge die wir an der Warenausgabe bekommen haben, beschr&auml;nkten sich dann doch nur auf eine einzelne Spiegelt&uuml;r. Die kompletten, restlichen Bauteile des Schrankes (inkl. Birkent&uuml;r, Korpus, Schrankeinrichtung, ...) mit einem Gesamtgewicht von weit &uuml;ber 300kg durften wir selbst tragen.</p>
<p>Die ersten paar Pakete haben wir noch relativ problemlos auf den Wagen bekommen, irgendwann war es dann aber doch ziemlich voll. Unterwegs durften wir dann auch noch mit ansehen wie andere Kunden vom gleichen Problem geplagt wurden, viele mit erheblich mehr Waren und einige (alleine unterwegs) komplett ohne eine M&ouml;glichkeit die Dinge &uuml;berhaupt aus dem Regal zu bewegen. Nat&uuml;rlich f&uuml;hlte sich auch kein Ikea-Mitarbeiter verantwortlich, also habe ich dann als Kunde zugegriffen und einer Frau geholfen ihr letztes Paket auf den Wagen zu bekommen.</p>
<p>Nat&uuml;rlich sind die Schiebew&auml;gen bei Ikea einem derartigem Gewicht nicht wirklich gewachsen. Ab der dritten Kiste fing ein Rad an der vorderseite an in unregelm&auml;&szlig;igen Abst&auml;nden zu blockieren und den Wagen permanent in andere Richtungen zu lenken als von mir beabsichtigt. Dieses Problem l&ouml;ste sich zumindest sp&auml;ter. Als wir alle Pakete auf dem Wagen hatten, blockierten alle R&auml;der sch&ouml;n gleichm&auml;&szlig;ig. Das machte das Schieben nicht leichter und selbst in meinen Wanderstiefeln fehlte mir &ouml;fters die Bodenhaftung um sofort vorw&auml;rts zu kommen, aber zumindest steuerte ich wieder etwas kontrollierter durch die Gegend.</p>
<p>Irgendwann, endlich an der Kasse vorbei gekommen, sind wir uns noch schnell am Kundenservice beschweren gegangen, um von der netten Frau nur gesagt zu bekommen dass sie da leider auch nichts tun kann. Sie h&auml;tte das Problem schon mehrmals angebracht und k&ouml;nne uns auch komplett verstehen. Wir haben dann auf ihr Anraten hin noch schnell die &uuml;blichen Ikea-"ich schreibe meine Meinung auf einen Schnipsel Papier und hoffe dass ihn mal irgendwann irgendwer liest"-Beschwerdezettel ausgef&uuml;llt und k&ouml;nnen nun maximal darauf hoffen dass bei Ikea mal jemand ein schlechtes Gewissen bekommt und wir aus PublicRelations-Gr&uuml;nden einen 5&euro;-Gutschein f&uuml;r das Ikea-Restaurant oder so bekommen... ganz toller Service.</p>
<p>Jedenfalls haben wir es dann doch allen Widrigkeiten zum Trotz irgendwann geschafft alle Dinge zusammenzusuchen und auf 2 Wagen zum Speditionsdienst zu schleppen. Nachdem man uns dort dann ans Herz gelegt hat, doch etwas kleines selbst mitzunehmen, um nicht in die n&auml;chsth&ouml;here Preiskategorie zu rutschen und noch mehr f&uuml;r die Lieferung zu bezahlen, haben wir es dann auch endlich geschafft in den Genuss des genialen Ikea Lieferservices zu kommen. Lieferung innerhalb von 2 Werktagen! Inkl. des aktuellen Samstags!</p>
<p>Nein, so einfach war es dann doch nicht... statt in den gro&szlig; beworbenen 2 Werktagen, kann eine Lieferung leider erst am Mittwoch erfolgen. Da wir Mittwoch keine Zeit haben, dann halt doch erst Donnerstag. Die Lieferzeiten sind unglaublich flexibel. Wir k&ouml;nnen Mittwoch(!) m&ouml;glicherweise schon im Internet oder unter einer Telefonnummer nachsehen und erfahren dann um welche Uhrzeit die Lieferung erfolgt... Mit einer Genauigkeit von +-1h.</p>
<p>Man beachte in diesem Satz das w&ouml;rtchen "erfahren"! Ich kann also Ikea nicht sagen dass ich gerne eine Lieferung gegen 7 Uhr oder doch lieber gegen 16 Uhr h&auml;tte, Lieferungszeitraum ist 7-18 Uhr und wenn ich wirklich richtig viel Gl&uuml;ck habe, kann ich schon am Vortag eine genauere Uhrzeit erfahren und meinem Chef mitteilen dass ich gegen 8 oder 12 Uhr mal eben f&uuml;r 2-3 Stunden nach hause m&uuml;sste... Das geht nat&uuml;rlich nur, wenn mit Mittwoch irgendeine Uhrzeit vor 18 Uhr gemeint w&auml;re.. daf&uuml;r konnte man nat&uuml;rlich keinerlei Garantien &uuml;bernehmen.</p>
<p>Irgendwie habe ich mir Service bisher immer anders vorgestellt. Nicht nur dass Ikea, wie bereits bekannt, ziemlich teuer und &uuml;berlaufen ist und dass man die fertigen Produkte dann auch ziemlich immer als Ikea-M&ouml;bel erkennt. Nein, Ikea versteht auch unter Lieferservice dass man die Produkte selbst durch die Gegend schleppt, zusammensucht, zur Versandannahme schiebt und die Leute dort dann f&uuml;r 90&euro; mal irgendwann, wenn es gerade passt, die Sachen vorbei bringen. Ikea versteht unter Beschwerdenannahme dass man sich wohl beschweren kann und dann evtl. mit viel Gl&uuml;ck mal eine Bockwurst bekommt um Ruhe zu haben. Ikea versteht unter Reklamespr&uuml;chen wie "Unser Ziel: maximal 3 Kunden an diesem Servicepoint" oder "Lieferung innerhalb von 2 Werktagen" irgendwas zwischen einem guten Witz und etwas dass man dem Kunden in die Hand dr&uuml;cken kann damit er den Eindruck h&auml;tte man w&uuml;rde es wenigstens versuchen.</p>
<p>Ich sag euch was Ikea: Ich verstehe dass ihr mich und meine bessere H&auml;lfte nicht als Kunden braucht. Ich verstehe dass die 500&euro; die ich heute in eurem Laden gelassen habe, euch nicht wertvoll genug sind um ernsthaft jemanden damit zu besch&auml;ftigen mir diese Ausgabe leichter zu machen. Wenn ich will dass mir jemand meine Sachen aus dem Lager holt, dann soll ich gef&auml;lligst nochmal 25&euro; zahlen!<br/>Ich verstehe auch dass ihr versucht mich an jeder Ecke um kleine Betr&auml;ge zu betr&uuml;gen und ihr, statt ein Vertrauensverh&auml;ltnis zwischen Kunden und Marke aufzubauen, lieber das kurzfristige Geld nehmt dass ihr mir schnell aus der Tasche ziehen k&ouml;nnt.</p>
<p>Jetzt bitte ich euch das folgende zu verstehen: Ich werde nie wieder bei Ikea gr&ouml;&szlig;ere M&ouml;belst&uuml;cke kaufen, solange sich diese Verh&auml;ltnisse nicht ge&auml;ndert haben. Ich werde allen Bekannten oder Verwandten die ich auch nur irgendwie beeinflussen kann &uuml;berzeugen versuchen, eure M&auml;rkte zu meiden und ich werde auch meine Leser dazu auffordern mir &auml;hnliche Berichte zukommen zu lassen, um sie ver&ouml;ffentlichen oder weiterleiten zu k&ouml;nnen.</p>
<p>Ihr habt gerade einen Kunden verloren der jedes Jahr sicherlich mehrere hundert Euro in eurer Filialen gelassen hat. Einen Kunden der sich regelm&auml;&szlig;ig zu Weihnachten oder Geburtstag hat Gutscheine f&uuml;r Ikea schenken lassen. Ein einzelner Kunde ist sicher nicht weiter wichtig f&uuml;r eine derartig gro&szlig;e Kette.. das ist mir durchaus klar. Aber wie ich beim Kundenservice ja erfahren durfte, sind wir bei weitem kein Einzelfall. Ich hoffe ihr k&ouml;nnt es euch leisten permanent Kunden so zu vergraulen. Noch dazu immer die Kunden, welche auch mal etwas gr&ouml;&szlig;eres kaufen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1103" onclick="set_comment_reference(1103)" title="auf diesen Kommentar antworten">#1103</a>:
    31.Jan.2009 11:01
    von
    
      
        <a href="http://brenrhad.de/blog/2008/09/02/mit-dem-taxi-kostenlos-ins-einkaufszentrum-die-suchmaschine-als-carrier/" target="_blank">
          Brenrhad
        </a>
</p>
<p>"Jetzt bitte ich euch das folgende zu verstehen:"<br/>
Hier auch. &Uuml;berzeugt.</p>

<p class="infos">
<a href="#comment_1104" onclick="set_comment_reference(1104)" title="auf diesen Kommentar antworten">#1104</a>:
    01.Feb.2009 12:02
    von
    
      
        <a href="http://dresdenneustadt.wordpress.com" target="_blank">
          Anton Launer
        </a>
</p>
<p>Tja, aber ein ordentlicher Schrank von einem M&ouml;belhersteller der auf Wunschzeit ausliefert und sogar aufbaut, kostet eben ein bisschen mehr.<br/>
Aber das w&auml;re doch eine tolle Gesch&auml;ftsidee Liefer- und Aufbau-Service f&uuml;r Ikea. F&uuml;r die von Ihnen beschriebenen 90 Euro findet man bestimmt zwei Studenten, mit nem VW-Bus und Aufbau-Geschick.</p>

<p class="infos">
<a href="#comment_1105" onclick="set_comment_reference(1105)" title="auf diesen Kommentar antworten">#1105</a>:
    01.Feb.2009 12:02
    von
    
      
        <a href="http://www.bunix.de" target="_blank">
          reaper
        </a>
</p>
<p>Hmmm, also ja toller Service ist das mit Sicherheit nicht aber das ist bei anderen M&ouml;belh&auml;usern nicht viel anders. Eine Lieferung von einer kleinen Anbauwand bei H&ouml;ffner h&auml;tte mich k&uuml;rzlich auch was um die 60 Euro gekostet und das Teil hab ich im PKW weggekriegt. So Dinge wie Service und Kundenfreundlichkeit sollte man, wie ich finde, immer im Vergleich zu anderen sehen.</p>

<p class="infos">
<a href="#comment_1106" onclick="set_comment_reference(1106)" title="auf diesen Kommentar antworten">#1106</a>:
    01.Feb.2009 12:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Hmm.. sicher muss man die Sache im Vergleich mit irgendwelchen Wettbewerbern sehen, aber nur weil andere genauso mies sind, muss ich noch nicht begeistert sein.</p>
<p>Vieles von dem was Ikea macht, m&uuml;sste so einfach nicht sein, z.B. muss man seine Kunden nicht die schwersten Kisten selbst aus dem Regal holen lassen, wenn es genau daf&uuml;r eine Warenausgabe gibt. Auch k&ouml;nnte man gleich bei der Vereinbahrung des Liefertermins eine Uhrzeit ausmachen... zumindest wenn man sich eh einen Tag vorher auf eine bestimmte Uhrzeit festlegt ist das dann eigentlich sowieso kein wirklicher Nachteil. Evtl. k&ouml;nnte dann der Kunde die Lieferung erst 1-2 Tage sp&auml;ter bekommen (wenn er nicht den ganzen Tag Zeit hat) und evtl. muss man dann vorher mit dem Kunden etwas genauer planen, aber das w&auml;re eine Umstellung die Ikea keinen Cent kostet (ok, ein Heft zum Termine eintragen und ein Stift evtl.) und dem Kunden einen enormen Vorteil verschafft.</p>

<p class="infos">
<a href="#comment_1107" onclick="set_comment_reference(1107)" title="auf diesen Kommentar antworten">#1107</a>:
    02.Feb.2009 01:02
    von
    
      
        <a href="http://nexuslex.wordpress.com/" target="_blank">
          nexuslex
        </a>
</p>
<p>And I wasn't the only slave to my nesting instinct.  The people I know who used to sit in the bathroom with pornography, now they sit in the bathroom with their IKEA furniture catalogue.  ~Chuck Palahniuk, Fight Club, Chapter 5</p>
<p>...ich liebe, wenn die Hutschnur hochgeht und so herrlich lange Texte dabei entstehen.... klasse find ich immer meine M&ouml;bel vom Sperrm&uuml;ll..bescheidener Service, unschlagbare Preise... alles Einzelst&uuml;cke...</p>
<p>gr&uuml;&szlig;e dr.tod, beute zu jagen ist h&auml;ufig mit unbill verkn&uuml;pft...</p>

<p class="infos">
<a href="#comment_1108" onclick="set_comment_reference(1108)" title="auf diesen Kommentar antworten">#1108</a>:
    04.Feb.2009 12:02
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>die Warenausgabe ist nicht f&uuml;r schwere Gegenst&auml;nde, sonder f&uuml;r empfindliche, oder "begehrte" Dinge, wie z.B. kleine leicht einsteckbare LED Regallampen oder eben deine Spiegelt&uuml;r, damit die selbst in den Regalen herumkrosenden Kunden nicht erst 5 davon zerdeppern ^^</p>
<p>Insgesamt muss man halt schauen, was man will. Muddern hat ne K&uuml;che nun neu und wir haben verglichen, Ikea wahr ok, aber der &Ouml;rtliche hat ausgemessen, nach Wunsch zusammengestellt, bessere Ware fertigen lassen, gelagert, geliefert und aufbauen lassen nach Wunsch, selbst am Tag noch flexibel und das alles im Preis der K&uuml;che mit drin!<br/>
Die Expeditregale sind allerdings z.B. unschlagbar von Ikea ^^ <em>duck</em></p>
<p>Klar k&ouml;nnte Ikea seinen Service umstellen ... aber teurer w&uuml;rde das auf jeden Fall. Termingerechte Lieferungen kosten ne ganze Ecke mehr, da die Wagenauslastung sinkt. Personal an den Regalen, Hebeb&uuml;hnen etc. kost alles Kohle ^^</p>
<p>Aber wenne da nu nimmer hinf&auml;hrst, kaufste auch nu endlich mal gute M&ouml;bel XD</p>

<p class="infos">
<a href="#comment_1109" onclick="set_comment_reference(1109)" title="auf diesen Kommentar antworten">#1109</a>:
    04.Feb.2009 01:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Nat&uuml;rlich kann man es so sehen... das bestreite ich keineswegs. Ich sehe nur das Problem an der Stelle, wo fast alle lokalen M&ouml;belh&auml;ndler unbedingt so sein wollen wie Ikea.<br/>
Von ein paar H&auml;ndlern abgesehen, die ich mir beim besten Willen weder leisten kann noch will, gibt es extrem wenige H&auml;ndler die wirklich was sinnvolles bieten.</p>
<p>Mit "nicht leisten k&ouml;nnen" meine ich &uuml;brigens nicht dass die M&ouml;bel um 10 oder 20% teuerer w&auml;ren (was man dann vlt. noch mit teuerem Service begr&uuml;nden kann), die meisten H&auml;ndler die einigerma&szlig;en sinnvollen Service bieten haben Preise die beim doppelten anfangen und nach oben hin keine Grenzen kennen.</p>
<p>Dabei w&uuml;rde ich &uuml;brigens die Qualit&auml;t von Ikea-M&ouml;beln generell nicht wirklich als so schlecht ansehen. Selbst wenn man nur bei Ikea sucht, findet man M&ouml;bel sowohl im unteren als auch im sinnvollen Preissegment. Dabei ist nat&uuml;rlich nichts extrem hochwertiges (z.B. handgeschreinerte Vollholzschr&auml;nke wie mein Vater manchmal welche baut, k&ouml;nnte ich mir im Laden nie leisten), aber das hat ja wohl auch keiner erwartet oder?</p>

<p class="infos">
<a href="#comment_1110" onclick="set_comment_reference(1110)" title="auf diesen Kommentar antworten">#1110</a>:
    06.Feb.2009 07:02
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>Rate mal, wo ich heute hinfahre ^^<br/>
Und rate mal, welchen Schrank Muttern sich da holen mag ... XD</p>

<p class="infos">
<a href="#comment_1111" onclick="set_comment_reference(1111)" title="auf diesen Kommentar antworten">#1111</a>:
    06.Feb.2009 07:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Nuja, soll sie nur.. ist zumindest sch&ouml;n gro&szlig; das Ding und ziemlich gut anpassbar.</p>

<p class="infos">
<a href="#comment_1112" onclick="set_comment_reference(1112)" title="auf diesen Kommentar antworten">#1112</a>:
    06.Feb.2009 01:02
    von
    
      
        <a href="/2009/02/06/kleinkram/" target="_blank">
          Kleinkram &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] Unser toller, neuer IKEA-Schrank ist da. Zu unserem Gl&uuml;ck kam der Lieferservice gegen 9:15 bei uns an und wir haben das sogar schon gegen Mittag des Vortages erfahren. Wenn man weniger verschobene Arbeitszeiten hat als ich, w&auml;re das wohl ein Problem, aber so ging es. Dennoch: Service ist DAS nicht! [...]</p>

<p class="infos">
<a href="#comment_1113" onclick="set_comment_reference(1113)" title="auf diesen Kommentar antworten">#1113</a>:
    09.Mar.2009 09:03
    von
    
      
        IKEA Freunde
      
    
    
  </p>
<p>Ja, es gibt ettliche Leute, die die Lieferung und den Aufbau von IKEA M&ouml;bel &uuml;bernehmen. Auf <em>zensiert</em> findet sich unter Marktplatz ein Lieferdienst f&uuml;r jeden Geldbeutel ;-)</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1114">
<p class="infos">
<a href="#comment_1114" onclick="set_comment_reference(1114)" title="auf diesen Kommentar antworten">#1114</a>:
    09.Mar.2009 10:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Was in Diskordias geheiligtem Namen....?</p>
<p>Spam f&uuml;r Ikea-Aufbauservice und andere Ikea-Dienstleistungen?<br/>
Ist Ikea jetzt Viagra 3.0?</p>
<p>Enlarge your Billy?</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1115" onclick="set_comment_reference(1115)" title="auf diesen Kommentar antworten">#1115</a>:
    08.Dec.2009 12:12
    von
    
      
        janien
      
    
    
  </p>
<p>Du kannst froh sein das du ne bookwurst &uuml;berhaubt bekommst,<br/>
und ikea m&ouml;bel sind eins total stabiel, das kannst du von anderen m&ouml;belh&auml;user nicht so erwarten.<br/>
und rate mal ich habe meine sp&uuml;lmarschine die in der zeit von 8 uhr morgens bis 12 uhr angesetzt wurde, um morgens 7 uhr. ich war da noch am pennen.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1116">
<p class="infos">
<a href="#comment_1116" onclick="set_comment_reference(1116)" title="auf diesen Kommentar antworten">#1116</a>:
    08.Dec.2009 12:12
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Wer hat Dich eigentlich hier reingelassen?</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1117" onclick="set_comment_reference(1117)" title="auf diesen Kommentar antworten">#1117</a>:
    08.Dec.2009 12:12
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          SirSnookie
        </a>
</p>
<p>Der Club der Legastheniker vermute ich mal.</p>
</div>