+++
title = "CeBIT 2008 - Teil 1"
date = "2008-03-10T01:03:00"
author = "Dr. Azrael Tod"
tags = ["Maueralt"]
issoid = "blog/330"
aliases = "blog/330"
+++

<p>Wie auch schon andere bemerkten war Samstag so ziemlich der <a href="http://wirres.net/article/articleview/4816/1/6/">ung&uuml;nstigste Zeitpunkt</a> um bei der CeBIT aufzuschlagen. Da mir aber leider ebenso wie der gro&szlig;en, grauen Masse an anderen, privaten Technikjunkies kein anderer Tag zur Verf&uuml;gung stand, hab ich mich mal ins Get&uuml;mmel gest&uuml;rzt und bin mit Freundin, Presseausweis und gro&szlig;em Rucksack losgefahren um mir das ganze mal anzutun.<br/><br/>Mein Bericht wird sich in folgende Teile gliedern:<br/></p><ul><br/><li>Teil 1: (ja das ist dieser) - grobe &Uuml;bersicht &uuml;ber die Veranstalltung, Ablauf und Anreise<br/></li><br/><li><br/>Teil 2: die "Jobb&ouml;rse" und &auml;hnliche Dinge, die vollends daneben waren<br/></li><br/><li><br/>Teil 3: Produkte die mir aufgefallen sind<br/></li><br/></ul><br/><br/>Die Anfahrt war schonmal das erste Erlebnis. Wenn man als Student unterwegs ist, hat man nat&uuml;rlich nicht viel Geld zur Verf&uuml;gung. (Den Eintritt kann man sich zum Gl&uuml;ck sparen, Presseausweise,Veranstaltungen der eigenen Hochschule und &auml;hnliche Quellen f&uuml;r Freikarten machen es m&ouml;glich.) Also sucht man schon Wochen vorher nach einer geeigneten Transportmethode. Wir haben uns nach langem &Uuml;berlegen dazu entschlossen schon halb 4 aufzustehen (An dieser Stelle geht ein netter Sondergru&szlig; an meinenLieblingssender <a href="http://www.sunshine-live.de">Sunshine Live</a>, der ebenfalls auf der CeBIT vertreten war: "Guten Morgen Liebe Studenten".) und gegen 4 Uhr von Dresden Mitte aus per Bahn zu starten um dann p&uuml;nktlich halb 12 inHannover zu sein. ( BTW: Warum hat der Bahnhof in Leipzig &Ouml;ffnungszeiten f&uuml;r das Klo? -.- Wehe es muss mal wer zwischen 0 und 6 Uhr pinkeln.) Endlich an der Messe angekommen (Zum Gl&uuml;ck passten wir beide noch zusammen in die Metronom-Bahn, sehr viele andere Gruppen wurden getrennt und mussten 30min auf die n&auml;chste Bahn warten.), hatten wir das Gl&uuml;ck, dass wir schon Karten hatten und nicht erst noch ewig anstehen mussten.<br/>Die Messe selbst empfand ich weitestgehend als Entt&auml;uschung, an jeder Ecke sah man die selben langweiligen und seit Jahren Produkte und nur sehr wenige schafften es sich daraus hervor zu heben. Die meisten versuchten es &uuml;ber das Verteilen von Werbeartikeln, was meiner Meinung aber eher <a href="http://01blog.de/2008/03/08/cebit-am-samstag/">T&uuml;tensammler</a> anlockt als die "Entscheider", die auf so einer Messe gern gesehen w&auml;ren. (Den Sinn der T&uuml;ten f&uuml;r die Leute, die sie umherschleppten entzieht sich meinerKenntnis, meine Freundin stimmte mir da zu, gab aber auch gleich zu bedenken: "So eine T&uuml;te von Razer h&auml;tte ich auch gerne". Da ich ihr da nicht wirklich widersprechen kann muss ich es wohl einsehen, sinnloser Plunder als Werbegeschenk wirkt.)<br/>Man konnte die Hallen eigentlich in 2 Gruppen einteilen. In der einen befanden sich die Hersteller von Spiele-Hardware und &auml;hnlichem, die auch jede Menge Werbegeschenke verteilten und um deren St&auml;nde sich die Geeks beinahe gegenseitig platt getrampelt haben und in der anderen Gruppe (nebenbei die erheblich gr&ouml;&szlig;ere) Befanden sich Hersteller vonSicherheitsoftware, Netzwerkzubeh&ouml;r oder &auml;hnlichen Dingen, die f&uuml;r Spiels&uuml;chtige Jugendliche v&ouml;llig uninteressant sind.<br/>Man merkte auch jederzeit wo man sich gerade Befindet, einfach indem man gez&auml;hlt hat, wieviele Ellenbogen man innerhalb der letzten 3 Minuten in die Magengrube bekommen hat.<br/><br/>Wenn die Leute gewusst h&auml;tten, dass es am Stand von Oracle h&uuml;bsche, schwarze Mousepads und Minzdrops gegeben hat...
      
    
  