+++
title = "Das einzige, was die Politik tun kann..."
date = "2008-07-13T10:07:00"
author = "profmakx"
issoid = "blog/473"
aliases = "blog/473"
+++

<p>Ich gebe es ja zu. Zu meinem eigenen Leidwesen bin ich Newsjunkie und besch&auml;ftige mich gerne und viel mit aktuellem Tagesgeschehen. Vielleicht sollte ich das weniger tun, aber gerade musste ich mal wieder etwas lesen:</p>
<p>Angesichts der hohen &Ouml;lpreise (ich weiss nicht warum &Ouml;lpreise immer mit Energiepreisen verwechselt werden. Strom wird immerhin in Deutschland aus Prim&auml;renergietr&auml;gern gewandelt die zu einem guten Teil auch hier verf&uuml;gbar sind) sieht sich die Politik hilflos. Ein Zitat von <a href="http://www.n-tv.de/ExpertenErwartung_Oelpreis_auf_120_Dollar/130720084309/993115.html">hier</a> von einem "Energieexperten".</p>
<p></p><blockquote>Letztlich kann die Politik am besten zur Entlastung der Autofahrer beitragen, indem Sie alles unterst&uuml;tzt, was den Umstieg auf Fahrzeuge mit weniger Spritverbrauch voranbringt. Dazu geh&ouml;rt z. B. die geplante Umstellung der Kfz-Steuer von Hubraum auf CO2-Aussto&szlig;.</blockquote>
<p>Meiner Meinung nach hat man das verpennt! Das ist etwas, dass sich gerade durch einfache marktwirtschaftliche Mechanismen von selber erledigt. Man m&uuml;sste diese Schmerzen vielleicht nur in kleinerem Ma&szlig;e ertragen wenn man z.B. mal auf die Gr&uuml;nen oder den Herrn T&ouml;pfer oder viele viele Wissenschaftler geh&ouml;rt h&auml;tte.</p>
<p>Die Erkl&auml;rung warum man das nicht getan hat ist allerdings auch einfach: Es war so angenehm und so einfach &Ouml;l f&uuml;r 10 oder 20 Dollar pro Barrel zu kaufen. Und f&uuml;r 50 Dollar hat sich auch noch keiner ans Bein gemacht. Warum sich darum k&uuml;mmern was in 20 Jahren ist? Ausserdem reicht das &Ouml;l ja auf ewig (was richtig ist, da der Preis irgendwann dazu f&uuml;hren wird, dass man es eben nicht mehr in Kraftfahrzeugen verbrennt).</p>
<p>In der Politik werden keine wirklichen Entscheidungen zum Besten der Bev&ouml;lkerung gef&auml;llt, wenn sie unpopul&auml;r sind. Viele Politiker scheinen nur eins im Sinn zu haben: Lang genug im Bundestag sitzen um seine Rente und einen ruhigen Sitz in einem Aufsichtsrat zu sichern.<br/>Der Wirtschaft mag ich es nicht so recht ver&uuml;beln wenn sie ihre Monopole ausreizt. Wer w&uuml;rde sich nicht die Taschen vollstecken wenn er k&ouml;nnte?<br/>Aber die Aufgabe der Politik ist es doch nicht da irgendwelche Taschent&uuml;cher f&uuml;r die weinenden Autofahrer (und im weiteren Sinn eigentlich jeden) auszugeben sondern Weichen zu stellen, damit sich die Volkswirtschaft eben nicht in so eine Sackgasse man&ouml;vriert.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_330" onclick="set_comment_reference(330)" title="auf diesen Kommentar antworten">#330</a>:
    21.Jul.2008 07:07
    von
    
      
        <a href="http://fidel.vido.info/wordpress" target="_blank">
          fidel
        </a>
</p>
<p>Ich denke es w&uuml;rde schon viel bringen wenn ein Politker nicht nach 15 Jahren Dienst wirtschaftlich ausgesorgt h&auml;tte.</p>
<p>Letztlich muss es ein Beurf sein wie jeder andere und der Otto-Normal B&uuml;rger muss eben mal 40++ Jahre arbeiten bis er in seine wohlverdienste Rente kann. Nicht 35, nicht 30 und sicher nichts darunter.</p>
<p>Warum ? Weil wir Politiker mit Herz brauchen, Leute die auch wirklich was ver&auml;ndern wollen und mit Leib und Seele bei der Sachen sind. Nur so kommt man letztlich zu wirklich guten Resultaten (im Gegensatz zu Kompromissen die immer h&auml;ufiger werden)</p>
<p>Ich fand z.b. sehr interessant als Herr Lammert (CDU) sich &ouml;ffentlich &uuml;ber die Geh&auml;lter von Fussballspielern ausgelassen hat. Das hat zwar sicherlich seine Abnehmer gefunden, letzlich wurde aber in diesem Fall sehr sch&ouml;n ignoriert, dass er selber Teil einer bevorzugt behandelten Gruppe ist.</p>
<p>Daumen hoch, guter Artikel</p>
</div>