+++
title = "Fehler in SciFi"
date = "2008-07-13T01:07:00"
author = "Dr. Azrael Tod"
issoid = "blog/472"
aliases = "blog/472"
+++

<p>Wohl jedem von uns sind sie schon einmal aufgefallen: Fehler in typischen Sciencefiction Geschichten.<br/>Dabei sollte eigentlich schon vom Namen des Genres her klar sein dass man sich bei all der Fiktion doch bitte auch ein wenig an reale Wissenschaft halten sollte.<br/>Viele dieser (oft billig produzierten) Geschichten zeugen aber noch heute vom imho eigentlich &uuml;berlagerten Vorurteil dass SciFi generell nur Einheitsbrei mit Weltraummonstern, schlampigen Geschichten, einer typischen Heldenfigur und ein paar h&uuml;bschen, sp&auml;rlich bekleideten Frauen sein muss.<br/>Diese Meinung stammt wahrscheinlich noch aus den Anfangszeiten des Genres (oder zumindest als es erstmals so eingeordnet wurde) als diese Geschichten in der Tat haupts&auml;chlich billig produziert als Groschenhefte auftauchten und eher der seichten Unterhaltung dienen sollten.<br/>Da es ziemlich schwer ist, physikalisch korrekte, realistische Einsch&auml;tzungen der Zukunft zu bringen, dies alles so ganz nebenbei noch spannend zu erz&auml;hlen und mit glaubhaften Charakteren zu versehen (an den beiden letzten Bedingungen scheitern bereits in anderen Genres die meisten Autoren, warum sollte das hier besser sein und dann auch noch abstrusen physikalischen Gesetzen entsprechen?) kann man die vorhandenen Fehler meiner Meinung nach in verschiedene Gruppen aufteilen:</p>
<p><!--more-->Die erste Gruppe w&auml;ren Punkte bei denen der Autor nicht im geringsten auf bestehende Physik achtet wenn sie einen dramatischen Vorgang erschweren w&uuml;rde. Meist hat der Autor nach einer anderen L&ouml;sung gesucht, doch keine einfache gefunden.<br/>Das klingt auf den ersten Blick nach der schlechtesten M&ouml;glichkeit, meiner Meinung nach muss das jedoch nicht unbedingt der Fall sein. Nat&uuml;rlich ist vieles aus diesen Geschichten unm&ouml;glich und kann mit ein wenig Hintergrundwissen leicht verlacht werden, doch die Autoren konzentrieren sich an diesen Stellen daf&uuml;r oft auf die Dinge die sie eher k&ouml;nnen und erzeugen Geschichten die vom Erz&auml;hlstil und den geschilderten Vorg&auml;ngen her &auml;u&szlig;erst fesselnd wirken.<br/>Oft entstehen daher gro&szlig;e Meisterwerke die ohne derartiges nicht m&ouml;glich w&auml;ren und man sollte bei all der Kritik nicht vergessen dass vieles aus diesen Geschichten zwar v&ouml;llig unm&ouml;glich sein mag, dies aber in vielen anderen Genres v&ouml;llig normal und gar erw&uuml;nscht ist.<br/>Es hat sich ja auch noch nie jemand aufgeregt, dass <a href="http://www.herr-der-ringe.ws/wiki/Sauron" target="_blank">Sauron</a>, die <a href="http://www.herr-der-ringe.ws/wiki/ents" target="_blank">Ents</a> und wohl 3/4 aller anderen Wesen in <a href="http://de.wikipedia.org/wiki/J._R._R._Tolkien" target="_blank">Tolkiens</a> Geschichten aus <a href="http://de.wikipedia.org/wiki/Tolkiensches_Universum" target="_blank">Mittelerde</a> in der Realit&auml;t unm&ouml;glich w&auml;ren.<br/>Gute Beispiele f&uuml;r derartige Fehler finden wir z.B. wenn im <a href="http://en.wikipedia.org/wiki/The_Skylark_of_Space" target="_blank">Skylark-Zyklus</a> von <a href="http://de.wikipedia.org/wiki/E._E._Smith" target="_blank">Eduard Elmer "Doc" Smith</a> ansehen wie interstellare Reisen erm&ouml;glicht werden: -&gt; Einstein hat sich geirrt, wir brauchen nur immer weiter zu beschleunigen und werden schneller als das Licht. (Ein recht h&auml;ufiger Ansatz bis man dazu &uuml;bergegangen ist via "<a href="http://de.wikipedia.org/wiki/Wurmloch" target="_blank">Wurmloch</a>" oder "<a href="http://stargate-wiki.de/index.php/Hyperantrieb" target="_blank">Hyperantrieb</a>" zu reisen da dies schwerer zu widerlegen ist.)</p>
<p>Die Zweite Gruppe der Fehler sind wohl Stellen die dem Autor gar nicht bewusst waren, er versuchte sich m&ouml;glichst an alle bekannten Theorien und Gesetzm&auml;&szlig;igkeiten zu halten doch ihm ist ein Fehler unterlaufen.<br/>Die meisten dieser Fehler sind eher unwichtig und werden von denjenigen die sie entdecken meist nur bel&auml;chelt. Aber immerhin hat man etwas bemerkt was anderen nicht aufgefallen ist, daher werden derartige Fehler oft bekannter als Stellen die sehr offensichtlich sind.<br/>Nat&uuml;rlich gibt es auch offensichtliche Fehler in diesem Bereich, dies ist dann aber auch die Stelle an der uns das Vorurteil der billig produzierten SciFi wieder einholt. Wenn sich eine Person mehr diese Geschichte durchgelesen h&auml;tte bevor sie ver&ouml;ffentlicht wurde, h&auml;tte der Fehler evtl. behoben werden k&ouml;nnen.<br/>Beispiel: Um die <a href="http://de.wikipedia.org/wiki/Ringwelt" target="_blank">Ringwelt</a> von <a href="http://de.wikipedia.org/wiki/Larry_Niven" target="_blank">Larry Niven</a> wurde zeitweise viel Aufhebens gemacht, als ein paar Physiker das beschriebene Gebilde durch gerechnet haben und feststellten dass eine derartige Welt nicht lange existieren w&uuml;rde da sie keinen stabilen Orbit behalten w&uuml;rde. Ringwelt war davon abgesehen in vielen Aspekten ein physikalisch sehr korrektes Werk und Niven hat in <a href="http://www.amazon.de/Ringwelt-Zyklus-Ringwelt-Ingenieure-Bd-2/dp/3404242394" target="_blank">Teil 2</a> dieser Buchfolge auch auf die Instabilit&auml;t reagiert und eine komplette Geschichte aufgebaut in der die Probleme wie auch ihre L&ouml;sung erkl&auml;rt wurden (Die Bekanntheit dieses Fehlers soll angeblich soweit gegangen sein dass Studenten am MIT davon 1971 auf den Fluren gesungen h&auml;tten. Quelle: Widmung des Buches Ringewelt Ingenieure)</p>
<p>Eine weitere Art Fehler sind "die Unvorhersehbaren", damit meine ich Fehler die der Autor gar nicht bemerken konnte, weil die ihnen entgegenstehenden Gesetzm&auml;&szlig;igkeiten zum Zeitpunkt der Ver&ouml;ffentlichung noch gar nicht bekannt waren.<br/>Mit diesen Fehlern will ich mich gar nicht all zulange aufhalten, sie kommen nat&uuml;rlich ab und zu vor und sind nahezu unm&ouml;glich zu verhindern.<br/>Ein Beispiel: Die Oberfl&auml;chengestallt der <a href="http://de.wikipedia.org/wiki/Venus_(Planet)#Oberfl.C3.A4che" target="_blank">Venus</a> in der <a href="http://www.perry-rhodan.net/start.html" target="_blank">Perry Rhodan</a>-Reihe. Zum Zeitpunkt des Erscheinens der ersten Hefte war schlicht noch nicht genug &uuml;ber die Beschaffenheit bekannt, dass die Autoren also <a href="http://www.perrypedia.proc.org/index.php/Venus" target="_blank">daneben lagen</a>, war zu erwarten.<br/>Es sei mir nur noch die Randbemerkung gestattet dass es erstaunlich ist wie selten diese Fehler in manchen Klassikern vorkommen und wie genau manche Werke, z.B. manches von <a href="http://de.wikipedia.org/wiki/Jules_Verne" target="_blank">Jules Verne</a>, an erst sp&auml;ter entdeckten Prinzipien und Technologien liegen. (Allerdings hat auch Verne Fehler gemacht, es w&uuml;rde z.B. wohl den wenigsten Personen gefallen in einem Projektil, <a href="http://de.wikipedia.org/wiki/Von_der_Erde_zum_Mond" target="_blank">per Kanone auf den Mond geschossen</a> zu werden...)</p>
<p>Als vierte Art der Fehler w&uuml;rde ich Dinge z&auml;hlen, in die man sich &uuml;ber Umwege hinein gesteigert hat, diese Art der Fehler ist in B&uuml;chern noch relativ selten gewesen, nahm mit der Verbreitung von l&auml;ngeren Fernsehserien oder monatlich erscheinenden Fortsetzungsromanen immer mehr zu.<br/>Gute Beispiele <span style="text-decoration:line-through;">[Update]w&auml;ren hier z.B</span>. fallen mir im Moment leider nicht ein, aus diesem Grund hatte ich diese Stelle bereits leer gelassen, werde nochmal ne Nacht dr&uuml;ber schlafen und hoffentlich etwas nachliefern[/Update]</p>
<p>Die f&uuml;nfte und letzte Art der Fehler sind diejenigen die ich am meisten hasse. Sie sind erst mit der Verbreitung von Film und Fernsehen in gr&ouml;&szlig;eren Mengen aufgetreten und entstehen entweder aus Budgetgr&uuml;nden (egal welchen Effekt man darstellen will, bei einem Buch macht das Preislich nicht wirklich gro&szlig;e Unterschiede) oder um auf dem Bildschirm einen sch&ouml;neren Effekt zu verursachen.<br/>F&uuml;r die erste Variante finden wir ein Beispiel wenn wir uns Ansehen warum bei <a href="http://de.wikipedia.org/wiki/Star_Trek" target="_blank">Star Trek</a> der <a href="http://de.wikipedia.org/wiki/Teleporter" target="_blank">Teleporter</a> genutzt wurde: Landungen auf Planeten via Raumschiff darzustellen w&auml;re zu teuer gewesen. Der Teleporter, welcher sich in der SciFi derartig festgesetzt hat, ist also (zumindest sein massives Auftreten) nur ein Nebeneffekt einer Sparma&szlig;nahme. Der Fehler liegt darin dass es dank der <a href="http://de.wikipedia.org/wiki/Heisenbergsche_Unsch%C3%A4rferelation" target="_blank">Heisenbergschen Unsch&auml;rferelation</a> unm&ouml;glich w&auml;re die Subatomaren Teilchen gleichzeitig exakt bez&uuml;glich ihres Impulses als auch Position zu erfassen. (Dazu muss man aber noch sagen dass a) dies nach neueren Erkenntnissen evtl. gar nicht n&ouml;tig w&auml;re und b) mir die Art der Autoren damit umzugehen sehr gefallen hat: "Wir haben ein Ger&auml;t das diese Dinge erm&ouml;glicht: Einen <a href="http://www.memory-alpha.org/de/wiki/Heisenberg-Kompensator" target="_blank">Heisenbergkompensator</a>!" eine sehr sch&ouml;ne M&ouml;glichkeit den Fans klar zumachen dass es sich trotz allem nur um Fiktion handelt und man nicht alles auf die Goldwaage legen sollte)<br/>F&uuml;r die Zweite Variante Beispiele zu finden ist wohl der einfachste Teil dieses Artikels. Wir alle kennen Filme in denen Laser mit lautem Zischen durch den (luftleeren!) Weltraum gefeuert werden oder Raumschiffinsassen trotz angeblich vorhandener Beschleunigungskompensation bei dem leichtesten Angriff durch die Gegend geworfen werden.<br/>Diese Fehler finde ich besonders &auml;rgerlich da sie als einzige bewusst gemacht werden UND die Geschichte nicht voran bringen. Man kann sie meiner Meinung nach damit vergleichen dass ein Koch eine schon bis zur Schmerzgrenze gesalzene Mahlzeit noch mit besonders h&uuml;bschen Salzkristallen dekorieren will. Es mag am Ende sch&ouml;ner aussehen, aber essbarer wird es dadurch nicht!</p>
<p>Sollte sich wirklich jemand den Aufwand zugemutet haben diesen endlosen Rant durchzulesen freue ich mich nat&uuml;rlich wie immer &uuml;ber Meinungen und Kommentare.<br/>(In diesem speziellen Fall w&auml;re es schon interessant zu erfahren ob das &uuml;berhaupt jemand auf sich nehmen wollte.)</p>
<p>BTW: ein netter <a href="http://fora.tv/2008/05/08/Neal_Stephenson_Science_Fiction_as_a_Literary_Genre" target="_blank">Vortrag zum Thema SF</a> von Neal Stephenson, mit Ausfl&uuml;gen zur Erkl&auml;rung warum Geeks so handeln wie sie es tun. (<a href="http://blog.fefe.de/?ts=b6879f29" target="_blank">via Fefe</a>)</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_333" onclick="set_comment_reference(333)" title="auf diesen Kommentar antworten">#333</a>:
    13.Jul.2008 08:07
    von
    
      
        striker
      
    
    
  </p>
<p>Mich w&uuml;rde noch ein "gutes Beispiel" f&uuml;r die vierte Art Fehler interessieren. Ich glaube, da fehlt noch was ;)</p>
<p>Btw interessanter Artikel. Wirklich :)</p>

<p class="infos">
<a href="#comment_334" onclick="set_comment_reference(334)" title="auf diesen Kommentar antworten">#334</a>:
    13.Jul.2008 08:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Awww.. fuck!<br/>
Das hat man davon wenn man ewiglange Sachen &uuml;ber mehrere Tage hinweg schreibt. :-/</p>

<p class="infos">
<a href="#comment_335" onclick="set_comment_reference(335)" title="auf diesen Kommentar antworten">#335</a>:
    14.Jul.2008 09:07
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Bei SciFi versuche ich immer so lange zu erkl&auml;ren ohne Ahnung zu haben bis der Leser selbst nicht mehr wei&szlig;, ob er Ahnung hat.</p>
<p>Es ist doch v&ouml;llig egal, ob etwas wissenschaftlich korrekt ist, so lange es plausibel klingt. Aber ich muss zugeben dass ich bei den Laserger&auml;uschen in Weltraumschlachten auch immer grinsen muss.</p>

<p class="infos">
<a href="#comment_336" onclick="set_comment_reference(336)" title="auf diesen Kommentar antworten">#336</a>:
    14.Jul.2008 02:07
    von
    
      
        <a href="http://seufz.wordpress.com" target="_blank">
          seufz
        </a>
</p>
<p>und ich muss zugeben das mich genau aus diesen Gr&uuml;nden SciFi so garnicht intressiert. :)</p>

<p class="infos">
<a href="#comment_337" onclick="set_comment_reference(337)" title="auf diesen Kommentar antworten">#337</a>:
    14.Jul.2008 03:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Naja, Genres sind nunmal Geschmackssache... ich pers&ouml;nlich finde daf&uuml;r z.B. Krimi oder so meist nicht so berauschend.<br/>
(Wobei ich eigentlich schon fast eine Ausnahme bin, da ich so ziemlich alles lese was irgendwo rumliegt.)</p>

<p class="infos">
<a href="#comment_338" onclick="set_comment_reference(338)" title="auf diesen Kommentar antworten">#338</a>:
    16.Jul.2008 09:07
    von
    
      
        <a href="http://www.from-hades.de" target="_blank">
          Oliver
        </a>
</p>
<p>Ich denke hier treffen wir auf ein gutes Beispiel von Wildern in fremden Gefilden. Star Wars beispielsweise ist kein SF, es nimmt Kompotenten des M&auml;rchens, vermengt diese mit einem gewaltigen Schu&szlig; Fantasie und packt ein paar Fragmente SF dabei. Fertig ist irgendetwas nur kein SF a la I Robot und damit meine ich  keinesfalls den Film. Genres sind immer irgendwie grenzwertig zu betrachten, zu schnell endet man in Dogmatik. Andererseits existieren eben markante Beispiele wie Alien, Star Wars etc. die alles andere sind als <em>science</em> <em>fiction</em>.</p>

<p class="infos">
<a href="#comment_339" onclick="set_comment_reference(339)" title="auf diesen Kommentar antworten">#339</a>:
    16.Jul.2008 01:07
    von
    
      
        <a href="http://ag6.alltagsgrauen.info" target="_blank">
          fwolf
        </a>
</p>
<p>in diesem Sinne: lies mal B&uuml;cher von Michael McCollumn - Beziehungsgeschichten sind eher mau, aber der Weltraumkampf ist ultra-realistisch gehalten.</p>
<p>Ansonsten halte ich mich an Iain M. Banks und Ben Bova -von wegen "Hardcore-SF" ;)</p>
<p>cu, w0lf.</p>

<p class="infos">
<a href="#comment_340" onclick="set_comment_reference(340)" title="auf diesen Kommentar antworten">#340</a>:
    16.Jul.2008 02:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>@oliver klar verschwimmen die Grenzen, ich wollte das auch keinenfalls als Dogmatische Sichtweise verstehen und die Genres unbedingt voneinander trennen. Mir ging es eher um die Fehler die bei allen m&ouml;glichen Filmen/B&uuml;chern/usw. vorkommen die sich mit Entwicklungen in der Zukunft oder noch zu entwickelnden Technologien besch&auml;fftigen.</p>
<p>@fwolf werde ich tun wenn ich davon mal irgendwo was finde<br/>
Hab mir die Woche mal die Blackcollar-Romane von Timothy Zahn durchgelesen, Teil 1 war wirklich genial, Teil 2 ziemlich gut und in Teil 3 hat man gemerkt dass er nur noch die Serie abschlie&szlig;en wollte. Das Ende ist etwas unbefriedigend.</p>
</div>