+++
title = "Brot und Spiele"
date = "2008-10-23T05:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/991"
aliases = "blog/991"
+++

<p>Mit "<a href="http://de.wikipedia.org/wiki/Panem_et_circenses" target="_blank">panem et circenses</a>" oder zu deutsch "Brot und Spiele" kritisierte der r&ouml;mische Dichter <a href="http://de.wikipedia.org/wiki/Juvenal" target="_blank">Juvenal</a> sehr treffend die Zust&auml;nde im r&ouml;mischen Reich.<br/>Er bezog sich dabei vor allem auf den Unterschied zwischen der Zeit der r&ouml;mischen Republik, als die Macht noch vom Volk ausging und an Feldherren oder Beamte nur verliehen wurde, zu den sp&auml;teren Zust&auml;nden im r&ouml;mischen Kaiserreich.</p>
<p>Wenn wir dieses Zitat mal auf die heutige Zeit beziehen, worin liegen dann die Unterschiede?<!--more--> Soll es sich wirklich nur darum handeln, dass das Volk mehr das Gef&uuml;hl vermittelt bekommt es w&auml;re nicht so? Oder liegen die Unterschiede gar nur in der Art der "Spiele"?</p>
<p>Sehen wir uns doch einmal an was Wikipedia zur heutigen Bedeutung dieses Zitates sagt:<br/></p><blockquote>Der Ausdruck bezeichnet auch heute noch Versuche einer Regierung oder anderer administrativer Strukturen, das Volk oder Teile des Volkes von Problemen (z. B. Rezessionen, innenpolitischen Problemen usw.) abzulenken, indem man mit Steuersenkungen, Wahlgeschenken oder eindrucksvoll inszenierten Gro&szlig;ereignissen die allgemeine Stimmung zu heben versucht.</blockquote><br/>&Auml;hm.. ja.. etwas zu eng gefasst. Administrative Strukturen sind ja ganz lustig aber so allgemein w&uuml;rde ich die Medien und deren "Regenten" nicht gerade als solche bezeichnen. Es handelt sich eher um diverse Einzelpersonen die eine derartige Menge an Geld und Macht angeh&auml;uft haben dass sie selber nicht mehr wissen was sie damit tun sollen (au&szlig;er nat&uuml;rlich dem &uuml;blichen: Nach mehr Macht, Geld und der Weltherrschaft zu streben... ach vergesst die Weltherrschaft, die ist bereits gut aufgeteilt.).

<p>Wenn sich ein solcher Medienmogul schlau anstellt werden die meisten B&uuml;rger nicht mal seinen Namen kennen und doch kann er &uuml;ber sie bestimmen was sie f&uuml;r Informationen bekommen, mit welcher Fernsehsendung sie sich jeden Abend vom Tagesgeschehen ablenken und welche Musik sie h&ouml;ren. DAS nenne ich mal Macht, das konnte nicht mal der gute alte C&auml;sar (evtl. auch K&auml;sar gesprochen, man ist sich da nicht so einig) zu seiner Zeit.<br/>Besser noch: Nicht nur dass die Typen mehr macht &uuml;ber mehr Personen aus&uuml;ben, die Personen bemerken das noch nicht mal und w&uuml;rden gar nicht auf die Idee kommen dagegen Einspruch zu erheben. Wenn morgens im Radio das neue Lied von $beliebiger_Superstar kommt dann ist das nat&uuml;rlich toll und muss angeh&ouml;rt werden.</p>
<p>Um derartiges zu vermeiden gab es in Deutschland ja fr&uuml;her mal die Idee &Ouml;ffentlich-Rechtliche Rundfunkanstalten zu unterhalten, die auch von der Politik unabh&auml;ngig sind. Leider bringen die den genau gleichen Schei&szlig; wie alle anderen, mit der Ausrede "Wir spielen ja nur was das Volk verlangt!"<br/>DAS IST BL&Ouml;DSINN! Ihr sollt nicht spielen was das Volk verlangt, ihr sollt spielen was das Volk braucht! Und das ist keine d&auml;mliche TeleNovela (allein schon das Wort!) oder die &Uuml;bertragung von irgendwelchen Fu&szlig;ballspielen. Das sind Informationen die sie von den Privaten nicht bekommen, unabh&auml;ngige Meinungen, Bildung!</p>
<p>Aber nat&uuml;rlich ist sowas aufw&auml;ndiger als einfach eine schlechte Serie f&uuml;r viel Geld zu kaufen und dem ausgetrocknetem Steuerzahlerhirn reinzudr&uuml;cken als wirklich innovatives zu bringen.</p>
<p>Die gr&ouml;&szlig;te Schande ist also eigentlich nicht dass wir uns mit Brot und Spielen zufrieden geben. Das haben die alten R&ouml;mer auch schon verbrochen. Die gr&ouml;&szlig;te Schande ist, dass wir BigBrother, Babara Salesch und Sarah&amp;Marc Werauchimmer f&uuml;r Unterhaltung und McDoof, Burgerking oder Mensaessen f&uuml;r Nahrung halten.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_825" onclick="set_comment_reference(825)" title="auf diesen Kommentar antworten">#825</a>:
    24.Oct.2008 01:10
    von
    
      <a href="/blog/author/toranor/">
        toranor
      </a>
</p>
<p>Aber Brot und Spiele funktioniert. Das Volk will nun mla nicht wissen in welchen riesen Haufen Scheisse(sorry) sie leben (und das kann man niemand ver&uuml;beln), sondern einfach nur seichte Unterhaltung (?), um nicht denken zu m&uuml;ssen.<br/>
Denken kostet Kraft, und wir deutschen sind fett und faul, wir haben keine Kraft mehr zu denken. Wir wollen dass wir alle verdummen, und uns dann &uuml;ber das ergebnis der Pisa-Studie aufregen.</p>
<p>Klar k&ouml;nnten wir viel Kultur und mehrseitige Berichterstattung &uuml;ber ein Thema bringen, aber dann m&uuml;ssten die LEute doch denken, sie m&uuml;ssten das gesehen verarbeiten, auswerten, bewerten und sich sich SELBER ne Meinung bilden.<br/>
Die Kr&ouml;nung ist ja, Ranicki kommt auf die B&uuml;hne und sagt den Preisgewinnern, das sie scheisse(sry) sind, und die feiern ihn. Keiner versteht was der Mensch da vorn sagt, aber alle klatschen.</p>
<p>Was w&auml;re, wenn jeder in diesem Staat w&uuml;sste, was in  selbigem vor sich geht, und dazu ne eigene MEinung hat ? Ich glaub dann hammer b&uuml;rgerkrieg oder Lynchjustiz.</p>
<p>Davon mal abgesehen, sind wir mittlerweile eh zum grossteil unfahig uns ne eigene MEinung zu bilden. Was einem da an geistigen Kotlawinen entgegenkommt, wenn mal mal jemand nach seiner Meinung fragt, oder man mal ne Meinung ungefragt gesagt bekommt, l&auml;sst einem an der Menschwerdung des Affen zweifeln. Da ist es auch als mitdenkender sch&ouml;n, wenn man weis, was sein gegen&uuml;ber f&uuml;r eine Meinung hat, denn die kan heute morgen in der Klosp&uuml;lung.</p>

<p class="infos">
<a href="#comment_826" onclick="set_comment_reference(826)" title="auf diesen Kommentar antworten">#826</a>:
    15.Jan.2009 01:01
    von
    
      
        <a href="/2009/01/15/systemschaden/" target="_blank">
          Systemschaden &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...]  Dass Deutschland ziemlich im Eimer ist, habe ich ja schon mehr als oft genug bemerkt (f&uuml;r mehr Links empfehle ich meine Suche zu verwenden) und [...]</p>

<p class="infos">
<a href="#comment_827" onclick="set_comment_reference(827)" title="auf diesen Kommentar antworten">#827</a>:
    21.Apr.2009 01:04
    von
    
      
        <a href="/2009/04/21/neuigkeit-20-politiker-lugen/" target="_blank">
          Neuigkeit 2.0: Politiker l&uuml;gen! &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] w&uuml;rde ein derartiger Entschluss erstmal ordentlich f&uuml;r Wirbel sorgen&hellip; aber wir wissen ja bereits wie das l&auml;uft. Man sorgt mit Brot und Spielen f&uuml;r Ablenkung und schon bemerkt keiner mehr was in der Politik so abgeht. Tats&auml;chlich wird der Termin f&uuml;r eine [...]</p>
</div>