+++
title = "MTV minus M"
date = "2008-10-23T12:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/987"
aliases = "blog/987"
+++

<p>MTV gibt jetzt endg&uuml;ltig seine urspr&uuml;ngliche Rolle als Musikfernsehen auf.<!--more--></p>
<p>Neben der <a href="http://www.medienrauschen.de/archiv/comedy-central-wird-nachtprogramm/" target="_blank">Fusion von Nick und CommedyCentral auf einen Sendeplatz</a> (Der einzige Grund CommedyCentral anzusehen war f&uuml;r mich dass da auch tags&uuml;ber mal ganz selten was ertr&auml;gliches lief.. das gibts jetzt aber auch nichtmehr.), steht wohl auch noch so einiges an Kleinkram auf der&nbsp; K&uuml;rzungsliste zur &ldquo;<a href="http://www.dwdl.de/article/story_18267,00.html">Optimierung</a> der Kostenstruktur und Erh&ouml;hung der Wettbewerbsf&auml;higkeit der Sender&rdquo;. Darunter dass die letzten beiden Sendungen zum Thema Musik, das MTV Newsmag und die MTV Masters, jetzt auch weggek&uuml;rzt werden.</p>
<p>Jetzt kann sich MTV endlich auf die wirklich wichtigen Dinge im Programm verlegen, frei gewordene Sendezeit weiter mit Klingeltonwerbung und RealityTV-Billigproduktionen auff&uuml;llen.</p>
<p>Liebe MTV-Verantwortlichen: Werbung ist nat&uuml;rlich wichtig um mit diesen Einnahmen das Programm finanzieren zu k&ouml;nnen, nur daf&uuml;r muss ein Programm vorhanden sein. Rein Werbung auszustrahlen ist nat&uuml;rlich billiger, aber die Einschaltquoten gehen auch in den Keller. Ich w&uuml;rde euch ja bitten nicht wie so viele Branchen dem Zwang zu verfallen mit wenig Geld m&ouml;glichst prozentual die h&ouml;chsten Gewinne zu erziehlen, aber daf&uuml;r ist es lange zu sp&auml;t.</p>
<p>Weniger aber besser bezahlte Werbung ist der einzige Weg aus dieser Abw&auml;rtsspirale! <span style="text-decoration:line-through;">Wenn</span>^WDa ihr das nicht erkennen werdet, d&uuml;rft ihr nat&uuml;rlich auch weiterhin nach Restniveau fahnden und es abschaffen... ich f&uuml;rchte nur da gibt es nichtmehr viel zu tun.</p>
<p>(Thema <a href="http://www.medienrauschen.de/archiv/mtv-optimiert/#comment-110447#comment-110447" target="_blank">gleich 2x</a> bei <a href="http://www.medienrauschen.de/archiv/comedy-central-wird-nachtprogramm/" target="_blank">Medienrauschen</a> geklaut)</p>
<p>BTW: Manchmal bin ich richtig froh keinen Fernseher mehr zu besitzen und keinen Kabelanschluss bezahlen zu m&uuml;ssen. Sowas will sich doch nicht wirklich irgendwer antun oder?</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_817" onclick="set_comment_reference(817)" title="auf diesen Kommentar antworten">#817</a>:
    23.Oct.2008 02:10
    von
    
      
        <a href="http://blog.mactv24.de" target="_blank">
          Mac
        </a>
</p>
<p>Ach weine den beiden (schon lange) nicht mehr nach.</p>

<p class="infos">
<a href="#comment_818" onclick="set_comment_reference(818)" title="auf diesen Kommentar antworten">#818</a>:
    23.Oct.2008 02:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Das tu ich ja nun auch nicht im Geringsten.. wie auch? Das letzte mal dass ich MTV angesehen hab war glaube vor meinem Studium und seit meinem letzten Umzug hab ich &uuml;berhaupt kein Fernsehen mehr.</p>

<p class="infos">
<a href="#comment_819" onclick="set_comment_reference(819)" title="auf diesen Kommentar antworten">#819</a>:
    23.Oct.2008 03:10
    von
    
      
        <a href="http://gottweltkuehlschrank.de/die-letzte-trote" target="_blank">
          GottWeltK&uuml;hlschrank 1.5 &amp;raquo; Die letzte Tr&ouml;te
        </a>
</p>
<p>[...] (Geklaut bei G33KY^2) [...]</p>

<p class="infos">
<a href="#comment_820" onclick="set_comment_reference(820)" title="auf diesen Kommentar antworten">#820</a>:
    25.Oct.2008 10:10
    von
    
      
        <a href="http://unixhaus.de" target="_blank">
          Solarix
        </a>
</p>
<p>Tja MTV ist eigentlich schon Mitter der 90er immer schlechter geworden und das von Jahr zu Jahr.<br/>
Wer kann sich noch an Moderatoren Wie Ray Cokes erinnern?<br/>
Sp&auml;testens als bei MTV das Multikulti Ding abgel&ouml;st wurde Durch eine Deutsche Filiale war es vorbei. Diesem MTV kann man berechtigt nach heulen, aber dem MTV von heute trauere ich keine Tr&auml;ne nach.</p>
<p>Das alte "gute" MTV lebt in meinen Erinnerungen weiter. ;) Und die Clips auf Youtube.</p>

<p class="infos">
<a href="#comment_821" onclick="set_comment_reference(821)" title="auf diesen Kommentar antworten">#821</a>:
    25.Oct.2008 10:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ich gestehe ich geh&ouml;rte noch nie zu denen die sich stundenlang irgendwelche Musikvideos angesehen haben. Von einigen wenigen wirklich guten (KoRn hatte da immer was drauf) mal abgesehen hat sowas im schlimmsten Fall mal im Hintergrund gedudelt.</p>

<p class="infos">
<a href="#comment_822" onclick="set_comment_reference(822)" title="auf diesen Kommentar antworten">#822</a>:
    26.Oct.2008 02:10
    von
    
      
        <a href="http://unixhaus.de" target="_blank">
          Solarix
        </a>
</p>
<p>Naja "Headbangers Ball" mit der verstrahlten Vanessa Warwick, hatte schon was. Da gab es auch noch Platz f&uuml;r Stoff jenseits des "Dudelfunks"  ausserdem war ich da noch ein paar Tage j&uuml;nger . ;)</p>

<p class="infos">
<a href="#comment_823" onclick="set_comment_reference(823)" title="auf diesen Kommentar antworten">#823</a>:
    03.Dec.2008 09:12
    von
    
      
        rene
      
    
    
  </p>
<p>Evil terror, der teufel ist eine frau CATHERINE M&Uuml;HLEMANN ist die m&ouml;rderin von unseren guten alten mtv. und das viva heute so scheisse ist geht auch auf ihr konto, im mittelalter w&auml;hre so was wie die am scheiterhaufen verbrannt worden!!!!</p>

<p class="infos">
<a href="#comment_824" onclick="set_comment_reference(824)" title="auf diesen Kommentar antworten">#824</a>:
    04.Dec.2008 12:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>gutes, altes MTV? VIVA erst heute schei&szlig;e?<br/>
zumindest bist du optimistisch... -.-</p>
</div>