+++
title = "Newsfeed-Umstellungen"
date = "2008-02-17T07:02:00"
author = "Dr. Azrael Tod"
issoid = "blog/321"
aliases = "blog/321"
+++

<p>Ich habe mal meine Newsfeeds auf den neuesten Stand gebracht:<br/><br/>Mein Hauptnewsfeed (SharedItems, also alles was ich an gelesenen Sachen f&uuml;r interessant hielt...) gibt es jetzt &uuml;ber <a href="http://www.feedburner.com"> FeedBurner</a>. Dies erm&ouml;glicht jede Menge neuer Funktionen, von denen einige aber im Moment noch nicht 100%ig funktionieren. (Und mir selbst erm&ouml;glichen die statistiken zugegebenerma&szlig;en auch besser einzusch&auml;tzen wer sich alles f&uuml;r meine Feeds interessiert.)<br/>Nat&uuml;rlich k&ouml;nnt ihr auch weiterhin unter der alten URL auf meinen Feed zugreifen (vor allem bei Paranoia sicher eine Option), aber wirklich unterst&uuml;tzen werde ich in Zukunft haupts&auml;chlich die neue Adresse.<br/>Wer &uuml;ber keinen RSS-Reader verf&uuml;gt, kann sich meinen Newsfeed mit Zusammengestellten Items aus allen M&ouml;glichen Quellen jetzt auch <a href="http://www.feedburner.com/fb/a/emailverifySubmit?feedId=1693162&amp;loc=de_DE">per EMail bestellen</a> (K&ouml;nnte manchmal N&uuml;tzlich sein, neigt aber auch, dank der Gro&szlig;en Anzahl von Items, dazu zu nerven)<br/><br/>Wem das alles zu viel ist, oder wer einfach nur eine &Uuml;bersicht &uuml;ber die WIRKLICH wichtigen Dinge m&ouml;chte, dem m&ouml;chte ich an dieser Stelle die <a href="http://feeds.feedburner.com/StarredByDrAzraelTod">alternative, nochmals aussortierte Version</a> empfehlen. (gibts nat&uuml;rlich erst recht auch <a href="http://www.feedburner.com/fb/a/emailverifySubmit?feedId=1693258&amp;loc=en_US">per Mail</a>)<br/><br/>Der G33ky-Feed wird neuerdings ebenfalls &uuml;ber Feedburner umgeleitet (die einzige Sache bei der ich euch keine gro&szlig;e Wahl lasse^^). Dabei ist jedoch keinerlei Umstellung eurerseits n&ouml;tig.<br/><br/>Bei allen anderen Feeds (Musik, Webcomics, k&uuml;rzlich angeh&ouml;rtes, ...) bleibt erstmal alles beim alten. Es k&ouml;nnte jedoch sein dass ich auch dort noch einiges Umstelle um mehr &Uuml;bersicht dar&uuml;ber zu erhalten, ob sich &uuml;berhaupt Irgendjemand daf&uuml;r interessiert. (aus Mangel an Feedback)</p>
