+++
title = "Dinge, die ich auf die harte Tour lernen musste"
date = "2006-05-04T09:05:00"
author = "Dr. Azrael Tod"
issoid = "blog/284"
aliases = "blog/284"
+++

<p></p><h3>Heute: Autos:</h3><br/><ul><br/> <li>Man kann selbst einen TDI abw&uuml;rgen.</li><br/> <li>Fahrschullehrer sind &uuml;ber&auml;ngstlich, was den Abstand zu anderen Autos betrifft.</li><br/> <li>...seltsame &Uuml;berholman&ouml;ver kurz vor einer Baustelle scheinen ihnen jedoch zu gefallen.</li><br/> <li>Wenn ein Fahrschulpr&uuml;fer "Links" sagt sollte man selten Rechts abbiegen.</li><br/> <li>Anders rum ist es auch nicht besser.</li><br/> <li>w&auml;hrend einer Fahrschulpr&uuml;fung die Vorfahrtsregeln nicht beachten kann Geld kosten.</li><br/> <li>... dauerhaft zu langsam fahren und ein Haufen kleinere Fehler ebenfalls</li><br/> <li>Auch ein Pr&uuml;fer der einen durchfallen lassen will, kann ins Geld gehen.</li><br/> <li>Leute die l&auml;stern, weil jemand 3x durch die Pr&uuml;fung fiel k&ouml;nnen ganz schnell diesen Rekord brechen :P</li><br/> <li>Man muss auch Parkgeb&uuml;hren zahlen, wenn der Parkplatz erst 2 Tage nach dem abstellen des Autos geb&uuml;hrenpflichtig wurde.</li><br/> <li>Die Anzahl der freien Parkpl&auml;tze in Zwickau reduziert sich drastisch, wenn der gr&ouml;&szlig;te kostenlose Parkplatz pl&ouml;tzlich geb&uuml;hrenpflichtig wird.</li><br/> <li>Zwickau wimmelt von Politessen.</li><br/> <li>Mit Strafzetteln l&auml;sst sich gutes Geld verdienen.</li><br/> <li>KFZ-Techniker sind oft realit&auml;tsferner als Informatiker. (dass sowas &uuml;berhaupt m&ouml;glich ist... o_O)</li><br/> <li>KFZ-Techniker halten JEDES Auto f&uuml;r untermotorisiert!</li><br/> <li>Ein Verbrauch von K&uuml;hlwasser in Gr&ouml;&szlig;enordnung des Benzinverbrauches ist selten gut.</li><br/> <li>Auch Kan&auml;le im Zylinderkopf aufgrund einer kaputten Dichtung scheinen negativ zu sein.</li><br/> <li>Die Phasenvarianz der Schilde sollte um 0,5 milicochrain erh&ouml;ht werden (nur ein test um zu sehen, ob ihr noch mitlest^^)</li><br/> <li>Autos im Hagel stehen zu lassen scheint sich Negativ auszuwirken.</li><br/> <li>Ein Haufen kleinere Beulen Dach sehen nicht so toll aus, beeinflussen aber die Funktionalit&auml;t zum Gl&uuml;ck kaum.</li><br/> <li>... Eine Kaputte Frontscheibe ist eher kritisch.</li><br/> <li>Mit steigender Zahl der Defekte sinkt das Fahrvergn&uuml;gen.</li><br/> <li>den T&Uuml;V st&ouml;ren dutzende kleinere Defekte jedoch kaum o_O</li><br/> <li>Tschechen im Lada mit Anh&auml;nger oder LKWs mit Sommerreifen mindern im winterlichen Erzgebirge ebenfalls das Fahrvergn&uuml;gen erheblich.</li><br/> <li>M&auml;dchen bekommen Angst, wenn man mit einem Auto rel. schnell unterwegs ist und das Auto immer mehr seltsame Ger&auml;usche von sich gibt.</li><br/> <li>Nach einem ganzen Tag in einem kleinem Golf 2, mit argen Motorproblemen auf der Autobahn, wollen manche M&auml;dchen nur ungern wieder in dieses Auto steigen.</li><br/> <li>Auch KFZ-Techniker bekommen bei einem gewissen Fahrstil Angst.</li><br/> <li>Es gibt eine Grenze ab der es auf Grund von zu vielen zu schlimmen Einzelproblemen eines Motors nicht mehr sinnvoll ist, ein altes Auto weiter zu verwenden.</li><br/> <li>Bereits vorher gibt es eine Grenze, ab der keiner mehr gerne mitf&auml;hrt... nicht mal (oder vor allem nicht *g*) die eigene Freundin.</li><br/> <li>Es ist schwieriger ein neues Auto zu einem vern&uuml;nftigen Preis zu finden, als man glauben sollte.</li><br/></ul>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_16" onclick="set_comment_reference(16)" title="auf diesen Kommentar antworten">#16</a>:
    22.Aug.2008 03:08
    von
    
      
        <a href="/2008/08/22/dinge-die-ich-auf-die-harte-tour-lernen-musste-3/" target="_blank">
          Dinge die ich auf die harte Tour lernen musste
        </a>
</p>
<p>[...] die ich auf die harte Tour lernen musste&nbsp;#3  Der ersten beiden Teile sind ja nun schon eine ganze Weile her, doch ich hab beschlossen mal alle m&ouml;glichen Facts [...]</p>

<p class="infos">
<a href="#comment_17" onclick="set_comment_reference(17)" title="auf diesen Kommentar antworten">#17</a>:
    22.Aug.2008 09:08
    von
    
      
        <a href="/2008/08/22/dinge-die-ich-auf-die-harte-tour-lernen-musste-4/" target="_blank">
          Dinge die ich auf die harte Tour lernen musste
        </a>
</p>
<p>[...] harte Tour lernen musste&nbsp;#4  F&uuml;r diejenigen die den letzten Beitrag gelesen haben (oder die beiden von 2006), ist das was jetzt kommt schon bekannt, eine weitere Sammlung von Dingen die ich auf die [...]</p>

<p class="infos">
<a href="#comment_18" onclick="set_comment_reference(18)" title="auf diesen Kommentar antworten">#18</a>:
    22.Aug.2008 12:08
    von
    
      
        <a href="/2008/08/22/dinge-die-ich-auf-die-harte-tour-lernen-musste-5/" target="_blank">
          Dinge die ich auf die harte Tour lernen musste
        </a>
</p>
<p>[...] Autos (ebenfalls 04.05.06) [...]</p>
</div>