+++
title = "Der Trend zum Drittcomputer"
date = "2008-07-03T05:07:00"
author = "Dr. Azrael Tod"
issoid = "blog/445"
aliases = "blog/445"
+++

<p>Immer st&auml;rker zeigt sich f&uuml;r mich ein Tendenz auch in privaten Wohnungen eine komplexere Netzwerkstruktur aufzubauen. Die Zeit in der eine Familie &uuml;berlegt hat ob sie sich &uuml;berhaupt einen Computer zulegen soll ist meiner Meinung nach l&auml;ngst vorbei und einzelne Computer die mit internem Modem oder ganz abgekapselt das komplette Netz der Wohnung darstellen sind nahezu ausgestorben.</p>
<p>Diese Entwicklung wurde nat&uuml;rlich durch den Preisverfall bei Hardware beg&uuml;nstigt, erm&ouml;glicht wurde sie meiner Meinung nach jedoch eher durch die st&auml;rkere Verbreitung von schnelleren Internetanschl&uuml;ssen und vor allem durch CS-Kiddies die sich jedes 2. Jahr dringend einen neuen Computer zulegen m&uuml;ssen.<br/>Letztere Aussage mag auf den ersten Blick etwas unsinnig wirken, aber welche Familie w&uuml;rde sich schon einen 2. PC kaufen wenn die Kinder nicht am PC spielen w&uuml;rden? F&uuml;rs surfen und Onlinebanking reicht pro Familie meistens ein PC (Naja, bei mir und meiner Freundin eher nicht, da braucht schon jeder seinen eigenen sonst kommen wir uns ins Gehege.^^), auch die Steuererkl&auml;rung kann man noch daran machen. Erst wenn der Sohn den PC 3 Stunden am St&uuml;ck mit Battlefield belegt, die Tochter Sims spielen oder ihre Freundinnen per ICQ &uuml;ber den neuen Kerl in der Klasse ausfragen will, und der Vater eigentlich nur kurz sein neuestes Spielzeug bei Reichelt, Conrad oder Ebay kaufen wollte... erst dann wenn es also so richtig kracht fangen die Familienmitglieder an sich&nbsp; jeweils einen eigenen PC zu kaufen. (Bzw. im Normalfall kauft das Spiele- oder Hardwares&uuml;chtigste Mitglied der Familie meistens alle paar Jahre PCs und gibt die alten an den Rest der Familie weiter.)</p>
<p>Pl&ouml;tzlich ergeben sich die altbekannten Vernetzungsprobleme die man von allen Ansammlungen mehrerer Rechner so kennt. Papa m&ouml;chte kurz vom Rechner des Sohnemanns die Fotos der letzten Familienfete runterladen, die Tochter will nur mal eben die Musiksammlung ihres Bruders mit ihrer eigenen abgleichen und das ganze sollte m&ouml;glichst auch noch ohne gro&szlig;es Rumgerenne mit USB-Sticks oder DVD-Rohlingen geschehen.</p>
<p>WLAN bietet sich da nat&uuml;rlich f&uuml;r die Verbindungen an und wird in den meisten F&auml;llen auch genutzt. Wer will schon Kabel verlegen?</p>
<p>Was jetzt noch fehlt sind einfach zu konfigurierende Multimedia-Serversysteme mit geringem Stromverbrauch, <a href="http://de.wikipedia.org/wiki/Network_Attached_Storage" target="_blank">NAS-L&ouml;sungen</a> sind ein Anfang, doch ich glaube nicht dass eine 08/15-Familie einsieht warum sie mehrere hundert Euronen f&uuml;r ein Ger&auml;t ausgeben soll, das f&uuml;r sie keinen eindeutig erkennbaren Mehrwert in Form von v&ouml;llig neuen Funktionen bietet. Alles was ein NAS-System kann, kann problemlos vom Arbeits-PC &uuml;bernommen werden, klar schluckt der daf&uuml;r erheblich mehr Strom und l&auml;uft auch nicht die ganze Zeit aber das sind alles nur Detailverbesserungen die nicht wirklich als gute Kaufargumente verwertbar sind.</p>
<p>Der Ausweg w&auml;re leicht, es sollte z.B. kein Problem sein NAS-Funktionen in den digitalen-Videorekorder oder den <a href="http://de.wikipedia.org/wiki/Wireless_Access_Point" target="_blank">WLAN-AP</a> mit DSL-Modem zu integrieren (Aber warum sollte man so umst&auml;ndlich anfangen und nicht gleich AP, Videorecorder und NAS in einem Ger&auml;t kombinieren?), in derartigen Ger&auml;ten erscheinen solche Funktionen dann als echter Mehrwert und sorgen (bei verh&auml;lltnissm&auml;&szlig;igen Preisen) eher f&uuml;r eine Anschaffung als der Verkauf als Einzelger&auml;te.</p>
<p>Offen bleibt auch nicht die Frage OB etwas derartiges auf den Markt gebracht wird, sondern vielmehr wer es zuerst schafft etwas derartiges auf den Markt zu bringen und dabei UNBEDINGT beide folgende Punkte einzuhalten:<br/></p><ol><br/> <li>Die Bedienung muss einfach sein! Es muss mit wenigen Men&uuml;s und ohne technischen Sachverstand m&ouml;glich sein einen Film per <a href="http://de.wikipedia.org/wiki/Digital_Video_Broadcasting" target="_blank">DVB</a> aufzunehmen (oder per <a href="http://de.wikipedia.org/wiki/BitTorrent_(Protokoll)" target="_blank">Torrent</a> herunterzuladen), die Rechte f&uuml;r Netzwerkzugriffe einzustellen und das ganze auf einem anderem Rechner anzusehen.</li><br/> <li>Der Preis muss in Bereichen liegen die eine kleinfamilie nicht grunds&auml;tzlich abschrecken.</li><br/></ol><br/>F&uuml;r die Konfiguration der NAS- und AP-Funktionen erg&auml;ben sich so ganz nebenbei durch die Kombination mit einem Fernsehsystem auch komplett neue M&ouml;glichkeiten. Man braucht nicht l&auml;nger den Kunden zu erkl&auml;ren warum sie irgendwelche kryptischen IP-Adressen in ihren Browser eingeben sollen, sie m&uuml;ssen einfach nur ihren Fernseher einschalten und auf der Fernbedienung "Einstellungen" dr&uuml;cken.

<p>Kombiniert mit dem Trend zu immer billigeren Computern bzw. <a href="http://de.wikipedia.org/wiki/Netbook" target="_blank">NetTops</a> der sich in letzter Zeit zeigt f&uuml;hrt dies auch zu v&ouml;llig neuen Hardwarem&ouml;glichkeiten (der Trend ist ja nun auch bei Aldi <a href="http://www.heise.de/newsticker/Medions-399-Euro-Netbook-auch-bei-Aldi-Nord--/meldung/110148/from/atom10" target="_blank">angekommen</a>). Evtl. wird es bald v&ouml;llig normal sein zuhause einen relativ leistungsf&auml;higen Server stehen zu haben, der alle anliegenden Daten verarbeitet, Hintergrunddienste ausf&uuml;hrt und so ganz nebenbei Fernseher spielt. Surfen, Chatten und arbeiten kann man dann ja recht schnell auf dem pers&ouml;nlichem Mini-Notebook. (Auf die Art kann man insgesammt wohl sogar Geld sparen und der Schnuckel-Faktor ist auch nicht grade zu verachten)</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_257" onclick="set_comment_reference(257)" title="auf diesen Kommentar antworten">#257</a>:
    04.Jul.2008 08:07
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Na, das w&uuml;nsche ich mir auch schon lange. Aber NAS-Systeme kann man sich doch mittlerweile recht g&uuml;nstig basteln, hab vor zwei Wochen daheim eines f&uuml;r runde 300&euro; eingerichtet (2x 500GB Festplatten eingeschlossen).</p>

<p class="infos">
<a href="#comment_258" onclick="set_comment_reference(258)" title="auf diesen Kommentar antworten">#258</a>:
    04.Jul.2008 09:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Naja, ich hab mir sone Art Media-System mit Server selber gebaut. Das ist ja mit nem mini-ITX-Mainboard und ein wenig Zubeh&ouml;r kein gro&szlig;es Problem.</p>
<p>F&uuml;r den Otto-Normal-Verbraucher ist das jedoch nichts, der kann und will sich seinen PC nicht selber zusammenbauen.</p>

<p class="infos">
<a href="#comment_259" onclick="set_comment_reference(259)" title="auf diesen Kommentar antworten">#259</a>:
    21.Jul.2008 09:07
    von
    
      
        <a href="http://fidel.vido.info/wordpress" target="_blank">
          fidel
        </a>
</p>
<p>Die simple NAs Variante ist denke ich wenn clver umgesetzt wirklich gut und erschwinglich.<br/>
Denke es scheitert bis dato in vielen Haushalten eher an der Idee-Generierung an sich  sowie ggf dem technischen Knowhow und nicht am finaziellen. Da k&ouml;nnen allenfalls die Kids selber oder technisch versierte Bekannte helfen.<br/>
Bin happy mit meiner FreeNas L&ouml;sung die die grundlegenden Funktionen out of the box mitbringt.</p>

<p class="infos">
<a href="#comment_260" onclick="set_comment_reference(260)" title="auf diesen Kommentar antworten">#260</a>:
    21.Jul.2008 09:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>naja, 1&amp;1 versucht ja gerade etwas &auml;hnliches in verschiedenen Varianten zu verkaufen. Allerdings scheint das Ding seine Videodaten nur aus dem Internet oder von externen Datentr&auml;gern beziehen zu k&ouml;nnen, ein DVB- oder wenigstens Analog-empf&auml;nger fehlt mir da noch.<br/>
Wozu sollte man seinen AP/NAS/... an den Fernseher h&auml;ngen wenn man damit noch nicht direkt fernsehen kann?</p>
</div>