+++
title = "Spiele wegen denen ich Rückfällig werden könnte"
date = "2008-07-12T03:07:00"
author = "Dr. Azrael Tod"
issoid = "blog/470"
aliases = "blog/470"
+++

<p>Wie schon &ouml;fter bemerkt sind vor allem eher &auml;ltere Spiele meine Welt, dies mag einerseits daran liegen dass meiner Meinung nach heutzutage oft der Grafik mehr Gewicht zugerechnet wird als Spielumfang und die M&ouml;glichkeiten die man als Spieler hat, andernseits liegt es wohl auch zu gewissen Teilen daran, dass ich in den letzten Jahren (vor allem seit Anfang meines Studiums) eher weniger dazu gekommen bin zu Spielen.</p>
<p>Jedenfalls gibt es einige Spiele f&uuml;r deren Fortsetzungen ich evtl. sogar &uuml;berlegen w&uuml;rde meinen PC wieder spielf&auml;hig aufzur&uuml;sten (wenn ich auch nur eine Grundmenge Geld &uuml;brig h&auml;tte) und die ich mir (zumindest wenn es sie f&uuml;r Linux g&auml;be) kaufen w&uuml;rde.</p>
<p><!--more--></p>
<p>Dabei handelt es sich um:<br/></p><ol><br/> <li><a href="http://fallout.bethsoft.com/ger/home/home.php" target="_blank">Fallout 3</a> - Zumindest wenn der Schwerpunkt weiterhin wie bei Teil 1/2 auf der Handlung, dem Witz und den unglaublich weitverzweigten M&ouml;glichkeiten liegt und nicht dies alles zugunsten von Grafikorgien aufgegeben wurde.</li><br/> <li><a href="http://www.games-guide.de/pcgames/adventure/e/earthsiege2.htm" target="_blank">Earthsiege 3</a> - Es gab imho niemals einen besseres Mech-Game als Earthsiege 2, leider ist nach <a href="http://en.wikipedia.org/wiki/Starsiege:_Tribes" target="_blank">Starsiege</a> (was schon nicht mehr ganz meinen Geschmack getroffen hat) nie eine weitere Fortsetzung erschienen (<a href="http://en.wikipedia.org/wiki/Starsiege:_Tribes" target="_blank">Starsiege: Tribes</a> gilt nicht, dies ist ebensowenig eine Earthsiege-Fortsetzung wie <a href="http://en.wikipedia.org/wiki/MissionForce:_CyberStorm" target="_blank">Mission Force: Cyberstorm</a>). Auch die <a href="http://www.microsoft.com/Games/mechwarrior4/" target="_blank">Mechwarrior-Reihe</a> kann imho nicht mit der Atmhosph&auml;re und dem Ressourcensystem mithalten.<br/>Das Verhalten der Hercs ist eher dem eines Panzers entsprechend langsam als bei diversen neueren Verwurstungen des Themas. (siehe z.B. <a href="http://www.garagegames.com/products/29/" target="_blank">Dark Horizon - Lore Invasion</a>)</li><br/> <li><a href="http://de.wikipedia.org/wiki/Freespace" target="_blank">Conflict: Freespace</a> oder <a href="http://de.wikipedia.org/wiki/Wing_Commander_(Computerspiel)" target="_blank">Wing Commander</a> - Epische Geschichte, geniale Story, erz&auml;hlt von langen Videosequenzen und ein Fluggef&uuml;hl das einfach nur Spa&szlig; macht. Leider sind Weltraumshooter wohl etwas aus der Mode gekommen (wie alle Spiele die einen extra Joystick als Vorraussetzung haben). Microsoft-Spiele bei deren Steuerung fast nur die Maus zur Verf&uuml;gung steht, deren Bugs und Abst&uuml;rze im Sekundentakt erfolgen und &auml;hnliche Karikaturen z&auml;hlen nicht als Alternativen!</li><br/> <li><a href="http://de.wikipedia.org/wiki/Strike_Commander" target="_blank">Strike Commander</a> - wieder ein actiongeladener Flugsimulator mit dem Hang zum Suchtmittel und langen Videosequenzen als W&uuml;rze. Dieses Spiel lies sich noch einfach steuern wie ein Actionspiel, hatte aber dennoch einen gewissen taktischen Tiefgang und stammt noch aus der guten alten Zeit in der einem Flugsimulator noch ein dickes Handbuch beigelegt waren in dem selbst Dinge wie &uuml;bliche Flugman&ouml;ver und aerodynamische Grundprinzipien beschrieben waren.</li><br/> <li><a href="http://de.wikipedia.org/wiki/The_Legend_of_Kyrandia" target="_blank">The Legend of Kyrandia</a> - Ich k&ouml;nnte stundenlang &uuml;ber den Witz und die R&auml;tsel von Kyrandia 3 lachen (und habe es auch). Kaum ein anderes Adventure hatte eine vergleichbare einfache Steuerung und dennoch derartig viele m&ouml;gliche L&ouml;sungswege f&uuml;r ein und dieselbe Situation (zumindest in der ersten H&auml;lfte des Spieles).</li><br/> <li><a href="http://de.wikipedia.org/wiki/Magic_Carpet_(Computerspiel)" target="_blank">Magic Carpet</a> - Teppiche klopft man! Oder man fliegt auf ihnen durch die Gegend und zaubert Feuerb&auml;lle, Erdbeben und Vulkane mit denen man seine Gegner besiegt. Grafisch war dieses Spiel f&uuml;r seine Zeit einfach nur Richtungsweisend und verf&uuml;gte &uuml;ber ein Spielkonzept das seines Gleichen sucht. Die Zauberspr&uuml;che waren derartig Vielseitig wie die Gegner, die Steuerung war ziemlich gut gelungen und Mana sammeln machte einfach &uuml;ber viele Stunden unglaublichen Spa&szlig; (Nebenbemerkung: Magic Carpet ist wohl das Spiel mit den meisten M&ouml;glichkeiten zur 3D-Darstellung das ich bis heute kenne.. auch wenn ich noch nie jemanden getroffen habe, der per "magischem Auge" etwas bei diesem Spiel erkannt h&auml;tte)</li><br/> <li><a href="http://de.wikipedia.org/wiki/Dungeon_Keeper" target="_blank">Dungeon Keeper</a> - ICH BIN B&Ouml;&Ouml;&Ouml;&Ouml;&Ouml;SE!</li><br/></ol>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_324" onclick="set_comment_reference(324)" title="auf diesen Kommentar antworten">#324</a>:
    12.Jul.2008 03:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Mift! Links vergessen!<br/>
werden heute Abend nachgeliefert...</p>

<p class="infos">
<a href="#comment_325" onclick="set_comment_reference(325)" title="auf diesen Kommentar antworten">#325</a>:
    12.Jul.2008 06:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Links wurden hinzugef&uuml;gt und einige Details erg&auml;nzt</p>

<p class="infos">
<a href="#comment_326" onclick="set_comment_reference(326)" title="auf diesen Kommentar antworten">#326</a>:
    13.Jul.2008 10:07
    von
    
      
        <a href="http://www.zettt.de" target="_blank">
          Zettt
        </a>
</p>
<p>Ich spiele auch ganz selten am Rechner. Aber ein Spiel das mir richtig ans Herz gewachsen ist, ist Unreal Tournament. Fand ich den ersten Teil schon Hammer und den zweiten Teil auch. Den Dritten kenne ich nicht. Weiss auch gar nicht ob der schon draussen ist. Wuerde ich aber sicher wieder endlos zocken. ^^</p>

<p class="infos">
<a href="#comment_327" onclick="set_comment_reference(327)" title="auf diesen Kommentar antworten">#327</a>:
    13.Jul.2008 10:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>zugegeben.. UT war wirklich ein gutes Spiel (nicht umsonst war UT2004 das letzte Spiel dass ich mir nochmal nachtr&auml;glich gekauft habe obwohl ich auch ein gecrackte Version h&auml;tte spielen k&ouml;nnen)<br/>
Aber da die gr&ouml;&szlig;te Ver&auml;nderung (und imho die einzige wirklich wichtige) von 2004 zu 2007 eine Verbesserung der Grafik ist, werde ich wohl noch einige Zeit bei UT1 und 2004 bleiben.<br/>
Ich nehme mal &uuml;brigens an dass du mit UT3 UT2007 meinst (1, 2003, 2004, 2007), das ist imho bereits einige Monate verf&uuml;gbar.</p>
<p>BTW: UT2004 tut sehr gut unter Linux und wurde auch mit dieser Funktion verkauft! Vorbildlich!</p>

<p class="infos">
<a href="#comment_328" onclick="set_comment_reference(328)" title="auf diesen Kommentar antworten">#328</a>:
    14.Jul.2008 09:07
    von
    
      
        <a href="http://gottweltkuehlschrank.de/" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Das neueste UT hei&szlig;t wirklich <a href="http://de.wikipedia.org/wiki/Unreal_Tournament_3">UT3</a> und nicht UT 2007 (und ist seit November drau&szlig;en), was meiner Meinung nach ein gro&szlig;er Schritt in die richtige Richtung (also weg von der FIFA-Reihe) ist.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_329">
<p class="infos">
<a href="#comment_329" onclick="set_comment_reference(329)" title="auf diesen Kommentar antworten">#329</a>:
    14.Jul.2008 09:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Naja, aber die richtige Richtung ist meiner Meinung nach dennoch nicht immer wieder das gleiche Spiel mit einer neuen Grafikengine zu ver&ouml;ffentlichen.<br/>
Detailverbesserungen sind sicher eine gute M&ouml;glichkeit auf Dauer das beste Produkt zu liefern, wenn man aber wie in der Spielebranche darauf aus ist dass sich m&ouml;glichst alle Nutzer immer die neueste Version kaufen, sollte man schon in jeder Version einen guten Grund liefern warum man sich diese ZUS&Auml;TZLICH zur alten kaufen sollte.<br/>
(Bei anderen Produkten, bei denen man auch Version 1 mit Version 7 zusammen verwenden kann, kann man auf leichte Ver&auml;nderungen setzen, da geht es jedoch auch nur darum NEUE Kunden zu finden oder alten Kunden alle paar Generationen die neueste zu verkaufen.)</p>
</div>
</li>
</ul>
</div>