+++
title = "It's all text!"
date = "2008-10-02T12:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/845"
aliases = "blog/845"
+++

<p>In einem Beitrag auf <a href="http://www.terminally-incoherent.com/blog/2008/10/01/vim-tips/">Terminal-Incoherent</a> bez&uuml;glich einiger Tips f&uuml;r Vi/Vim wurde ein Addon f&uuml;r Firefox erw&auml;hnt das ich euch einfach nicht vorenthalten will (es wurden auch noch einige andere sehr gute Sachen erw&auml;hnt, aber die sind ziemlich vi-spezifisch und darum gehts mir gerade nicht.). <a href="https://addons.mozilla.org/en-US/firefox/addon/4125">It's all Text</a> erm&ouml;glicht es jeglichen Inhalt eines Textfeldes, auf beliebigen Webseiten im Editor der eigenen Wahl zu &ouml;ffnen.<!--more--></p>
<p>F&uuml;r mich pers&ouml;nlich muss ich zugeben dass dies meist weder Vi noch Emacs ist (Hey, unangepasst zu sein bedeutet nicht sich an die Vorurteile bez&uuml;glich unangepasster Menschen anzupassen... Mit der Ausrede kann ich auf solche Editoren verzichten und mich dennoch als geek bezeichnen *g*).<br/>Beide Editoren waren einfach nie so ganz mein Fall. Bereits f&uuml;r das Erstellen eines Blogposts kann jedoch die Syntax-Hervorhebung eines guten Editors wahnsinnig n&uuml;tzlich sein, so dass auch ich durchaus meine Vorteile von diesem Plugin habe.</p>
<p>F&uuml;r komplexere Anforderungen h&auml;tte ich jedoch gerne eine erweiterte Funktion im Plugin, ich w&uuml;rde gern per Tastenkombination eine alternative Befehlszeile ausw&auml;hlen mit der der Text verarbeitet werden soll.<br/>Dies w&uuml;rde wohl nicht sonderlich viel Programmieraufwand bedeuten, w&uuml;rde jedoch auch f&uuml;r andere Umgebungen komplexeste Funktionen in Sekundenbruchteilen erm&ouml;glichen. [ctrl]+[foo]-dr&uuml;cken, kurz eine Befehlszeile eingegeben und schon jagt man den Text durch grep, liest in direkt in less oder kann ihn sogar je nach aktuellem Verlangem in vi, nano, emacs, gedit, mcedit, kate oder gar eclipse (ok, dann doch lieber nano oder joe) &ouml;ffnen. Das Ergebnis k&ouml;nnte man dann via Pipe wieder in die selbe temp-Datei werfen und schon w&auml;re der Inhalt des Feldes aktualisiert.</p>
<p>Sollte irgendwer da drau&szlig;en ein &auml;hnliches Plugin kennen das dies bereits tut, dann bitte ich um einen Hinweis. Es w&uuml;rde mir in meinem t&auml;glichen Umgang mit dem Web durchaus helfen.</p>
