+++
title = "Bücherregal von Höffner"
date = "2015-05-05T12:05:00"
author = "Dr. Azrael Tod"
tags = ["Dresden", "Rant"]
issoid = "blog/1614"
aliases = "blog/1614"
+++

<p>Das war gerade die d&auml;mlichste Aktion seit <a href="/2008/3/5/Tschechisch-f&uuml;r-Service" title="G33KY: Tschechisch f&uuml;r Service">Pardubice</a>. Wir haben ein Regal bei H&ouml;ffner zusammenstellen lassen und zur Lieferung/Aufbau bestellt. Unf&auml;higkeit auf allen Seiten kulminierte in einem absurden Chaos, wie ich es selbst bei Handwerker-Auftr&auml;gen schon lange nicht mehr gesehen habe.</p>
<p>Es steht jetzt jedenfalls da, aber es hat mich einiges an Nerven gekostet.</p>
<p></p><h3>TL/DR:</h3><br/><ul><li>Regal bestellt</li><li>Lieferzeiten "irgendwann an diesem Tag" (7-13 Uhr)</li><li>Anruf "30min vorher"</li><li>Spediteure stehen trotz penibel genauer Angaben dann anderthalb Stunden nach dem Anruf am falschen Haus</li><li>haben keine Ahnung was sie aufbauen sollen</li><li>sind liederliche Schlampen</li><li>wollen Geld dann unbeding per EC/Bar, obwohl per Rechnung vereinbart</li><li>ich radel 15min von einem Geldautomaten zum n&auml;chsten, weil diese jeweils nur 500&euro; ausspucken und ich gerade keine 1,2K&euro; da habe</li><li>3,5h meiner Zeit verschwendet, ich bin 14:30 wieder auf Arbeit</li></ul><br/><h3>Bilder</h3><br/><ul class="gallery"><br/> <li><a data-big="/images/blog/regal/original/DSC_0161.JPG" href="/images/blog/regal/DSC_0161.JPG" title="Wir haben gleich das ganze Zimmer neu gemacht, also auch gestrichen"><img alt="Streichen des Raumes" src="/images/blog/regal/thumbnails/DSC_0161.JPG"/></a><span class="info">vorher das Zimmer gestrichen <a class="big" href="/images/blog/regal/original/DSC_0161.JPG" title="gro&szlig;e Version">↗</a></span></li><br/> <li><a data-big="/images/blog/regal/original/DSC_0162.JPG" href="/images/blog/regal/DSC_0162.JPG" title="Da Links ist magnetische Farbe, rechts Wandtattoos"><img alt="Wandtattoos" src="/images/blog/regal/thumbnails/DSC_0162.JPG"/></a><span class="info">Die Wand hinterm Regal <a class="big" href="/images/blog/regal/original/DSC_0162.JPG" title="gro&szlig;e Version">↗</a></span></li><br/> <li><a data-big="/images/blog/regal/original/DSC_0194.JPG" href="/images/blog/regal/DSC_0194.JPG" title="Das fertige Regal, noch leer"><img alt="Bild vom Regal 1" src="/images/blog/regal/thumbnails/DSC_0194.JPG"/></a><span class="info">So sieht es leer aus <a class="big" href="/images/blog/regal/original/DSC_0194.JPG" title="gro&szlig;e Version">↗</a></span></li><br/> <li><a data-big="/images/blog/regal/original/DSC_0195.JPG" href="/images/blog/regal/DSC_0195.JPG" title="immernoch leer"><img alt="" src="/images/blog/regal/thumbnails/DSC_0195.JPG"/></a><span class="info">anderer Winkel <a class="big" href="/images/blog/regal/original/DSC_0195.JPG" title="gro&szlig;e Version">↗</a></span></li><br/> <li><a data-big="/images/blog/regal/original/DSC_0196.JPG" href="/images/blog/regal/DSC_0196.JPG" title="ENDLICH wieder Platz im B&uuml;cherregal!"><img alt="Regal mit B&uuml;chern" src="/images/blog/regal/thumbnails/DSC_0196.JPG"/></a><span class="info">mit B&uuml;chern (unsortiert) <a class="big" href="/images/blog/regal/original/DSC_0196.JPG" title="gro&szlig;e Version">↗</a></span></li><br/> <li><a data-big="/images/blog/regal/original/DSC_0193.JPG" href="/images/blog/regal/DSC_0193.JPG" title="Nein, ich habe den Dreck nicht zusammengekehrt, da lag &uuml;berall so viel"><img alt="" src="/images/blog/regal/thumbnails/DSC_0193.JPG"/></a><span class="info">so gut r&auml;umen Spediteure auf <a class="big" href="/images/blog/regal/original/DSC_0193.JPG" title="gro&szlig;e Version">↗</a></span></li><br/></ul>
<p>(Ja, heute wurden mal alle Bilder mit der Hand-Kartoffel geknippst)</p>
<p></p><h3>Die Bestellung</h3><br/>Wir sind also in den Laden gewackelt, haben uns an einen Schreibtisch gesetzt, der netten Frau beschrieben was wir gern h&auml;tten (Regalsystem und Ma&szlig;e waren bereits entschieden) und uns generell erstmal eine Stunde mit ihr unterhalten und genaue Artikelnummern raussuchen lassen.

<p>Dann verabschiedete die Frau uns mit den Worten: </p><blockquote>Ich w&uuml;rde jetzt mal die Preise raussuchen und alles zusammenrechnen, dann kommen Sie in 30min nochmal wieder und wir senden die Bestellung ab</blockquote><br/>Kein Problem!<br/>Also kurz was Essen gegangen, zur&uuml;ck gekommen, nochmal eine halbe Stunde mit der Frau geredet und Bestellung abgegeben.

<p>Dabei noch extra darauf geachtet dass die Frau auch unter Bemerkungen notiert wie man zu unserem Haus kommt, weil wir zwar an der Y-Stra&szlig;e wohnen, man aber &uuml;ber die X-Stra&szlig;e in unseren Innenhof kommt. Denn wir wohnen im Innenhof. Nicht an einer der umgebenden Seiten, Sondern im einzeln stehenden Geb&auml;ude das es <a href="/2012/12/4/Infrastruktur">laut Telekom garnicht gibt</a>.<br/>Daher haben wir auch die Hausnummer "Y-Stra&szlig;e 12B HH" und nicht "Y-Stra&szlig;e 12B" oder "Y-Stra&szlig;e 12" (alles valide Hausnummern eines anderen Geb&auml;udes, im Gegensatz zur nicht-existierenden "Y-Stra&szlig;e 12A" oder "Y-Stra&szlig;e 12C").</p>
<p>Direkt im Laden mussten wir nat&uuml;rlich erstmal nur einen kleinen Betrag Anzahlen, haupts&auml;chliche Bezahlung sollte dann <b>per Rechnung</b> erfolgen. Alles andere w&auml;re auch zu albern.</p>
<p></p><h3>Termin vereinbaren</h3><br/>Nat&uuml;rlich bekommt man dann nicht gleich einen Termin genannt, kann man ja auch verstehen, so ein Speditionsunternehmer will ja auch etwas planen und die passenden Teile im Hauptlager muss ja auch erst jemand aus der Kiste kramen.

<p>Also einen Monat gewartet, und dann konnte man nach mehreren vergeblichen (gegenseitigen) Anrufversuchen auch schon einen "Termin" vereinbaren.</p>
<p>Was unterscheidet einen Termin von einem "Termin"? Der eine ist zeitlich und r&auml;umlich festgelegt.</p>
<p>Weil so Speditionen das mit der Planung aber nicht so genau nehmen, bekommt man dann gesagt dass Termine nur Wochentags m&ouml;glich sind. Nein, Nachmittags oder genaue Terminangaben gehen auch nicht, also haben wir uns mit folgendem zufrieden geben m&uuml;ssen:</p><blockquote>Montag, zwischen 7 und 13 Uhr</blockquote><br/>Untragbar? Nat&uuml;rlich! Aber zum Gl&uuml;ck kann ich recht flexibel Pause machen und die bieten an dass man 30min vorher angerufen wird.

<p>Zum eigentlichen Termin war dann meine Frau gerade im Ausland unterwegs, aber so eine Annahme einer Lieferung werd' ich ja wohl noch alleine schaffen!</p>
<p></p><h3>Die Lieferung</h3><br/>Wenn man einen Termin ab um 7 erh&auml;lt k&ouml;nnte man ja meinen dass man der Erste auf deren Liefer-Tour w&auml;re und die relativ p&uuml;nktlich w&auml;ren. Aber bis ich besagten Anruf erhielt, dauerte es dann doch bis um 11.<br/>11Uhr? Kein Problem!<br/>Also bin ich gem&uuml;tlich nach Hause gewackelt, hab in Ruhe Mittag gegessen, die W&auml;sche zusammengelegt, den Geschirrsp&uuml;ler ausger&auml;umt und etwas Computer gespielt.<br/>12:30 bekam ich dann auch schon den n&auml;chsten Anruf. Ich solle bitte das Tor &ouml;ffnen, sie k&auml;men nicht zum Haus.

<p>Nach einigen Diskusionen und widerspr&uuml;chlichen Angaben welches Tor die denn jetzt meinen w&uuml;rden (da gibt es  im ganzen Hof keins), mal auf Verdacht das Haus verlassen und zur 12B gelaufen. Tatsache, da steht der LKW.<br/>Warum sich auch von den Hinweisen auf dem Lieferschein, oder dem fehlenden Familiennamen am Klingelschild, oder dem Hinweistext am Briefkasten:</p><blockquote>HINWEIS: Hausnummer 12B HH befindet sich GEGEN&Uuml;BER!"</blockquote>verunsichern lassen?

<p>Die Spediteure stehen also anderthalb Stunden nach dem Anruf endlich am falschen Haus.</p>
<p>LKW umgeparkt, T&uuml;ren ge&ouml;ffnet, und los gehts.</p>
<p></p><h3>Der Aufbau</h3><br/><blockquote>Haben sie vlt eine Skizze?</blockquote><br/>Was? Du wei&szlig;t nicht wie du das Regal aufbauen sollst? Nat&uuml;rlich habe ich keine Skizze, ich k&ouml;nnte dir eine zeichnen, aber normalerweise sollte man davon ausgehen dass statt mir auch mal jemand die T&uuml;r &ouml;ffnen k&ouml;nnte der bei der Planung nicht dabei war. Was machst du dann? Raten?<br/><blockquote>Wollen sie die Regalb&ouml;den &uuml;berall gleich verteilt haben?</blockquote><br/>Darauf h&auml;tte ich ja mal einfach mit "Ja" antworten sollen und dann warten bis der die B&ouml;den nachz&auml;hlt und feststellt dass das nicht aufgeht. Gleiches Problem wie gerade eben schon: Wenn ich mich im Laden stundenlang hin setz und ein Regal plane, warum muss ich dann dem Monteur nochmal erkl&auml;ren was ich mir vor 2 Monaten vorgestellt hatte? Kann man da nicht einfach das erstellte Bild was uns die Verk&auml;uferin vorgehalten hat ausdrucken und dem Paket beilegen?

<p>Im Aufbrechen dann noch kurz der Br&uuml;ller:<br/></p><blockquote>Bei diesem letzten Regalboden fehlt so ein Dings [er meint Exzenter]. Da senden wir ihnen noch eine Packung und dann m&uuml;ssen sie das mal selbst befestigen... Oh, sie haben das fehlende Teil gefunden, na dann mach ich das gleich noch</blockquote><br/>Ja, und wenn ihr euren M&uuml;ll (das grobe haben sie ja weg ger&auml;umt, aber halt nur das wor&uuml;ber man gestolpert w&auml;re) nicht einfach zusammen mit Restbauteilen auf meinem Tisch liegen lassen h&auml;ttet, dann h&auml;ttest du das Teil selbst sofort gesehen. Oder halt verfickt nochmal danach Suchen!

<p>Aber sch&ouml;n dass er mir erkl&auml;rt wie man das "Ding" verwendet um einen Regalboden zu montieren.</p>
<p></p><h3>Wir h&auml;tten gerne Geld</h3><br/>Hatte ich erw&auml;hnt dass wir penibel darauf geachtet hatten dass wir per Rechnung zahlen?<br/><blockquote>Zahlen sie per EC-karte oder Bar?</blockquote><br/>Nein, ich habe keine EC-Karte. Meine Frau h&auml;tte eine, aber die befindet sich gerade leider 9 Zeitzonen entfernt.<br/>Barzahlen w&auml;re vlt. eine Option, wenn das nicht <b>ABSURD UNSERI&Ouml;S</b> w&auml;re und ich gerade zuf&auml;llig reichlich 1200&euro; rumliegen h&auml;tte.<br/><blockquote>Ja, dann k&ouml;nnen Sie ja noch Geld holen gehen.</blockquote><br/>Klar kann ich das tun. Auf meinen Kommentar dass das eine bescheuerte Idee ist, ich das aber machen kann wenn die Monteure fertig sind mit aufbauen, reagiert er total verwundert bis unversch&auml;mt.<br/><blockquote>Sowas hab' ich ja noch nie erlebt, dass wir aus der Wohnung geworfen werden!</blockquote><br/>Was zum... Soll ich dir auch noch sagen wo die Wertgegenst&auml;nde sind, bevor ich dich mit deinem Kollegen hier allein lasse? Ach nein, brauche ich ja nicht... ihr habt ja einen gro&szlig;en LKW vorm Haus stehen, ihr k&ouml;nnt ja gleich alles einpacken und sp&auml;ter suchen.

<p>Jedenfalls sehe ich kein ernstes Problem darin das hinterher zu erledigen, muss er halt mal 15min warten. Die nehmen es ja sonst auch nicht so genau mit den Zeitangaben. Das sieht er jedoch anders...<br/></p><blockquote>Sie k&ouml;nnen das doch nicht vergleichen. Nur weil wir sie unn&ouml;tig haben warten lassen bedeutet das nicht dass sie uns jetzt warten lassen! Wir wollen auch irgendwann Feierabend machen! &Uuml;berhaupt, das mit dem 30min vorher ank&uuml;ndigen ist ja nur Service von uns, das muss nicht stimmen.</blockquote><br/>NA GUT DASS ICH KEINEN FEIERABEND BRAUCHE!<br/>Ist ja nur meine Mittagspause die sich hier am Ende auf 3,5h erweitert haben wird. Die Zeit muss ich nat&uuml;rlich nicht irgendwann trotzdem arbeiten.

<p>W&auml;hrend der ganzen Zeit bringt der Typ es nicht ein einziges Mal fertig irgendwie einen Vorschlag zu bringen der ein Problem l&ouml;sen k&ouml;nnte.<br/>Auf die Idee dass ich auch eine &Uuml;berweisung per Internet starten k&ouml;nnte und ihm einen Beleg ausdrucken k&ouml;nnte, kommt er erst als wir das Haus fast verlassen haben. 30min vorher w&auml;re das eine brauchbare Alternative gewesen die mir und ihm Zeit gespart h&auml;tte. Nachdem mein ganzer Elektroschei&szlig; ausgeschalten ist, ich keine Zeit Tan-Listen zu suchen habe und ich bereits in Stra&szlig;enschuhen da stehe, war das ein klein wenig sp&auml;t.<br/>Selbst darauf einfach mal seinen Chef anzurufen und zu fragen was er tun soll kommt er nicht.</p>
<p>Aber hey! Ab gehts zum Geldautomaten!<br/>...der nur 500&euro; ausspuckt.<br/>Also zum n&auml;chsten Geldautomaten.</p>
<p>Hab ich erw&auml;hnt dass die Typen mich auch nicht im LKW mitnehmen k&ouml;nnen und ich die Strecke per Fahrrad zur&uuml;cklege?<br/>Aber hey, 7km n&auml;her an meinem Wochenziel von 100km.</p>
<p>Dazu dass er dann nach dieser Aktion die verbleibenden 12ct Wechselgeld gleich ohne jeglichen Kommentar beh&auml;lt sagt man da schon gar nichts mehr.</p>
