+++
title = "Opa-ma!"
date = "2009-05-25T10:05:00"
author = "Dr. Azrael Tod"
issoid = "blog/1399"
aliases = "blog/1399"
+++

<p>Am 4. und 5. Juni soll ja nun der Amerikanische Obermufti nach Dresden eingewandert kommen und da es daf&uuml;r nat&uuml;rlich viele Vorbereitungen, Sicherheitsma&szlig;nahmen und repressive Ma&szlig;nahmen zu treffen gibt, hat die Stadt Dresden nun eine komplette Webseite zum Besuch angelegt.<br/>Darauf finden sich so tolle Sachen wie der <a href="http://www.dresden.de/obama/de/gut-zu-wissen.php" target="_blank">Standort und die Erreichbarkeit eines Infomobiles</a> oder einer Mitmachecke, in der man Fotos ver&ouml;ffentlichen kann, auf denen zu sehen ist wie toll man sich auf den Besuch des Vertreters der tollsten Nation unseres Planeten, der Quelle der Demokatie und des Lichtbringerlandes der Zivilisation... &auml;h... wo war ich? Achja.. jedenfalls <a href="http://www.dresden.de/obama/de/interaktiv/fotos.php" target="_blank">kann man Bilder ver&ouml;ffentlichen auf denen man zeigt wie man sich freut</a>.<!--more--></p>
<p>Auch wahnsinnig toll finde ich <a href="http://www.dresden.de/obama/de/interaktiv/bastelecke.php" target="_blank">die Bastelecke</a>, in der gezeigt wird wie man mit einem Farbdrucker, Schere und Leim sehr schnell und mit wenig aufwand die tollsten Winkelemente bauen kann und wie man sch&ouml;ne Wimpelketten erstellt. Passende PDF-Vorlagen <a href="http://home.g33ky.de/fact/4384.html" target="_blank">gibt es dort nat&uuml;rlich auch gleich zum Download</a>.<br/>Ich finde auch <a href="http://de.wikipedia.org/wiki/DDR-Sprachgebrauch#W" target="_blank">den Begriff Winkelement sehr sch&ouml;n gew&auml;hlt</a>, da sieht man doch gleich dass sich unser System ganz drastisch gewandelt hat... fr&uuml;her mussten noch alle auf die Stra&szlig;e gehen und organisiert f&uuml;r Leute winken von deren Politik sie eigentlich nichts gehalten haben, heute haben wir die Wahl, daf&uuml;r sind die meisten eh schon zu verbl&ouml;ded um auch nur noch eine Fahne selbst zu wedeln (zumindest wenn man mal von der alkoholischen absieht).<br/>Diese Leute werden aber  zum Gl&uuml;ck durch Mitl&auml;ufer und anderes Gesocks mehr als ausgeglichen.<br/>Versteht mich nicht falsch! Obama ist sicher ein besserer Pr&auml;sident als es viele seiner Vorl&auml;ufer waren und sicher um l&auml;ngen besser als McCain oder gar seine Hockeymom jemals gewesen w&auml;ren. Und nat&uuml;rlich schl&auml;gt er auch seinen direkten Vorg&auml;nger um etliche  L&auml;ngen (Wobei dieser eigentlich wahnsinnig viel f&uuml;r die Gleichberechtigung getan hat. Vor ihm w&auml;ren die Leute nie verzweifelt genug gewesen um dort ernsthaft eine Frau oder gar einen Schwarzen f&uuml;r das Pr&auml;sidentenamt in betracht zu ziehen.)<br/>Jedenfalls bleibt aber auch der beste amerikanische Pr&auml;sident noch immer ein Amerikaner und wird nicht automatisch zum Messias. Obama wird weder die Welt retten, noch wird er die Politik der US of A  endlich in vern&uuml;nftige Richtungen lenken. Weiterhin bleibt halt noch die klitzekleine Tatsache dass es sich um einen AMERIKANISCHEN  Politiker handelt, der mit UNSERER Situation so viel am Hut hat wie das Merkel mit der Bildungspolitik in Hinterindien.<br/>Darum Leute: geht w&auml;hlen! Sucht euch gute Politiker (Muhahahahahaha, der war gut! Sagen wir mal lieber "ertr&auml;gliche &Uuml;bel".) die sich f&uuml;r EUCH zust&auml;ndig f&uuml;hlen und von EURER Wahlstimme abh&auml;ngen.</p>
<p>Aber jetzt bin ich irgendwie abgedriftet... Eigentlich wollte ich noch erw&auml;hnen dass Cindy bereits das erste Flugzeug mit Tarnanstrich und amerikanischen Symbolen am Dresdner Flughafen gesehen hat und dass es eigentlich genial w&auml;re die Vorbeifahrt des POTUS mal mit runtergelassenen, schwarzen Rollos (Ikea, typ: blickdichtes Verdunklungsrollo) zu beobachten und ein schwarzes Metallrohr in die entsprechende Richtung zu halten. Unser Schlafzimmerfenster sollte ja in die richtige Richtung zeigen. :D<br/>Es w&auml;re mal interessant zu warten, wie lange es dauert bis man den sprichw&ouml;rtlichen, roten Punkt (den man ja eigentlich &uuml;berhaupt nicht sieht, auch wenn jeder Film was anderes zeigt) auf der Stirn rumwackeln sieht.</p>
