+++
title = "Tanzstunde Abschlussball"
date = "2009-03-08T03:03:00"
author = "Dr. Azrael Tod"
issoid = "blog/1294"
aliases = "blog/1294"
+++

<p>Irgendwann letztes Jahr habe ich mich von Cindy &uuml;berreden lassen einen Anf&auml;ngerkurs in der Tanzschule mitzumachen, seitdem sind wir jeden Dienstag-Abend quer durch Dresden getingelt und haben uns derartig k&ouml;rperlich bet&auml;tigt.</p>
<p>Am gestrigen Samstag war nun jedenfalls der dazugeh&ouml;rige Abschlussball, f&uuml;r den ich gezwungen wurde Schlips zu tragen... Da es mich mit Schlipps die n&auml;chsten Jahre hoffentlich erstmal nicht mehr zu sehen geben wird, hier eine Dokumentation dieses Jahrhundertereignisses in Bildern.<!--more--><br/></p><table style="width:194px;"><tr><td align="center" style="height:194px;background:url('http://picasaweb.google.dehttp://lh5.ggpht.com/s/v/46.19/img/transparent_album_background.gif') no-repeat left;"><a href="http://picasaweb.google.de/drazraeltod/Abschlussball?feat=embedwebsite"><img height="160" src="http://lh5.ggpht.com/_sREE3IlYns8/SbPQvg3UQbE/AAAAAAAAAks/XNoAq4kWN2Y/s160-c/Abschlussball.jpg" width="160"/></a></td></tr><tr><td style="text-align:center;font-family:arial,sans-serif;font-size:11px;"><a href="http://picasaweb.google.de/drazraeltod/Abschlussball?feat=embedwebsite">Abschlussball</a></td></tr></table>
<p>Da Cindys Eltern leider schon f&uuml;r dieses Wochenende verplant waren, haben wir nur meine Eltern als Begleitung mitgenommen. Trotz Schlips und Anzug war es ein verd&auml;chtig ertr&auml;glicher Abend, nichtmal die Musikauswahl ider permanente Hinweise es w&auml;re sch&ouml;n wenn wir noch einen Fortschrittkurs machen w&uuml;rden (sowohl von diversen Eltern als auch von Cindy) konnten dem einenen wirklichen D&auml;mpfer versetzen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1183" onclick="set_comment_reference(1183)" title="auf diesen Kommentar antworten">#1183</a>:
    08.Mar.2009 10:03
    von
    
      <a href="/blog/author/toranor/">
        toranor
      </a>
</p>
<p>Die Bilder sprechen B&auml;nde.<br/>
Irgendwie f&uuml;hlst du dich im Anzug nicht besonders wohl, oder irre ich mich da ?</p>

<p class="infos">
<a href="#comment_1184" onclick="set_comment_reference(1184)" title="auf diesen Kommentar antworten">#1184</a>:
    09.Mar.2009 06:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Nein, dass ich mich wohl f&uuml;hle w&uuml;rde ich nicht direkt behaupten... Jeans und T-Shirt w&auml;ren mir um l&auml;ngen lieber gewesen, aber irgendwie h&auml;tten die mich so dort wahrscheinlich nicht reingelassen.</p>
<p>Zum Gl&uuml;ck gibts verdammt wenig Gelegenheiten wo ich so aufkreuzen muss. Nichtmal bei irgendeinem Vorstellungsgespr&auml;ch musste ich mich derartig verstellen.</p>

<p class="infos">
<a href="#comment_1185" onclick="set_comment_reference(1185)" title="auf diesen Kommentar antworten">#1185</a>:
    09.Mar.2009 09:03
    von
    
      
        Alex
      
    
    
  </p>
<p>lol, das letzte bild (im album), welches auch oben als thumblink herh&auml;lt, ist ein knaller :-D</p>

<p class="infos">
<a href="#comment_1186" onclick="set_comment_reference(1186)" title="auf diesen Kommentar antworten">#1186</a>:
    09.Mar.2009 05:03
    von
    
      
        Numanoid
      
    
    
  </p>
<p>Welche Tanzschule war das? Die oben in Klotzsche?</p>

<p class="infos">
<a href="#comment_1187" onclick="set_comment_reference(1187)" title="auf diesen Kommentar antworten">#1187</a>:
    09.Mar.2009 07:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Nebl, n&auml;he Bahnhof Mitte</p>

<p class="infos">
<a href="#comment_1188" onclick="set_comment_reference(1188)" title="auf diesen Kommentar antworten">#1188</a>:
    23.Mar.2009 08:03
    von
    
      
        <a href="http://blog.blechkopp.net" target="_blank">
          Torsten
        </a>
</p>
<p>Hach - so klein ist ist Kleinbloggersdorf!</p>
<p>Auch ich war vor Ort - sogar im selben Tanzkurs. Du hattest sogar die Ehre, mit meiner Freundin das Tanzbein zu schwingen. Meine Freundin sagt, du musstest nach der Petronella kurz &uuml;berlegen, wie der Wiener Walzer ging - mach dir nichts draus, ging mir oft nicht anders! ;-)</p>
<p>Torsten</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1189">
<p class="infos">
<a href="#comment_1189" onclick="set_comment_reference(1189)" title="auf diesen Kommentar antworten">#1189</a>:
    23.Mar.2009 09:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>hehe.. das lag eher weniger an der Petronella als vielmehr an der Tatsache dass es mir jedes mal so geht.<br/>
Ich brauch immer erstmal ein paar Sekunden um wieder die entsprechende Schrittfolge abzurufen und der Name des Tanzes hilft mir da auch kein St&uuml;ck. :-)</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1190" onclick="set_comment_reference(1190)" title="auf diesen Kommentar antworten">#1190</a>:
    28.Mar.2009 02:03
    von
    
      
        <a href="http://www.tanzstudio-ritmo.de" target="_blank">
          Tanzschule Regensburg
        </a>
</p>
<p>Das mit dem Unwohlsein ist un&uuml;bersehbar ;)</p>
<p>Allerdings finde ich, dass das Outfit &uuml;berzeugend aussieht und auch die Tanzpartnerin schick gekleidet ist.</p>
<p>Alles in Allem war es doch wohl am Schluss eine runde Sache ;)</p>
</div>