+++
title = "Drosselkom"
date = "2013-04-26T07:04:00"
author = "Dr. Azrael Tod"
tags = ["Politik", "Rant", "Sprache", "Technik"]
issoid = "blog/1574"
aliases = "blog/1574"
+++

<p>So wir alle haben wohl inzwischen geh&ouml;rt da&szlig; die Telekom in Zukunft ihren Kunden nur noch <a href="https://netzpolitik.org/2013/telekom-macht-ernst-tarifwechsel-fuhrt-zur-ende-der-flatrates-und-verletzung-der-netzneutralitat/">DSL-Vertr&auml;ge mit Volumenlimit andrehen will,  bei denen nach nGB Transfer der Anschluss abgeschalteten wird</a> (Nein,  funktional kaputt oder abgeschalteten ist f&uuml;r mich kein gro&szlig;er Unterschied) <br/>Nicht nur das, oben drauf kommt noch dass die hauseigenen Medien-Sachen nicht ins Volumen z&auml;hlen. Ja, <a href="http://blog.refefe.de/?ts=af86c272&amp;css=topaz.css">das kann man nicht im strikten Sinne als Bruch der Netzneutralit&auml;t bezeichnen</a>, aber wisst ihr was? Das ist mir genauso egal wie die Frage <a href="https://soundcloud.com/david1701/funktional-kaputt">ob ein PKW der nur noch 300m/h f&auml;hrt wirklich als defekt z&auml;hlt</a>.</p>
<p>Meiner Meinung nach geht es weder um Netzneutralit&auml;t (w&auml;re sch&ouml;n) , noch um die Frage ob das jetzt als defekt z&auml;hlt (ja) noch um die Frage die Terrorkom eine Monopolstellung missbraucht (ja).<br/>Es geht darum dass die Telekom mit einer "Flatrate" wirbt und die Leute an dieser Stelle aufh&ouml;ren die Vertragsdetails zu lesen. Es geht darum ob ein Vertrag f&uuml;r "unbegrenzte Leistung zu einem festen Preis" mit einem Volumentarif verwechselt wird. Es geht im Endeffekt wie &uuml;berall darum dass Marktwirtschaft in der Theorie funktioniert, aber selbst da auch nur so lange man annimmt dass jeder immer &uuml;ber alle Informationen verf&uuml;gt. </p>
<p>Warum sehe ich niemanden fordern da&szlig; mal jemand "Flatrate" rechtlich sicher festlegt?<br/>Warum erfindet niemand einen Alternativbegriff den man Eltern und co.  statt diesem in die Hand dr&uuml;cken kann? Wir haben Bio-Siegel auf Wurst und Siegel f&uuml;r <a href="http://www.scilogs.de/wblogs/blog/detritus/bio/2011-04-18/bio-mondscheink-se-an-lichtbl-ten-tagen-gek-st">Laktosefreien, bei bestimmten Mondphasen gek&auml;sten K&auml;se</a>, warum zum Henker kann man sowas nicht f&uuml;r funktionierende Festpreismodelle bauen?</p>
<p>Wir brauchen wirklich <b>irgendetwas</b> an dem $Endnutzer erkennen kann dass das was er unter einem Festpreis versteht auch drin ist wenn er eine "Flatrate" kauft.</p>
<p>Was wird stattdessen gefordert? Netzneutralit&auml;t soll Gesetz werden! (wir alle wissen wie gut das funktionieren w&uuml;rde und dann trifft es hier nicht mal zu) Die Telekom soll ihre Entscheidung r&uuml;ckg&auml;ngig machen! (klar,  gleich nachdem sich n&auml;chste Woche der n&auml;chste Aufreger gefunden hat und die anderen Anbieter nachgezogen haben) Das beste bisher: <a href="http://www.christopherlauer.de/2013/04/22/telewahn/">DIE TELEKOM SOLLTE ZERSCHLAGEN WERDEN</a>! ... genau, total realistische Forderung, wird sicher n&auml;chste Woche gleich gemacht.</p>
<p>Nat&uuml;rlich w&auml;re es sch&ouml;n wenn wir irgendeine zust&auml;ndige stelle h&auml;tten, die bemerkt dass die Telekom da gerade versucht Mitbewerber (z.B. Multimedia-Streaming-Dienste wie die Mediatheken der &Ouml;R-Sender) bei Medien-Sachen aus dem Gesch&auml;ft zu dr&auml;ngen und einschreitet. Man k&ouml;nnte z.B. eine Art "Kartellamt" schaffen das sich um sowas k&uuml;mmern k&ouml;nnte. Aber wie gesagt: Das ist hier nicht das Problem wegen dem sich alle aufregen und bei 2 gro&szlig;en Senderfirmen im Fernsehen hat sich ja auch keiner beschwert.</p>
<p>Zum Schluss noch <a href="http://youtu.be/LqIvz7Z1sbw">ein Video zur Auflockerung</a>:<br/></p><p style="text-align: center;"><br/><iframe allowfullscreen="" frameborder="0" height="315" src="http://www.youtube.com/embed/LqIvz7Z1sbw" width="560"></iframe><br/></p>
