+++
title = "Gewinnspiel! SPAM zu gewinnen!"
date = "2009-02-02T11:02:00"
author = "Dr. Azrael Tod"
issoid = "blog/1228"
aliases = "blog/1228"
+++

<p>Also dass Spam jetzt nicht die schlauste aller Werbemethoden ist war mir ja schon eine Weile klar... Diesmal haben diese Spinner aber mal wieder einen Rekord aufgestellt.<!--more--></p>
<p>Irgendwo hatte vor kurzem mal jemand ein Blog ein Netbook verlost, Teilnahmebedingung war nat&uuml;rlich mal wieder ein Blogbeitrag &uuml;ber das Gewinnspiel mit Backlink. Halt Linkbaiting der d&uuml;mmsten Sorte.</p>
<p>Ich habe es mir nicht nehmen lassen dazu auch meinen Kommentar abzugeben und habe heute dann darauf folgend eine E-Mail erhalten:</p>
<p></p><blockquote>Hallo Frank,

<p>ich hatte gesehen, dass Du an einem Netbook-Gewinnspiel teilgenommen hast. Vielleicht interessiert Dich ja auch das hier?</p>
<p>[SPAM-URL]</p>
<p>L&ouml;sungshinweis: "Netbook Test"</p>
<p>Viel Gl&uuml;ck!</p>
<p>Gru&szlig;,<br/><a href="mailto:trutz@trutz.de">Trutz</a></p></blockquote>
<p>&Auml;hm.. ja.. der Link zu meinem Blog steht an einem Kommentar zu diesem Mist und tats&auml;chlich kann man auf meinem Blog eine Mailadresse ala input von g33ky.de finden.<br/>Wenn man schon bewusst und eigenh&auml;ndisch Spam versenden will (danach sieht es zumindest aus), dann k&ouml;nnte man doch wenigstens &uuml;berfliegen was dort gerade steht.</p>
<p>Klingt f&uuml;r irgendwen der folgende Kommentar als w&auml;re ich an solchem Mist interessiert? Eigentlich dachte ich immer dass ich bisher recht deutlich zum Ausdruck gebracht h&auml;tte, was ich von derartigem <a href="http://en.wikipedia.org/wiki/Linkbait#Link_bait" target="_blank">Link-baiting</a> halte.</p>
<p></p><blockquote><br/>Ist es noch &ldquo;interessant&rdquo; wie viele Blogger sich dazu hergeben diese Seite hirnlos zu verlinken nur weil ihnen die vage M&ouml;glichkeit auf einen Gewinn genannt wird oder l&auml;uft das schon eher unter bedenklich?

<p>Ich verstehe ja durchaus wenn man sich f&uuml;r Hardware interessiert und dar&uuml;ber berichten will. Ich verstehe ebenso wenn man Links f&uuml;r Geld oder Sachwerte verkauft. Was ich nicht verstehe sind diese naiven Typen die sobald ein Gewinn in aussicht steht jeden Verstand verlieren. (Wobei ein Netbook vlt. noch etwas ist das auch durch die Anzahl der Teilnehmer geteilt noch einen kleinen Gewinn vorweisen kann, der den Aufwand wert sein k&ouml;nnte aber es gibt ja auch den selben Effekt wenn jemand ein Shirt oder &auml;hnlichen Bl&ouml;dsinn verlost).</p>
<p>Nat&uuml;rlich kann jeder mit seinem Blog oder seiner Website machen was auch immer er will&hellip; aber &uuml;ber alle betrachtet ist es verdammt d&auml;mlich und zeugt noch immer von unzureichender Glaubw&uuml;rdigkeit der Blogs im allgemeinen.<br/></p></blockquote>
<p>Also "Trutz" (oder eher <a href="http://www.google.com/search?hl=de&amp;q=Cornelia+Fries+Klarekoepfe" target="_blank">Cornelia</a>?), wie ich auf deiner Seite sehe (nicht die in deiner E-Mail verlinkte, sondern die Domain unter der du auch deine E-Mailadresse verwendest) hast du irgendwie mit diversen Anw&auml;lten zu tun. Das finde ich klasse! Dann tu doch mal bitte folgendes: Gehe zu deinem Anwalt des Vertrauens und frage ihn wie das rein rechtlich mit Werbemails so steht in Deutschland. Die sind n&auml;mlich schon lange nicht mehr nur grenzwertig.<br/>Wenn gerade doch kein Anwalt greifbar ist, empfehle ich dir wenigstens mal <a href="http://de.wikipedia.org/wiki/Spam#Rechtslage_in_Deutschland" target="_blank">den passenden Wikipedia-Artikel</a> zu lesen, dort steht auch schon einiges interessantes zum Thema.</p>
<p></p><blockquote>Das neue UWG (seit 2004) regelt unmissverst&auml;ndlich die Anspr&uuml;che, die an E-Mail-Werbung gestellt werden, damit sie wettbewerbsrechtlich einwandfrei ist. Dazu geh&ouml;rt insbesondere, dass der Empf&auml;nger in die Zusendung von Werbung per E-Mail vorher eingewilligt hat.</blockquote>
<p>Also "Trutz", ich habe dir weder jemals erlaubt mir Werbemails mit eindeutig wirtschaftlichem Interesse zu senden, noch stehen oder standen wir in irgend einer Art von Gesch&auml;ftsbeziehung von der ich w&uuml;sste. Da dies die erste Mail von dir war, werde ich das erstmal noch durchgehen lassen, bei weiteren muss ich dir leider f&uuml;r die Entsorgung und den sonstigen Aufwand der f&uuml;r mich entsteht (Blacklisting, Arbeitszeitverluste beim Lesen, Recherche f&uuml;r Beschwerden, Sammeln von Informationen &uuml;ber die Rechtslage, ...) meine Unkosten in Rechnung stellen. Derzeit belaufen sich diese auf 4&euro; pro ungew&uuml;nscht zugesendeter E-Mail. Du kannst nat&uuml;rlich jederzeit Einspruch gegen diese Geb&uuml;hren einlegen (Annahme aus technischen Gr&uuml;nden leider nur per Post an die im Impressum genannte Adresse) oder einfach auf die Sendung weiterer Mails verzichten. Solltest du jedoch weitere E-Mail-Nachrichten senden, sehe ich die Bedingungen als akzeptiert an und werde eine Rechnung schreiben. Deine Adresse finde ich schon.. auch wenn du sie ziemlich gut auf deiner Seite versteckt hast... ob das als Impressum &uuml;berhaupt zul&auml;ssig ist (und du brauchst im Gegensatz zu mir eins, da du gewerbliche Absichten hegst) will ich hier lieber garnicht erst er&ouml;rtern.</p>
<p>Diese Bedingungen gelten &uuml;brirgens auch f&uuml;r alle anderen. Privat darf mir gerne jeder so viele Nachrichten schicken wie er will und ich freue mich immer &uuml;ber Hinweise oder Themenvorschl&auml;ge. Gewerbliche Absichten jedoch, vor allem Personen die mich offensichtlich f&uuml;r bl&ouml;d halten und dies oberfl&auml;chlich zu verstecken versuchen, verbitte ich mir.</p>
