+++
title = "Hausdurchsuchung bei Wikileaks"
date = "2009-03-25T08:03:00"
author = "Dr. Azrael Tod"
issoid = "blog/1344"
aliases = "blog/1344"
+++

<p>Also Hand hoch da drau&szlig;en! Wer hats kommen sehen? Alle?<br/>Gestern wurden beim Besitzer der Wikileaks.de-Domain erstmal gepflegt die Wohnungen   durchsucht, Begr&uuml;ndung war nat&uuml;rlich die Verbreitung von Kinderpornographie &uuml;ber Wikileaks.<!--more--><br/>Zitat <a href="http://wikileaks.org/wiki/Hausdurchsuchung_bei_WikiLeaks.de_Domaininhaber" target="_blank">Wikileaks</a>:<br/></p><blockquote>Um kurz nach 21 Uhr wurden am heutigen Montag den 24. Maerz 2009 die Wohnorte von Theodor Reppe, dem Domaininhabers von Wikileaks.de durch die saechsische Polizei, vertreten durch sieben Polizeibeamte in Dresden und vier Beamte in Zivil in Jena, durchsucht. Grund fuer die Durchsuchung sind laut Protokoll die "Verbreitung pornographischer Schriften" und das "Auffinden von Beweismitteln" in diesem Zusammenhang. Die Durchsuchung erfolgte aufgrund seines Status als Domaininhaber der Wikileaks.de Domain. </blockquote><br/>Dresden und Jena? Da soll nochmal einer sagen dass unterdr&uuml;ckende Regime immer weit entfernt sind.. wir sitzen offensichtlich selbst in einem. (Vor einem Jahr h&auml;tte ich den Satz vlt. noch durch "bald" abgemildert aber in letzter Zeit wirds ja immer schlimmer...)

<p>Nat&uuml;rlich muss die Polizei diese b&ouml;sen "St&ouml;rer" (Anmerkung, ein St&ouml;rer ist ein potentieller Gef&auml;hrder, ein Gef&auml;hrder ist ein potentieller T&auml;ter -&gt; "DU bist St&ouml;rer") hochgehen lassen.<br/>Wikileaks hat ja auch eindeutig Kinderpornographie verbreitet... immerhin wurden hier die Listen ver&ouml;ffentlicht was in anderen L&auml;ndern so gefiltert wird. Sprich: Die Polizei versucht jetzt offenbar endlich die unabh&auml;ngige Berichterstattung &uuml;ber dieses leidige Thema zu unterdr&uuml;cken. Wird ja auch Zeit!<br/>Wo kommen wir da hin wenn hier jeder Beweise f&uuml;r irgendwas auf seiner Webseite ver&ouml;ffentlichen kann? Das geht nat&uuml;rlich nur mit Genehmigung durch die Obrigkeit. Da h&auml;tte Wikileaks doch mal lieber bei Frau von der Leyen angerufen und gefragt was andere L&auml;nder so sperren und dass das unver&auml;ndert &uuml;bernommen, dann w&auml;re das nicht passiert.</p>
<p>Wirklich interessant ist eigentlich nur dass es unsere Pozilei nichtmal schafft etwas schon von Grund auf so peinliches wie eine derartige Hausdurchsuchung sinnvoll &uuml;ber die B&uuml;hne zu bringen. Das geht ja schon bei der Zielauswahl los:<br/></p><blockquote>Herr Reppe ist der Spender der Wikileaks.de Domain und betreibt einen Mirror der US Congressional Research Service Dokumentensammlung, ist allerdings ansonsten nicht operativ in Wikileaks involviert. Herr Reppe ist ausserdem Betreiber eines der populaersten deutschen Tor-Proxyservers (morphium.info), allerdings wurde nur seine Verbindung zu Wikileaks bei der Durchsuchung erwaehnt. </blockquote><br/>Mensch Leute! So geht das doch nicht, so bekommt ihr eure Kritiker doch nie mundtot, wenn ihr so ineffektiv die falschen Leute erwischt. Ihr m&uuml;sst das Serverzentrum aufsp&uuml;ren und die Server konfiszieren, dann kann auch Wikileaks erstmal selber nicht mehr im Internet herausposaunen dass jemand Durchsuchungen durchf&uuml;hrt.

<p>Sp&auml;testens jedoch bei der Abwicklung wirds endg&uuml;ltig zweifelhaft:<br/></p><blockquote>Einige Details der Durchsuchung werfen Fragen auf:<br/><ul><li>Wikileaks wurde nicht kontaktiert, obwohl zwei Journalisten anerkannte Mitglieder des Deutschen Presse Verbandes (DPV) sind.</li><br/><li>Die Zeit von mindestens 11 Polizeibeamten wurde verschwendet um eine sinnlose Hausdurchsuchung bei einem freiwilligen Helfer einer Medienorganisation vorzunehmen.</li><br/><li>Die Polizei fragte nach Passwoertern zur Wikileaks.de Domain, und forderte die Abschaltung der Domain.</li><br/><li>Herr Reppe wurde nicht zu seinen Rechten belehrt, wie dem Protokoll zu entnehmen ist.</li><br/><li>Entgegen der Feststellung im Protokoll, hat Herr Reppe nicht auf einen Zeugen verzichtet und es wurde auch kein Polizeibeamter als Zeuge nominiert.</li></ul><br/>Schlussendlich hat Herr Reppe sich verweigert das Protokoll der Polizei aufgrund dieser und anderer Maengel zu unterschrieben.<br/></blockquote><br/>Wobei: Wenn man schon ohne Sinn und Verstand alles Abschaffen will was einen Rechtsstaat ausmacht, dann muss man nat&uuml;rlich auch solche Kinkerlitzschen nicht weiter beachten... ist ja nur konsequent.

<p>(via <a href="http://www.elementarteile.de/?p=2260" target="_blank">Elementarteile</a>)</p>
<p>[Update]<br/>Es <a href="http://blog.koehntopp.de/archives/2405-Konsequent-II.html" target="_blank">gibt</a> <a href="http://blog.windfluechter.net/index.php?/archives/377-Hausdurchsuchung-bei-Wikileaks-Domaininhaber.html" target="_blank">weitere</a> <a href="http://blog.fefe.de/?ts=b737a0f5" target="_blank">Berichte</a> <a href="http://twitter.com/wikileaks/status/1384169898" target="_blank">dar&uuml;ber</a>.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1213" onclick="set_comment_reference(1213)" title="auf diesen Kommentar antworten">#1213</a>:
    25.Mar.2009 11:03
    von
    
      
        <a href="http://www.blogpiloten.de/2009/03/25/lesetipps-fr-den-25-mrz-2/" target="_blank">
          &amp;raquo; Causa Wikileaks - Die Blogpiloten Leseliste, Blogpiloten.de - das Beste aus Blogs, Videos, Musik und Web 2.0
        </a>
</p>
<p>[...] G33KY^2: Hausdurchsuchung bei Wikileaks: &ldquo;Dresden und Jena? Da soll nochmal einer sagen dass unterdr&uuml;ckende Regime immer weit entfernt sind.. wir sitzen offensichtlich selbst in einem.&rdquo; [...]</p>

<p class="infos">
<a href="#comment_1214" onclick="set_comment_reference(1214)" title="auf diesen Kommentar antworten">#1214</a>:
    25.Mar.2009 08:03
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>danke f&uuml;r die kleine zusammenfassung (die irgendwie wirklich den Vergleich mit China und Co nahelegt) - w&auml;re sonst komplett an mir vorbeigeschrammt.</p>
<p>Gruss<br/>
fidel</p>

<p class="infos">
<a href="#comment_1215" onclick="set_comment_reference(1215)" title="auf diesen Kommentar antworten">#1215</a>:
    26.Mar.2009 09:03
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p><em>kopfsch&uuml;ttel</em></p>
<p>ich glaube, ich muss weiter im Keller an meiner Wasserstoffbombe basteln gehen -.-</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1216">
<p class="infos">
<a href="#comment_1216" onclick="set_comment_reference(1216)" title="auf diesen Kommentar antworten">#1216</a>:
    26.Mar.2009 12:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Mich h&auml;llt die schlechte Verf&uuml;gbarkeit der Rohstoffe bisher von diesem Weg ab... vielversprechender scheint mir bisher die M&ouml;glichkeit Biologischer Waffen oder richtig starken EMP-Anschl&auml;gen in Gegenden mit einer hohen Dichte an Banken.</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1217" onclick="set_comment_reference(1217)" title="auf diesen Kommentar antworten">#1217</a>:
    26.Mar.2009 04:03
    von
    
      
        <a href="http://macfidelity.de/2009/03/25/politik-kinderpornographie-sperrlisten-netzfilter-und-ahnliche-krankhafte-auswuchse/" target="_blank">
          Politik | Kinderpornographie, Sperrlisten, Netzfilter und &auml;hnliche krankhafte Ausw&uuml;chse | macfidelity
        </a>
</p>
<p>[...] Geeky - Hausdurchsuchung bei Wikileaks    Share it [...]</p>
</div>