+++
title = "Syncthing"
date = "2015-11-16T11:11:00"
author = "Dr. Azrael Tod"
tags = ["\"Freie\" Software", "Android", "G33KY.de", "Open Source", "Softwareschrott", "Technik"]
issoid = "blog/1629"
aliases = "blog/1629"
+++

<p>Seit Juni verwende ich kein <a href="https://www.seafile-server.org/">Seafile</a> mehr um meine Daten zu synchronisieren. Stattdessen bin ich auf <a href="http://syncthing.net">Syncthing</a> umgestiegen.</p>
<p>Warum? Hauptgrund Nr. 1 ist dass der <a href="https://github.com/haiwen/seadroid">Seafile-Client f&uuml;r Android</a> einfach nur abartig untauglicher Schrott ist. Angefangen dabei dass Dateien nur heruntergeladen werden wenn man sie &ouml;ffnet, Synchronisierung dieser Dateien dann auch manuell zu triggern ist (vergessen vor dem &Ouml;ffnen zu aktualisieren? pech gehabt!) &uuml;ber die Dateizuordnung die komplett kaputt ist (seadroid will selbst verwalten welche Datei mit welchem Intent ge&ouml;ffnet wird statt Android die Wahl zu &uuml;berlassen) bis dahin dass Updates bei FDroid eher Gl&uuml;ckssache sind als etwas mit dem man fest rechnen kann.</p>
<p>Also Seafile. Das hat auch gleich den Vorteil dass es eine deutlich dezentralisiertere Infrastruktur mitbringt. Jede Node synchronisiert sich mit jeder anderen Node (wenn beide die gleichen Freigaben besitzen) und abgesehen von einem "Verteilerger&auml;t"-Bit das entscheidet ob man bekannte Nodes von einer anderen automatisch &uuml;bernimmt, gibt es keinen wirklichen Server.</p>
<p>BTW: niemals mehrere Verteilerger&auml;te verwenden, noch weniger welche die sich gegenseitig als solche betrachten! (sonst wird es unm&ouml;glich Nodes zu l&ouml;schen)</p>
<p>Gesteuert werden Nodes haupts&auml;chlich &uuml;ber eine Config-Datei oder das mitgelieferte Webinterface. Alles l&auml;uft recht angenehm minimalistisch ab. Syncthing k&uuml;mmert sich einzig darum dass Dateien synchronisiert werden. Wo Seafile noch versucht ein Web-Frontend oder WebDAV-Server anzubieten, Nachrichten zwischen Nutzern auszutauschen oder Markdown zu einem Wiki zu parsen tut Syncthing... nichts.</p>
<p><a href="/static/images/blog/syncthing.png" title="ziemlich alles was man bei Syncthing an Interface hat/braucht"><img alt="Synthing-Web-Interface" src="/static/images/blog/syncthing.png" style="max-width: 600px"/></a></p>
<p>Du brauchst mehr Funktionalit&auml;t? Kein Problem! Nutze ein Tool das diese Funktionalit&auml;t bietet und werf' es auf das synchronisierte Verzeichnis!</p>
<p>Vorteile:</p><ul><li>Daten werden direkt <u>nur</u> im Dateisystem abgelegt, keine kryptischen Block-Daten mit denen man auf Serverseite nicht ohne weiteres Arbeiten kann (weshalb ich bei Seafile vieles an Daten auf meinem Server doppelt vorhalten und per seaf-cli mit dem Server selbst synchronisieren musste)</li><li>der Android-Client ist einfach nur der Desktop-Client mit einer zus&auml;tzlichen GUI die die API des Web-Frontends parst, wenn die GUI irgendwas nicht kann, kann man noch immer jenes verwenden. Es existieren keinerlei funktionale Einschr&auml;nkungen</li><li>Client (und Server nat&uuml;rlich erst recht) ben&ouml;tigt weit weniger Ressourcen</li><li>Syncthing bietet &auml;hnlich viele Optionen selbst eine Versionierung vorzunehmen. Das aber halt auf jedem Client getrennt (z.B. kann ich 1 Jahr lang jede Datei&auml;nderung auf meinem Server aufheben lassen und auf meinem Telefon nur die letzte Version) UND eine Option um externe Tools anzubinden (Git any1?)</li><li>man kann sich relativ einfach eine portable-Version von Syncthing basteln und auf einen USB-Stick werfen</li></ul><br/>Nachteile:<ul><li>Syncthing kennt keine Benutzer, daher auch keine Verwaltung von Zugriffsrechten oder Sharing zwischen Nutzern - jede Freigabe ist entweder f&uuml;r jeden Host schreibbar oder man definiert auf einem Host dass er <b>keinerlei</b> &Auml;nderungen von au&szlig;en annimmt</li><li>Syncthing ist definitiv nicht DAU-tauglich (ein DAU wird auch keinen Seafile-Server aufsetzen wollen, verwenden w&auml;re da hingegen m&ouml;glich)</li></ul>
<p></p><h3>Aber $Zusatzfunktion?</h3>
<p>Wie bereits geschrieben k&uuml;mmert sich Syncthing nur um seine einzige Aufgabe und macht diese gut.</p>
<p>Das bedeutet dass vieles an Funktionalit&auml;t die Seafile mitbringt nicht vorhanden ist. Das ist gut so! Seafiles viele Funktionen bieten immer jeweils M&ouml;glichkeiten etwas grunds&auml;tzlich zu versuchen um dann wieder qualvoll an den Einschr&auml;nkungen zu scheitern.</p>
<p>Dateifreigaben public al&aacute; Dropbox-Link sind ohne Zusatztools nicht m&ouml;glich (oder gar zeitlich ablaufende Links und Aufrufstatistiken f&uuml;r jene), da kein zentraler Server definiert. Also einfach NGinx o.&auml;. auf eine "public"-Freigabe werfen und das Problem ist gekl&auml;rt. Gr&ouml;&szlig;ere Verzeichnisse in Seafile will man eh niemandem freigeben, da die M&ouml;glichkeit zum Download als Zip ab einer gewissen Gr&ouml;&szlig;e einfach deaktiviert ist und man keinesfalls h&auml;ndisch Links aus dem HTML-Code rausfrickeln will. (Ich hatte mal versucht per wget 5K Dateien von einem Seafile-Share runterzuladen, sollte man gar nicht erst versuchen...)</p>
<p>WebDav-Anbindung von Seafile war ebenfalls eine existierende Funktion. Ich habe sie vlt. 2-3x verwendet (daf&uuml;r gef&uuml;hlt einen halben Tag an Einstellungen rumgefrickelt), ansonsten war das f&uuml;r mich toter Code von dem ich nie etwas hatte. Versuche dar&uuml;ber meine Fritzbox anzubinden sind grandios gescheitert, ansonsten w&auml;re das eine M&ouml;glichkeit gewesen ohne spezielle Client-Software zu arbeiten.</p>
<p>Ein eingebundenes Markdown-Wiki existierte in Seafile ebenfalls. Jenes konnte man nat&uuml;rlich auch nur per Web-Frontend nutzen, Links auf Unterverzeichnisse funktionierten gar nicht, ganz zu schweigen davon ein Wiki f&uuml;r nicht-angemeldete Nutzer sinnvoll lesbar zu machen. Bei Syncthing werfe ich im Zweifelsfall einfach <a href="http://gohugo.io/&gt;Hugo&lt;/a&gt; oder &lt;a href=" https:="">etwas</a> <a href="https://www.staticgen.com/">vergleichbares</a> 'drauf, kann Layout/Funktionalit&auml;t frei w&auml;hlen und habe meine Ruhe.</p>
<p></p><h3>Also alles Sonnenschein?</h3>
<p>Nein. Wie bereits geschrieben w&uuml;rde ich Syncthing nicht gerade technisch unbedarfteren Leuten in die Hand dr&uuml;cken. Meiner Frau habe ich einen Client aufs Telefon gepackt und da das Familien-Wiki hin synchronisiert, aber da muss sie sich mit der Software selbst halt auch &uuml;berhaupt nicht mehr besch&auml;ftigen. Sie hat einen Ordner der aktuell gehalten wird und brauch in dem nur mit einem Texteditor arbeiten.</p>
<p>Ich habe aber auch meinen Verwandten (z.B. Eltern) Accounts auf meinem Seafile-System gegeben gehabt, wenn die dies' ernsthafter verwendet h&auml;tten, w&auml;re Syncthing schlicht keine Alternative gewesen.</p>
<p>Und dann war da noch das Problem mit den Versionsspr&uuml;ngen...</p>
<p></p><h3>Versionsspr&uuml;nge?</h3>
<p>Syncthing befindet sich noch in der Entwicklung. Bis zum Erreichen der Version 1.0 werden Versionsspr&uuml;nge wie 0.11 zu 0.12 zu einander inkompatibel sein (danach nur noch Spr&uuml;nge wie 1.0 zu 2.0). Das ist auch <a href="http://docs.syncthing.net/dev/release-schedule.html">dokumentiert</a>, man muss es nur halt auch lesen.</p>
<p>Ich habe das nicht getan.</p>
<p>Als also mein Client auf der einen OSX-Arbeitskiste meldete "Es gibt ein Update auf 0.12.0" hab ich mich gefreut und auf Installieren geklickt. Danach habe ich gemerkt dass irgendein Depp die OSX-Sachen so eingestellt hat dass sie per Default den Beta-Kanal aktualisieren und ich damit eine inkompatible Version installiert habe die sich mit all' meinen anderen Kisten nicht versteht.</p>
<p>Das war nervig, aber die OSX-Kiste ist nicht sonderlich wichtig. Ich war dann doch froh als 0.12 offiziell released wurde und meine anderen Kisten fast alle zueinander kompatibel aktualisiert werden konnten. Und wieder habe ich vorher nicht genug nachgedacht und nicht bemerkt dass der Android-Client eben noch nicht aktualisiert wurde. Das wurde er dann auch f&uuml;r fast 2 Wochen nicht, was f&uuml;r mich <u>sehr</u> nervige Auswirkungen hatte.</p>
<p>Sprich: Bei ernsten Syncthing-Versionsspr&uuml;ngen immer <b><i><u>PR&Uuml;FEN OB MAN WIRKLICH ALLE CLIENTS AKTUALISIEREN KANN</u></i></b>, sonst zerschie&szlig;t man sich selbst seine Synchronisation.</p>
