+++
title = "CSS und Symfony input_date_tag"
date = "2008-10-10T05:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/914"
aliases = "blog/914"
+++

<p>Das PHP-Framework <a href="http://www.symfony-project.org" target="_blank">Symfony</a> bietet zum einbinden aller m&ouml;glicher XHTML-Eingabefelder <a href="www.symfony-project.org/book/1_0/07-Inside-the-View-Layer" target="_blank">Helper</a> an, nat&uuml;rlich auch f&uuml;r die eingabe eines Termines. Daf&uuml;r gibt es unter Helper eine Funktion <code><br/>function input_date_tag($name, $value = null, $options = array())<br/></code><br/>Diese Funktion nimmt unter $options wie es f&uuml;r Symfony &uuml;blich ist die verschiedensten Parameter an, der wichtigste ist wohl 'rich' welcher, auf true gesetzt, eine zus&auml;tzliche Schaltfl&auml;che einbindet &uuml;ber die sich per Javascript eine Kalenderbox zur Datumsauswahl &ouml;ffnet. Dies kann durchaus n&uuml;tzlich sein, vor allem da man das Aussehen des Kalenders &uuml;ber CSS-Themes recht leicht anpassen kann.<!--more--><br/>Alles was dazu n&ouml;tig ist, ist ein weiterer Parameter:<br/><code><br/>'css'=&gt;'skins/aqua/theme'<br/></code><br/>skins/aqua/theme bezeichnet hier den Pfad zur CSS-Datei, die f&uuml;r dies zust&auml;ndig ist, relativ zu den Javascript-Daten des Helpers. Toll nicht?</p>
<p>Moment? Relativ zum Helper? Ja, richtig gelesen! Man kann nur relativ zum Helper einen Pfad angeben, die Skin-Daten liegen also erstmal standardm&auml;&szlig;ig irgendwo zwischen Symfony-spezifischen Daten.</p>
<p>Jetzt werden sicher viele sage dies sei ja nicht schlimm, man w&uuml;rde ja nur einmal an dieser Datei arbeiten und wenn es doch ernster wird, k&ouml;nne man ja die entsprechende Symfony-Funktion leicht &auml;ndern, es ist ja OpenSource. Das eigentliche Problem an der Sache tritt eigentlich erst dann auf, wenn man ein Symfony-Update durchf&uuml;hrt oder schlimmer noch Symfony per externals ins SVN des betroffenen Projektes eingebunden hat und auf dieser Basis ein Update durchf&uuml;hrt. Auch wenn man das Projekt ohne Symfony weitergeben will (man muss ja nicht immer unbegrenzt Speicher und Bandbreite haben) kommt man bei dieser Grundlage ins Gr&uuml;beln</p>
<p>Sicherlich kann man das Ganze etwas umgehen. Man k&ouml;nnte z.B. eine invalide URL f&uuml;r ein Stylesheet angeben (keine geht ja nicht, dann wird wieder auf Aqua geschalten) und die Styles gesondert einbinden. Solche L&ouml;sungen funktionieren, sch&ouml;n sind sie jedoch nicht.</p>
<p>Viel besser w&auml;re es gewesen, h&auml;tten die Autoren des Symfony-Frameworks sich hier an ihre eigenen Regeln gehalten und die gleichen URL-Erzeugungsfunktionen verwendet wie &uuml;berall sonst. Dann k&ouml;nnte man einfach eine Url vom Basisverzeichnis aus angeben und alles w&auml;re gut. ...haben sie nur leider nicht</p>
