+++
title = "Kinder an die Macht"
date = "2014-02-03T12:02:00"
author = "Dr. Azrael Tod"
tags = ["Genderquatsch", "Politik", "Rant", "Sprache"]
issoid = "blog/1583"
aliases = "blog/1583"
+++

<p>Erinnert sich noch jemand daran dass die Sozen diejenigen waren die uns den Sozialstaat letztens fast bis auf Null gek&uuml;rzt haben? Das ist nat&uuml;rlich kein Zufall.<br/>Man nimmt f&uuml;r solche Aufgaben, die evtl. Widerspruch hervorrufen k&ouml;nnten halt immer genau die denen man laut Vorurteil erstmal die gegenteilige Position zuordnet.</p>
<p>So wie auch nur die Sozen die Sozialausgaben auf null k&uuml;rzen k&ouml;nnen ohne dass die Opposition explodiert, sind auch Frauen ideal um Milit&auml;reins&auml;tze zu fordern.<br/>In diesem Sinne finde ich folgendes Bild der aktuellen Kriegsminister von Norwegen, Schweden, den Niederlanden und Deutschland recht aussagekr&auml;ftig.:</p>
<p></p><blockquote class="twitter-tweet" lang="en"><p><a href="https://twitter.com/search?q=%23MSC50&amp;src=hash">#MSC50</a> "onderonsje" MinDefs resp <a href="https://twitter.com/search?q=%23Norway&amp;src=hash">#Norway</a> <a href="https://twitter.com/search?q=%23Sweden&amp;src=hash">#Sweden</a> <a href="https://twitter.com/search?q=%23Netherlands&amp;src=hash">#Netherlands</a> <a href="https://twitter.com/search?q=%23Germany&amp;src=hash">#Germany</a> <a href="http://t.co/fNFV0Z61fM">pic.twitter.com/fNFV0Z61fM</a></p>&mdash; Jeanine Hennis (@JeanineHennis) <a href="https://twitter.com/JeanineHennis/statuses/429630898532016128">February 1, 2014</a><img alt="4 Kriegsministerinnen" src="/static/images/blog/kriegsministerinnen.jpg"/></blockquote>
<p>In diesem Sinne prophezeie ich jetzt mal dass wir in den n&auml;chsten Jahren noch st&auml;rker &uuml;berall einfallen als bisher schon.</p>
<p>Aber das ist ja jetzt eigentlich eh schon &uuml;berholt, da <a href="http://spiegel.de/politik/deutschland/s-a-950489.html" target="_blank" title="Vorsicht SPON-Link!">Zensursula ja bereits gefordert hat dass wir unsere Ressourcen st&auml;rker beim Neger im Land vorw&auml;rts-verteidigen</a>. </p>
<p></p><blockquote>Was Bundespr&auml;sident Joachim Gauck noch in Frageform verpackte, bringt von der Leyen auf griffige Formeln. Wie als Beleg z&auml;hlt die Ministerin auf, dass sich Deutschland ja schon lange in Afghanistan engagiert. Ab diesem Fr&uuml;hsommer nun will sie ein paar zus&auml;tzliche Ausbilder und Flugzeuge nach Afrika schicken. Von der Leyen aber geht noch weiter und gibt eine Maxime f&uuml;r ganz neue Missionen vor. So gebe es eine Verpflichtung Deutschlands, einen "Beitrag zu einer schrittweisen L&ouml;sung der aktuellen Krisen und Konflikte zu erbringen".<br/></blockquote>
<p>Mit so einer Aussage kann man sich prima festlegen. Das ist jetzt vlt. nur eine Sau wert die man durchs Dorf treibt (und wen interessiert das jetzt gerade schon? Gew&auml;hlt wurde man ja gerade) aber in 1-2 Monaten ist das sp&auml;testens vergessen.<br/>Sch&ouml;n wird es aber wenn dann mal wieder der "unvorhersehbare Ernstfall" eintritt. Da kommen dann die NATO-Partner und erinnern uns an die Aussage.<br/></p><blockquote>Gleichg&uuml;ltigkeit ist keine Option</blockquote>
<p>Oh&hellip; Na dann m&uuml;ssen wir den Amerikanischen Br&uuml;dern halt wohl leider folgen&hellip; so schade!</p>
<p>Aber die p&ouml;sen Kindersch&auml;nder-Terroristen m&uuml;ssen ja auch wirklich mal von unseren Ressourcen verscheucht werden!</p>
