+++
title = "Arbeitszeiten und Freelancer in IT"
date = "2008-09-25T09:09:00"
author = "Dr. Azrael Tod"
issoid = "blog/793"
aliases = "blog/793"
+++

<p>Erstmal grunds&auml;tzlich eine Feststellung: in diesem Post geht es nicht um die Einnahmen eines Freelancers im Vergleich zu einem normal angestellten. Ein Freelancer wird im Durchschnitt immer weniger verdienen als gleichwertige Angestellte, auch wenn er zuerst einen h&ouml;heren Stundenlohn nennt. Da er aber s&auml;mtliche Verwaltungskosten, Arbeitnehmeranteile, Sozialleistungen, Urlaubsausf&auml;lle, Unkosten f&uuml;r Ausstattung und was da auch alles sonst noch so anf&auml;llt selbst tragen muss, ist dies auch begr&uuml;ndet.<br/>Das soll jetzt nicht bedeuten dass es keinen Freelancer gibt, der bekommt was er bekommen sollte. Es bedeutet viel eher dass Personen mit viel &Uuml;berschuss dann dazu tendieren eher irgendwann unter "Mittelst&auml;ndiges Unternehmen" oder so zu z&auml;hlen. In diesem Post geht es eher um einen Vergleich welche Arbeitsweise und Arbeitszeitaufteilung welche Folgen hat. Anschlie&szlig;end werde ich kurz &Uuml;berlegungen anstellen wie man das Optimieren k&ouml;nnte.<!--more--><br/>Wenn man die Arbeitszeiten betrachtet ist bei einem Freelancer (oder was das betrifft auch andere Personen die @home arbeiten) aber oft die Verlockung gr&ouml;&szlig;er sich doch mal 15min. mit etwas anderem zu besch&auml;ftigen. Dies bedeutet durchaus dass ein Freelancer pro Tag m&ouml;glicherweise ein paar Minuten weniger an einem Projekt arbeitet als ein Vergleichbarer Angestellter (die gesamte Arbeitszeit am Tag wird hingegen oft l&auml;nger sein als die viel zitierten 8h, man will ja auch den Arbeitgeber nicht betr&uuml;gen und sorgt sich um seinen Ruf). Doch was tut er in dieser Zeit? Wenn ich von mir selbst ausgehe, liegt die Vermutung nahe dass man mal kurz "spielt", sprich eine Technik mit der man gerade zu tun hat auch etwas weiterf&uuml;hrender ausprobiert als dies f&uuml;r das Projekt n&ouml;tig ist.<br/>Er kann das ja auch, wie er sich seine Arbeitszeiten organisiert ist schlie&szlig;lich nur seine Sache. Au&szlig;erdem sieht er ja selbst dass er&nbsp; sich weiterbilden muss um konkurrenzf&auml;hig zu bleiben.</p>
<p>Als Angestellter jedoch zeigt sich oft (wenn auch heutzutage nicht mehr so extrem) eine gr&ouml;&szlig;ere Sicherheit was den eigenen Arbeitsplatz betrifft. Dies ist sicher nicht nur negativ, in unserer Gesellschaft gibt es sicher genug Stress, wir sollten ihn nicht noch k&uuml;nstlich erzeugen. F&uuml;r den Arbeitnehmer bedeutet dies aber auch dass er Morgens zur Arbeit wackelt, dort 8,5h oder mehr (inkl. Pause) angestrengt arbeitet, dann v&ouml;llig fertig nach hause geht und an diesem Tag eigentlich nichts mehr wird. Man will ja auch nicht noch in der Freizeit permanent am PC sitzen.<br/>Zum Basteln und Ausprobieren kommt der Angestellte in seiner Freizeit daher eigentlich erheblich seltener. Wann sollte er auch? Es bleibt ja h&ouml;chstens das Wochenende. Ich brauche wohl auch nicht zu erw&auml;hnen wie wichtig dieses Ausprobieren &uuml;ber die Jahre gesehen f&uuml;r das K&ouml;nnen eines Coders oder &auml;hnlich veranlagter Berufe sein kann. Das grunds&auml;tzliche Interesse f&uuml;r die Interna ist es doch das uns in Schaaren dazu treibt uns Dinge anzueignen von denen keiner glaubt das sie je n&uuml;tzlich w&auml;ren, was sie aber oft dann doch irgendwann sind.</p>
<p>Grunds&auml;tzlich finde ich 8h Arbeitszeit bei einer 40h-Woche einfach nur schlecht. Meiner Meinung nach w&auml;re es erheblich besser die Arbeitszeit auf 10h pro Tag zu erh&ouml;hen und somit das Wochenende auf 3 Tage zu verl&auml;ngern. Ob ich als Angestellter jetzt von 9-5 im B&uuml;ro sitze oder von 8-6 st&ouml;rt mich eigentlich nicht wirklich. Nach einem kompletten Arbeitstag wird eh nicht mehr viel. Ich bereite mir etwas essbares zu, r&auml;ume vlt. noch die Wohnung auf und versuche mich den Rest des Abends zu entspannen. (Unterhaltungen mit der "besseren H&auml;lfte", B&uuml;cher, Filme, bei vielen reicht die Verzweiflung sogar noch f&uuml;r Fernsehen)<br/>W&uuml;rde ich 2 Stunden l&auml;nger arbeiten, w&uuml;rde sich evtl. die Entspannungszeit reduzieren, wirklich st&ouml;ren w&uuml;rde das wohl aber erstmal die wenigsten. Als Ausgleich hat man dann einen dritten Tag f&uuml;rs Wochenende gewonnen, der nicht nur frei gelegt werden kann und so Amtsbesuche, l&auml;ngeren Einkauf oder andere Projekte erm&ouml;glicht, die sonst einfach nur zu lange dauern.<br/>Wenn man wieder mehr zusammenh&auml;ngende Freizeit hat, erm&ouml;glicht dies es evtl. sogar wieder anzufangen mit dem PC zu spielen.. man sa&szlig; ja nur 4 Tage am PC und hat noch fast die halbe Woche vor sich.</p>
<p>Leider sehe ich bei meiner eigenen besseren H&auml;lfte dass dies in der deutschen Realit&auml;t nicht so ganz funktioniert. Die Firma bei der sie arbeitet l&auml;sst die Angestellten im Schichtsystem durchaus in 12h-Schichten arbeiten. 12h sind es weil vom Gesetzgeber bei 10h Arbeit insgesamt 2h Pause vorgeschrieben sind. 2h Pause mit denen nicht mal die Angestellten dort viel mehr anfangen k&ouml;nnen als Fernsehen (in jener Firma geht das), 30-45min f&uuml;rs Essen zu verbrauchen und den Rest der Zeit evtl. sogar zu schlafen.<br/>Ich wei&szlig; nicht wie es euch geht, aber mir w&auml;re die Zeit dann doch zu kostbar um sie sinnlos zu vertr&ouml;deln. Es bleibt wie so oft: Eine sch&ouml;ne Idee, aber in Deutschland einfach nicht durchf&uuml;hrbar!</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_645" onclick="set_comment_reference(645)" title="auf diesen Kommentar antworten">#645</a>:
    25.Sep.2008 01:09
    von
    
      
        <a href="http://gottweltkuehlschrank.de" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Ja finde ich die Idee von Google ganz gut, jedem Angestellten w&ouml;chentlich ein kleines, nat&uuml;rlich bezahltes, Kontigent an Zeit zur Verf&uuml;gung zu stellen (4 Stunden sind es glaube ich) in denen er tun und lassen kann, was er will. Wenn ein gutes Projekt daraus erw&auml;chst wird das nat&uuml;rlich belohnt (unter anderem Google Maps ist so entstanden), wenn nicht hatte der Angestellte wenigstens Zeit, einmal &uuml;ber den Tellerrand zu blicken.</p>

<p class="infos">
<a href="#comment_646" onclick="set_comment_reference(646)" title="auf diesen Kommentar antworten">#646</a>:
    25.Sep.2008 02:09
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Andere Ger&uuml;chte sagen, dass es das 20% Project nicht mehr gibt oder zumindest nich &uuml;berall... irgendwoher m&uuml;ssen die werbeeinahmen ja kommen.</p>

<p class="infos">
<a href="#comment_647" onclick="set_comment_reference(647)" title="auf diesen Kommentar antworten">#647</a>:
    25.Sep.2008 02:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Das ist nat&uuml;rlich eine noch bessere Idee (aus Sicht des Arbeitgebers zumindest)<br/>
Wenn man dann daf&uuml;r sorgen k&ouml;nnte, dass die Coder in dieser Zeit m&ouml;glichst effektiv nutzen, w&auml;re das die Ideall&ouml;sung.<br/>
Ich f&uuml;rchte aber dass viel von dieser Zeit f&uuml;r YouTube, lustige E-Mails und &auml;hnliches drauf geht. (Was ja bei Google im speziellen wieder zu Ideen betreffs YouTube oder GMail f&uuml;hren k&ouml;nnte. ^^)</p>
</div>