+++
title = "Block flash, save a tree"
date = "2008-12-03T08:12:00"
author = "Toranor"
issoid = "blog/1095"
aliases = "blog/1095"
+++

<p>Ich hasse ja Flash. Und ich hasse alle die Flash einsetzen. Vor allem jene, die meinen Flash ist was zum Videos zu komprimieren/speichern/wiedergeben und oder oder damit komplette Websites zu erstellen. <!--more--> Nat&uuml;rlich geht das, aber es ist dazu geeignet wie nen paar St&auml;bchen zum Suppe essen. Es gibt xvid, divx, mpeg1,2,4, huffyuv, h.26x undwasauchimmer. alles leistungsfahige codecs, die auch gute Kompression bieten. Wieso muss man da das denkbar beschissenste (sry) Format nehmen ? Ich kann auf meinem Schrott Northwood (1,6GHz) nen 720p Video problemlos abspielen, aber bei nem 160p flash ruckelt alles. DVD's recodiert er in 5 facher Echtzeit, aber bei nem Flash-Werbepopup hackt die Musik.<br/>Danke f&uuml;r diese tolle Technologie.</p>
<p>(achtung sarkasmus) Aber ist hab ja Verst&auml;ndnis, HTML ist ja so sau schwer, und komplett unverst&auml;ndlich. Mit click click ne Flash-Website aus Frontpage zu machen ist ja viel besser und billiger als nen Informatiker bezahlen. Ihr wechselt ja auch eure Bremsen selber, weil der Mechaniker keine Ahnung hat. (/sarkasmus)</p>
<p>So, nun zum eigentlichen Anliegen:<br/>Endlich hat mal jemand gemessen, wie sch&auml;dlich Flash denn wirklich ist, und inwiefern das Fehlen von Flash hilft, Energie zu sparen:<br/><a href="http://www.sectheory.com/browser-power-consumption.htm" target="_blank">http://www.sectheory.com/browser-power-consumption.htm</a><br/>Nun, nach sinnfreien Umweltzonen kommt bestimmt auch bald das Verbot f&uuml;r Flash.</p>
<p>Ich muss weg.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_941" onclick="set_comment_reference(941)" title="auf diesen Kommentar antworten">#941</a>:
    04.Dec.2008 03:12
    von
    
      
        <a href="http://dc6xs.de" target="_blank">
          RobVinc
        </a>
</p>
<p>Hmm also sparen alle User mit Plattformen, f&uuml;r die es kein Flash gibt, einen Haufen Energie.</p>

<p class="infos">
<a href="#comment_942" onclick="set_comment_reference(942)" title="auf diesen Kommentar antworten">#942</a>:
    04.Dec.2008 07:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Nur bis sie anfangen selbst massig Energie aufzuwenden um Flush irgendwie zum laufen zu bekommen...^^</p>
<p>Aber stimmt schon, flush ist so ziemlich das gr&ouml;&szlig;te &Auml;rgernis daswo es im Netz gibt. Es l&auml;uft ja nichtmal unter Linux richtig problemlos und Linux w&uuml;rde ich heutzutage im Zeitalter der Netbooks nicht gerade als Nischenprodukt z&auml;hlen.</p>

<p class="infos">
<a href="#comment_943" onclick="set_comment_reference(943)" title="auf diesen Kommentar antworten">#943</a>:
    04.Dec.2008 09:12
    von
    
      
        <a href="http://friedenspanzer.blog.de/" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Seit welcher Version kann Frontpage denn Flash? Ich hab mit ungef&auml;hr 11 Jahren aufgeh&ouml;rt ernsthaft dar&uuml;ber nachzudenken Frontpage zu benutzen, also schon eine Zeit lang nix mehr gesehen. (OK, ich gebs zu, einmal vor drei Jahren in der Schule, weil ich keine Lust hatte ein Layout mit table zu erstellen)</p>
<p>Flash als Technologie find ich gar nicht mal so schrecklich. Aber mit Autos kann man ja auch Leute &uuml;berfahren, obwohl es eine tolle Erfindung ist.</p>

<p class="infos">
<a href="#comment_944" onclick="set_comment_reference(944)" title="auf diesen Kommentar antworten">#944</a>:
    04.Dec.2008 09:12
    von
    
      
        <a href="http://dc6xs.de" target="_blank">
          RobVinc
        </a>
</p>
<p>Richtig, mir verschwindet immer wieder mal der FF aufm EEE, egal ob ich nun 3-4 YT-Vids gesehn hab oder auch nur eins. Aber Java-ger&ouml;tz^h^h^h^h^hApplets schaffen das teilweise.</p>

<p class="infos">
<a href="#comment_945" onclick="set_comment_reference(945)" title="auf diesen Kommentar antworten">#945</a>:
    04.Dec.2008 09:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Aber Autos sorgen auch nicht daf&uuml;r dass die Fu&szlig;g&auml;nger bestimmte St&auml;dte nichtmehr betreten k&ouml;nnen, um mal bei deiner analogie zu bleiben ;-)</p>
<p>Flash ist einfach keine Technologie die dem Anwender das Leben leichter macht.. nur dem Entwickler der sich nun keine wirklich brauchbare L&ouml;sung einfallen lassen muss wie er sein Video in eine Seite einbaut. Vlt. noch f&uuml;r den Designer der dann mit viel Bunt und Flackern seine Seite gestalten kann.<br/>
Was Flash jedoch nicht macht, ist Daten besser darzustellen oder f&uuml;r jeden zugreifbar zu machen. Wann immer es um Inhalte geht ist Flash eher hinderlich als sinnvoll.</p>

<p class="infos">
<a href="#comment_946" onclick="set_comment_reference(946)" title="auf diesen Kommentar antworten">#946</a>:
    04.Dec.2008 11:12
    von
    
      
        <a href="http://friedenspanzer.blog.de/" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Flash ist auch nicht f&uuml;r Informationen gemacht, genauso wenig wie HTML f&uuml;r interaktive Inhalte erdacht wurde (Und nein, JS ist keine Ausrede!)</p>
<p>Bl&ouml;d an Flash ist nur das, was damit angestellt wird. Und dabei legen viele (ja, auch ihr hier) zweierlei Ma&szlig; an: Wenn es jemand schafft einen Shooter nur &uuml;ber HTML und JS zu realisieren ist er ein Gott, wenn es jemand schafft Informationen in Flash sinnvoll darzustellen und verf&uuml;gbar zu machen (Oh ja, das ist tats&auml;chlich m&ouml;glich) ist er ein Idiot, weil er Flash benutzt.</p>
<p>Das gr&ouml;&szlig;te Problem das ich bei Flash sehe ist ein politisches: das propriet&auml;re Format. Aber bring mal den Kunden bei.</p>

<p class="infos">
<a href="#comment_947" onclick="set_comment_reference(947)" title="auf diesen Kommentar antworten">#947</a>:
    04.Dec.2008 12:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>der unterschied ist: ein Shooter in HTML und JS (mein letzter Stand war nur eine Lauff&auml;hige 3D-Engine &uuml;ber JS-Canvas) ist etwas mit einem gewissen Coolness-Faktor das ich nicht verwenden MUSS.</p>
<p>Flush rennt mir an jeder 2. Ecke &uuml;ber den Weg, ich komm schlicht nicht mehr drumrum.<br/>
Auch wenn jetzt jeder sagt es solle nur angewendet werden wenn man sich sicher ist dass alle potentiellen nutzer es eh installiert haben... Tatsache bleibt einfach dass ich vieles im Netz nicht ohne Flush verwenden kann, egal ob das an dieser Stelle sinnvoll war oder nicht, siehe Videodarstellung.</p>
<p>Ich will also nochmal feststellen: Ich habe KEIN Problem mit Spielen in Flash aber wohl mit so Dingen wie der Wordpress.com-Klickstatistik (ein Bild h&auml;tte es auch getan, evtl. mit Zonen zum klicken) oder einem stundenlangem Website-Intro. (Ein gutes Beispiel finden wir auch in der Hinterlegung auf der Adobe-Website)</p>

<p class="infos">
<a href="#comment_948" onclick="set_comment_reference(948)" title="auf diesen Kommentar antworten">#948</a>:
    05.Dec.2008 01:12
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>Sagen wir mal so, das eigentliche Problem an egal welcher Geschichte ist ...</p>
<p>Haben wir totes Pferd?<br/>
Dann nehmen wir doch mehr tote Pferde und der Karren rennt wieder!</p>
<p>Will damit sagen, das obwohl der Materialmangel bekannt ist alles immer gr&ouml;&szlig;er, schneller, Leistungshungriger wird, obwohl dies nicht sein muss.</p>
<p>Ich f&uuml;hre da immer als kleines Beispiel ins Schlachtfeld den Amiga 500. Ok, die Vermarktung war unter aller Sau, aber das Ger&auml;t war eigentlich nur f&uuml;r eine bestimmte darstellbare Anzahl an Farben gedacht und doch kam quasi schon im Tot des Ger&auml;tes ein Spiel heraus, welches den Farbumfang sprengte.</p>
<p>Andersherum gesehen ist diese L&ouml;sung, also weiterentwicklung und verbesserung alter Systeme, unwirtschaftlich, weil man nichts daran verdient, aber ob das alles gut ist?</p>
<p>Im Falle von Flash geht mir allerdings noch mehr auf den Keks, das &uuml;berhaupt dieses ganze Kropzeugs im Netz verbreitet wird von "Klicke hier und saufe Santaclaus unter den Tisch ... probiere es noch einmal ..."<br/>
DAS WILL KEINER HABEN!</p>
<p><em>kopf-&gt;tisch</em></p>
<p>Eine wie ich finde interessante &Uuml;berlegung mit dem Verbrauch von Flash und Leistung.</p>
<p>Mfg</p>
<p>madda</p>

<p class="infos">
<a href="#comment_949" onclick="set_comment_reference(949)" title="auf diesen Kommentar antworten">#949</a>:
    16.Nov.2009 07:11
    von
    
      
        <a href="http://www.linux-forum.de/flash-player-funktioniert-bei-youtube-nur-teilweise-31530-3.html#post115618" target="_blank">
          Flash Player funktioniert bei YouTube nur teilweise? - Seite 3 - Linux: Linux-Forum
        </a>
</p>
<p>[...]  [...]</p>
</div>