+++
title = "Arbeitszeiten"
date = "2009-10-06T08:10:00"
author = "Dr. Azrael Tod"
issoid = "blog/1465"
aliases = "blog/1465"
+++

<p>Ach ist das sch&ouml;n... ich kann mir meine Arbeitszeiten nahezu beliebig legen, kann auf Arbeit kommen und gehen wann ich will. Weil ich aber faul bin, habe ich das getan was wohl die meisten tun w&uuml;rden: ich habe sie mir so gelegt dass sie am besten mit meinen t&auml;glichen Gewohnheiten korrelieren.</p>
<p>Ergebnis ist nat&uuml;rlich dass ich irgendwann zwischen 8 und 9 auf Arbeit aufschlage und gegen 18:00 wieder nach Hause wackel. Mein, neuerdings sehr sch&ouml;n auf 5min Fu&szlig;weg verk&uuml;rzter, Arbeitsweg  macht es dann auch noch m&ouml;glich dass dies auch ziemlich genau die Zeiten sind zu denen ich unsere Wohnung verlasse und betrete und so genie&szlig;e ich den Luxus aufstehen zu k&ouml;nnen wenn ich sowieso gerade munter werden w&uuml;rde und wieder nach Hause zu gehen wenn meine Leistungsf&auml;higkeit eh langsam im Keller verschwindet.</p>
<p>Das w&auml;re wirklich alles toll.. aber leider scheint unsere tolle Gesellschaft auf solche Arbeitszeiten irgendwie nicht vorbereitet...<!--more--></p>
<p>Es geht ja schon  los wenn ich mal aufs Amt muss... &Ouml;ffnungszeiten sind Montag bis Freitag irgendwann zwischen 9 und 14 Uhr, Dienstag und Donnerstag gibt es aus unglaublich gro&szlig;er Gnade auch mal &Ouml;ffnungszeiten bis 18:00. BRAVO! Schon ein Fall f&uuml;r den ich mir fast Urlaub nehmen muss nur um ein Formular abzuholen oder so. (Wobei es in Dresden noch geht, da hier viele &Auml;mter gl&uuml;cklicherweise auch mal Samstags &ouml;ffnen. Dumm ist halt nur wenn man in einer Kleinstadt wie meiner Heimatstadt Zschopau wohnen w&uuml;rde... aber da gibts ja nicht viele Leute, betrifft also kaum jemanden.)</p>
<p>Bei Banken gehts gleich weiter... &Ouml;ffnungszeiten immer nur bis 18:00, Freitags (wenn es sich sogar mal lohnen w&uuml;rde zeitiger Schluss zu machen) nur bis Mittag! \o/<br/>Wobei das ja eh nicht mein Hauptproblem mit Banken ist... jeder der schonmal in einer anderen Sparkasse geld auf sein Konto bei der eigenen Sparkasse einzahlen wollte wei&szlig; wovon ich rede (Ein Problem dass man nicht hat wenn es Einzahlungsautomaten f&uuml;r Kleingeld und Scheine gibt... die ich aber bisher nur in der Kleinstadt Zschopau gesehen habe, wo ich nicht drauf angewiesen bin, und weder in Zwickau, noch Dresden).</p>
<p>Doch ignorieren wir mal die B&uuml;rokratie, es gibt ja noch genug andere Stellen an denen man mit Menschen interagieren muss...<br/>&Auml;rzte (MUHAHAHAHA, schonmal versucht nach 18:00 zum Zahnarzt zu gehen?), spezialisierte Einzelh&auml;ndler (ok, der Gem&uuml;seladen/das Einkaufszentrum an der Ecke hat 8-20 Uhr ge&ouml;ffnet aber wer kennt einen Uhrmacher der vor 9 oder nach 18 Uhr noch jemanden in den Laden l&auml;sst?) oder Post-Filialen, keiner  scheint anzunehmen dass au&szlig;erhalb der &uuml;blichen Zeiten noch Kunden unterwegs sein k&ouml;nnten.</p>
<p>Post! Das ist sowieso ein Stichwort. Die Post schl&auml;gt bei uns irgendwann zwischen 12 und 17 Uhr auf. Ich k&ouml;nnte ja damit leben dass sie langsam ist, Pakete mehr wirft als Transportiert oder dass Briefe auch permanent unterwegs verloren gehen... aber wie zum Henker soll ich jemals zuhause sein wenn ein Paket ankommt?<br/>Ich k&ouml;nnte mich ja sogar damit abfinden mein Mittagessen auf 14:00 oder so zu verlegen und statt zum D&ouml;nermann lieber nach Hause zu gehen, dann k&ouml;nnte ich nicht nur Weg sparen sondern auch noch meine Nachbarn zu ebener Erde entlasten mir st&auml;ndig meine Pakete entgegennehmen zu m&uuml;ssen (Ich will auch eigentlich garnicht wissen wer daf&uuml;r haftet wenn mal ernsthaft ein Paket verloren geht oder so.).<br/>Aber auch hier gilt: ich kann nicht jeden zweiten Tag erstmal f&uuml;r 5 Stunden Mittagspause machen... besser noch, ich wei&szlig; ja nichtmal genau an welchem Tag das Paket ankommt und kann h&ouml;chstens mit Sch&auml;tzwerten arbeiten.<br/>Aber zum Gl&uuml;ck gibt es ja besagte Nachbarn! Da zu denen der Fu&szlig;weg so viel k&uuml;rzer ist als zu uns ins 2. Obergeschoss, hat es sich in letzter Zeit sogar eingeb&uuml;rgert dass man gleich erstmal bei denen klingelt ob die das Paket annehmen... auch am Wochenende wenn wir zuhause sind!<br/>Ich habe ja bereits mindestens 3-4 Pakete angenommen seitdem wir in Dresden wohnen... meine Nachbarn kommen bereits f&uuml;r Samstag Morgen auf erheblich mehr, am besten nat&uuml;rlich so dass man zum ersten Mal am Tag die Wohnung verl&auml;sst und im Briefkasten den Hinweis findet dass vor 15min. ein Paketbote da war.<br/>Aber zumindest brauch ich mir keine Sorgen zu machen dass das daran liegen w&uuml;rde dass die Post nicht wei&szlig; wo ich wohne... denn immerhin wei&szlig; sie das gut genug um diese Daten <a href="http://www.deutschepost.de/dpag?xmlFile=link1015625_1007" target="_blank">sch&ouml;n &ouml;ffentlich zu verkaufen</a>.</p>
<p>Doch zur&uuml;ck zum eigentlichen Thema: Jeder Laden, jede Institution, jedes Amt hat ungef&auml;hr die gleichen &Ouml;ffnungs- wie ich Arbeitszeiten. Jeder scheint genau dann auf Arbeit aufzuschlagen wenn ich das auch tu und keinen scheint es zu st&ouml;ren.<br/>Da haben wir doch mal wieder ein tolles Beispiel f&uuml;r die "Servicew&uuml;ste Deutschland", meines Erachtens weit aussagekr&auml;ftiger als dass niemand meine Sachen an der Kasse f&uuml;r mich einpackt (das wollen die Leute eh nicht: "Lassen sie das liegen, junger Mann! Das sind meine Eink&auml;ufe!") oder dass <a href="http://g33ky.de/2008/07/17/hande-weg-von-telecolumbus/">$billigsterAllerInternetanbieter </a>nur automatisierte Hotlines f&uuml;r 9,90&euro; die Minute als Hilfe anbietet.</p>
<p>Meine Arbeitszeit ist nicht zu selten oder zu abwegig! Meine Arbeitszeit ist zu normal und zu &uuml;blich!</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1341" onclick="set_comment_reference(1341)" title="auf diesen Kommentar antworten">#1341</a>:
    07.Oct.2009 05:10
    von
    
      
        <a href="http://bunix.de" target="_blank">
          reaper
        </a>
</p>
<p>Versteh ich nich, am Anfang schreibst du das du deine Arbeitszeiten legen kannst wie du willst. Dann geh halt mal um 9 aufs Amt, danach auf Arbeit und mach Abend entsprechend l&auml;nger. Wenn man flexible Arbeitszeit hat, dann ist doch prima, richtig mies sind Leute dran die nicht mal zwischen durch weg k&ouml;nnen oder man sp&auml;ter anfangen k&ouml;nnen. Solls ja auch geben ;) Und zum Zahnarzt kannste doch auch mal schon vor der Arbeit gehen.</p>
<p>Aber unabh&auml;ngig davon haste recht: "Bitte holen sie ihr Paket auf der Postfiliale XYZ ab. 9-18 Uhr aber nicht vor morgen" ;)</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1346">
<p class="infos">
<a href="#comment_1346" onclick="set_comment_reference(1346)" title="auf diesen Kommentar antworten">#1346</a>:
    08.Oct.2009 08:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Naja, k&ouml;nnen ist halt nicht unbedingt wollen ;-)</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1342" onclick="set_comment_reference(1342)" title="auf diesen Kommentar antworten">#1342</a>:
    08.Oct.2009 10:10
    von
    
      
        B3rT
      
    
    
  </p>
<p>Oh ja, dar&uuml;ber reg ich mich auch st&auml;ndig auf. Habe &auml;hnliche Arbeitszeiten wie du. Wenn ich mal zur Bank muss hei&szlig;t das das ich an den zwei Tagen an denen sie mal bis um 18.00 offen hat mit 120 anstatt der Erlaubten 80 nach hause Rasen darf. Und wehe es ist mal Stau, dann darf ich 4 Tage warten bis ich wieder die Chance hab, weil Samstag zu &ouml;ffnen f&auml;llt denen nat&uuml;rlich auch nicht ein ...<br/>
Schlimmer war es allerdings vor einem guten Jahr als ich eine neue Wohnung gesucht hab. So gut wie kein Makler (und ohne Makler gibt es nichts, zumindest nicht hier) macht Termine nach 17.00.</p>
<p>Pakete lass ich mir im &uuml;brigen generell nur noch auf den Arbeitsplatz liefern. (Gibt nur Probleme wenn der Shop keine M&ouml;glichkeit f&uuml;r die Angabe einer Firma hat, dann liefert DHL n&auml;mlich nicht her...)</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1345">
<p class="infos">
<a href="#comment_1345" onclick="set_comment_reference(1345)" title="auf diesen Kommentar antworten">#1345</a>:
    08.Oct.2009 08:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>zum Arbeitsplatz senden ist auch eine Sache die ich mir schon mehrmals &uuml;berlegt habe... mein Problem ist halt nur dass es auch Sachen gibt die ich dann nicht wirklich zeitlich genau genug planen kann. Wenn also ein Paket dann doch mal Samstags ankommt hab ich die Arschkarte.</p>
<p>Schwere Sachen sind auch evtl. ein weiteres Problem, die mag man als Fu&szlig;g&auml;nger nicht unbedingt von Arbeit  nach hause tragen.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1351">
<p class="infos">
<a href="#comment_1351" onclick="set_comment_reference(1351)" title="auf diesen Kommentar antworten">#1351</a>:
    13.Oct.2009 09:10
    von
    
      
        B3rT
      
    
    
  </p>
<p>Normal kommt das dann eben Montags fr&uuml;h dann an. Gut ich wei&szlig; nicht wie das sonst abl&auml;uft, da ich in einem Online Versandhaus arbeite kommt hier auch jeden Tag mehrmals die gesamte Palette an Lieferdiensten vorbei.</p>
<p>Stimmt schwere Sachen k&ouml;nnten problematisch werden, solange man im Besitz eines F&uuml;hrerscheins ist kann man sich zumindest meist ein Auto irgendwoher leihen.</p>
</div>
</li>
</ul>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1343" onclick="set_comment_reference(1343)" title="auf diesen Kommentar antworten">#1343</a>:
    08.Oct.2009 07:10
    von
    
      
        Numanoid
      
    
    
  </p>
<p>Ja, gerade die Banken leben &Ouml;ffnungszeitentechnisch noch mitten im Sozialismus. Wenn man Gl&uuml;ck hat, dann Mo-Do 9-12 und 14-18 Uhr, Meistens hat man aber noch Mittwoch und Freitag ab  Mittag geschlossen, Samstag sowieso. Aber dann wundern und rumjammern da&szlig; immer mehr Leute zu den Direktbanken abwandern.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1344">
<p class="infos">
<a href="#comment_1344" onclick="set_comment_reference(1344)" title="auf diesen Kommentar antworten">#1344</a>:
    08.Oct.2009 08:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>das gleichen die dann aber wieder aus indem sie mehr Filialen gleichzeitig geschlossen haben... <em>g</em><br/>
Die Filialen scheinen wie  Pilze aus dem Boden zu schie&szlig;en, das einzige was noch schlimmer ist w&auml;rend wohl Krankenkassen. Halt all die Organisationen die dringendst Geld verbrennen m&uuml;ssen.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1347">
<p class="infos">
<a href="#comment_1347" onclick="set_comment_reference(1347)" title="auf diesen Kommentar antworten">#1347</a>:
    09.Oct.2009 07:10
    von
    
      
        <a href="http://www.bunix.de" target="_blank">
          reaper
        </a>
</p>
<p>Genau und wenn die AOK auch noch die Filialen l&auml;nger als von 12 bis Mittag aufmachen m&uuml;sste dann g&auml;be es schon im April keine neuen Z&auml;hne mehr.</p>
</div>
</li>
</ul>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1348" onclick="set_comment_reference(1348)" title="auf diesen Kommentar antworten">#1348</a>:
    12.Oct.2009 12:10
    von
    
      
        <a href="http://www.freemusicwiki.net/weblog/index.php/" target="_blank">
          torsten
        </a>
</p>
<p>Der/Die/Das Rewe bei mir um die Ecke hat ja jetzt auch bis 22 Uhr offen. Sch&ouml;n, da kann ich jetzt auch einkaufen, wenn ich den &uuml;blichen ladenschluss mal verpasst klar. Aber was passiert denn nun, wenn alle 24 h pro tag offen haben? Jau, wir k&ouml;nnen shoppen, zum Arzt gehen, Tanken, Pakete abgeben, etc. wann wir wollen. Und: Es wird von mehr und mehr Leuten erwartet, dass sie bereit sind, binnen der 24h die ein Tag hat, zu arbeiten.<br/>
Da frage ich mich dann, wer diese Leute sind, die nachts um 3 hinter der Theke stehen um Pakete anzunehmen und warum nicht auch sie entscheiden k&ouml;nnen, wann sie arbeiten gehen.</p>
<p>Mit anderen Worten: Ich w&uuml;rde die These aufstellen, dass die flexiblen Arbeitszeiten der einen, die Nachtarbeit der anderen sind. Und: die einen sind obenauf, w&auml;hrend die anderen eher am unteren Rand der Gesellschaft zu finden sind.</p>
<p>Deswegen finde ich Servicew&uuml;sten nicht so schlimm. Sie bedeuten m.E. ja auch eine gewisse Entspanntheit.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1349">
<p class="infos">
<a href="#comment_1349" onclick="set_comment_reference(1349)" title="auf diesen Kommentar antworten">#1349</a>:
    12.Oct.2009 06:10
    von
    
      
        <a href="http://bunix.de" target="_blank">
          reaper
        </a>
</p>
<p>Dat ist doch aber eine klassische unbegr&uuml;ndete Erwartungshaltung. In Deutschland geht man davon aus das jedes KANN ein sofortiges MUSS bedeutet. Nur weil es keinen Ladenschluss gibt bleibt es doch immer noch die Entscheidung jedes H&auml;ndlers ob sich das &Ouml;ffnen lohnt. Und das l&auml;sst sich dann ganz einfach betriebswirtschaftlich entscheiden.</p>
<p>Wenn nach 22 Uhr nicht mehr genug Umsatz gemacht wird um die Kosten zu decken, dann wird die Bude eben 22 Uhr geschlossen und fertig. Dummerweise steht dieser Entscheidung der Neid entgegen. Wenn n&auml;mlich von den drei Gem&uuml;sel&auml;den zwei zu machen hat der dritte immer noch genug Umsatz und die beiden anderen werden neidisch, brennen dem T&uuml;rken die Bude ab oder stellen eine polnische Billigkraft ein die dann den Laden trotz fehlender Kunden offen h&auml;lt und schmei&szlig;t die dann alle Monate raus weil sie Nachts um vier einen Apfel gegessen und nicht bezahlt hat.</p>
<p>Klassischer Gier-Kapitalismus eben, &ouml;ffnen k&ouml;nnen und sollen hei&szlig;t noch lange nicht &ouml;ffnen m&uuml;ssen. Wenn ich mich zum Beispiel in Irland umsehe wo es defakto keinen Ladenschluss gibt, da hat der Metzger eben Vormittag und Abends auf, zwischendurch aber nicht. Wo ist das Problem?</p>
<p>Auch die Post k&ouml;nnte ja in zwei Schichten arbeiten, ein Team von 6-14 Uhr und eins von 14 bis 22 Uhr. Vielleicht auch von 6-10 nur eine Kraft, &uuml;ber Mittag dann zwei und Abend wieder nur eine, je nach dem wie die Leute eben kommen. Aber nein das wird ja zu teuer, womit wir dann wieder bei der Servicefrage sind. Service ist einfach mal teuer, deshalb will ihn auch keiner bieten und deshalb gibts den eben auch nur selten oder teuer und dann meckern wir auch wieder.</p>
</div>
</li>
<li>
<div class="comment" id="comment_1350">
<p class="infos">
<a href="#comment_1350" onclick="set_comment_reference(1350)" title="auf diesen Kommentar antworten">#1350</a>:
    12.Oct.2009 07:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Die wenigsten Dinge die ich nannte h&auml;ngen vom Ladenschluss ab, weder wird die Post ihre Pakete jetzt bis 22:00 liefern, noch werden Banken jetzt Freitags und Samstags l&auml;nger &ouml;ffnen.<br/>
Die Einzelh&auml;ndler hingegen, die sowieso schon bis Ladenschluss ge&ouml;ffnet hatten, werden das nat&uuml;rlich auch in Zukunft tun.</p>
<p>Ich habe vor 10 Jahren bereits Abends gegen halb 8 oder gar halb  12 noch Butter kaufen k&ouml;nnen und ich werde das auch in 10 Jahren noch k&ouml;nnen.</p>
<p>Was ich jedoch nicht kann, ist nach um 6 noch eine Uhr reparieren zu lassen, es gibt mindestens 4 L&auml;den in der n&auml;chsten Umgebung und keiner hat l&auml;nger als 9-18 Uhr auf.<br/>
Wo ist da der Sinn? Diese L&auml;den sucht man im Regelfall einmal alle 4 Jahre auf, da ist dann auch nichts mit Preisvergleichen gro&szlig;artig (zumindest wenn man mal vom reinen Verkaufen der Uhren absieht, aber das macht Amazon billiger auch nach 24 Uhr noch).<br/>
Wenn meine Uhr defekt ist oder ich sonst irgendwelche Dienstleistungen von denen brauche, dann gehe ich in den erstbesten Laden, frage was es kostet und lass die Uhr dann gleich da. Ich schau mich nicht um, oder geh wieder nachdem ich den Preis gesagt bekommen habe.</p>
<p>F&uuml;r derartige L&auml;den ist es einfach viel wichtiger einen guten Standort zu haben und vertrauenserweckend auszusehen als die billigsten Preise zu haben. Warum ist es dann nicht wichtig wann die L&auml;den ge&ouml;ffnet haben?<br/>
Wie Reaper bereits schrieb.. warum sollten nicht einfach 2 L&auml;den fr&uuml;her &ouml;ffnen und 2 sp&auml;ter? Einfach nur aus Gier? Aus Dummheit? Oder vlt. doch einfach nur weil jeder gerne um vern&uuml;nftige Zeiten arbeitet und sich keiner ernster Gedanken dr&uuml;ber macht?</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1352" onclick="set_comment_reference(1352)" title="auf diesen Kommentar antworten">#1352</a>:
    02.Nov.2009 09:11
    von
    
      
        <a href="http://www.dresdner-rand.de" target="_blank">
          randOM
        </a>
</p>
<p>Das Gesch&auml;ft k&ouml;nnte so sch&ouml;n sein, wenn da nicht immer die dumme Kundschaft st&ouml;ren w&uuml;rde :-) Soviel zum Thema Flexibilit&auml;t...</p>
</div>