+++
title = "ganz altes Laub (Ur-Laub)"
date = "2009-02-16T11:02:00"
author = "Dr. Azrael Tod"
issoid = "blog/1246"
aliases = "blog/1246"
+++

<p>Ich bin wieder da! Seit Sonntag sind wir wieder in Dresden und haben unseren Skiurlaub wider erwarten relativ Verletzungsfrei &uuml;berstanden.</p>
<p>Bilder <a href="http://picasaweb.google.com/drazraeltod/Heiligenblut2009" target="_blank">gibt es</a> <a href="http://picasaweb.google.com/drazraeltod/Heiligenblut2009Teil2" target="_blank">nat&uuml;rlich auch</a>.</p>
<p>Um es kurz zu machen: Das Wetter war recht gut, die Stimmung meistens auch und wir haben wie immer ziemlich viele Kilometer an H&ouml;henunterschieden mit unseren Brettern zur&uuml;ckgelegt. (Cindy hatte es mal relativ vorsichtig &uuml;berschlagen.. 1km H&ouml;he f&uuml;r 1x Schareck fahren, bei 30min Zeit inkl. Gondelfahrt, 6 Tage Zeit und jeden Tag von 9 bis 4 fahren, dabei eine Stunde Pause).<br/><!--more--><br/>Ziel unserer Reise war wie so oft das kleine D&ouml;rflein <a href="http://www.heiligenblut.at/" target="_blank">Heiligenblut</a> am (oder von uns aus hinterm) Gro&szlig;glockner. Wir haben uns also wie auch schon die letzten Jahre auf den Weg gemacht, sind mit etlichen Autos losgefahren und haben uns <a href="http://www.heiligenblut.at/default.asp?ukneu=true&amp;appname=betriebsmodul&amp;domain=Domain.kaernten.Frontend.Heiligenblut&amp;action=showAll&amp;portal=79477674212350553&amp;uaid=2&amp;unterkunftsart=78069326216720112&amp;startnode=20610&amp;lid=de&amp;stammid=117234&amp;jid=WI&amp;siid=49&amp;r4ydomain=Frontend.Heiligenblut&amp;LAid=1" target="_blank">in einer H&uuml;tte auf ca. 1800m &uuml;ber nomal-Null, direkt am Skihang</a> einquartiert.</p>
<p>Diesmal war die kleine H&uuml;tte noch &uuml;berbelasteter als jemals zuvor. 17 Personen haben sich in eine H&uuml;tte mit 11 Betten gequetscht, das sorgt nat&uuml;rlich schnell f&uuml;r etwas gr&ouml;&szlig;erem Hang zu Reibereien und ist auch nur &uuml;berhaupt machbar gewesen weil sich die Gruppe ziemlich gut versteht und der Wirt ein Auge zugedr&uuml;ckt hat.</p>
<p>Man merkt an dieser Stelle bereits dass man in &Ouml;stereich wohl doch eine etwas andere Mentalit&auml;t hat, die Sprache &auml;hnelt sich zwar (mehr isses wirklich nicht, ich verstehe Engl&auml;nder teilweise besser als diese &Ouml;sis), aber die Kultur ist bei diesen abgeschiedenen Bergv&ouml;lkchen doch etwas "entspannter".</p>
<p>Dies hat durchaus nicht nur Vor- oder Nachteile, so h&auml;tte wohl ein deutscher Wirt sicher anders auf die starke &Uuml;berbelegung reagiert, andernseits w&auml;ren uns wohl auch einige seltsame Umst&auml;nde bei der Anreise erspart geblieben, weil ein solcher sich schon im Vorraus mehr den Kopf zerbrochen h&auml;tte.</p>
<p>So waren am Anreisetag 2 Personen aus unserer Gruppe bereits vor 16:00 am Berg und hatten sich bereits mehrmals mit dem Wirt im Vorbeifahren am Skihang unterhalten. Der Wirt hielt es aber bis wir nach 16:00 dann fast alle oben waren und er mit dem Skidoo das Gep&auml;ck auf den Berg bringen sollte nicht f&uuml;r n&ouml;tig uns zu sagen dass das aufgrund von zu viel Schnee auf der Piste nicht klappen wird und wohl fast alles erst irgendwann in der Nacht mit dem gro&szlig;en Pistenger&auml;t gebracht werden kann.</p>
<p>Wir sa&szlig;en also erstmal auf dem Berg, h&auml;tten bis vor 16:00 vieles via Skier hochbringen k&ouml;nnen und haben uns aufgeregt dass wir nichtmal an Nahrung, Getr&auml;nke oder Hausschuhe kommen konnten und alles noch unten an der Mittelstation auf einem Parkplatz bei weit unter -10&deg;C lagerte.</p>
<p>Zum Gl&uuml;ck l&ouml;ste sich das Problem noch zu einem ziemlich gro&szlig;en Teil und es wurde doch noch irgendwie m&ouml;glich die meisten Dinge nach oben zu transportieren, auch wenn die Auswahl etwas ung&uuml;nstig erfolgte und einige Sachen (die "wichtigsten" sollten wir erstmal zu Platz A bringen, das war dann das was zu letzt hochgeschafft wurde) erstmal bis Nachts um 5 in einem Container darauf warteten zur H&uuml;tte transportiert zu werden.</p>
<p>Dennoch... wir hatten bereits am ersten Abend etwas essbares auf dem Berg, Getr&auml;nke waren auch vollst&auml;ndig anwesend, empfindliche Elektronik oder so wurde auch nicht besch&auml;digt und nur auf die wenigsten Dinge wie Handt&uuml;cher oder eine Kleidungsst&uuml;cke f&uuml;r den n&auml;chsten Tag mussten wir bis zum Morgen verzichten.</p>
<p>Der Rest der Woche gestalltete sich zum Gl&uuml;ck nicht ganz so Chaotisch (eigentlich schade... ALL HAIL DISCORDIA!). Morgens gegen 8:45 standen wir in Skiern oder Snowboards am Hang, gegen um 9 machte dann auch mal die Bahn auf und hat die anderen Touristen auf den Hang gelassen (inzwischen hatten wir so anderthalb Fahrten auf der perfekt pr&auml;parierten Piste weg) und von einer einst&uuml;ndigen Unterbrechung f&uuml;r eine Mittagspause (Warum zu einer teueren Bergh&uuml;tte fahren, wenn man viel billiger selbst auf der eigenen was besseres kochen kann?) sind wir dann bis Nachmittags um 4 duchgefahren.</p>
<p>Das Wetter war die ganze Woche ziemlich gleichm&auml;&szlig;ig gut. Der Schnee war &auml;u&szlig;erst reichlich und nahezu perfekt, daf&uuml;r war die Sicht oft etwas knapp durch Schnee oder Nebel und der Wind wehte etwas stark. Es hat allerdings auch irgendwie seinen eigenen Charme bei -20&deg;C und B&ouml;hen von 80km/h auf einem Berg zu stehen und sich mit hoher Geschwindigkeit den Hang herunter zu st&uuml;rzen.</p>
<p>Die Bahnen brauchten dieses Jahr durch den Wind leider etwas l&auml;nger bis sie oben ankamen. Statt der &uuml;blichen 10-15min. war man eher reichlich 20min. zwischen Mittelstation und Bergstation unterwegs... wenn die Bahn nicht gleich ganz aus Sicherheitsgr&uuml;nden angehalten werden musste.<br/>Wir haben aber nach bester M&ouml;glichkeit versucht das durch k&uuml;rzere Zeiten (gleiche Strecke: bis unter 5min) bei der Abfahrt wieder auszugleichen. *g*</p>
<p>Alles in allem war es also wie immer eine gelungene Woche.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1128" onclick="set_comment_reference(1128)" title="auf diesen Kommentar antworten">#1128</a>:
    17.Feb.2009 10:02
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p><em>bibber</em></p>
<p>Ich mag es zwar eher kalt, aber soviel Kalt muss dann nicht ^^<br/>
Naja, wer es mag. Ich glaub mein Ding w&auml;hr es nicht, Skateboarden war zwar kein Ding, aber alles mir fest an den F&uuml;&szlig;en steckt, will irgendwie nie dorthin, wo ich hin will -.-</p>

<p class="infos">
<a href="#comment_1129" onclick="set_comment_reference(1129)" title="auf diesen Kommentar antworten">#1129</a>:
    17.Feb.2009 11:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>So kalt wars garnicht... zumindest wenn man ordentliche Klamotten hat und nicht gerade mit nacktem Gesicht rumkurvt.<br/>
Gefroren haben wir allerh&ouml;chstens in der Gondel und das auch eher weil wir dort auf Metallb&auml;nken sitzen mussten, die nur mit wenig Stoff bespannt waren.</p>
<p>Kurz: es gibt kein schlechtes Wetter, es gibt nur unangepasste Kleidung.</p>
</div>