+++
title = "Wahljahr: Tastaturen"
date = "2009-02-26T01:02:00"
author = "Dr. Azrael Tod"
issoid = "blog/1274"
aliases = "blog/1274"
+++

<p>Heute gibts mal wieder etwas Hardwarebezogenes. Ich bin gerade am suchen einer neuen Tastatur die ich an mein Akoya klemmen kann. Die eingebaute ist zwar f&uuml;r ein Netbook wirklich ziemlich gut, aber eben nur f&uuml;r ein Netbook. Es ist nichtmal so dass mich die Gr&ouml;&szlig;e der Tasten, der Anschlag oder die Position st&ouml;ren w&uuml;rde, viel eher h&auml;tte ich einfach gerne ein paar mehr Tasten (z.B. programmierbare Multimediatasten f&uuml;r die diversen Steuerfunktionen meines GUI oder einen Nummernblock)<!--more--><br/></p><h2>Allgemeines</h2><br/>Dabei sollte eine neue Tastatur nat&uuml;rlich den typischen Bl&ouml;dsinn vermeiden. Oft ist mir z.B. aufgefallen dass sich die zus&auml;tzlichen St&uuml;tzen zum erh&ouml;hen der Position (auch wenn das bei diesem Modell ziemlich nutzlos ist) bei vielen Varianten dadurch selbst einklappen dass die Tastatur ein kleines St&uuml;ck vom K&ouml;rper weg geschoben wird.

<p>Andere Tastaturen haben Sondertasten an die Stelle von normalen bewegt. So hatte ich f&uuml;r PS2 ein st&uuml;ck Plastikschrott, bei der die Taste f&uuml;r einen ACPI-Shutdownbefehl an der Stelle lag, wo ich normalerweise "Print-Screen" erwarte. Sowas kann man mit untragbar nichtmal mehr ansatzweise beschreiben. Da h&auml;tten wir ohnehin so einen generellen Punkt: NIEMALS Standardtasten verschieben! Selbst wenn es unbedingt sein muss (und bei Desktoptastaturen kann ich mir keinen Grund daf&uuml;r vorstellen), dann nur sehr gut &uuml;berlegt verschieben. Akoya hat als Beispiel keinen Steuer- oder Ziffernblock und damit keine Bild-auf/-ab und Pos1/Ende-Tasten, diese wurden via einer Alternativbelegung auf die Pfeiltasten gelegt. Diese Tasten sind artverwand. Wenn ich die eine statt der anderen Taste dr&uuml;cke, werde ich damit im seltensten Fall mehrere Stunden arbeit vernichten. ich muss halt meistens nur wieder zur&uuml;cksteuern.</p>
<p>Diese Sonderbelegung hat sogar Vorteile: wenn ich Bild-* dr&uuml;cken will, brauch ich nichtmehr meine rechte Hand vom Hauptblock wegzubewegen. Beim Verwenden der normalen Steuertasten neigt man sonst schnell dazu mit der rechten Hand permanent zwischen Pfeil-Tasten und Steuerblock zu pendeln, w&auml;hrend die linke Hand etwas wenig ausgelastet (shift, ctrl und die Ausschneiden/Einf&uuml;gen/Kopieren-Tastenkombis) ist. Aus dem Grund liegt ja auch bei etwas cryptischeren Editoren derartiges oft nicht auf den Richtungstasten, so dass man die Hand garnicht mehr vom Hauptblock wegbewegen muss.</p>
<p>Akoyas Variante hingegen ist angenehm genug dass ich sie instinktiv auch schon auf gro&szlig;en Tastaturen vermisse... etwas das mir bisher bei den wenigsten Notebooktastatur-Sonderumstellungen passiert ist.</p>
<p>Bisher gingen meine &Uuml;berlegungen haupts&auml;chlich 2 Wege, wie ich mir ein Keyboard ausw&auml;hlen k&ouml;nnte:</p>
<p></p><h2>Idee1: Tastatur von @work</h2><br/>Wenn ich mir die selbe Tastatur zulege, an der ich auf Arbeit schon die ganze Zeit tippe (Cherry CyMotion, Linuxausgabe), hat das nat&uuml;rlich den Vorteil dass ich mir nicht noch eine weitere Positionierung von Sondertasten antrainieren muss. Die Tastatur selbst ist ohnehin nicht schlecht, hat mehr Sondertasten als ich brauch, es tippt sich ganz nett und auch die sonst typischen Schwachstellen wurden weggelassen.

<p>Anf&auml;nglich ist es etwas gew&ouml;hnungsbed&uuml;rftig rechts und Links von allen anderen Tasten noch eine Reihe Sondertasten zu haben. Besonders die Tabulator-Taste habe ich h&auml;ufig mit so einer verwechselt. Etwas Abstand oder ein eindeutig unterscheidbares Design h&auml;tten da sicher nicht geschadet. Die Auswirkungen halten sich aber in Grenzen, da man ja beim Schreiben eh meist von innen kommt und sich Blind zu den Tasten am Rand tastet.</p>
<p>Der Anschlag der Tasten ist nicht schlecht, einzig die erzeugten Ger&auml;usche sind mir etwas zu laut... das k&ouml;nnte aber mal wieder mit meiner Gew&ouml;hnung an die fl&uuml;sterleise Verwendung von Akoyas Tastatur kommen.</p>
<p>Das Problem mit dieser Tastatur: Man findet sie nicht mehr! Weder bei Egay, noch bei Amazon oder sonstirgendwo. Diese spezielle Variante wird scheinbar seit Jahren nicht mehr hergestellt und verkauft. Wenn ich viel Gl&uuml;ck habe, bekomme ich noch eine "SAP-Version" davon. Einziger Unterschied w&auml;re dann wohl dass statt dem sch&ouml;nen Tux-Aufkleber und entsprechenden Symbolen auf den Sondertasten dort dann satanische Symbole aufgedruckt sind.</p>
<p></p><h2>Idee2: Tastatur via Bluetooth</h2><br/>Das w&auml;re ja auch eine Variante, ich k&ouml;nnte eine BT-Tastatur kaufen und muss dann nicht permanent irgendwelche Kabel anschlie&szlig;en wenn ich nach hause komme. Ich k&ouml;nnte einfach den (zu Akoya mitgelieferten) Dongle permanent dran lassen.

<p>Leider hab ich keine Ahnung wie die Dinger unter Linux unterst&uuml;tzt werden, alles was ich gefunden habe waren einige Forenbeitr&auml;ge von Leuten die Probleme damit hatten. Rein grunds&auml;tzlich scheint es aber zumindest zu gehen. Weiterhin hab ich dann auf der negativen Seite noch stehen dass ich damit wohl wieder permanent nach Akkus suchen werde. Wenn es dumm kommt l&auml;uft der Rechner dank neuem Akku (derzeit unter Linux ca. 8-9h, unter Windows noch ungetestet aber ich rechne mit 25% mehr) dann ohne Netz l&auml;nger als die Tastatur.</p>
<p>Nat&uuml;rlich l&ouml;st die Entscheidung dann auch mein Problem nicht: WELCHE BT-Tastatur?</p>
<p>Eine BT-Tastatur k&ouml;nnte ich auch ganz nett mit meinem Not-Book kombinieren, das derzeit als Mediaserver l&auml;uft. Die Reichweite ist zwar nicht sonderlich gro&szlig;, aber um von der Couch aus etwas bequemer das Lied zu wechseln (was ich momentan mit Akoya, ssh und <a href="http://nex.scrapping.cc/code/shell-fm/" target="_blank">shell-fm</a> mache, was sogar kleiner und leichter als eine komplette Tastatur sein k&ouml;nnte) sollte es reichen. Diverse Lirc-Hardware ist zwar vorhanden.. funktioniert aber eigentlich nie so wie es soll. -.-</p>
<p>In dem Bereich kann man sich dann auch gleich wieder h&auml;ssliche Kabel sparen, ich hab diese Problematik ja gerade so sch&ouml;n einged&auml;mmt gehabt.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1160" onclick="set_comment_reference(1160)" title="auf diesen Kommentar antworten">#1160</a>:
    26.Feb.2009 05:02
    von
    
      
        <a href="http://" target="_blank">
          doctorheils
        </a>
</p>
<p>Spannendes Thema. Ich brauch n&auml;mlich auch eine und habe keine Ahnung.</p>
<p>So eine mit Leuchten drinne w&auml;r schon was f&uuml;r mich ;)</p>

<p class="infos">
<a href="#comment_1161" onclick="set_comment_reference(1161)" title="auf diesen Kommentar antworten">#1161</a>:
    26.Feb.2009 06:02
    von
    
      
        <a href="http://codeschmie.de" target="_blank">
          fa
        </a>
</p>
<p>Wird jetzt zum Thema Akoya nicht viel helfen, aber meine Logitech G11 (erste Generation) ist die beste Tastatur, die ich je hatte.</p>

<p class="infos">
<a href="#comment_1162" onclick="set_comment_reference(1162)" title="auf diesen Kommentar antworten">#1162</a>:
    26.Feb.2009 07:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>nuja, grunds&auml;tzlich ja nicht ganz ungeeignet... die frage w&auml;re h&ouml;chstens wie gut sich die Tasten unter Linux verwenden lassen (da wird es sicher ein paar scripte von Nutzern geben  die man anpassen kann).</p>
<p>Ich habs zwar nicht ganz so mit diesen leuchtenden Tastaturen, aber ich vermute mal dass man das abstellen kann oder?</p>
<p>Wenn es ganz dumm kommt, geh ich auch einfach mal in nen Laden und lass mir ein paaar an akoya vorf&uuml;hren.</p>

<p class="infos">
<a href="#comment_1163" onclick="set_comment_reference(1163)" title="auf diesen Kommentar antworten">#1163</a>:
    26.Feb.2009 07:02
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>IBM MFII</p>
<p>hm. die sind alt!</p>
<p>Cherries fand ich auch ganz akzeptabel vom Tippgef&uuml;hl her.</p>

<p class="infos">
<a href="#comment_1164" onclick="set_comment_reference(1164)" title="auf diesen Kommentar antworten">#1164</a>:
    26.Feb.2009 08:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Naja, usb-anschluss sollte es schon haben.. wobei es glaube auch MFII mit usb gibt</p>

<p class="infos">
<a href="#comment_1165" onclick="set_comment_reference(1165)" title="auf diesen Kommentar antworten">#1165</a>:
    02.Mar.2009 10:03
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>Nicht schlagen ... ich liebe meine Appletastatur ^^'<br/>
Die neue Alutatte. Ich mag einfach den Druckpunkt, diese Cherry "ichversinkeimweichenGummiundkehrniewieder"Druckpunkte mag ich net.</p>
<p>Ich hab keinen Plan von Linux, unter windows kann ich per Keymapper die "zuvielen" Tasten an dem Dingen umfunktionieren wie ich es gern h&auml;tte.<br/>
Es gibt sie als USB und BT, habe sie jetzt glaube ich &uuml;ber ein Jahr und bislang noch nichts negatives daran aufgefallen.</p>

<p class="infos">
<a href="#comment_1166" onclick="set_comment_reference(1166)" title="auf diesen Kommentar antworten">#1166</a>:
    02.Mar.2009 10:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>nichts liegt mir ferner, als dich zu schlagen.. ich finde die apple-tastaturen sehen durchaus nicht schlecht aus und sind fast verwendbar.</p>
<p>Ist zwar nicht ganz so meins und ich finde auch f&uuml;r den Preis bieten andere Firmen teilweise mehr leistung, aber das ist halt Geschmackssache.</p>
<p>Momentan &uuml;berlege ich gleich ob ich mich Desktopm&auml;&szlig;ig nicht komplett neu ausstatten sollte, neue Tastatur, Maus (dann gleich mit etwas besserem Mousepad) und evtl. noch nen neuen Bildschirm.</p>
<p>Alles Sachen die ich schon ne weile mal haben wollte, bisher wars aber noch nicht wirklich dringend.</p>

<p class="infos">
<a href="#comment_1167" onclick="set_comment_reference(1167)" title="auf diesen Kommentar antworten">#1167</a>:
    03.Mar.2009 08:03
    von
    
      
        <a href="http://www.matworx.de" target="_blank">
          madda
        </a>
</p>
<p>Uh, alles neu macht der M&auml;rz ^^<br/>
diese Optimus Maximus von Lebedev finde ich ja als Idee sehr geil, aber das umgesetzte Konzept, die Vermaktung und der Preis sind dann doch ein klein wenig crank ^^'</p>

<p class="infos">
<a href="#comment_1168" onclick="set_comment_reference(1168)" title="auf diesen Kommentar antworten">#1168</a>:
    03.Mar.2009 08:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>naja, das Ding ist ja vom Konzept her ganz nett... aber sinnvoll finde ich das irgendwie nicht. Das Ding komplett unter Linux ansteuern zu k&ouml;nnen wird sicher aussichtslos sein, unter Windows wird der passende Treiber massig Ressourcen fressen und am Ende tippe ich blind und sehe nichtmal den Unterschied.</p>
<p>Da h&auml;tte man lieber sinnvolle Innovationen bringen k&ouml;nnen, z.B. eine sinnvollere Anordnung der Zusatztasten oder wie bei Akoya Bildlauftasten f&uuml;r die man nicht erst weg vom Hauptblock der Tastatur muss (allerdings nur zus&auml;tzlich, keinesfalls sollte man das allen Nutzern aufdiktieren).</p>
<p>Das w&auml;re doch &uuml;berhaupt mal was: eine Tastatur bei der sich alle Tasten umstellen lassen. Ich will Ctrl eine halbe taste nach rechts schieben? klar, kein problem! Ich will die Windows-Taste irgendwo hinter Backspace plazieren? ... (An dieser Stelle: Gru&szlig; an Toranor <em>g</em>)</p>

<p class="infos">
<a href="#comment_1169" onclick="set_comment_reference(1169)" title="auf diesen Kommentar antworten">#1169</a>:
    23.Mar.2009 11:03
    von
    
      
        <a href="http://blog.canuco.de" target="_blank">
          thorben
        </a>
</p>
<p>Ehrliche Frage: Wofuer brauchst du "print screen"?</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1170">
<p class="infos">
<a href="#comment_1170" onclick="set_comment_reference(1170)" title="auf diesen Kommentar antworten">#1170</a>:
    23.Mar.2009 12:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>kurze Antwort: Bildschirmphotos</p>
<p>Zugegeben,  momentan habe ich daf&uuml;r gerade eine andere Tastenkombination (unter Linux habe ich mir sowieso komplett andere Tastenbelegungen angew&ouml;hnt und eingestellt) und auch unter Windoof nutze ich seit Jahren eigentlich alternative Tools f&uuml;r sowas, aber damals (tm) war das richtig nervig.<br/>
Man will einfach nicht die falsche Taste dr&uuml;cken und dann ohne weitere Abfrage ausversehen den PC ausgeschalten haben. Das ist genauso sinnvoll wie der rie&szlig;ige Aus-Knopf am alten PC meines Vaters, den ich st&auml;ndig durch dagegenrollen mit dem Stuhl bet&auml;tigte. -.-</p>
</div>
</li>
</ul>
</div>