+++
title = "Back to LowTech"
date = "2009-01-12T01:01:00"
author = "Dr. Azrael Tod"
issoid = "blog/1170"
aliases = "blog/1170"
+++

<p>Fr&uuml;her war alles besser... Gut, das ist jetzt etwas sehr vereinfacht und &uuml;bertrieben ausgedr&uuml;ckt, aber zumindest die Computer waren fr&uuml;her besser. Jetzt werdet ihr sicher denken dass der alte DAT endg&uuml;ltig durchdreht, immerhin gibt es kaum einen Bereich der Technik in dem es so rasannte &Auml;nderungen an der Technik gab wie bei Computern.<!--more--></p>
<p>Wenn ich mir jedoch mal (v&ouml;llig abseits von CPU-Leistung oder Festplattenkapazit&auml;t) mein allererstes Notebook, ein Siemens Scenic 510AGP hernehmen w&uuml;rde und mit einem aktuellem Notebook in der selben Gewichtsklasse vergleiche, dann schl&auml;gt sich das noch immer nicht ganz schlecht.</p>
<p>Wie bereits in einem <a href="http://ugotit.de/2009/01/07/dockingstationen-fur-macbooks/comment-page-1/#comment-55" target="_blank">Kommentar auf diesem Blog</a> bemerkt gab es zum Scenic eine Dockingstation die erheblich besser funktioniert und mehr Funktionen bietet als fast alles was heute so f&uuml;r selbst die teuersten Notebooks verf&uuml;gbar ist:<br/></p><blockquote>1 x Seriell 9-polig, 1 x Parallel 25-polig<br/>2 x PS/2<br/>1 x ext. Monitor 15 pol., mit DDC1/2<br/>2 x PCMCIA<br/>1 x Line In + 1 x Lautsprecher + 1 x Mikrofon<br/>1 x Game/MIDI<br/>1 x Anschlu&szlig; f&uuml;r Notebook-Netzteil<br/>2 x USB</blockquote><br/>Nicht nur dass ich also wenn mein Notebook in der Station steht kein extra Stromkabel verlegen muss, auch der Bildschirm, die Tastatur, Maus, Lautsprecher, zus&auml;tzliche PCMCIA-Karten (Netzwerk?), Drucker, USB-Ger&auml;te... kurz: einfach ALLES war sofort angesteckt.

<p>Sucht heute mal eine Dockingstation die einen zus&auml;tzlichen Bildschirmanschluss bietet oder &uuml;ber die das Notebook extern mit Strom versorgt werden kann! &Uuml;berhaupt wird es schwer, etwas zu finden das mehr als die typischen USB-Ger&auml;te, die gerade mal einen USB-HUB und wenn es wirklich ganz luxori&ouml;s kommt dann noch 2 PS/2-Ports, bietet.</p>
<p>Aber auch die Grundausstattung des Notebooks sollte man beachten... immerhin wird sich bei weitem nicht jeder eine Dockingstation zu dem Ger&auml;t dazu gekauft haben.</p>
<p>Ein sehr sch&ouml;nes Detail war, finde ich, dass alles recht sch&ouml;n Modular gehalten wurde. So konnte man in die beiden Einsch&uuml;be an der Front des Notebooks jeweils einen Akku stecken und so die Laufzeit f&uuml;r bestimmte Tage verdoppeln, wenn man kein optisches Laufwerk brauchte. Jenes war n&auml;mlich ebenfalls als Einschub f&uuml;r die linke Seite ausgelegt und konnte jederzeit mit 2 Handgriffen ausgetauscht werden. CD-Laufwerk am einen Tag, Diskettenlaufwerk am n&auml;chsten und am &uuml;bern&auml;chsten kauft man sich ein neues DVD-Laufwerk und lann es auch als gr&ouml;&szlig;te technische Niete der Welt selbst einbauen. Auch das Netzteil konnte man dort einschieben und so direkt im Ger&auml;t mit sich rumtragen wenn man gerade mal nur minimale Hardware mitschleppen wollte.Der Stecker mit dem man es sonst an das Notebook von au&szlig;en angeschlossen hatte (oder halt an der Docking-Station) verschwand dazu schnell unter einer Klappe im Netzteil.</p>
<p>Die einzige &auml;hnlich leicht austauschbare Komponente wie diese Einsch&uuml;be, sind heute wohl die Akkus in Notebooks... es sei denn nat&uuml;rlich man ist stolzer Besitzer eines Ger&auml;tes von Apple.</p>
<p>Aber damit sind wir immer noch nicht am Ende.. Auch die Festplatte war sehr leicht auszutauschen. Dazu war sie in einem minimalistisch gehaltenen Laufwerksk&auml;fig aufgeh&auml;ngt, der einfach nur von der Seite her ins Notebook gesteckt war. Zwar wurde sie mit einer Schraube fixiert geliefert, doch auch ohne diese Schraube steckte die Festplatte recht fest im Geh&auml;use und man konnte so das Ger&auml;t sogar verwenden als w&auml;re es eine Wechselfestplatte wie man sie vom Desktop-PC her vlt. noch kennt.</p>
<p>Heutzutage hingegen machen viele Geh&auml;use auf mich den Eindruck dass die Hauptrichtlinie hinter der Entwicklung war "es muss billig sein". Dass daf&uuml;r viele Stellen einfach nicht so sinnvoll durchdacht wirken und man Stunden braucht, will man nur mal eben ein Laufwerk austauschen scheint den Herstellern egal.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1053" onclick="set_comment_reference(1053)" title="auf diesen Kommentar antworten">#1053</a>:
    12.Jan.2009 04:01
    von
    
      
        <a href="http://ag7.alltagsgrauen.info/" target="_blank">
          fwolf
        </a>
</p>
<p>Weswegen meine Wahl beim Netbook auch auf eines gefallen ist, das man leicht erweitern kann - sonst h&auml;tte ich mir auch was g&uuml;nstigeres als den Asus EeePC 1000H geg&ouml;nnt.</p>
<p>cu, w0lf.</p>

<p class="infos">
<a href="#comment_1054" onclick="set_comment_reference(1054)" title="auf diesen Kommentar antworten">#1054</a>:
    12.Jan.2009 06:01
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>Das das h&auml;ndische basteln an der Hardware zu Zeiten der Gewinnmaximierungs-Krankheit nicht im Sinne der Verk&auml;ufer ist, ist doch nur logisch oder ?</p>

<p class="infos">
<a href="#comment_1055" onclick="set_comment_reference(1055)" title="auf diesen Kommentar antworten">#1055</a>:
    12.Jan.2009 07:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>&Ouml;hm.. wieso? Wenn ich daran denke, was eines dieser Laufwerke (einfach ein normales, genormtes Notebooklaufwerk mit etwas Plastik ringsrum um es im Einschub zu halten) gekostet hat, dann ist sowas sicher auch keine schlechte Einnahmequelle.<br/>
Es gibt ja auch genug andere Industriezweige die durch Zubeh&ouml;r mehr verdienen als durch die "Hauptartikel".</p>

<p class="infos">
<a href="#comment_1056" onclick="set_comment_reference(1056)" title="auf diesen Kommentar antworten">#1056</a>:
    13.Jan.2009 08:01
    von
    
      
        <a href="http://www.bunix.de" target="_blank">
          reaper
        </a>
</p>
<p>Ja aber wenn ich heute f&uuml;r ein alternatives Laufwerk fast soviel bezahlen muss wie f&uuml;r ein neues Notebook. Hmm was kauf ich mir denn da :P Aber mit dem Billig-Billig Wahn hast du recht, nur was erwartet man denn f&uuml;r 299 Euro.</p>
<p>Wenn ich meine aktuelle Denkmatte mit meiner alten vergleiche dann sind die Einsparungen ohne weiteres zu erkennen. Das Teil ist immernoch super verarbeitet aber kein Vergleich zum Model von vor 7 Jahren.</p>
</div>