+++
title = "Wertdichte"
date = "2015-08-31T11:08:00"
author = "Dr. Azrael Tod"
tags = ["Kulturflatrate", "Nerdig", "Politik", "Pseudoargumente", "Technik", "Telefon"]
issoid = "blog/1625"
aliases = "blog/1625"
+++

<p>Ich habe gerade eine microSD-Karte gekauft.<br/>Es ist eine Version mit 128GB Speicherplatz.<br/>Ich h&auml;tte auch 200GB bekommen k&ouml;nnen.</p>
<p>Wenn wir 192KBit/s OGG Vorbis (oder MP3) nehmen und Musik 'drauf spielen, dann reicht das f&uuml;r:<br/></p><blockquote>96 days 10 hours 48 minutes 53.33 seconds</blockquote>
<p>Wie lang ist ein Lied?<br/>Generell meint man irgendwas um die 3 Minuten, aber seit den 80ern sind es im Durchschnitt wohl eher 3,5 bis 4.<br/><a href="https://plot.ly/~RhettAllain/131/average-song-length/" title="Link: Average Song Length"><img alt="Entwicklung der durchschnittlichen Liedl&auml;nge &uuml;ber die letzten Jahrzehnte" src="http://g33ky.de/static/images/information/song_length.png"/></a></p>
<p>Rechnen wir einfach mal mit 4 Minuten pro Lied! Immerhin geht ja sonst noch einiges an Verwaltungsdaten drauf und runden ist genau genug f&uuml;r uns.</p>
<p>Das bedeutet auf die Speicherkarte passen ca. 34.722 Lieder.</p>
<p>Ein Lied kostet &uuml;blicherweise ca. 1&euro; als Download.</p>
<p>Als Album sind meist eher ein Dutzend Lieder f&uuml;r 5&euro; zu haben, als Sampler auch mal 20 (einzeln bekanntere) Lieder f&uuml;r 5&euro; und einzelne Lieder kosten h&auml;ufig eher 1,30&euro; oder gar 2&euro;, aber f&uuml;r unsere Zwecke reicht wieder ein typischer N&auml;herungswert. Es geht um die Gr&ouml;&szlig;enordnung, nicht um genaue Werte.</p>
<p>Das bedeutet auf eine Speicherkarte passen mal eben locker 30.000&euro; an digitaler Musiksammlung.</p>
<p>Laut <a href="https://de.wikipedia.org/wiki/MicroSD#Eigenschaften">Wikipedia</a> wiegt eine microSD-Karte ca. 0,25g. Das k&ouml;nnte ich jetzt versuchen nachzumessen, aber genauer wird es dann, aufgrund meiner ungeeigneten Werkzeuge, sicher nicht.</p>
<p>Ein Gramm Speicherkarten l&auml;sst sich also mit ca. 0,1 Millionen Euro bef&uuml;llen.</p>
<p>Anders ausgedr&uuml;ckt: 100 Millionen Euro pro Kg</p>
<p></p><h3>&Uuml;berfl&uuml;ssig</h3><br/>Fr&uuml;her war es mal Mode Rekorde zu sammeln was denn die teuerste Fl&uuml;ssigkeit pro ml sein soll:

<p><img alt="HP Black #45 ist teuer" src="/static/images/information/tinte.png"/></p>
<p></p><ul><li>Roh&ouml;l 0,25 &euro; pro Liter</li><li>Penicillin $80 pro Liter</li><li>Menschliches Blut ~ $400 pro Liter (nat&uuml;rlich sehr Blutgruppenabh&auml;ngig)</li><li>Druckertinte HP Black #45 - unterschiedlichste Angaben, gerne um 500 bis 1500&euro; pro Liter (ich habe gerade bei Amazon HP Black #21 f&uuml;r 2960&euro; pro Liter gefunden)</li><li>Champagner der 1928er Krug Collection (<a href="https://www.classicdriver.com/de/article/krug-champagner-rekordpreis-f%C3%BCr-jahrgang-1928">bei einer Versteigerung 2006</a>) ca. 21.000&euro;/l</li><li>ein paar Flaschen Whiskey (irisch) der Destillerie "Nun&rsquo;s Island", gebrannt im sp&auml;ten 19. Jahrhundert, wurde 2002 mal f&uuml;r ca. $140.000 pro Flasche (genaue F&uuml;llmenge unklar) verkauft</li><li>bestimmte Schlangengifte k&ouml;nnen bis zu 16.000.000&euro;/l kosten</li><li>hochkonzentrierte L&ouml;sungen von <a href="https://de.wikipedia.org/wiki/Pyrophosphatase" target="_blank">Pyrophosphatase (Enzym)</a> wurden zeitweise angeblich f&uuml;r  60.000.000&euro;/l gehandelt (leider keine guten Quellen gefunden)</li></ul>
<p>Ja, &micro;SD-Karten sind keine Fl&uuml;ssigkeit (aber Sch&uuml;ttgut), nehmen wir aber die Gr&ouml;&szlig;e (11 mm &times; 15 mm &times; 0,7 mm), kommen wir zumindest auf ein Volumen von 0,1155 ml. Wir werfen das Zeugs einfach in die gleiche Menge &Ouml;l (nein, nicht Wasser) und behaupten es w&auml;re eine Emulsion.</p>
<p>Ohne &Ouml;l: 30.000&euro; pro 0,1155 ml -&gt; 259,74 Millionen Euro pro Liter<br/>50% &Ouml;l: noch immer 130 Millionen &euro; pro Liter</p>
<p>Wir haben also mit Dingen die wir bei Amazon kaufen k&ouml;nnen eine Fl&uuml;ssigkeit hergestellt die fast genau so teuer ist wie die sonst "teuerste Fl&uuml;ssigkeit der Welt"</p>
