+++
title = "Kein OpenSource unter Windows"
date = "2009-05-13T09:05:00"
author = "Dr. Azrael Tod"
tags = ["\"Freie\" Software"]
issoid = "blog/1395"
aliases = "blog/1395"
+++

<p>Hiermit stelle ich mal die These in den Raum dass OpenSource niemals bei Windows-Nutzern angekommen ist. Es werden Erzeugnisse aus dieser Bewegung genutzt, vlt. schreibt auch mal jemand ein eigenes Programm und klebt den Aufkleber drauf, aber keiner denkt auch nur daran es sinnvoll zu verwenden. Alles was in der Windows-Welt genutzt wird ist Freeware.<!--more--></p>
<p>Aufgefallen ist mir dies als ich neulich <a href="/2009/05/04/because-i-can!/" target="_blank">meinen neuen Spiele-PC</a> (Codename: "<a href="http://en.wikipedia.org/wiki/WOPR" target="_blank">WOPR</a>") als ersten seit einem halben Jahrzehnt freiwillig mit Windows bespielt habe und ich angefangen habe nach 64Bit-Software zu suchen. Wozu 64Bit? Mein Rechner hat mit seinen 4GB RAM bereits genug Arbeitsspeicher um allein damit den Adressbereich eines 32-Bit-Systems komplett zu f&uuml;llen... Wenn ich nicht sinnlos Ressourcen brachliegen lassen will muss ich nat&uuml;rlich die erweiterten F&auml;higkeiten meiner CPU verwenden. Warum auch nicht? Immerhin sind solche Gr&ouml;&szlig;en des RAMs heutzutage bei neu verkauften PCs so ziemlich Standard und auch die meisten CPUs (fast alle f&uuml;r Desktop-Rechner) beherrschen den Befehlssatz. Man sollte also davon ausgehen k&ouml;nnen dass man langsam damit arbeiten k&ouml;nnen sollte.</p>
<p>Unter Linux gibt es auch eigentlich keine Probleme... ich lege mir die entsprechende CD meiner Lieblingsdistribution ein und bekomme alles m&ouml;gliche an Software sch&ouml;n vorcompiliert gleich mitgeliefert. Auch wenn ich mir zus&auml;tzliche Software ohne Einbindung in die Paketverwaltung installieren will habe ich noch lange kein Problem. F&uuml;r Debian/Ubuntu gibt es z.B. heute an jeder Ecke die Software direkt als .deb mit x64&lt;-Binaries (ich kenne kein gr&ouml;&szlig;eres Projekt dass nur die alten Binaries anbietet) und wenn es wirklich mal garnichts gibt muss ich mir halt wie unter normalen x86er-Systemen den Quellcode selbst compilieren.</p>
<p>Auch in der Windows-Welt ist es kein Problem an ein entsprechendes Betriebssystem zu kommen. Microsoft tauscht sogar meistens die CD/DVD um, wenn man eine 32er Version hat und nun doch lieber die 64er installieren will. Auch die dort mitgelieferten Programme sind neu compiliert worden und liegen in 64bit vor. Ich wei&szlig; zwar nicht direkt was ich von Paint in dieser Version habe, aber ich kann es zumindest nativ laufen lassen.<br/>Nichtmal mehr die Treiber werden zum Problem.</p>
<p>Wenn man dann jedoch anfangen will irgendwelche Programme zu installieren, wird es d&uuml;ster. Alles was man bekommt sind die Standard-Binaries wie sie unter allen Systemen laufen. Wenn &uuml;berhaupt verschiedene Versionen angeboten werden, dann nach XP und Vista unterschieden, evtl. mal noch Sachen f&uuml;r 95/98/Me (SEEEEHR sinnvoll, vor allem wenn man bedenkt wie gro&szlig; die Unterschiede f&uuml;r Anwendungen zwischen XP und Vista sind).</p>
<p>Wenn man jetzt nach OpenSource-Software sucht, wird man genau das selbe Problem haben. Es gibt schlicht niemanden der sich mal hingesetzt hat und diverse Programme einfach nochmal durch einen Compiler gejagt hat. Warum nicht? Es ist OpenSource! Man kann das tun!<br/>Unter Windows ist es jedoch &uuml;blich dass Software von genau einer Person compiliert wird: demjenigen der sie geschrieben hat. Man findet nichtmal eine funktionierende Version von Firefox/Chrome/Safari/Opera, OpenOffice oder VLC (wenigstens gibt es <a href="http://mpc-hc.sourceforge.net/Vista64.html" target="_blank">eine Version von Mediaplayer Classic</a>). Die Haltung "You should be able to use the regular 32-bit version without problems." scheint derartig weit verbreitet dass man sich fragt ob die ganze Branche permanent unter Drogen steht.</p>
<p>Nat&uuml;rlich kann ich die Abw&auml;rtskompatibilit&auml;t nutzen ohne ernste Probleme zu haben... ich kann aber auch alles sch&ouml;n mit 8-Bit DOS1-Programmen erledigen und mit DOSbox emulieren. ICH WILL ES NUR NICHT!</p>
<p>Wenn das so weiter geht, wird in 5-10 Jahren "compilieren" im Amerikanischen Fernsehen genauso ausgepiept wie "ficken". Es ist immerhin auch eine T&auml;tigkeit die man nur hinter verschlossenen T&uuml;ren ausf&uuml;hrt und &uuml;ber die man in der &Ouml;ffentlichkeit nicht spricht. Eigentlich schade, wenn nicht alle immer nur passende Software von MS kaufen w&uuml;rden und auch Endnutzer mal entsprechende Software in die Hand bekommen m&uuml;ssten h&auml;tten wir sonst vlt. auch schon Projekte mit denen auch $DAU sowas schafft (Programm starten, Projektdatei &ouml;ffnen, "compile" dr&uuml;cken, fertig).<br/>Wobei nat&uuml;rlich klar ist dass Microsoft das nicht will... wenn man die Vorteile von OpenSource weiter der &Ouml;ffentlichkeit vorenthalten kann und sich nur ein paar Geeks damit besch&auml;ftigen kann man vlt. auch weiterhin ein paar Versionen der Hauseigenen Software mehr verkaufen. Au&szlig;erdem ist es sicher sehr lukrativ wenn der Compiler nicht immer zum System dazu geliefert wird und jeder erstmal eigenst&auml;ndige Software kaufen muss.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1280" onclick="set_comment_reference(1280)" title="auf diesen Kommentar antworten">#1280</a>:
    13.May.2009 09:05
    von
    
      
        <a href="http://malison.org" target="_blank">
          Carsten M&uuml;ller
        </a>
</p>
<p>Ich glaube das der Typische Windows-User mit ein wenig mehr Sachverstand und Verst&auml;ndnis f&uuml;r den Unterschied zwischen 32Bit und 64Bit kein Vertrauen in compilierte Software aus einer Fremdquelle h&auml;tte. Und dem Rest ist es einfach egal und die wissen eh nicht ob sie da ein 32Bit oder 64Bit Windows laufen haben...</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1281">
<p class="infos">
<a href="#comment_1281" onclick="set_comment_reference(1281)" title="auf diesen Kommentar antworten">#1281</a>:
    13.May.2009 10:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Warum sollte eine Fremdquelle weniger vertrauenserweckend sein als die "offiziellen" Projekte von diverser OpenSource-Software? Besser noch... ich glaube durchaus dass es m&ouml;glich w&auml;re die 64Bit-Compilate auf den gleichen Servern zu hosten die die anderen Versionen anbieten. Es m&uuml;sste sich halt nur jemand hinsetzen und das Zeugs bauen. Aber das tut nunmal keiner.</p>
<p>Ich glaube auch nicht dass ein durchschnittlicher Nutzer bemerkt ob er Vista oder XP hat.. er verwendet halt Windows oder noch besser PC. "Gibt es etwa etwas anderes?"<br/>
Dennoch gibt es an jeder Ecke Versionen f&uuml;r die verschiedenen Windows-Varianten.</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1282" onclick="set_comment_reference(1282)" title="auf diesen Kommentar antworten">#1282</a>:
    14.May.2009 08:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Nachtrag: Firefox gibt es doch f&uuml;r 64Bit<br/>
Ich werde aber wohl dennoch bei Chrome bleiben.</p>
<p>von Miranda IM gibts auch eine sehr instabile Testversion</p>

<p class="infos">
<a href="#comment_1283" onclick="set_comment_reference(1283)" title="auf diesen Kommentar antworten">#1283</a>:
    14.May.2009 08:05
    von
    
      
        <a href="http://malison.org" target="_blank">
          Carsten M&uuml;ller
        </a>
</p>
<p>@Azrael: Weil der Virensensibilisierte Windows User jahrelang darauf trainiert wurde nur Software aus offiziellen Quellen zu installieren.</p>

<p class="infos">
<a href="#comment_1284" onclick="set_comment_reference(1284)" title="auf diesen Kommentar antworten">#1284</a>:
    14.May.2009 08:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>&auml;hm? und wer tut das? bzw. wie kommst du darauf dass es sowas wie "offizelle Quellen" gibt?</p>
<p>Signaturen w&auml;ren eine M&ouml;glichkeit... aber erstens nutzt die keine Sau und andernseits klicken eh alle Windoof-Nutzer die Fenster weg.<br/>
Der virensensibilisierte Windows-Nutzer ist imho ein ger&uuml;cht... und kein sehr glaubhaftes.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1285">
<p class="infos">
<a href="#comment_1285" onclick="set_comment_reference(1285)" title="auf diesen Kommentar antworten">#1285</a>:
    14.May.2009 10:05
    von
    
      
        <a href="http://malison.org" target="_blank">
          Carsten M&uuml;ller
        </a>
</p>
<p>Naja eine Quelle f&uuml;r den Firefox, w&auml;ren die Seiten von Mozilla. Dies w&auml;re dann eine offizielle Quelle :) Biete ich allerdings eine selbst compillierte Variante auf meiner eigenen Webseite an w&auml;re das keine Offizielle Quelle, h&ouml;chstens f&uuml;r meine Selbstcompillierte Version...</p>
<p>Und das es sich bei einem Virensensibilisierten Windows User nur um ein Ger&uuml;cht handelt glaub ich nicht. Du selbst bist doch als Windows User sicher erfahren genug um nicht einfach jede Software von irgendwo auf deinen Rechner zu ziehen und sie zu installieren. Das die breite Masse das anders handhabt mag sein aber wir wollen doch nicht alle &uuml;ber einen Kamm sch&auml;ren :)</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1286">
<p class="infos">
<a href="#comment_1286" onclick="set_comment_reference(1286)" title="auf diesen Kommentar antworten">#1286</a>:
    14.May.2009 11:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Das ist eben der Denkfehler... es geht um OpenSource, nur weil Mozilla die gr&ouml;&szlig;ere Firma ist, bedeutet dass noch lange nicht dass es sich um eine offizielle Quelle handelt. Wenn dem so w&auml;re, w&auml;re dann Iceweasel nicht aus einer offiziellen Quelle?<br/>
Oder nehmen wir mal pyChao... daf&uuml;r gibt es dann wohl keine offizielle Quelle, da &uuml;berhaupt keine Firma hinter dem Projekt steht?</p>
<p>Alles wonach die Nutzer in der Realit&auml;t gehen ist doch die positionierung bei Google und das Aussehen der Seite. Wenn ich meine Seite h&uuml;bscher gestalte und bei Google auf Platz 1 lande kann es verdammt schnell passieren dass mehr Leute G33KY Firefox runterladen als Mozilla Firefox.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1287">
<p class="infos">
<a href="#comment_1287" onclick="set_comment_reference(1287)" title="auf diesen Kommentar antworten">#1287</a>:
    14.May.2009 12:05
    von
    
      
        <a href="http://malison.org" target="_blank">
          Carsten M&uuml;ller
        </a>
</p>
<p>Entschuldige das ich dir wiederspreche, aber du hast da einen Denkfehler. Die Offizielle Quelle f&uuml;r pyChao w&auml;re deine Webseite, als Initiator. Da muss keine Firma dahinter stecken, diese &Uuml;berlegung w&auml;re auch v&ouml;llig abwegig. Was auch in Sachen Mozilla falsch ist da es sich nicht um eine Firma sondern um eine Foundation handelt ergo eine Non-Profit Organisation &auml;hnlich einem Deutschen e.V.</p>
<p>Und nur weil irgend etwas OpenSource ist heisst das nicht das es davon keine Offiziellen Quellen gibt. Auf <a href="http://Kernel.org" rel="nofollow">Kernel.org</a> finde ich zbsp. den Mainline-Kernel, diese Seite ist daf&uuml;r die Offizielle Quelle. Such ich allerdings die Sourcen f&uuml;r den Debian Kernel muss ich auf <a href="http://debian.org" rel="nofollow">debian.org</a> schauen.</p>
<p>Und nur weil ich den Mainline Kernel auch von anderen Quellen beziehen kann heisst das nicht das <a href="http://kernel.org" rel="nofollow">kernel.org</a> nicht die offizielle Quelle f&uuml;r den Linux Kernel ist.</p>
<p>Was die Sache mit Google betrifft stimme ich dir zu, deshalb warnt OpenOffice auf ihrer Seite auch davor die Software von anderen Quellen runterzuladen.</p>
</div>
</li>
</ul>
</div>
</li>
</ul>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1288" onclick="set_comment_reference(1288)" title="auf diesen Kommentar antworten">#1288</a>:
    14.May.2009 12:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Wenn der Initiator die offizielle Quelle ist, dann darfst du deinen Firefox aber nur bei Netscape runterladen ;-)</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1289">
<p class="infos">
<a href="#comment_1289" onclick="set_comment_reference(1289)" title="auf diesen Kommentar antworten">#1289</a>:
    14.May.2009 01:05
    von
    
      
        <a href="http://malison.org" target="_blank">
          Carsten M&uuml;ller
        </a>
</p>
<p>Na wenn du dich auf diese Basis begeben willst dann m&uuml;sstest du schon sagen das ich meinen Firefox nur von der NCSA beziehen darf... Denn auch der Netscape Navigator basiert "nur" auf dem NCSA Mosaic. Aber da du ja schonmal was von einem Fork geh&ouml;rt hast wirst du dich ja sicher nicht auf diese Basis begeben wollen :)</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1290">
<p class="infos">
<a href="#comment_1290" onclick="set_comment_reference(1290)" title="auf diesen Kommentar antworten">#1290</a>:
    14.May.2009 01:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Das ist eben genau die Aussage die ich formulieren wollte... es gibt keine offizielle Version bei OpenSource, da der Code niemandem geh&ouml;rt.<br/>
Jeder kann sich den Code bauen und seine eigene Version ver&ouml;ffentlichen. Firefox ist in dem Fall vlt. gerade ein schlechtes Beispiel da der Name und diverse Logos nicht unter einer offenen Lizenz stehen (daher ja auch die Probleme mit Debian und ihrem Iceweasel), aber prinzipiell k&ouml;nnte JEDER eine eigene Version von einem OS-Projekt forken, irgendwas dran &auml;ndern und h&auml;tte damit eine Version die nicht minder(/mehr) offiziell ist als die vorherige.</p>
<p>Wenn du also sagst dass man keine Software aus inoffiziellen Quellen beziehen soll, dann ist das eigentlich schon daher Bl&ouml;dsinn weil du in diesem flie&szlig;endem &Uuml;bergang nie bestimmen kannst was offiziell ist und was nicht. Der &Uuml;bergang ist einfach zu flie&szlig;end.<br/>
Ist die Variante von <a href="http://mozilla-x86-64.com" rel="nofollow">mozilla-x86-64.com</a> ein Fork (sie haben fast nichts am Code ge&auml;ndert)?  Ist Iceweasel ein eigenst&auml;ndiges Programm (der Code enth&auml;llt &auml;nderungen und darf nicht mehr unter dem Namen Firefox verteilt werden, wird aber dennoch regelm&auml;&szlig;ig mit dem Repo von Mozilla abgeglichen)? Ist Flock nur eine weitere Version von Firefox/Netscape/Mosaic/wasauchimmer?</p>
<p>Man kann evtl. so argumentieren dass ich in dem Moment ein eigenes Programm erschaffe in dem ich von mir ge&auml;nderten Code compiliere, aber was machst du dann bei Leuten die ihre eigene Version aus ihrem privaten GIT-Repo bauen? Verwenden die dann alle keinen Firefox oder Linux-Kernel mehr? Ist nur das "Original" was der Distributor/Repository-Admin des urspr&uuml;nglichen Projektes abgesegnet hat?</p>
<p>Sp&auml;testens wenn man sich die Verwirrungen die z.B. bei Compiz/Berryl/Compiz Fusion aufgetreten sind ansieht, bemerkt man dass OpenSource-Projekte keine gerade Linie bilden "Wir implementieren Feature X, dann Feature Y..." sondern Code auch zwischen Projekten verschoben wird, ganze Teile ausgetauscht werden und wirklich aktive Projekte auch permanent geforkt und wieder gemerged werden.</p>
<p>Sprich: Es gibt keine offizielle Version bei OpenSource</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1293">
<p class="infos">
<a href="#comment_1293" onclick="set_comment_reference(1293)" title="auf diesen Kommentar antworten">#1293</a>:
    14.May.2009 03:05
    von
    
      
        <a href="http://malison.org" target="_blank">
          Carsten M&uuml;ller
        </a>
</p>
<p>Ich hab nicht gesagt das man keine Software aus offiziellen Quellen beziehen SOLL ich hab nur gesagt das einige der Virentrainierten Windows User dies nicht tun werden sondern auf die offiziellen Quellen zugreifen w&uuml;rden.</p>
<p>Ich glaube wir reden aneinander vorbei. Ich geb dir ja in soweit recht aber das ist nicht der Kern meiner Aussage. Versuchen wirs anhand eines anderen Beispiels:</p>
<p>Ich kaufe mir ein Auto. Das kann ich direkt tun (Offizielle Quelle), oder &uuml;ber einen authorisierten H&auml;ndler (Offizieller Mirror) oder aber auch &uuml;ber jemand Privat. In allen F&auml;llen kaufe ich das gleiche Fahrzeug. Nur wer sagt mir zum Beispiel das der Private nicht dran rumgepfuscht hat? Um das auszuschliessen m&uuml;sste ich das komplette Fahrzeug auseinander nehmen und pr&uuml;fen.</p>
<p>Genauso verh&auml;llt es sich zbsp mit dem Firefox. Da du meinst das es den meisten egal ist wird sich also auch niemand die M&uuml;he machen und den Quellcode eines Firefox pr&uuml;fen der auf irgendeiner inoffiziellen Quelle angeboten wird. Da die meisten das nicht mal bei dem Code tun der auf den offiziellen Seiten angeboten wird.</p>
<p>Und ich kann deine Aussage nicht unterschreiben das es keine offiziellen Versionen von OpenSource gibt.</p>
<p>Sobald ich meinen Code unter eine OpenSource Lizenz stelle und ver&ouml;ffentliche ist dieser Code offiziell. Und damit gibt es eine offizielle Seite.</p>
<p>Was danach mit dem Code passiert ob er geforkt oder nicht geforkt wird. Ob jemand den Code in eigene Programme einbindet oder nicht, &auml;ndert nix an der Sache im Allgemeinen.</p>
<p>Und das ganze wird umso prek&auml;rer wenn es sich um vorcompillierte Software handelt. Da gehts n&auml;mlich auch ein wenig um Haftung. Wenn ich einen FF von deiner Webseite herrunterlade der mir beim installieren die Festplatte l&ouml;scht, als Beispiel, dann werde ich mich sicher nicht erst an das Mozilla Projekt wenden sondern an dich denn von deiner Seite hab ich den FF ja.</p>
<p>Deine Sonstigen Ausf&uuml;hrungen teile ich da will ich dir auch nicht widersprechen, aber ich glaube du vermischst da einiges was nicht vermischt werden soll.</p>
<p>Was die Sache mit IceWeasel betrifft, diese &Auml;nderung betraf ja vorallem die Lizenz der Icons und das Verhalten bei eingereichten Patches.</p>
</div>
</li>
</ul>
</div>
</li>
</ul>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1291" onclick="set_comment_reference(1291)" title="auf diesen Kommentar antworten">#1291</a>:
    14.May.2009 02:05
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          sirsnookie
        </a>
</p>
<p>da muss ich dem guten Dr Azrael Tod zustimmen.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1292">
<p class="infos">
<a href="#comment_1292" onclick="set_comment_reference(1292)" title="auf diesen Kommentar antworten">#1292</a>:
    14.May.2009 02:05
    von
    
      
        <a href="http://malison.org" target="_blank">
          Carsten M&uuml;ller
        </a>
</p>
<p>Bei was genau?</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1294">
<p class="infos">
<a href="#comment_1294" onclick="set_comment_reference(1294)" title="auf diesen Kommentar antworten">#1294</a>:
    14.May.2009 03:05
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Bei alles! Auch Scharf!</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1295">
<p class="infos">
<a href="#comment_1295" onclick="set_comment_reference(1295)" title="auf diesen Kommentar antworten">#1295</a>:
    14.May.2009 03:05
    von
    
      
        <a href="http://malison.org" target="_blank">
          Carsten M&uuml;ller
        </a>
</p>
<p>In Farbe und Bunt?</p>
</div>
</li>
<li>
<div class="comment" id="comment_1296">
<p class="infos">
<a href="#comment_1296" onclick="set_comment_reference(1296)" title="auf diesen Kommentar antworten">#1296</a>:
    14.May.2009 04:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Deitsche welle polen!</p>
</div>
</li>
</ul>
</div>
</li>
</ul>
</div>
</li>
</ul>
</div>