+++
title = "Layer-Ads"
date = "2008-07-22T09:07:00"
author = "Dr. Azrael Tod"
issoid = "blog/495"
aliases = "blog/495"
+++

<p>Meckator stellt sich gerade mal wieder <a href="http://meckator.de/2008-07-22/lohnt-sich-layer-ads/" target="_blank">die Frage nach dem Sinn</a> der <a href="http://de.wikipedia.org/wiki/Internetwerbung#Layer_Ad" target="_blank">selbigen</a> und stellt fest dass er durch sie verdammt wenig verdient aber viel Aufwand f&uuml;r seine Besucher erzeugt.<!--more--></p>
<p>Werbung die die Besucher nervt wird sich meiner Meinung nach NIE lohnen solange man keine Inhalte oder Leistungen liefern kann die die Besucher nicht oder nur zu erheblich h&ouml;herem Aufwand (Geld?) auch woanders erhalten k&ouml;nnen.<br/>Sprich: Im Fernsehen mag das bis zu gewissen Grenzen gehen (auch wenn ich diese Grenze seit l&auml;ngerem bei immer mehr Leuten erreicht sehe), im Internet wird es erheblich schwerer.<br/>Layer-Ads empfinden viele als starke St&ouml;rung, umso schlimmer wenn Spielereien wie eine versteckten Link zum ausblenden der Werbung eingesetzt werden.<br/>Nat&uuml;rlich kann man mit derartigen Variationen den Anteil derer erh&ouml;hen die (in diesem Fall aus versehen) auf die Werbung klicken, diese Hits werden nat&uuml;rlich auch vom Werbenden registriert, das Produkt zu verkaufen wird mit derartigen Klicks jedoch eher weniger erreicht werden da die Nutzer die nervigen Seiten auch eher schlie&szlig;en werden.</p>
<p>F&uuml;r den Seitenbetreiber bedeutet das Ganze so nebenbei auch noch einige Nutzer (wie mich) die diese Seiten absofort komplett meiden werden, dies kann kaum im Sinn des Autors sein.</p>
<p>Also liebe Webmaster: &Uuml;berlegt euch noch einmal ob dies die gute Einnahmequelle ist die ihr w&uuml;nscht oder ob etwas unaufdringliches, auf das die Nutzer klicken weil sie die Inhalte interessieren, nicht doch sinnvoller scheint.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_379" onclick="set_comment_reference(379)" title="auf diesen Kommentar antworten">#379</a>:
    23.Jul.2008 03:07
    von
    
      
        <a href="http://sieghai.wordpress.com/" target="_blank">
          gabrielstagebuch
        </a>
</p>
<p>Layer Das sind der pure schei&szlig;. So welche seiten sind bei mir genauso schnell weggeklickt wie viva oder mtv mit seiner &uuml;berm&auml;&szlig;igen yamba werbung.</p>

<p class="infos">
<a href="#comment_380" onclick="set_comment_reference(380)" title="auf diesen Kommentar antworten">#380</a>:
    23.Jul.2008 11:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Naja.. oder generell geblockt... gibt ja genug m&ouml;glichkeiten. :-) (die ich z.B. nutze)</p>

<p class="infos">
<a href="#comment_381" onclick="set_comment_reference(381)" title="auf diesen Kommentar antworten">#381</a>:
    23.Jul.2008 11:07
    von
    
      
        <a href="http://blog.b-o-f-h.net" target="_blank">
          Thorsten
        </a>
</p>
<p>Es scheint genug abzuwerfen, genau wie bei Viva und MTV. Wobei das bei Viva und MTV ja ein Teufelskreis ist, weniger Quote bedeutet billiger Werben, bedeutet mehr dumme Klingeltonwerbung...</p>

<p class="infos">
<a href="#comment_382" onclick="set_comment_reference(382)" title="auf diesen Kommentar antworten">#382</a>:
    24.Jul.2008 08:07
    von
    
      
        <a href="http://crackpod.bplaced.net/" target="_blank">
          CracKPod
        </a>
</p>
<p>L&ouml;sung hei&szlig;t Adblock Plus und Mozilla Firefox nat&uuml;rlich.</p>

<p class="infos">
<a href="#comment_383" onclick="set_comment_reference(383)" title="auf diesen Kommentar antworten">#383</a>:
    24.Jul.2008 08:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ja, ich nehm das selbe... wobei NoScript f&uuml;r diese Anwendung genauso gut funktioniert aber imho etwas schlechter zu bedienen ist.</p>
</div>