+++
title = "Homeservergehäuse"
date = "2008-09-05T07:09:00"
author = "Dr. Azrael Tod"
issoid = "blog/689"
aliases = "blog/689"
tags = ["Dresden", "Gadget", "Hardware", "Nerdig", "PC", "Technik", "Homeservergehäuse"]
+++

<p>Ich werde mich nun endlich mal daran machen, f&uuml;r meinen kleinen Homeserver ein neues Geh&auml;use zu bauen. Bisher steckte mein Mini-ITX-Motherboard noch in einem Miditower-Geh&auml;use von der Stange (was mich schon seit Monaten st&ouml;rt) doch in der neuen Wohnung hab ich keinen passenden Platz f&uuml;r diese Kiste gefunden.</p>
<p>Unter dem Fernsehschr&auml;nkchen ist jedoch an der R&uuml;ckseite eine Ecke mit dreieckigem Grundriss frei (jeweils 39cm Kantenl&auml;nge au&szlig;en, Innenkante 54cm und 71cm hoch). Diese Ecke ist nicht nur vom Volumen her ziemlich ausreichend f&uuml;r das Motherboard, Netzteil und meine 2-3 Laufwerke, sie liegt auch noch ideal.<!--more--> So kann ich durch ein Loch in der R&uuml;ckwand auch gleich das Videokabel vom N64 durch zur Fernsehkarte legen. Die Umschaltbox f&uuml;r den Bildschirm liegt auch gleich oben dr&uuml;ber. (Evtl. sollte ich die aber auch gleich einbauen und die ganze Ecke verschlie&szlig;en.)</p>
<p>Nat&uuml;rlich ist ein Dreieckiger Grundriss nicht gerade die &uuml;blichste Variante f&uuml;r Computergeh&auml;use, also bleibt mir nichts anderes &uuml;brig als eine L&ouml;sung komplett von Grund auf zu improvisieren.</p>
<p>Derzeit scheinen mir 2 M&ouml;glichkeiten als sinnvoll:</p>
<p>Entweder ich bestell mir Nirosta-Bleche, komplett gestanzt und abgekanntet (habe da eine Quelle in der Verwandschaft), diese m&uuml;ssten jedoch schon verdammt genau gestanzt sein damit z.B. die Fernsehkarte rein passt.</p>
<p>Alternativ k&ouml;nnte ich mir etwas mit Glasfasernetzen und Kunstharz laminieren.</p>
<p>Beides hat jeweils seinen eigenen Charm, doch f&uuml;r beide L&ouml;sungen sind erstmal die n&auml;chsten Schritte gleich: Alles Ausbauen, jedes Bauteil ausmessen und &uuml;berlegen wie ich das ganze Zeug im Geh&auml;use verteilen will.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_532" onclick="set_comment_reference(532)" title="auf diesen Kommentar antworten">#532</a>:
    05.Sep.2008 07:09
    von
    
      
        RobVinc
      
    
    
  </p>
<p>K&ouml;nntest ja erstmal ne 3D-CAD Zeichnung machen..<br/>
und nebenbei mal die OS-3DCAD-Tools testen ,)</p>

<p class="infos">
<a href="#comment_533" onclick="set_comment_reference(533)" title="auf diesen Kommentar antworten">#533</a>:
    05.Sep.2008 07:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Hehe... eine Zeichnung wirds so oder so geben, aber im Moment tendiere ich mehr dazu das auf Papier zu l&ouml;sen statt mich erst komplett in ein neues Programm zu fitzen.<br/>
Ich guck mal...</p>

<p class="infos">
<a href="#comment_534" onclick="set_comment_reference(534)" title="auf diesen Kommentar antworten">#534</a>:
    07.Sep.2008 04:09
    von
    
      
        <a href="http://ag7.alltagsgrauen.info" target="_blank">
          fwolf
        </a>
</p>
<p>schon mal an stinknormales Holz gedacht? Wenn da drin mehr als 100 Grad (Flammpunkt ab 300&deg; C) herschen, sind die meisten Teile sowieso bereits im Arsch.</p>
<p>Sowas plane ich f&uuml;r den Zeitpunkt, an dem ich mir mal wieder ein paar Ausgaben f&uuml;r ne Multi-Wohnzimmer-Beamer-what-the-devil-Kombi leisten kann: Einfach sch&ouml;nes Teil vom Weibchen basteln lassen (sie ist Tischlerin im dritten Ausbildungsjahr) - ins Wohnzimmer stellen - fertsch ;</p>
<p>cu, w0lf.</p>

<p class="infos">
<a href="#comment_535" onclick="set_comment_reference(535)" title="auf diesen Kommentar antworten">#535</a>:
    07.Sep.2008 04:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>jau, hab ich... vor allem auch weil es optisch an der Seite des Schrankes evtl. besser wirken k&ouml;nnte.<br/>
Aber bei Holz st&ouml;rt mich immer die Verarbeitung, ich hab nicht gerade das gr&ouml;&szlig;te Geschick im Umgang mit S&auml;ge und Bohrer, au&szlig;erdem fallen da derartig viele Sp&auml;ne an... Das nervt etwas wenn man sowas nur im Wohnzimmer zusammenbauen kann.<br/>
Mein Weibchen ist da sicher auch geschickter als ich, auch wenn sie als Microtechnologin da wohl auch nicht direkt pr&auml;destiniert ist. <em>g</em></p>

<p class="infos">
<a href="#comment_536" onclick="set_comment_reference(536)" title="auf diesen Kommentar antworten">#536</a>:
    17.Sep.2008 11:09
    von
    
      
        <a href="http://www.bistnpieces.de/blog" target="_blank">
          mattis
        </a>
</p>
<p>Erst aus Pappe basteln, da kann man Gr&ouml;&szlig;e, Lage der Teile, Luftstrom, Lautst&auml;rke ausprobieren und dann z.B. aus MDF (mitteldichte Faserplatte) nachbauen. Die Pappteile k&ouml;nnen dann als Schablone dienen.</p>

<p class="infos">
<a href="#comment_537" onclick="set_comment_reference(537)" title="auf diesen Kommentar antworten">#537</a>:
    17.Sep.2008 11:09
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Da hattest du ja bei  deinem eigenem Projekt schon gezeigt... sehr sch&ouml;ne aktion, werde ich ernsthaft in Betracht ziehen.</p>

<p class="infos">
<a href="#comment_538" onclick="set_comment_reference(538)" title="auf diesen Kommentar antworten">#538</a>:
    19.Sep.2008 11:09
    von
    
      
        <a href="/2008/09/19/homeservergehause1/" target="_blank">
          Homeservergeh&auml;use#1 &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...]  Meine Entw&uuml;rfe bez&uuml;glich meines kleinen Homeservergeh&auml;uses (Projektstart) nehmen langsam erste Formen an. Inzwischen habe ich die dreieckige Grundfl&auml;che etwas aufgegeben, [...]</p>

<p class="infos">
<a href="#comment_539" onclick="set_comment_reference(539)" title="auf diesen Kommentar antworten">#539</a>:
    22.Sep.2008 10:09
    von
    
      
        <a href="/2008/09/22/homeservergehause2/" target="_blank">
          Homeservergeh&auml;use#2 &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...]  Freitag fing ich endlich an die Realisation meines Geh&auml;use-Projektes (0 1) ernsthafter in Angriff zu nehmen. Als erstes habe ich mal versucht die Skizze meines [...]</p>

<p class="infos">
<a href="#comment_540" onclick="set_comment_reference(540)" title="auf diesen Kommentar antworten">#540</a>:
    22.Sep.2008 05:09
    von
    
      
        <a href="/2008/09/22/homeservergehause3/" target="_blank">
          Homeservergeh&auml;use#3 &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...] von Eigenbau-Homeservergeh&auml;use V3 &ldquo;Schuhkartonserver&rdquo; (andere Teile der Reihe: 0 1 2), also Beschreibung der Realisierung an sich, Testl&auml;ufe, erste Ausf&auml;lle, die Ursachen daf&uuml;r [...]</p>

<p class="infos">
<a href="#comment_541" onclick="set_comment_reference(541)" title="auf diesen Kommentar antworten">#541</a>:
    14.Oct.2008 01:10
    von
    
      
        <a href="/2008/10/14/homeservergehause5/" target="_blank">
          Homeservergeh&auml;use#5 &amp;laquo; G33KY^2 - The Nerd Strikes Back
        </a>
</p>
<p>[...]  Die unendliche Geschichte geht weiter -.- (Teile: 0 1 2 3 4). Gestern Abend habe ich die Platten aus denen das Geh&auml;use mal zusammengesetzt werden soll [...]</p>

<p class="infos">
<a href="#comment_542" onclick="set_comment_reference(542)" title="auf diesen Kommentar antworten">#542</a>:
    16.Nov.2008 04:11
    von
    
      
        <a href="/2008/11/16/homeservergehause-6-v4-tinfoilhat/" target="_blank">
          Homeservergeh&auml;use
        </a>
</p>
<p>[...]  Die n&auml;chste Revision meines Homeservergeh&auml;uses V4 - &ldquo;Tinfoilhat&rdquo; (alle Teile, 0 1 2 3 4 5) ist [...]</p>
</div>
