+++
title = "Brandgefahr: Odys X28"
date = "2009-05-29T09:05:00"
author = "Dr. Azrael Tod"
tags = ["Gadget", "Hardware", "Technik"]
issoid = "blog/1402"
aliases = "blog/1402"
+++

<p>Vor einiger Zeit habe ich mir einen neuen MP3-Player zugelegt, wegen des ziemlich geringen Preises und der optisch ansprechenden Verarbeitung habe ich mich f&uuml;r ein Ger&auml;t der <a href="http://www.odys.de/" target="_blank">Marke Odys/Axdia</a> entschieden, den <a href="http://www.odys.de/web/web_lan_de_hmp_1_mp_2_an_X700208.html" target="_blank">X28 mit 2GB internem Speicher</a> und einem Einschub f&uuml;r Micro-SD-Karten.</p>
<p>Leider musste ich jetzt feststellen dass man wohl doch <a href="/fid/4408">nur das bekommt wof&uuml;r man bezahlt</a><!--more--></p>
<p>Rein von der Verwendung des Ger&auml;tes her gibt es kaum etwas auszusetzen.. es ist schick, bedient sich gut (andere behaupten es w&auml;re eine gew&ouml;hnungsbed&uuml;rftige Men&uuml;f&uuml;hrung, aber ich finde die Software eigentlich ziemlich gelungen und man kann die Grundfunktionen auch mal blind in der Tasche bedienen.), frisst genug Daten um mich den halben Tag zu unterhalten und der Klang ist auch besser als bei manch anderem portablem Player da drau&szlig;en (nat&uuml;rlich nicht wenn man die mitgelieferten Ohrst&ouml;psel verwendet).</p>
<p>Offensichtlich negativ ist dass er keine SDHC-Karten frisst und dass der Akku nur 6-8h h&auml;llt (was mich nicht st&ouml;rt, ich brauch das Ding nur f&uuml;r meine 20min Arbeits-Fu&szlig;-weg zu <a href="http://seto-gmbh.de" target="_blank">seto</a>) Viel st&ouml;render f&uuml;r mich war bisher die schlichte Tatsache dass man, wie bei so vielen anderen Playern auch, das Ger&auml;t nicht verwenden kann w&auml;hrend es am USB-Anschluss geladen/als Speicher angesprochen wird.</p>
<p>Diese Woche jedoch musste ich bereits 3x feststellen dass dieses Ger&auml;t in bestimmten F&auml;llen gef&auml;hrlich hei&szlig; wird. Wenn ich es wie jeden Morgen an mein Notebook anstecke, gibt es F&auml;lle in denen scheinbar die Software abst&uuml;rzt und sich das Ding in einer endlosschleife aufh&auml;ngt.<br/>Dabei f&auml;ngt der Bildschirm an leicht zu flimmern und das Ger&auml;t heizt sich immer weiter auf. Wenn dann nach einigen Minuten mal von meinem Netbook her die Meldung aufpoppt dass trotz aller Versuche die Hardware nicht erkannt werden konnte, ist das Ding bereits hei&szlig; genug um sich am Aluminiumgeh&auml;use ordentlich die Hand zu verbrennen.<br/>Zum Gl&uuml;ck l&auml;sst sich dieser Zustand relativ leicht beheben, indem man das USB-Kabel abzieht und das Ger&auml;t hardwareseitig ausschaltet.</p>
<p>Bisher habe ich das auch noch immer rechtzeitig geschafft und auch nach einem solchen Absturz funktionierte das Ger&auml;t noch problemlos. F&uuml;r mich stellt sich jedoch die Frage was passiert wenn ich dabei doch irgendwann mal nicht anwesend bin? Was wenn ich das Ger&auml;t erstmal anstecke und mich nach 1-2min vom PC entferne? Brennt nur ein Chip im Ger&auml;t durch? Entz&uuml;ndet die Kiste das Papier auf dem sie liegen k&ouml;nnte? Gibt es einen Kurzschluss der den USB-Anschluss meines Computers in Mitleidenschaft zieht?</p>
<p>Von Odys konnte ich bisher zu diesem Thema noch keinerlei Aussagen finden. Die <a href="http://www.odys.de/web/web_lan_de_hmp_1_mp_2_an_X700208_faq_ja.html#Faq" target="_blank">angebotenen FAQ</a> und Bedienungsanleitungen sind auch nicht mehr als ein Witz.<br/>Meiner Meinung nach w&auml;re ein Softwareupdate DRINGEND n&ouml;tig und sollte dieses Problem auf diese Art nicht zu beheben sein m&ouml;chte ich Odys eine R&uuml;ckrufaktion ans Herz legen.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1298" onclick="set_comment_reference(1298)" title="auf diesen Kommentar antworten">#1298</a>:
    19.Jun.2009 10:06
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          sirsnookie
        </a>
</p>
<p>Das f&auml;llt dann sicher unter nicht sachgem&auml;&szlig;e Anwendung ;)</p>

<p class="infos">
<a href="#comment_1299" onclick="set_comment_reference(1299)" title="auf diesen Kommentar antworten">#1299</a>:
    16.Oct.2009 12:10
    von
    
      
        bIG O
      
    
    
  </p>
<p>immer ist es was anderes, ich habe den x28 (4GB) auch, und habe ein anderes problem, wenn ich musik, oder andere daten draufhabe, bekomme ich keine schriffzt mehr, also, da wo normalerweise text ist, dort nichs zu lesen ist. wie z.b. das haupt menu, es wird nicht unter den bildern ; musik, einstellung, spiele etc. angezeigt AUSER, manchmal dei der musikwidergabe, kleine kryptische zeichen... sieht so &auml;hnlich aus wie chinesisch (ja ich kann zwischen japanisch und chinesisch unterscheiden xD), aber nach dem formatiren , alles wieder normal dis ich wider mein zeug drauf ballere, naja, ein kumpel meinte , das das an dem virus liegen k&ouml;nnte, den ich und er programirt haben um PC proxies zu umgehen aber auch ohne den virus bekomme ich keine anzeie und google ist auch rat los.... naja, wer weis, vielleicht weist du ja was ^^</p>
<p>danke</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1300">
<p class="infos">
<a href="#comment_1300" onclick="set_comment_reference(1300)" title="auf diesen Kommentar antworten">#1300</a>:
    16.Oct.2009 12:10
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>IEHKS! Script-Kiddies auf G33KY^2!</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1301" onclick="set_comment_reference(1301)" title="auf diesen Kommentar antworten">#1301</a>:
    04.Dec.2009 01:12
    von
    
      
        lol oO?
      
    
    
  </p>
<p>ich brauch auch hilfe -.- ich hab keen virus, hack oda sonstiges aufm mp (auch odys x28 [4GB]) und habe auch nur komische zeichn xDD antwort w&auml;re g&uuml;nstig...<br/>
danke im vorraus ;D</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1302">
<p class="infos">
<a href="#comment_1302" onclick="set_comment_reference(1302)" title="auf diesen Kommentar antworten">#1302</a>:
    04.Dec.2009 02:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>boar.. LEUTE!<br/>
Das ist ein Nerdblog, nicht Quakenet oder Knuddels!</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1303" onclick="set_comment_reference(1303)" title="auf diesen Kommentar antworten">#1303</a>:
    05.Dec.2009 12:12
    von
    
      
        lol oO?
      
    
    
  </p>
<p>ja...sry soll ich etwa n eigenes "thema" odaso aufmachen?<br/>
wenn ja werd ich das dann tun :D</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1304">
<p class="infos">
<a href="#comment_1304" onclick="set_comment_reference(1304)" title="auf diesen Kommentar antworten">#1304</a>:
    05.Dec.2009 12:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ja, mach das mal.. in irgendeinem Forum f&uuml;r Legastheniker oder so.<br/>
Denen kannst du dann auch von deinem MP3-Player-Virus erz&auml;hlen, die interessiert es vlt. mehr als mich.</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1305" onclick="set_comment_reference(1305)" title="auf diesen Kommentar antworten">#1305</a>:
    05.Dec.2009 01:12
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          SirSnookie
        </a>
</p>
<p>Freggels, echt. Sind schon Ferien???</p>

<p class="infos">
<a href="#comment_1306" onclick="set_comment_reference(1306)" title="auf diesen Kommentar antworten">#1306</a>:
    06.Dec.2009 11:12
    von
    
      
        lol oO?
      
    
    
  </p>
<p>hahaha... ich hab keen virus odaso xP ich bin keen vollboon odaso...<br/>
also denk ma nach... in foren un sonstewas gabs och keene hilfe...<br/>
ich dachte hier K&Ouml;NNTE man ja ma hilfe bekommen... aber &uuml;berall nur vollhonks die jmd. dann doof anmachen!</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1307">
<p class="infos">
<a href="#comment_1307" onclick="set_comment_reference(1307)" title="auf diesen Kommentar antworten">#1307</a>:
    07.Dec.2009 12:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Nein, nat&uuml;rlich bist du das nicht! wie konnte ich nur auf die Idee kommen?</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1308" onclick="set_comment_reference(1308)" title="auf diesen Kommentar antworten">#1308</a>:
    07.Dec.2009 12:12
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          SirSnookie
        </a>
</p>
<p>Odaso - klingt nach ner osteurop&auml;ischen Coka-Cola Marke :)</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1309">
<p class="infos">
<a href="#comment_1309" onclick="set_comment_reference(1309)" title="auf diesen Kommentar antworten">#1309</a>:
    07.Dec.2009 01:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ziemlich.. und Keen kommt mir auch irgendwie bekannt vor.^^</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1430" onclick="set_comment_reference(1430)" title="auf diesen Kommentar antworten">#1430</a>:
    20.Jul.2010 06:07
    von
    
      
        Doreen
      
    
    
  </p>
<p>Hey..</p>
<p>Ich hab das auch mit der schrift und ich weis nich wie das weg geht</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1432">
<p class="infos">
<a href="#comment_1432" onclick="set_comment_reference(1432)" title="auf diesen Kommentar antworten">#1432</a>:
    21.Jul.2010 10:07
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>ganz einfach, Fenster &ouml;ffnen, Player in die Hand nehmen, beschleunigen und den Impuls dann dazu verwenden um den Player nach drau&szlig;en zu bef&ouml;rdern... schon ist das Problem weg.</p>
<p>Mal ehrlich Leute, k&ouml;nnt ihr auch mal lesen worauf ihr antwortet, bevor ihr irgendwelche Fragen stellt die &uuml;berhaupt nichts mit dem Post zu tun haben? Nein, nat&uuml;rlich k&ouml;nnt ihr das nicht, Intarnetz halt, hab ich wohl kurz vergessen.</p>
</div>
</li>
</ul>
</div>