+++
title = "Religion ist unethisch!"
date = "2008-12-19T12:12:00"
author = "Dr. Azrael Tod"
issoid = "blog/1134"
aliases = "blog/1134"
+++

<p>Sch&ouml;n trollige &Uuml;berschrift nicht?</p>
<p>Gerade eben erst habe ich mitbekommen dass es <a href="http://www.morgenpost.de/printarchiv/berlin/article996279/Ethik_oder_Religion_Warum_haben_Schueler_keine_Wahl.html" target="_blank">in Berlin mal wieder eine gro&szlig;e Diskussion</a>&nbsp;und <a href="http://www.pro-reli.de/volksbegehren/" target="_blank">ein Volksbegehren</a> um die Frage gibt, ob Sch&uuml;ler zwischen den F&auml;chern "Ethik" und "Religion" w&auml;hlen d&uuml;rfen (sollten) oder nur jeweils eins davon als Vorauswahl vorgeschrieben sein soll.</p>
<p>Randbemerkung: Ich kann nur davon ausgehen wie ich als Au&szlig;enstehender zu meiner Schulzeit den Religionsunterricht in Sachsen wahrgenommen habe. Das ist sicher weder fair noch irgendwie ernsthaft fundiert.<br/><!--more--></p>
<p>Bei mir stellt sich bei all diesen Aufgeblasenen Ansichten und &uuml;bertrieben hervorgehobenen Problemen vor allem die Frage: Seit wann haben wir in Deutschland Religionsunterricht?</p>
<p>Ich kenne bisher als Schulf&auml;cher nur Dinge die sich mit dem evangelischen und katholischem Christentum besch&auml;fftigen, wenn es ganz dumm kommt finden wir vlt. noch 1-2 Schulen an denen es f&uuml;r eine j&uuml;dische oder, ganz exotisch, islamische Variante reicht.</p>
<p>Von&nbsp;</p>
<p>Mit dem Themengebiet Religion haben diese 4 F&auml;cher f&uuml;r sich genommen ungef&auml;hr soviel zu tun als w&uuml;rde man einem Sch&uuml;ler beibringen bis 10 zu z&auml;hlen und dann einen Stempel "Mathe bestanden" aufs Abitur dr&uuml;cken. (Wobei das heutzutage wohl teilweise noch optimistisch w&auml;re...)</p>
<p>In allen anderen F&auml;chern bekommen die Sch&uuml;ler doch auch nur irgendwelche unbrauchbaren Grundlagen vorgesetzt die sie die Woche nach der Pr&uuml;fung wieder vergessen haben. &Uuml;berall sonst redet man sich auch heraus dass alles Praktische und Anwendbare was man im sp&auml;teren Berufsleben braucht nach den 9-13 Jahren Schulzeit stattfinden soll und man in dieser Zeit erstmal "Grundwissen" beigebracht bekommen soll.</p>
<p>Diese Ansicht teile ich nicht... aber wenn ihr schon mit solchem M&uuml;ll argumentiert, dann zieht die Sache gef&auml;lligst durch!</p>
<p>Was w&auml;re denn Grundwissen zu den Religionen? Welche Oblade zu welchem Gottesdienst am besten schmeckt oder die kleinsten Details der Sch&ouml;pfungsgeschichte von $Religion z&auml;hlen da wohl kaum mit drunter. Daf&uuml;r w&uuml;rde auch einfach die Zeit fehlen.</p>
<p>Wenn ich jetzt so genau dr&uuml;ber nachdenke: Wir hatten ja damals nicht viel... aber was wir hatten war ein Fach das doch tats&auml;chlich (neben anderen Themen) versuchte einen &Uuml;BERBLICK &uuml;ber die verschiedenen Religionen zu verschaffen. Welche hat sich wie entwickelt, wie sind die Gottesh&auml;user aufgebaut, wie sind die Dinger organisiert usw. usf. ...</p>
<p>Dieses Fach nannte sich: ETHIK</p>
<p>Das k&ouml;nnte man jetzt irgendwie bl&ouml;d gelaufen nennen oder?</p>
<p><a href="http://www.elementarteile.de/?p=2144">(</a><a href="http://www.elementarteile.de/?p=2144" target="_blank">via Elementarteile</a>)</p>
<p>BTW: Solange ich meine (evtl. doch mal irgendwann existierenden) Kinder nicht in <a href="http://de.wikipedia.org/wiki/Diskordianismus" target="_blank">Diskordianischen </a>Religionsunterricht schicken kann ist die Angelegenheit eh diskriminierend. Schlimmer noch: Diskordianismus wurde bei uns an der Schule nichtmal erw&auml;hnt! Dabei ist es DIE Weltreligion mit den meisten Mitgliedern. (Das erkl&auml;rt zumindest einigest oder?)</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1015" onclick="set_comment_reference(1015)" title="auf diesen Kommentar antworten">#1015</a>:
    19.Dec.2008 02:12
    von
    
      
        <a href="http://friedenspanzer.blog.de/" target="_blank">
          Friedenspanzer
        </a>
</p>
<p>Den besten Religionsunterricht hatte ich in der 11. und 12. Klasse. Das hie&szlig; evangelische Religion, ich h&auml;tte es aber auch Ethik genannt. Der Religionslehrer hat sich wirklich M&uuml;he gegeben, Grunds&auml;tze zu vermitteln. Wir haben irgendetwas von Martin Luther (ist ja quasi Landsmann von dir ;) ) &uuml;ber die Vorteile des Christentums gelesen, um es direkt danach mit einem Feuerbach-Text zu ruinieren. Wir haben philosophische Schriften von Goethe auseinandergenommen und diskutiert, ob der christliche Gott wissenschaftlich beweisbar ist. Und er kannte sogar die Principia Discordia, entgegen meines Vorschlages haben wir sie aber nicht besprochen.</p>
<p>Ich habe wahrscheinlich noch nie mehr aus dem Unterricht mitgenommen als unter diesem Lehrer. Sein Motto war "Glaubt was ihr wollt, hauptsache ihr denkt dar&uuml;ber nach." W&uuml;rde Religionsunterricht &uuml;berall so aussehen w&auml;re die Welt eine bessere.</p>

<p class="infos">
<a href="#comment_1016" onclick="set_comment_reference(1016)" title="auf diesen Kommentar antworten">#1016</a>:
    19.Dec.2008 03:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Es gibt immer gute und schlechte Lehrer und es h&auml;ngt verdammt viel davon ab ob man in dieser Beziehung Gl&uuml;ck hat.<br/>
Von daher kann man auch ruhig mit einem Katholischen Religionslehrer was &uuml;ber Islam lernen.<br/>
Genauso kann man nat&uuml;rlich auch an einen erzkonservativen Ethik-Lehrer geraten und weniger allgemeines lernen als bei dem schlechtesten Religionslehrer.</p>
<p>Die Frage ist halt, was das Schulsystem als grobe Richtung vorgibt, was unterichtet werden <em>sollte</em>.</p>

<p class="infos">
<a href="#comment_1017" onclick="set_comment_reference(1017)" title="auf diesen Kommentar antworten">#1017</a>:
    20.Dec.2008 03:12
    von
    
      
        <a href="http://erisisch.de" target="_blank">
          iio_
        </a>
</p>
<p>Ich fand folgenden Argumentation zu diesem Thema sehr interessant: <a href="http://hpd.de/node/6038%3C/p%3E" rel="nofollow">http://hpd.de/node/603...</a>
</p><p>@Friedenspanzer: Luther hatten wir damals auch im Religionsunterricht. Allerdings nur die halbe Geschichte: <a href="http://morgen.blogage.de/entries/2008/3/28/Martin-Luther%3C/p%3E" rel="nofollow">http://morgen.blogage....</a>
</p>
<p class="infos">
<a href="#comment_1018" onclick="set_comment_reference(1018)" title="auf diesen Kommentar antworten">#1018</a>:
    23.Dec.2008 12:12
    von
    
      
        adrianlang
      
    
    
  </p>
<p>Der Ethik-Unterricht ist keine Religionskunde, wie du sie beschrieben hast; er bezieht sich auf die im Grundgesetz transportierten Werte, ist also Humanismus-/Naturwissenschaft-/Staatsb&uuml;rgerkunde. Wenn der Unterricht mal Religionen und Weltanschauungen vergleichend behandelt ist das Gl&uuml;ck und nicht Programm. Demgegen&uuml;ber m&ouml;chte das B&uuml;rgerbegehren 25% des Religionskunde- bzw. Ethikunterrichts mit &uuml;berkonfessionellen Inhalten bestreiten. Dar&uuml;berhinaus sollen Religion und Ethik ordentliche Lehrf&auml;cher werden, was insbesondere die Stellung der Lehrer verbessert. Nicht zuletzt soll der Unterricht bereits in der 1. und nicht erst in der 7. Klasse angeboten werden.</p>
<p>Klar ist zu kritisieren, mit welchen Zielen die Pro-Reli-Kampagne stattfindet; die aktuellen Vorschl&auml;ge sind aber sinnvoll und unterst&uuml;tzenswert.</p>
<p>Achso, und selbstverst&auml;ndlich muss der Staat deinen Kindern diskordischen Unterricht anbieten, wenn eine ausreichende Klassenst&auml;rke zusammengekommen ist und es eine anerkannte Glaubensgemeinschaft in Berlin gibt, die die Ausbildung von Lehrern gemeinsam mit dem Land Berlin durchf&uuml;hrt.</p>
<p>Gru&szlig;,<br/>
Adrian</p>

<p class="infos">
<a href="#comment_1019" onclick="set_comment_reference(1019)" title="auf diesen Kommentar antworten">#1019</a>:
    24.Dec.2008 11:12
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Also ich wei&szlig; nicht wann du zu letzt in den Lehrplan gesehen hast.. aber bei uns stand damals schon noch was von wegen Weltreligionen und -Anschauungen drin.</p>
<p>Ich sehe durchaus ein dass sich einige religi&ouml;se Vereinigungen im Lehrplan unterrepr&auml;sentiert sehen, imho nimmt jedoch die Bedeutung der Religion f&uuml;r den durchschnittlichen deutschen B&uuml;rger ab und nicht zu. Woraus man dann jetzt ableitet wir br&auml;uchten mehr Religionsunterricht als vor 10 Jahren ist mir also etwas schleierhaft.</p>
<p>Kinder mit religi&ouml;ser Propaganda schon in der ersten Klasse zu bombardieren ist &uuml;brigens etwas was ich ganz wehement ablehnen w&uuml;rde. Man sollte ohnehin die Entscheidung &uuml;ber solche Dinge erst dann fordern wenn der betreffende reif genug ist sich auch selbst eine Meinung gebildet zu haben und nicht nur hirnlos alles nachplappert was Eltern oder Leerer ihm vorfl&uuml;stern.</p>
<p>Leider ist dies eine Wunschvorstellung eines m&uuml;ndigen B&uuml;rgers, die wohl heute bei den meisten auch mit 20-30 noch nicht eingetreten ist.</p>

<p class="infos">
<a href="#comment_1020" onclick="set_comment_reference(1020)" title="auf diesen Kommentar antworten">#1020</a>:
    25.Dec.2008 01:12
    von
    
      
        adrianlang
      
    
    
  </p>
<p>Es geht nicht darum, ob religi&ouml;se Weltanschauungsgemeinschaften sich unterrepr&auml;sentiert f&uuml;hlen, sondern dass humanistisch und naturwissenschaftlich gepr&auml;gte Verfassungswerte als alleinstehende Wahrheit vermittelt werden.</p>
<p>Relgionsunterricht ist zur Zeit ab der ersten Klasse (wie schon immer in Berlin), aber freiwillig, w&auml;hrend Ethik erst in der siebten Klasse unterrichtet wird. Unabh&auml;ngig davon ist Religionsunterricht aber soweit ich wei&szlig; auch kaum &bdquo;religi&ouml;se Propaganda&ldquo;.</p>
<p>M&uuml;ndigkeit entsteht nicht pl&ouml;tzlich mit dem 10. Geburtstag; Ethikunterricht k&ouml;nnte da eine gro&szlig;e Hilfe sein.</p>

<p class="infos">
<a href="#comment_1021" onclick="set_comment_reference(1021)" title="auf diesen Kommentar antworten">#1021</a>:
    10.Jan.2009 11:01
    von
    
      
        <a href="http://morgen.blogage.de" target="_blank">
          morgen
        </a>
</p>
<p>Ich bin fuer Laizismus. Wenn du deine Kinder in religioese Gedankengebaeude einfuehren moechtest, dann bitte privat!</p>
</div>