+++
title = "Von Druckern, Hausarbeiten und einer schlechten Aura..."
date = "2008-11-12T03:11:00"
author = "kleine Zuzi"
issoid = "blog/1046"
aliases = "blog/1046"
+++

<p>Ja, es gibt sie doch noch: Menschen, denen es nicht gelingt, ein einfaches .doc-Dokument auszudrucken. Dazu muss man sagen, dass ich nun wirklich kein Spezialist in Sachen Computern bin und bei den meisten Problemen auch nur fragend meinen Bildschirm ansehe. Meine Mitbewohnerin (und beste Freundin, nur deswegen kann ich es mir auch herausnehmen so &uuml;ber sie zu schreiben ;) ) schafft es aber immer wieder, mich in Staunen zu versetzen. Gestern und heute zum Beispiel... <!--more--></p>
<p>Es begab sich aber zu der Zeit, dass sie eine Hausarbeit schreiben musste. Sie tippte und tippte, bis zur Vollendung und dem geplanten Druck. Alles sch&ouml;n und gut, wenn nicht hin und wieder ihr Drucker herumspinnen w&uuml;rde. An sich kein Problem, schlie&szlig;lich gibt es doch mich und meinen niedlichen kleinen Laserdrucker. Also Dateien auf einen USB-Stick (mangels Netzwerk) und auf meinen PC &uuml;bertragen. Und da die erste unsch&ouml;ne &Uuml;berraschung: Die Seitenr&auml;nder hatten sich auf einmal verschoben. Keiner wei&szlig;, warum. Beziehungsweise wei&szlig; ich es doch: Sie benutzt die neueste Version von MS Office. Um das Seitenrand-Problem zu l&ouml;sen, sollte sie also das Dokument in ein PDF-Format umwandeln. Zwei Sekunden sp&auml;ter kam dann der Hilferuf per ICQ "Aber das kriege ich doch wieder nicht hin!" ... Ich schnaufte erst einmal, lieb wie ich bin, ging ich dann aber r&uuml;ber. Und was musste ich da feststellen? Nein, MS Office ist immer noch nicht im 21. Jahrhundert angekommen und kann nicht ohne Addons zum PDF-Format umwandeln. Also das Addon heruntergeladen und... Nichts! Immer noch keine Spur dieser Funktion. Also Plan B, der eigentlich eher mein Plan A ist: Schnell Open Office herunterladen (unter mehrmaligem Nachfragen, wie und wo sie das tun muss, versteht sich) und es damit machen. Et Voil&agrave;, es ging. Doch Halt, was fehlt jetzt noch? Richtig, es war noch nicht ausgedruckt. Also Druckversuch Nummer 2... Mitbewohnerin steht neben mir, ich werfe den Drucker an und - Die rote Lampe leuchtet. Sie hat wohl doch eine schlechte Aura auf Computer, meine beste Freundin, denn das tut er sonst nicht! Kurz die Kartusche herausgenommen und wiedereingesetzt - Dann ging er wieder. Gl&uuml;cklich, auch diese H&uuml;rde &uuml;berwunden zu haben, druckte ich den Spa&szlig; dann aus und legte mich irgendwann gestern Abend schlafen...</p>
<p>Vorhin kam mein Mitbewohnerfiffi dann wieder in mein Zimmer und meinte zu mir, dass sie wegen einiger formeller Fehler an Quellen usw. das Ding nocheinmal ausdrucken m&uuml;sste. Diesmal hatte sie es auch schon brav zum PDF umgewandelt und alles schien prima. Sie sprach noch "So, ich gehe besser aus dem Zimmer, damit das auch wirklich klappt!" und was tat mein Drucker? Zieht eine Seite schief ein und produziert kompletten Papierstau mit ungef&auml;hr sechs Seiten irgendwo zwischen seinen Einzelteilen. Hurra! Wutschnaubend konnte ich das Druckerlein dann doch noch von dem ganzen Wei&szlig; befreien und mit gro&szlig;em Sicherheitsabstand zu meiner Besten hat er dann auch getan, was er sollte...</p>
<p>Und was lernen wir daraus? Es gibt sie doch, die Menschen mit einer schlechten Aura. Und das n&auml;chste Mal sollte sie mir ihr Zeug doch aus der Ferne schicken. Vielleicht explodiert sonst noch meine Maus, wenn sie in der N&auml;he ist.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_880" onclick="set_comment_reference(880)" title="auf diesen Kommentar antworten">#880</a>:
    12.Nov.2008 03:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>&ouml;hm.. auren?^^</p>

<p class="infos">
<a href="#comment_881" onclick="set_comment_reference(881)" title="auf diesen Kommentar antworten">#881</a>:
    12.Nov.2008 03:11
    von
    
      
        RobVinc
      
    
    
  </p>
<p>Think posistive and use open standards :)</p>

<p class="infos">
<a href="#comment_882" onclick="set_comment_reference(882)" title="auf diesen Kommentar antworten">#882</a>:
    12.Nov.2008 08:11
    von
    
      
        <a href="http://macfidelity.de" target="_blank">
          fidel
        </a>
</p>
<p>bzgl dem abspeichern als pdf lohnt sich ein virtueller drucker unter ms-systemen.</p>
<p>FreePDF in Kombi mit Ghostscript is da ne brauchbare L&ouml;sung die dir in jedem App mit Print-Dialog auch ein PDF erzeugen kann.</p>

<p class="infos">
<a href="#comment_883" onclick="set_comment_reference(883)" title="auf diesen Kommentar antworten">#883</a>:
    12.Nov.2008 08:11
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Druckt nicht? Wackel mal am Kabel!</p>
<p>"Mal eben was ausdrucken" geh&ouml;rt zu meinen zeitaufw&auml;ndigsten T&auml;tigkeiten.</p>
<p>Aber ich finde man sollte eh LaTeX benutzen...</p>

<p class="infos">
<a href="#comment_884" onclick="set_comment_reference(884)" title="auf diesen Kommentar antworten">#884</a>:
    12.Nov.2008 09:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>evtl. sollte man auch die USB-Kabel gegen h&ouml;herwertigere austauschen.. solche mit Goldkontakten unso.<br/>
Au&szlig;erdem hilft es vorher im Internet zu recherchieren ob die Sonnenfleckenaktivit&auml;t gerade wieder zu hoch ist f&uuml;r eine problemlose Daten&uuml;bertragung</p>

<p class="infos">
<a href="#comment_885" onclick="set_comment_reference(885)" title="auf diesen Kommentar antworten">#885</a>:
    12.Nov.2008 09:11
    von
    
      <a href="/blog/author/kleinezuzi/">
        kleinezuzi
      </a>
</p>
<p>Sonnenfleckenaktivit&auml;t? WTF? ... Und mein Drucker geht ja, wenn nicht die Mitbewohnerin in der N&auml;he ist! :P</p>

<p class="infos">
<a href="#comment_886" onclick="set_comment_reference(886)" title="auf diesen Kommentar antworten">#886</a>:
    12.Nov.2008 09:11
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Wie soll man nie untersch&auml;tzen.. das wusste schon der B.O.F.H./B.A.f.H.!</p>

<p class="infos">
<a href="#comment_887" onclick="set_comment_reference(887)" title="auf diesen Kommentar antworten">#887</a>:
    12.Nov.2008 09:11
    von
    
      <a href="/blog/author/kleinezuzi/">
        kleinezuzi
      </a>
</p>
<p>G33K -.-</p>

<p class="infos">
<a href="#comment_888" onclick="set_comment_reference(888)" title="auf diesen Kommentar antworten">#888</a>:
    13.Nov.2008 11:11
    von
    
      <a href="/blog/author/toranor/">
        toranor
      </a>
</p>
<p>...wilkommen auf g33ky.de ^^</p>
<p>Zum Thema Drucker m&ouml;chte ich mla Murphys Law zitieren:<br/>
"Ein Einzelblatteinzug ist nur dazu da, um Einzelbl&auml;tter schief einzuziehen."</p>
</div>