+++
title = "Code-Monkey-Theorie"
date = "2009-11-30T12:11:00"
author = "Dr. Azrael Tod"
issoid = "blog/1479"
aliases = "blog/1479"
+++

<p>Letzten Abend ging mir mal wieder eine Idee durch den Kopf, die ich einfach nicht wieder los bekommen habe und die ich nat&uuml;rlich wieder haarklein ausarbeiten musste. Grunds&auml;tzlich gehe ich dabei von 2 Annahmen aus:<br/></p><ul><br/> <li>Technologie aus dem IT-Sektor steigt permanent  in Abstraktionsebenen</li><br/> <li>Programmierer/Netzwerktechniker/Whatever lernen permanent dazu, bzw. werden in dem was sie tun besser, solange sie sich ernsthaft darum k&uuml;mmern was sie in ihrem Beruf so tun und selbst besser werden wollen</li><br/></ul><br/>Im Folgenden werde ich f&uuml;r Personen die sich nicht mehr weiterentwickeln den Begriff "Code-Monkey" verwenden, es handelt sich dabei um Personen mit stagnierenden F&auml;higkeiten, die kein wirkliches Interesse mehr f&uuml;r ihren Beruf aufbringen. Dabei werde ich mal einfach ignorieren dass diese Erscheinung durchaus nicht an Code gebunden ist (sprich: ich rede nicht nur von Programmierern) sondern wohl in der ganzen Branche (oder wahrscheinlich auch weit dar&uuml;ber hinaus) vorkommen wird.

<p>Diese Grundlagen werde ich nun erstmal genauer ausf&uuml;hren und dann meine Schl&uuml;sse erl&auml;utern.<br/><!--more--><br/></p><h2>zu den Grundannahmen</h2><br/><h3>Steigende Abstraktionsebene</h3><br/>Jegliche Software scheint sich immer weiter von den relativ statischen Grundlagen der Computertechnik zu entfernen, um flexiblere Funktionen anzubieten. Dies bedeutet einerseits dass die Verwirklichung von immer gr&ouml;&szlig;eren Projekten immer einfacher wird, da flexiblere Werkzeuge zur Verf&uuml;gung stehen, andernseits bedeutet es aber auch dass sich Technik in Zwiebelschichten &uuml;bereinander legt und immer st&auml;rker verh&uuml;llt was auf den untersten Schichten wirklich passiert.

<p>Ein leider viel zu selten beachteter Nebeneffekt ist leider dass diese Struktur auch immer dazu neigt langsamer zu sein als andere L&ouml;sungen, die der physikalischen Grundlage auf der die Technologie basieren, n&auml;her sind. (Ein Thema das ich an dieser Stelle wohl erstmal au&szlig;en vor lassen, ein Rant dar&uuml;ber dass man auch vor 20 Jahren schon Texte schreiben konnte ohne 20sec. auf den Startvorgang des Editors zu warten kommt dann wohl mal wieder gesondert)</p>
<p></p><h3>permanentes Lernen</h3><br/>Diese Grundlage stellt gleich den wackeligsten Punkt meiner Theorie dar. Nat&uuml;rlich habe ich nicht wirklich die M&ouml;glichkeit diese Behauptung mit wahnsinnig vielen Beobachtungen belegen zu k&ouml;nnen. Wirklich dauerhaft beobachten kann ich dies wohl nur bei mir selbst, dort besitze ich auch die beste M&ouml;glichkeit um m&ouml;glichst genau vergleichen zu k&ouml;nnen welches Wissen ich mir wann, wo und auf welche Art angeeignet habe.<br/>Bei anderen Personen kann ich allerh&ouml;chstens als Au&szlig;enstehender versuchen den geschriebenen Code in seiner Qualit&auml;t zu vergleichen, manchmal mag dies schon aufgrund des eigenen Unwissens um bestimmte Hintergr&uuml;nde unm&ouml;glich sein, an anderen Stellen wird es ganz einfach durch die eigenen Vorlieben beeinflusst sein. Je l&auml;nger man mit jemandem zusammen arbeitet, desto st&auml;rker muss sich nat&uuml;rlich die Art der L&ouml;sungen, die man erzeugt, aneinander angleichen/anpassen.<br/>Dies sorgt sicher f&uuml;r den Effekt dass man z.B. Quellcode den ein Kollege nach 3-4 Jahren zusammenarbeit produziert als "besser" oder zumindest "angenehmer" empfindet als Code den er geschrieben hat ohne zu wissen wer das jemals lesen wird, welchen Stil dieser verwendet oder gar &uuml;ber welche Wissensbasis er verf&uuml;gt.

<p>Weiterhin mag es durchaus eine Grenze geben, ab der man sich pers&ouml;nlich nicht weiterentwickeln kann, sei es aufgrund des eigenen, begrenzten Intellektes oder anderer Umst&auml;nde. Bisher konnte ich noch keinen derartigen Effekt beobachten, bin mir aber auch ziemlich sicher dass jemand der von einem derartigem Effekt betroffen w&auml;re, ihn auch nicht wahrnehmen w&uuml;rde oder sich dann zumindest in einer ernsthaften Motivationskriese befinden m&uuml;sste.</p>
<p></p><h2>Schlussfolgerungen</h2>
<p>Da sich jeder IT-ler permanent in seinem Wissen und seinen F&auml;higkeiten verbessert, wird er mit dem Verlauf der Komplexit&auml;tsebenen auf seinem T&auml;tigkeitsfeld immer besser werden. Verst&auml;rkt wird dies durch eben jene Komplexit&auml;tsebenen, da man meist eine neue Ebene besser verwenden kann, wenn man die ihr zugrunde liegende Technologie besser verstanden hat.<br/>Ein typisches Beispiel w&auml;re dass es von Vorteil ist wenn man wei&szlig; wie eine Datenbank funktioniert, w&auml;hrend man ein ORM verwendet. (Sonst kommt z.B. <a href="http://snippets.symfony-project.org/snippet/375" target="_blank">sowas</a> raus)<br/>Gebremst wird dieser Verlauf wohl haupts&auml;chlich durch ein "Aussteigen" der Personen, indem sie entweder die Lust an pers&ouml;nlicher Weiterentwicklungen, bzw. den Wissensdrang nach Hintergr&uuml;nden verlieren, den T&auml;tigkeitsbereich wechseln oder indem sie an pers&ouml;nliche Grenzen sto&szlig;en, also z.B. mit einer neuen Komplexit&auml;tsebene nicht zurecht kommen.</p>
<p>Je l&auml;nger und interessierter sich also jemand auf dem Sektor besch&auml;fftigt, umso qualifizierter wird er wohl sein, desto st&auml;rker steigt aber auch die Wahrscheinlichkeit dass er "aussteigt". (&Uuml;bertrieben formuliert: Nur die allerwenigsten Programmierer werden mehr als 100 Jahre Berufserfahrung sammeln.)<br/>Von den ausgestiegenen Arbeitern werden nur die Stagnierenden (oder, sollte das m&ouml;glich sein, diejenigen die sich verschlechtern) in der Branche bleiben.</p>
<p></p><h2>eigentliche Theorie</h2>
<p>Je mehr Abstraktionsebenen ein IT-Arbeiter in seiner Karriere miterlebt hat und je mehr er sich f&uuml;r sein Fachgebiet interessiert, desto f&auml;higer ist er auf diesem Gebiet. Je f&auml;higer/erfahrener man jedoch wird, desto h&ouml;her die Wahrscheinlichkeit dass er zu einem reinen "Code-Monkey" wird und nur noch desinteressiert seinen Job macht und in seiner Entwicklung stagniert.<br/>Oder noch k&uuml;rzer:</p>
<p><b>Je l&auml;nger die Berufserfahrung, desto h&ouml;her die F&auml;higkeitsstufe, desto h&ouml;her aber auch die Wahrscheinlichkeit auf einen "Code-Monkey".</b></p>
<p></p><h2>Abschlie&szlig;ende Bemerkungen</h2>
<p>Nat&uuml;rlich habe ich hier noch keinerlei Randerscheinungen beachtet, so kann es z.B. durchaus sein dass jemand nach einiger Zeit als Code-Monkey doch wieder interesse aufbringt oder (und diese Wahrscheinlichkeit ist sogar ziemlich hoch) bereits aus anderen Gr&uuml;nden, als ernstem Interesse am Gebiet, in die Branche wechselt/ausgebildet wird und so seine Laufbahn bereits als Code-Monkey beginnt.</p>
<p>Code-Monkey ist absichtlich ein abwertend gemeinter Begriff, da ich diese Variante weit weniger erstrebenswert ansehe als sich ernsthaft daf&uuml;r zu interessieren was man tut.<br/>Code Monkeys hingegen als Gesamterscheinung sind durchaus nicht nur negativ zu betrachten, es gibt im t&auml;glichen Leben nunmal weit mehr langweilige Tipparbeit und Routinejobs, in denen sich ernsthaft interessierte Zeitgenossen wohl weit weniger wohl f&uuml;hlen als ein Code Monkey, der sich vlt. sogar mit Routine abgefunden hat. Sie m&ouml;gen nicht mal ann&auml;hernd guten Code schreiben, doch sie schreiben verdammt viel davon. Auch wenn jemand besser qualifiziertes also vlt. doppelt so viel Arbeit erledigt, die dann wiederrum nur die H&auml;lfte an Wartungsarbeit verursacht, k&ouml;nnten Code-Monkeys diese Arbeit genauso erledigen, einfach weil es erheblich mehr von denen gibt.</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1362" onclick="set_comment_reference(1362)" title="auf diesen Kommentar antworten">#1362</a>:
    30.Nov.2009 02:11
    von
    
      
        <a href="http://www.wangoo.de" target="_blank">
          SirSnookie
        </a>
</p>
<p>Guter Post, aber gerade zu den Abstraktionsebenen muss man auch anmerken, es wird gehyped. Wenn man sich z. B. Java ansieht (ja ich weiss, dadrinne programmiert doch keine blah s&uuml;lz) - liest man in jedem verdammten Buch: Abstraktion - damit ist der Code wiederverwendbar! Ich hatte zwar noch kein Projekt wo ich GENAU DIESEN Code wiederverwenden wollte aber nunja - wenns in B&uuml;chern steht - muss es ja Wahr sein.</p>
<p>Aber sonst, netter Post.</p>

<p class="infos">
<a href="#comment_1363" onclick="set_comment_reference(1363)" title="auf diesen Kommentar antworten">#1363</a>:
    06.Feb.2010 10:02
    von
    
      
        <a href="http://home.pages.at/vaddi/" target="_blank">
          vaddi
        </a>
</p>
<p>http://code-monkey.de/</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1364">
<p class="infos">
<a href="#comment_1364" onclick="set_comment_reference(1364)" title="auf diesen Kommentar antworten">#1364</a>:
    06.Feb.2010 08:02
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>sehr.. &auml;h.. aussagekr&auml;ftig... NICHT!</p>
</div>
</li>
</ul>
</div>