+++
title = "Verbesserung"
date = "2009-01-16T01:01:00"
author = "Dr. Azrael Tod"
issoid = "blog/1180"
aliases = "blog/1180"
+++

<p>Immer wieder l&auml;ster ich &uuml;ber unseren Staat, das System mit dem der selbige verwaltet wird und so ziemlich jede Aktion die unsere Klolitiker sich so einfallen lassen.</p>
<p>Doch nur durch die Feststellung dass das System tot ist und durch etwas anderes ersetzt werden muss, haben wir noch keine Idee durch was wir es ersetzen wollen. Ich habe mir schon lange Gedanken dar&uuml;ber gemacht und will euch nun mal 2 der Ideen vorstellen, die mir am sinnvollsten erscheinen und das Problem direkt an der Wurzel zu packen versuchen.<!--more--><br/></p><h2>Grundproblem Nr.1 - Politiker</h2><br/>Geben wir es doch zu... eines der Hauptprobleme ist doch dass wir in unserem System von einer Bande bestechlicher Politiker regiert werden, deren einziges bestreben ist an der Macht zu bleiben und m&ouml;glichst viel Geld zu verdienen. Wir k&ouml;nnen auch niemanden besseres ausw&auml;hlen, wenn er sich nicht auf den gleichen Bereich spezialisiert hat wird er nicht lange an der Macht bleiben und sollte er das doch schaffen, wird er auf Dauer genauso korrumpiert wie die bereits vorhandenen.<br/>Es bringt ja auch keinen Sinn zu leugnen dass jeder Mensch k&auml;uflich ist... die einzigen Fragen sind wohl wie hoch der Preis ist und wie man ihn am besten dr&uuml;cken kann.

<p>Bisherige Alternativen zu diesem System zeigten aber alle noch gr&ouml;&szlig;ere M&auml;ngel. So entfernen sich z.B. die Regierenden immer mehr vom regierten Volk, je weniger sie sind und je suver&auml;ner sie ihre Macht aus&uuml;ben k&ouml;nnen. Eine Diktatur kommt also auch nicht in Frage. Bei einer direkten Demokratie hingegen, bei der f&uuml;r jede noch so kleine &Auml;nderung erstmal das ganze Volk abstimmen muss, wird nie eine wirkliche &Auml;nderung durchgef&uuml;hrt.</p>
<p>Warum bauen wir uns also nicht eine direkte Demokratie bei der weniger Menschen gefragt werden? Wir bauen uns einen gro&szlig;en Zufallsgenerator, f&uuml;ttern ihn mit allen Personen die in Deutschland (oder halt dem betroffenen Bundesland/Ort/..) vorhanden sind und wenn es eine Entscheidung &uuml;ber ein neues Gesetz oder einen Br&uuml;ckenbau gibt werden ein paar Leute rausgesucht. Sie bekommen Zeit sich &uuml;ber alles zu informieren und d&uuml;rfen dann abstimmen. Je nach Gewicht der Entscheidung k&ouml;nnen das von mir aus auch gerne mal unterschiedlich viele Personen sein. Beim BKA-Gesetz also d&uuml;rften es ruhig ein paar Tausend bis alle sein, w&auml;hrend es bei der Errichtung eines Denkmals in Hinterbucklinghausen auch gerne nur 10 Personen sein d&uuml;rften.</p>
<p>Auf die Art wird niemand von seiner Macht korrumpiert.. er hat sie ja nur f&uuml;r eine Entscheidung lang. Bestechlichkeit verhindern wir auch, einfach indem wir geheim halten wer abstimmen darf. Nat&uuml;rlich sollte man auch Mindestanforderungen an die ausgew&auml;hlten Personen stellen, aber das Problem gibts ja auch in unserem aktuellem Wahlrecht in ziemlich identischer Art.</p>
<p>F&uuml;r die aufgewendete Zeit kann man auch gerne die B&uuml;rger entlohnen, niemand sollte einen ernsten Nachteil dadurch haben seine Rechte auszu&uuml;ben. Mir schwebt da in etwa ein variabler Betrag zwischen dem durchschnittlichen Einkommen eines B&uuml;rgers und einem Maximalbetrag von meinentwegen dem 3-Fachen vor... angepasst je nachdem wieviel die betreffende Person normalerweise verdienen w&uuml;rde.<br/></p><h2>Grundproblem 2 - Arbeitslosigkeit/soziale Unterschiede</h2><br/>F&uuml;r dieses Problem w&uuml;rde ich als Grundlage erstmal ein <a href="http://www.spiegel.de/wirtschaft/0,1518,386396,00.html" target="_blank">System analog zu dem z.B. von G&ouml;tz Werner vertreten Grundeinkommen/B&uuml;rgergeld</a> verwenden (wem das nichts sagt, sollte sich den Link unbedingt mal genau durchlesen).

<p>Ich w&uuml;rde das System aber gerne noch um einige Bildungsaspekte erweitern. So sollten z.B. alle B&uuml;rger jederzeit kostenlos die M&ouml;glichkeit bekommen Pr&uuml;fungen f&uuml;r diverse Abschl&uuml;sse abzulegen. Wer also gerade nicht arbeitet, kann jederzeit seine Freizeit doch produktiv verwenden... einfach indem man sich selbst weiterbildet (kann ja auch automatisch nebenher geschehen).<br/>Um dies zus&auml;tzlich zu f&ouml;rdern sollte man automatisch das B&uuml;rgergeld um kleine Betr&auml;ge aufbessern k&ouml;nnen wenn man mehr solche Abschl&uuml;sse gesammelt hat. Wer also den ganzen Tag nur Bierdosen auf der Stirn zerdr&uuml;ckt wird vlt. gerade ausreichend Geld zum Leben haben, w&auml;hrend jemand der seine ganze Zeit mit Selbststudium verbringt und permanent seinen Horizont erweitert ruhig auch etwas Luxus beanspruchen kann.</p>
<p>Lehrkr&auml;fte oder Bildungseinrichtungen (au&szlig;er Personen die die Pr&uuml;fungen durchf&uuml;hren) m&uuml;sste man daf&uuml;r nichtmal zur Verf&uuml;gung stellen. Wer es schafft sich die Dinge selbst anzueignen (Wof&uuml;r gibt es Bibliotheken, Internet oder andere Privatpersonen?) kann sich so relativ formlos auf eine Pr&uuml;fung vorbereiten, w&auml;hrend allen anderen nat&uuml;rlich auch f&uuml;r ein gewisses Endgeld an Schulungen teilnehmen k&ouml;nnen.</p>
<p>Diese beiden Vorschl&auml;ge sind nat&uuml;rlich bei weitem noch nicht ausgereift, ich finde jedoch dass sie mindestens als Gedankenspielchen wert sind in Betracht gezogen zu werden. Vlt. entwickelt sich daraus ja doch noch ein System dass man (bitte m&ouml;glichst bald) an die Stelle des aktuellen setzen kann.<br/>Wobei das gr&ouml;&szlig;te Problem wohl eh darin besteht derartige &Auml;nderungen an unseren Klolitikern vorbei und trotz unseres Systems in Leichenstarre durchzusetzen. Wer will schon freiwillig seine Macht aufgeben?</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1068" onclick="set_comment_reference(1068)" title="auf diesen Kommentar antworten">#1068</a>:
    16.Jan.2009 02:01
    von
    
      
        Neal Rerd
      
    
    
  </p>
<p>Interessante Idee, mit dem Zufallsgenerator.<br/>
Die Frage ist, wie dieser kontrolliert werden kann. Das m&uuml;ssten Leute mit Fachwissen machen, die dann aber auch wieder eine gro&szlig;e Macht &uuml;ber das Land h&auml;tten.<br/>
Und was wird aus dem Milit&auml;r? Wenn nicht alle anderen L&auml;nder mitmachen (Weltrevolution?) wird man kaum auf Milit&auml;r und Polizei verzichten k&ouml;nnen...</p>

<p class="infos">
<a href="#comment_1069" onclick="set_comment_reference(1069)" title="auf diesen Kommentar antworten">#1069</a>:
    16.Jan.2009 02:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>lass mich das mal auseinander nehmen:<br/>
Zufall<br/>
Es gibt bereits jetzt zufallsgeneratoren die etwas &auml;hnliches machen... siehe Lottogewinner, die werden permanent ausgelost und es besteht ein &auml;hnliches Bed&uuml;rfniss der Absicherung gegen Betrug.</p>
<p>Polizei/Armee<br/>
Warum sollten wir die Polizei ausrangieren, nur weil die Politische Struktur sich &auml;ndert? Die L&ouml;hne werden sich &auml;ndern, weiter wird aber dieser Bereich kaum mehr davon betroffen als z.B. ein B&auml;cker oder M&uuml;llmann.</p>

<p class="infos">
<a href="#comment_1070" onclick="set_comment_reference(1070)" title="auf diesen Kommentar antworten">#1070</a>:
    16.Jan.2009 03:01
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Wo wir aber beim M&uuml;llmann sind. Will das noch irgendwer machen, wenn jeder ein B&uuml;rgergeld bekommt?</p>

<p class="infos">
<a href="#comment_1071" onclick="set_comment_reference(1071)" title="auf diesen Kommentar antworten">#1071</a>:
    16.Jan.2009 04:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Das ist das Problem an so einem System... die Geh&auml;lter w&uuml;rden sich anpassen. Ein Job als Programmierer oder Skilehrer w&uuml;rde dann sicher weniger bringen weil er eigentlich Spa&szlig; macht. Einem M&uuml;llmann hingegen m&uuml;sste man mehr Geld zahlen um jemanden zu &uuml;berzeugen das zu tun auch wenn f&uuml;r sein Auskommen eigentlich gesorgt w&auml;re.</p>

<p class="infos">
<a href="#comment_1072" onclick="set_comment_reference(1072)" title="auf diesen Kommentar antworten">#1072</a>:
    16.Jan.2009 04:01
    von
    
      <a href="/blog/author/profmakx/">
        profmakx
      </a>
</p>
<p>Eine weitere Frage die sich stellt ist ob die Preise sich irgendwie so entwickeln, dass man sich mit dem B&uuml;rgergehalt nicht wirklich ein Leben leisten kann. Da werden wahrscheinlich auch lustige effekte auftreten w&uuml;rde ich denken.</p>

<p class="infos">
<a href="#comment_1073" onclick="set_comment_reference(1073)" title="auf diesen Kommentar antworten">#1073</a>:
    16.Jan.2009 05:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>imho w&uuml;rde sich die &Auml;nderung allein dadurch in Grenzen halten. B&uuml;rgergeld w&uuml;rde ja nur bedeuten dass <em>jeder</em> Geld bekommt und nicht l&auml;nger nur jeder extrem bed&uuml;rftige.</p>
<p>Wo ich erheblich mehr Probleme sehe sind die Lohnvorstellungen. Rein theoretisch w&auml;re nur noch ein geringeres Gehalt n&ouml;tig, doch gleichzeitig wird der Anreiz zu arbeiten niedriger. Wenn also jemand wirklich Arbeitskr&auml;fte will die auch etwas auf dem Kasten haben, muss er diesen mehr Anreiz in Form von Geld bieten.. M&ouml;glicherweise w&uuml;rde man also damit eine extreme (naja, noch extremer halt) Inflation lostreten.</p>

<p class="infos">
<a href="#comment_1074" onclick="set_comment_reference(1074)" title="auf diesen Kommentar antworten">#1074</a>:
    28.Jan.2009 03:01
    von
    
      
        <a href="http://trabifant.dirker.org" target="_blank">
          olaf
        </a>
</p>
<p>ich denke mal, die motivation etwas zu erschaffen/programmieren/bauen/basteln ist bei nicht wenigen menschen sehr hoch. das d&uuml;rfte vom anreiz her kein problem sein. und selbst den m&uuml;llmann wird irgendjemand &uuml;bernehmen, denn seien wir ehrlich (uuuuuhhh, ja ist b&ouml;se), nicht jeder wird sich auf einmal f&uuml;r eine bildungskarriere entscheiden. das problem wird am ende sein, dass sogar zu viele menschen ohne bildung existieren (die studien dazu sind ja auch irgendwie eindeutig: die unterschicht w&auml;chst, w&auml;hrend der rest immer weniger wird).</p>
<p>die motivation zu arbeiten kann man auch ohne oder mit wenig geldanreiz l&ouml;sen, aber dazu muss eben erst verstanden werden, dass man etwas f&uuml;r die gemeinschaft tut und daraus erst der effekt entsteht, dass es einem selbst an nichts fehlt. der versuch, die menschen davon zu &uuml;berzeugen, dass geld auf der bank nicht die erf&uuml;llung ist, d&uuml;rfte allerdings kl&auml;glich scheitern bzw. in unendlichem ma&szlig;e kompromittiert werden.</p>
<p>das ganze m&uuml;sste man mit der freiwirtschaft verkn&uuml;pfen. mit nachhaltigkeit sowieso. solange es den zinseszins-effekt gibt und geld "arbeiten" kann, wird es schwer, die "oberste kaste" von solch einem system zu &uuml;berzeugen.</p>

<p class="infos">
<a href="#comment_1075" onclick="set_comment_reference(1075)" title="auf diesen Kommentar antworten">#1075</a>:
    29.Jan.2009 12:01
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Hmm.. ich wei&szlig; nicht. Ich denke mal dass es weniger von der T&auml;tigkeit selbst abh&auml;ngt wie gut man Personen bekommt die sie ausf&uuml;hren als vielmehr vom gesellschaftlichen Ruf.<br/>
Ich denke mir z.B. dass M&uuml;llmann nicht unbedingt ein schlechterer Job als M&ouml;belpacker sein wird, aber mal ehrlich: wenn du die Wahl hast, was machst du dann?</p>
<p>Von daher vermute ich mal schon dass es schwierig wird Leute f&uuml;r bestimmte Jobs zu finden, wenn keiner wirklich arbeiten muss und man sich auch in Ruhe nach einem angesehenerem Job umsehen k&ouml;nnte, der vlt. auch noch gut bezahlt wird... "Man &uuml;berlebt ja auch ohne und hat zeit was besseres zu finden."</p>

<p class="infos">
<a href="#comment_1076" onclick="set_comment_reference(1076)" title="auf diesen Kommentar antworten">#1076</a>:
    29.Jan.2009 02:01
    von
    
      
        Olaf
      
    
    
  </p>
<p>Dann wirst du eben auch dort deinen zufallsgenerator bem&uuml;hen m&uuml;ssen. schaden kann es jedenfalls nicht, wenn man mehrere dinge kann.</p>
</div>