+++
title = "Niemand will mein Geld!"
date = "2012-03-13T06:03:00"
author = "Dr. Azrael Tod"
tags = ["Android", "Gadget", "Hardware", "Milestone", "Rant", "Technik"]
issoid = "blog/1564"
aliases = "blog/1564"
+++

<p>Ich w&uuml;rde mir eigentlich gerne ein neues Telefon kaufen. Nat&uuml;rlich im selben Sinne von "Telefon" wie beim letzten mal: Ein Ger&auml;t mit dem ich alles tu au&szlig;er telefonieren.</p>
<p>Mein Milestone ist jetzt auch schon wieder 2-3 Jahre alt und so langsam nerven mich einige Eigenschaften der Kiste doch zu sehr um sie l&auml;nger hin zu nehmen. Je genauer man ein solches Ger&auml;t kennt, desto st&auml;rker fallen einem halt die Konstruktionsfehler auf. So hat es eine drastisch zu kurze Akkulaufzeit, der Arbeitspeicher und interne Flash ist einfach untragbar unterdimmensioniert und eigentlich ist auch das Spiegelnde Display untragbar.</p>
<p>Jetzt bin ich offensichtlich nicht der 08/15-Nutzer und habe etwas "andere" Anspr&uuml;che an ein solches Ger&auml;t. So kommt es wohl auch dass ich auf dem Markt momentan wohl kein Ger&auml;t finden kann, welches meine Anspr&uuml;che befriedigt.</p>
<p></p><h3>Erstmal die Grundvorraussetzungen:</h3>
<p></p><ul><br/><li>offener Bootloader (ganz dringend Pflicht, diese Motorola-Software-Kacke will ich mir nicht noch einmal antun und die aktuelle Version um irgendwie wenigstens ann&auml;hernd brauchbare Software zum Laufen zu bekommen ist einfach nur Krampf)</li><br/><li>mindestens 512MB RAM</li><br/><li>HW-Tastatur (was will ich mit einem gro&szlig;en Display, wenn ich dann nur einen schlechten Ersatz f&uuml;r eine HW-Tastatur drauf sehen kann?)</li><br/><li>Mehr interner Speicher (gut, das ist seit android 2.2 nicht mehr ganz so dringend, aber 133MB? Ernsthaft? Alternativ k&ouml;nnte man, wie so viele Firmen heute, auch gleich die Speicherkarte zur Auslieferung weglassen und 8/16/32GB intern verbauen, sorgt nat&uuml;rlich f&uuml;r andere Probleme)</li><br/><li>L&auml;ngere Akkulaufzeit - Ich verstehe durchaus dass ein Display in der Gr&ouml;&szlig;e mehr Strom frisst als das von meinem Nokia 6020, aber wenn ich das Telefon einfach nur rumliegen habe, bei bester Netzwerkverbindung und ausgeschaltetem Display/GPS/Bluetooth/3G, dann sollte der Akku gef&auml;lligst mindestens 24h halten. Bei meinem Milestone sind es eher 6-12h.</li><br/><li>der ganze Rest-HW-M&uuml;ll sollte ca. dem Milestone entsprechen oder besser sein. Sprich: Bluetooth, Display, Netzwerkanbindung, CPU, HW-Video-Codecs, austauschbaren Akku (das ist ja heute zum Feature degeneriert)</li><br/><li>Gewicht: maximal 400g (das w&auml;ren 2.5 Milestones)</li><br/><li>Gr&ouml;&szlig;e: sollte in meine Jackentasche passen, ist also fast egal. In die Hosentasche w&uuml;rde ich das Milestone eh auch schon nicht mehr stecken</li><br/></ul>
<p>Das Milestone/Droid kostet bei Amazon momentan neu noch so um die 200&euro;, der Nachfolger etwa das selbe. Ich gehe also mal davon aus dass diese Anforderungen, die sich nicht so sehr vom bereits vorhandenen unterscheiden f&uuml;r 200-250&euro; durchaus machbar w&auml;ren.</p>
<p></p><h3>Jetzt gibt es einige Anforderungen f&uuml;r die ich durchaus bereit w&auml;re mehr Geld zu bezahlen, die aber nicht dringend sind:</h3><br/>Die Preise sind jetzt einfach mal ganz grobe Sch&auml;tzungen was ich daf&uuml;r auszugeben bereit w&auml;re. Sprich: Es ist sicherlich unwahrscheinlich dass das so viel kostet, aber wenn ich 2 Telefone zur Auswahl (HAHA) h&auml;tte, das eine h&auml;tte Feature A, kostet aber den entsprechenden Betrag mehr, dann w&uuml;rde ich wohl trotzdem das Teuerere kaufen.

<p></p><ul><br/><li><b style="display: inline-block; min-width: 45px;">50&euro;:</b> Spieletastatur (gut, das kracht etwas gegen die Anforderung der QWERTZ-Tastatur) - vlt. k&ouml;nnte man ja irgendwie eine ansteckbare Version zukaufen oder doch irgendwo D-Pad+6 Kn&ouml;pfe unterbringen</li><br/><li><b style="display: inline-block; min-width: 45px;">50&euro;:</b> HDMI-Ausgang</li><br/><li><b style="display: inline-block; min-width: 45px;">100&euro;:</b> <b>viel</b> Akkulaufzeit, sprich: gr&ouml;&szlig;er 3d Standby und mehr als 12h aktive Verwendung -&gt; genug um auch mal ein Wochenende unterwegs sein zu k&ouml;nnen ohne ein Ladeger&auml;t mitf&uuml;hren zu m&uuml;ssen</li><br/><li><b style="display: inline-block; min-width: 45px;">50&euro;:</b> entspiegeltes Display - das sollte eigentlich eine Selbstverst&auml;ndlichkeit sein, aber praktisch ist das wohl heute fast nicht mehr erh&auml;ltlich, daran muss ich mich leider anpassen</li><br/><li><b style="display: inline-block; min-width: 45px;">50&euro;:</b> benutzbare Kamera - die Aufl&ouml;sung am Milestone ist v&ouml;llig ok, aber manchmal will man auch in geschlossenen R&auml;umen oder am fr&uuml;hen Nachmittag irgendwo Bilder knipsen</li><br/><li><b style="display: inline-block; min-width: 45px;">20&euro;:</b> weniger empfindliche Oberfl&auml;chen</li><br/><li><b style="display: inline-block; min-width: 45px;">10&euro;:</b> Stiftbedienbarkeit - brauche ich auf einem Ger&auml;t dieser Gr&ouml;&szlig;e nicht wirklich, aber ist ein nettes Extra.</li><br/></ul>
<p></p><h3>Dinge jedoch f&uuml;r die ich nicht bereit bin mehr Geld zu bezahlen:</h3><br/><ul><br/><li>m&ouml;glichst Flach (sehen wir es realistisch, mein 6020 war 2cm dick und das hat mich auch nie gest&ouml;rt)</li><br/><li>Kamera mit mehr Petapixel</li><br/><li>Geh&auml;use in $Farbe (ich bin weder ein 13j&auml;hriges M&auml;dchen das ein Telefon passend zur blauen Handtasche will, noch bin ich schwul und w&uuml;nsche mir ein Telefon in unpraktischem, potth&auml;sslichem, wei&szlig;em Klavierlack)</li><br/><li>h&ouml;here Pixeldichte f&uuml;r Display - kann man machen, die Idee keine Pixel mehr sehen zu k&ouml;nnen ist auch ganz nett, aber mir reicht das Display des Milestone v&ouml;llig aus, vor allem wenn ich eh eine Folie dr&uuml;ber kleben muss (gegen Reflexionen/Kratzer) die leider alles etwas verschwimmen l&auml;sst.</li><br/><li>sinnlose Audio-"Technologie" die nur mit original-Ohrsteckern oder dem Telefon-"Lautsprecher" funktioniert</li><br/><li>irgendwelche Features die nur mit Hersteller-Spezifischem ROM funktionieren (das bleibt eh meist nicht lange drauf, da die Hersteller von Software meist keine Ahnung haben und f&uuml;r Updates auch schonmal ein Jahr brauchen... sollten die &uuml;berhaupt kommen)</li><br/><li>3D-Foo</li><br/></ul>
<p>Sind das unrealistische Forderungen? Untersch&auml;tze ich die Kosten f&uuml;r einen offenen Bootloader, einen gr&ouml;&szlig;eren Akku und etwas mehr RAM wirklich so sehr oder haben die Telefonhersteller einfach nur den letzten Schuss nicht geh&ouml;rt?</p>
<div class="old_comments"><h3>Importierte/Alte Kommentare:</h3>
<p class="infos">
<a href="#comment_1576" onclick="set_comment_reference(1576)" title="auf diesen Kommentar antworten">#1576</a>:
    13.Mar.2012 06:03
    von
    
      
        <a href="http://www.g33ky.de/" target="_blank">
          profmakx
        </a>
</p>
<p>... wenn du auch nur irgendwas findest was da nahe dran kommt bin ich dabei. Insbesondere der offene Bootloader und die Tastatur sind fuer mich ein muss. </p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1577">
<p class="infos">
<a href="#comment_1577" onclick="set_comment_reference(1577)" title="auf diesen Kommentar antworten">#1577</a>:
    13.Mar.2012 06:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>So wie ich das sehe, wird es fr&uuml;hestens dann passieren wenn die Leute anfangen die Telefone nicht mehr als Statussymbol zu sehen (weil eh jeder eins hat) und wirklich damit arbeiten wollen.</p>
<p>Sagen wir 20 Jahre?</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1578" onclick="set_comment_reference(1578)" title="auf diesen Kommentar antworten">#1578</a>:
    15.Mar.2012 11:03
    von
    
      
        <a href="http://bunix.de/" target="_blank">
          reaper
        </a>
</p>
<p>Irgendwie kenne ich diese &Uuml;berlegungen. Jedes mal ringe ich wieder mit mir und jedes Mal gehe ich neue faule Kompromisse ein. Bei der Eingabe w&uuml;rde ich ja einen Stift mit Schrifterkennung pr&auml;ferieren. Von der Hardwaretastatur hab ich mich ehrlich gesagt inzwischen verabschiedet da Slider bei mir die lange leben und der "blackberry" stil zu kleine Tasten und zu kleines Display bedeutet.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1579">
<p class="infos">
<a href="#comment_1579" onclick="set_comment_reference(1579)" title="auf diesen Kommentar antworten">#1579</a>:
    15.Mar.2012 11:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<blockquote>
<p>Bei der Eingabe w&uuml;rde ich ja einen Stift mit Schrifterkennung pr&auml;ferieren.</p>
</blockquote>
<p>naja, aber Stifterkennung krankt halt noch immer an den gleichen Problemen wie auch vor 10 Jahren schon.</p>
<ul>
<li>man braucht weiterhin platz auf dem Display</li>
<li>die Geschwindigkeit wird halt durch die Handhabung beschr&auml;nkt</li>
<li>die Erkennung funktioniert nicht immer zuverl&auml;ssig (vor allem bei Sonderzeichen)</li>
</ul>
<p>Gerade f&uuml;r Dinge wie SSH w&uuml;rde ich da halt doch noch immer selbst eine schlechte Tastatur vorziehen. Das Droid/Milestone und viele &auml;hnlich gebaute Telefone zeigen ja auch dass es inzwischen Tastaturen in fast brauchbar (nat&uuml;rlich mit viel Raum f&uuml;r Verbesserungen) gibt. Immerhin h&auml;llt meine Tastatur mich jetzt schon ein paar Jahre aus (bei permanentem rumspielen) und zeigt noch keinerlei Erm&uuml;dungserscheinungen. </p>
<p>Ich hab seinerzeit zu meiner Zeit auf meinem <a href="http://www.homecomputermuseum.de/comp/291_de.htm">HP Jornada 520</a> schon einen Eingabestift gehabt und den eigentlich auch nur dazu verwendet auf einer virtuellen Tastatur rum zu tippen. (Die durch den Stift zumindest erheblich dichter gepackt sein konnte als heutige). Auch meine bessere H&auml;lfte hat heute noch ein Telefon mit Stiftbedienung (HTC Touch) und verwendet es &auml;hnlich.</p>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1580" onclick="set_comment_reference(1580)" title="auf diesen Kommentar antworten">#1580</a>:
    21.Mar.2012 01:03
    von
    
      
        <a href="http://ag7.alltagsgrauen.info/" target="_blank">
          fwolf
        </a>
</p>
<p>Sony Ericson Xperia (Mini) Pro-Reihe?<br/>
Ist jedenfalls das, was ich gerade f&uuml;r mich plane. Gibt ja drei Varianten davon.</p>
<p>cu, w0lf.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1581">
<p class="infos">
<a href="#comment_1581" onclick="set_comment_reference(1581)" title="auf diesen Kommentar antworten">#1581</a>:
    21.Mar.2012 09:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Die ohne mini klingen ja "ganz nett" aber irgendwie verkackt Sony da die Informationspolitik komplett<br/>
Es ist scheinbar schon eine ganze Weile im Laden erh&auml;ltlich, dank des tollen Namens-Schema fast un-google-bar und wenn man dann endlich Informationen zu z.B. "XPERIA Pro" (sprich: weder "XPERIA mini pro", "XPERIA mini Pro 2" noch "XPERIA PRO" noch sonst irgendwas) findet, stehen nirgendwo interessante Daten.</p>
<p>Ich hab jetzt glaube 10 verschiedene Angaben gefunden, die sich alle inhaltlich unterscheiden und teilweise nicht einmal Sinn ergeben (siehe Amazon: <em>interner</em> Speicher = 1GB, <em>aufr&uuml;stbar</em> bis zu 32GB).<br/>
Wirklich interessante Daten wie z.B. die gr&ouml;&szlig;e des RAM findet man nat&uuml;rlich garnicht. (Aber hey! 8 Megapixel "Kamera" mit "Blitz" und "Digitalzoom"! -.-)</p>
<p>Genauso gibt es keinerlei Informationen dar&uuml;ber wie es Softwareseitig aussieht. Es wird noch immer mit Android 2.3 geliefert (untragbar), offener Bootloader wird nirgendwo erw&auml;hnt und auch ob Sony jemals Updates bereit stellt, konnte ich nicht finden.</p>
<p>Also M&ouml;glicherweise <em>k&ouml;nnte</em> das in Frage kommen, aber ich glaub es eher nicht.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1582">
<p class="infos">
<a href="#comment_1582" onclick="set_comment_reference(1582)" title="auf diesen Kommentar antworten">#1582</a>:
    21.Mar.2012 09:03
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>Ich stehe korrigiert, <a href="http://www-support-downloads.sonymobile.com/mk16/whitepaper_EN_mk16_xperia_pro.pdf">Sony bietet eine PDF mit Details an</a>.</p>
<p>Da steht dann drin:</p>
<ul>
<li>1 GB (up to 320 MB user-accessible memory) - ungen&uuml;gend, den Spa&szlig; hab ich mit dem Milestone gerade</li>
<li>512 MB RAM (untergrenze aber ertr&auml;glich)</li>
<li>1500 mAh Akku (sprich wohl nur marginal besser als beim Stein -&gt; auch nur 24h Akkulaufzeit bei perfektem Netz und konsequenter nicht-benutzung)</li>
</ul>
<p>mit der genauen Typnummer (MK16i, MK16a oder MK16) findet man dann auch weitere Informationen. Der Bootloader scheint zumindest in einigen Versionen freischaltbar sein und obwohl weder Cyanogenmod noch MIUI dieses Telefon offiziell unterst&uuml;tzen, scheint es zumindest m&ouml;glich zu sein sich da was neues drauf zu werfen.</p>
<p>Aber eins ist wohl sicher: es wird frickelig. :-/<br/>
In einigen Regionen soll GPRS-Funk damit noch nicht tun und allgemein sollen auch heute die ICS-Versionen dieses Ger&auml;t nur "so am Rande" mit unterst&uuml;tzen, weil es den anderen Sony-Ger&auml;ten so &auml;hnlich ist.<br/>
Und von Sony ist da wohl kaum direkt abhilfe zu erwarten.</p>
</div>
</li>
</ul>
</div>
</li>
</ul>

<p class="infos">
<a href="#comment_1620" onclick="set_comment_reference(1620)" title="auf diesen Kommentar antworten">#1620</a>:
    09.May.2013 06:05
    von
    
      
        <a href="http://linux-workers.posterous.com/" target="_blank">
          Ikem
        </a>
</p>
<p>Ich glaube f&uuml;r deine Belange w&auml;re ein Tablet mit Bluetooth-Tastatur eher geeignet.</p>
<p>Bei beidem w&uuml;sste ich allerdings spontan nicht welches ich dir empfehlen w&uuml;rde.</p>
<ul class="referencing_comments">
<li>
<div class="comment" id="comment_1623">
<p class="infos">
<a href="#comment_1623" onclick="set_comment_reference(1623)" title="auf diesen Kommentar antworten">#1623</a>:
    09.May.2013 10:05
    von
    
      <a href="/blog/author/Dr_Azrael_Tod/">
        Dr. Azrael Tod
      </a>
</p>
<p>a) nein, die sind der inbegriff von unpraktisch (zu schwer, passt nicht in die Jackentasche, keine Telefonfunktion, kein mobiler Datenzugriff au&szlig;er ich leg mir nen zweitvertrag zu oder schlepp zus&auml;tzlich immer das Telefon mit), au&szlig;erdem hab ich f&uuml;r genau solche zwecke mein ac100<br/>
b) Bluetooth-Tastaturen will auch niemand in brauchbar verkaufen, ich hab jetzt ziemlich alles am Markt vorhandene getestet und das Konzept abgeschrieben. Schade eigentlich, f&uuml;r meinen alten Jornada 520 gab es benutzbare Falttastaturen zum anstecken, das w&auml;re eigentlich genau das selbe, nur halt nicht mit bluetooth.</p>
</div>
</li>
</ul>
</div>